{
  "imports": {
    "class": "imports",
    "BDCOM-SMI": [
      "bdMgmt"
    ],
    "IF-MIB": [
      "InterfaceIndex",
      "ifIndex"
    ],
    "SNMP-FRAMEWORK-MIB": [
      "SnmpAdminString"
    ],
    "SNMPv2-CONF": [
      "OBJECT-GROUP",
      "MODULE-COMPLIANCE",
      "NOTIFICATION-GROUP"
    ],
    "SNMPv2-SMI": [
      "Counter32",
      "TimeTicks",
      "MODULE-IDENTITY",
      "OBJECT-IDENTITY",
      "OBJECT-TYPE",
      "Gauge32",
      "iso",
      "NOTIFICATION-TYPE",
      "IpAddress",
      "Unsigned32",
      "MibIdentifier",
      "Bits",
      "Integer32",
      "Counter64"
    ],
    "SNMPv2-TC": [
      "DisplayString",
      "TEXTUAL-CONVENTION",
      "RowStatus",
      "TimeStamp",
      "TruthValue"
    ]
  },
  "bdcomIfThresholdMIB": {
    "name": "bdcomIfThresholdMIB",
    "oid": "1.3.6.1.4.1.3320.9.218",
    "class": "moduleidentity",
    "revisions": [
      {
        "revision": "2003-10-16 00:00",
        "description": "Initial version of this MIB."
      }
    ],
    "lastupdated": "200310160000Z",
    "organization": "BDCOM, Inc.",
    "contactinfo": " Tel: +86-21-50800666 Postal: No.123,Juli RD,Zhangjiang Hitech Park, Shanghai Baud Data Communication Corporation Inc, Shanghai City 201203, P.R.C ",
    "description": "This MIB module defines the managed objects that support monitoring of thresholds on interfaces. Configuration and monitoring of the thresholds is done through threshold templates that can be assigned to any subset of interfaces on the network element. More than one threshold template can be assigned to a given interface. This MIB module should be used when it is desired to apply a common set of thresholds to a subset of the available interfaces. If a threshold is to be applied to only one interface, then the EVENT-MIB or the RMON-MIB may be used as simpler alternatives. If a threshold is to be applied to all available interfaces, then the EVENT-MIB may be used as a simpler alternative."
  },
  "BdifthTemplateIndex": {
    "name": "BdifthTemplateIndex",
    "class": "textualconvention",
    "type": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 1000
          }
        ]
      }
    },
    "status": "current",
    "description": "An arbitrary integer that uniquely identifies a threshold template. The value for each threshold template must remain constant at least from one re-initialization of the agent's network management system to the next re-initialization. The value may change when the agent's network management system is rebooted or re-initialized."
  },
  "BdifthTemplateIndexOrZero": {
    "name": "BdifthTemplateIndexOrZero",
    "class": "textualconvention",
    "type": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 1000
          }
        ]
      }
    },
    "status": "current",
    "description": "A value of either '0' or a valid template index. The distinguished value '0' indicates no template or no unassigned template index values are available."
  },
  "BdifthThresholdIndex": {
    "name": "BdifthThresholdIndex",
    "class": "textualconvention",
    "type": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 63
          }
        ]
      }
    },
    "status": "current",
    "description": "An arbitrary integer that uniquely identifies a threshold within a threshold template. The value for each threshold must remain constant when the agent's network management system is rebooted or re-initialized."
  },
  "BdifthThresholdList": {
    "name": "BdifthThresholdList",
    "class": "textualconvention",
    "type": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 8
          }
        ]
      }
    },
    "status": "current",
    "description": "A list of thresholds defined in a given template, in which each bit represents one threshold. The bits in the first octet represent thresholds identified by bdifthThresholdIndex values 0 through 7, inclusive. The bits in the second octet represent thresholds identified by integer values 8 through 15, inclusive, and so forth. The least significant bit of an octet represents the threshold identified by the lowest integer value, and the most significant bit represents the threshold identified by the highest integer value. The figure shown below illustrates the format of a threshold list. Octet 1 Octet 8 7 6 5 4 3 2 1 0 7 6 5 4 3 2 1 0 +-+-+-+-+-+-+-+-+ +-+-+-+-+-+-+-+-+ | |...| | +-+-+-+-+-+-+-+-+ +-+-+-+-+-+-+-+-+ | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | +- Threshold 56 | | | | | | | | | | | | | | +--- Threshold 57 | | | | | | | | | | | | | +----- Threshold 58 | | | | | | | | | | | | +------- Threshold 59 | | | | | | | | | | | +--------- Threshold 60 | | | | | | | | | | +----------- Threshold 61 | | | | | | | | | +------------- Threshold 62 | | | | | | | | +--------------- Threshold 63 | | | | | | | | : | | | | | | | | : | | | | | | | +--------------------- Threshold 0 | | | | | | +----------------------- Threshold 1 | | | | | +------------------------- Threshold 2 | | | | +--------------------------- Threshold 3 | | | +----------------------------- Threshold 4 | | +------------------------------- Threshold 5 | +--------------------------------- Threshold 6 +----------------------------------- Threshold 7 A bit value of '1' indicates that the threshold is being exceeded in current operation (i.e., the threshold is fired). A bit value of '0' indicates that the threshold is not being exceeded in current operation (i.e., the threshold is cleared). A threshold list of length N, where N < 8, represents a threshold list for which thresholds N*8 through 63 have the value of '0'. A special case is a threshold list having a length of '0', which represents a threshold list of all zeros."
  },
  "BdifthThresholdSeverity": {
    "name": "BdifthThresholdSeverity",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "fail": 1,
          "degrade": 2,
          "info": 3,
          "other": 4
        }
      }
    },
    "status": "current",
    "description": "The severity of the condition when the threshold is fired. A smaller enumerated integer value indicates that the threshold exceeded condition is more severe. The value 'fail' indicates a hard failure condition where no data can be received, or where the data received has a large number of errors which makes it impossible to recover most of the data. The value 'degrade' indicates a soft failure condition in which data received on this interface is affected, but a significant portion of the data can be recovered. The value 'info' is used to raise attention to a condition that could possibly be an impending problem or to notify the customer of an event that improves operation."
  },
  "BdifthThresholdSeverityOrZero": {
    "name": "BdifthThresholdSeverityOrZero",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 4
          }
        ]
      }
    },
    "status": "current",
    "description": "A value of either '0' or a valid threshold severity."
  },
  "bdIfThresholdMIBObjects": {
    "name": "bdIfThresholdMIBObjects",
    "oid": "1.3.6.1.4.1.3320.9.218.1",
    "class": "objectidentity"
  },
  "bdifthTemplateGroup": {
    "name": "bdifthTemplateGroup",
    "oid": "1.3.6.1.4.1.3320.9.218.1.1",
    "class": "objectidentity"
  },
  "bdifthTemplateIfAssignGroup": {
    "name": "bdifthTemplateIfAssignGroup",
    "oid": "1.3.6.1.4.1.3320.9.218.1.2",
    "class": "objectidentity"
  },
  "bdifthIfThresholdFiredGroup": {
    "name": "bdifthIfThresholdFiredGroup",
    "oid": "1.3.6.1.4.1.3320.9.218.1.3",
    "class": "objectidentity"
  },
  "bdifthTemplateIndexNext": {
    "name": "bdifthTemplateIndexNext",
    "oid": "1.3.6.1.4.1.3320.9.218.1.1.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "BdifthTemplateIndexOrZero",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object contains an appropriate value to be used for bdifthTemplateIndex when creating entries in the bdifthTemplateTable. The distinguished value 0 indicates that no unassigned entries are available. To obtain a suggested bdifthTemplateIndex value for a new entry, the manager issues a management protocol retrieval operation to obtain the current value of this object. The manager may ignore this object and use alternative mechanisms for choosing an unused value of bdifthTemplateIndex for a new entry. The agent will modify the value to the next unassigned index, when a new entry is created in bdifthTemplateTable with the current value of this object. After deletion of an entry in bdifthTemplateTable the agent will determine through its local policy when its index value will be made available for reuse."
  },
  "bdifthTemplateLastChange": {
    "name": "bdifthTemplateLastChange",
    "oid": "1.3.6.1.4.1.3320.9.218.1.1.2",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TimeStamp",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object specifies the value of sysUpTime at the last time there was either a change to any object in any entry in bdifthTemplateTable, or an entry was created or destroyed in bdifthTemplateTable. If no change to bdifthTemplateTable has occurred since the last re-initialization of the local network management subsystem, then this object contains a zero value."
  },
  "bdifthTemplateTable": {
    "name": "bdifthTemplateTable",
    "oid": "1.3.6.1.4.1.3320.9.218.1.1.3",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table is used to create threshold templates. Each template includes one or more thresholds (defined in the bdifthThresholdTable), and can be assigned to multiple interfaces. An interface may be associated with more than one template. The assignment of templates to interfaces is done in the bdifthTemplateIfAssignTable."
  },
  "bdifthTemplateEntry": {
    "name": "bdifthTemplateEntry",
    "oid": "1.3.6.1.4.1.3320.9.218.1.1.3.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthTemplateIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry describing the general properties of a threshold template. The template is created using the bdifthTemplateRowStatus object. Prior to creating an entry in the table, the manager should obtain a unique value of bdifthTemplateIndex by reading the bdifthTemplateIndexNext object. The values of bdifthTemplateName and bdifthTemplateNotifyHoldDownType must be provided before activating the entry. After creating an entry, thresholds can be defined for the template by creating entries with the same value of bdifthTemplateIndex in the bdifthThresholdTable. The template can then be assigned to one or more interfaces using the bdifthTemplateIfAssignTable. Once an entry has been activated, the value of bdifthTemplateName cannot be modified. In order to use a new value of bdifthTemplateName, a new template must be defined. The values of bdifthTemplateNotifyHoldDownType and bdifthTemplateNotifyHoldDownTime may be modified when the entry is active. See the description clause of bdifthTemplateNotifyHoldDownType for further caveats on modification of that object."
  },
  "bdifthTemplateIndex": {
    "name": "bdifthTemplateIndex",
    "oid": "1.3.6.1.4.1.3320.9.218.1.1.3.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "BdifthTemplateIndex",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "An arbitrary integer that uniquely identifies a threshold template. The value for each threshold template must remain constant at least from one re-initialization of the agent's network management system to the next re-initialization. The value may change when the agent's network management system is rebooted or re-initialized."
  },
  "bdifthTemplateName": {
    "name": "bdifthTemplateName",
    "oid": "1.3.6.1.4.1.3320.9.218.1.1.3.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 32
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object specifies a unique name associated with the threshold template by the management client, and provides a non-volatile 'handle' for the template. The name must not include whitespace characters. After this value has been written to the startup configuration, the agent must retain the value until a management client deletes it. The level of retention must span reboots and re-initializations of the agent, including those that result in different assignments to the value of bdifthTemplateIndex associated with this template. Once an entry has been activated, this value cannot be modified. In order to use a new value of bdifthTemplateName, a new template must be defined."
  },
  "bdifthTemplateNotifyHoldDownType": {
    "name": "bdifthTemplateNotifyHoldDownType",
    "oid": "1.3.6.1.4.1.3320.9.218.1.1.3.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "other": 1,
          "holdDownTimer": 2,
          "fireAndClearThresholds": 3
        }
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object specifies the method used to prevent an excess of notifications from being generated when operation fluctuates around a threshold level. The value 'holdDownTimer' indicates that notifications for a given threshold and interface are suppressed for a short amount of time after each notification. The time value is specified in bdifthTemplateNotifyHoldDownTime, which is instantiated only when this object is set to 'holdDownTimer'. After a notification is received for a given threshold and interface, the next notification for that threshold and interface will be generated after at least bdifthTemplateNotifyHoldDownTime amount of time has passed, only when the threshold is next fired or cleared. The value 'fireAndClearThresholds' indicates that hysteresis is used. The management client configures two values for each threshold: one for asserting that the threshold has been exceeded (see bdifthThresholdFiredValue), and a second value for asserting that the threshold is no longer being exceeded (see bdifthThresholdClearedValue, which is instantiated only when this object is set to 'fireAndClearThresholds'). When this entry in bdifthTemplateTable is active, this object may only be modified if there are no active entries in bdifthThresholdTable with the same value of bdifthTemplateIndex."
  },
  "bdifthTemplateNotifyHoldDownTime": {
    "name": "bdifthTemplateNotifyHoldDownTime",
    "oid": "1.3.6.1.4.1.3320.9.218.1.1.3.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 3600
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 5,
        "format": "decimal"
      }
    },
    "units": "seconds",
    "maxaccess": "read-create",
    "status": "current",
    "description": "The minimum amount of time between successive bdifthIfThresholdFired or bdifthIfThresholdCleared notifications for a given interface and template. This object is instantiated only when bdifthTemplateNotifyHoldDownType is set to 'holdDownTimer'."
  },
  "bdifthTemplateRowStatus": {
    "name": "bdifthTemplateRowStatus",
    "oid": "1.3.6.1.4.1.3320.9.218.1.1.3.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object is used to create and delete threshold templates. The values of bdifthTemplateName and bdifthTemplateNotifyHoldDownType must be provided before activating the entry. An entry can only be deleted when there are no active entries in the bdifthTemplateIfAssignTable with the same value of bdifthTemplateIndex. When an entry is deleted, all associated entries in the bdifthThresholdTable are also deleted. After the entry has been activated, this object cannot be set to any value other than 'destroy'. The row status never changes to 'notInService' after reaching the value 'active'."
  },
  "bdifthThresholdLastChange": {
    "name": "bdifthThresholdLastChange",
    "oid": "1.3.6.1.4.1.3320.9.218.1.1.4",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TimeStamp",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object specifies the value of sysUpTime at the last time there was either a change to any object in any entry in bdifthThresholdTable, or an entry was created or destroyed in bdifthThresholdTable. If no change to bdifthThresholdTable has occurred since the last re-initialization of the local network management subsystem, then this object contains a zero value."
  },
  "bdifthThresholdTable": {
    "name": "bdifthThresholdTable",
    "oid": "1.3.6.1.4.1.3320.9.218.1.1.5",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table specifies the interface thresholds used in each template."
  },
  "bdifthThresholdEntry": {
    "name": "bdifthThresholdEntry",
    "oid": "1.3.6.1.4.1.3320.9.218.1.1.5.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthTemplateIndex",
        "implied": 0
      },
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthThresholdIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry specifying an interface threshold used in a threshold template. The entry is created using the bdifthThresholdRowStatus object. The values of bdifthThresholdObject, bdifthThresholdSeverity, bdifthThresholdType, and bdifthThresholdFiredValue must be provided before activating the entry. If the value of bdifthTemplateNotifyHoldDownType in the bdifthTemplateEntry with the same value of bdifthTemplateIndex is 'fireAndClearThresholds', then the value of bdifthThresholdClearedValue must also be provided before activating the entry. If the value of bdifthThresholdType is other than 'rateOfIncreaseExponentXIfSpeed', then the value of bdifthThresholdSampleInterval must also be provided before activating the entry. The agent should not allow creation of two entries in the table with the same values of bdifthTemplateIndex, bdifthThresholdObject, bdifthThresholdSeverity, and bdifthThresholdDirection. Once an entry has been activated, the values of bdifthThresholdObject, bdifthThresholdSeverity, bdifthThresholdType, and bdifthThresholdDirection cannot be modified. In order to use new values of these objects, a new threshold must be defined. The values of bdifthThresholdDescr, bdifthThresholdFiredValue, bdifthThresholdClearedValue, bdifthThresholdSampleInterval, and bdifthThresholdApsSwitchover may be modified when the entry is active."
  },
  "bdifthThresholdIndex": {
    "name": "bdifthThresholdIndex",
    "oid": "1.3.6.1.4.1.3320.9.218.1.1.5.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "BdifthThresholdIndex",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "An arbitrary integer that uniquely identifies a threshold in a threshold template. The value for each threshold must remain constant when the agent's network management system is rebooted or re-initialized."
  },
  "bdifthThresholdDescr": {
    "name": "bdifthThresholdDescr",
    "oid": "1.3.6.1.4.1.3320.9.218.1.1.5.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 255
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "A description of the threshold's function and use. The description must not include carriage returns."
  },
  "bdifthThresholdObject": {
    "name": "bdifthThresholdObject",
    "oid": "1.3.6.1.4.1.3320.9.218.1.1.5.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OBJECT IDENTIFIER",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The object to be compared against the threshold values. The object must be defined in a table indexed only by ifIndex. All of the instance portion of the object identifier is truncated, since the instance(s) to be compared against the threshold are identified using the bdifthTemplateIfAssignTable. If the object has syntax 'Integer32', 'Unsigned32', or 'Gauge32', then bdifthThresholdType should be set to 'absoluteValue'. If the object has syntax 'Counter32' or 'Counter64', then bdifthThresholdType should be set to 'deltaValue' or 'rateOfIncreaseExponentXIfSpeed'."
  },
  "bdifthThresholdSeverity": {
    "name": "bdifthThresholdSeverity",
    "oid": "1.3.6.1.4.1.3320.9.218.1.1.5.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "BdifthThresholdSeverity",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object specifies the severity associated with the condition when the threshold is exceeded."
  },
  "bdifthThresholdType": {
    "name": "bdifthThresholdType",
    "oid": "1.3.6.1.4.1.3320.9.218.1.1.5.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "absoluteValue": 1,
          "deltaValue": 2,
          "rateOfIncreaseExponentXIfSpeed": 3
        }
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The manner in which to compare bdifthThresholdObject to bdifthThresholdFiredValue and bdifthThresholdClearedValue. The value 'absoluteValue' indicates that the value of bdifthThresholdObject is to be compared directly to bdifthThresholdFiredValue or bdifthThresholdClearedValue. The value 'deltaValue' indicates that the difference between two successive samples of bdifthThresholdObject is to be compared to bdifthThresholdFiredValue or bdifthThresholdClearedValue. The polling interval between successive samples is defined in bdifthThresholdSampleInterval. The value 'rateOfIncreaseExponentXIfSpeed' indicates that the rate of increase of bdifthThresholdObject is to be compared to the negated value of bdifthThresholdFiredValue used as the exponent of 10, times the value of ifSpeed (if the value of ifSpeed is less than the maximum value) or ifHighSpeed (otherwise). For example, a value of bdifthThresholdFiredValue of 5 on a gigabit ethernet interface indicates a threshold of 10^-5 times the interface speed, which is equal to 10,000 per second. When the value of this object is 'rateOfIncreaseExponentXIfSpeed', the polling interval between successive samples is determined automatically by the agent. When the object identified by bdifthThresholdObject is a counter, a threshold type of 'deltaValue' or 'rateOfIncreaseExponentXIfSpeed' should be used. When the object identified by bdifthThresholdObject is not a counter, a threshold type of 'absoluteValue' should be used."
  },
  "bdifthThresholdDirection": {
    "name": "bdifthThresholdDirection",
    "oid": "1.3.6.1.4.1.3320.9.218.1.1.5.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "rising": 1,
          "falling": 2
        }
      }
    },
    "default": {
      "default": {
        "value": "rising",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object indicates which direction of movement causes the threshold to fire. The value 'rising' indicates that the threshold is fired when the current sampled value is numerically greater than or equal to the value of bdifthThresholdFiredValue, and the threshold was considered to be cleared at the last sampling interval. If the value of the corresponding bdifthTemplateNotifyHoldDownType object is 'fireAndClearThresholds', the threshold is cleared when the current sampled value is less than the value of bdifthThresholdClearedValue, and the threshold was considered to be fired at the last sampling interval. If the value of the corresponding bdifthTemplateNotifyHoldDownType object is other than 'fireAndClearThresholds', the threshold is cleared when the current sampled value is less than the value of bdifthThresholdFiredValue, and the threshold was considered to be fired at the last sampling interval. The value 'falling' indicates that the threshold is fired when the current sampled value is numerically less than or equal to the value of bdifthThresholdFiredValue, and the threshold was considered to be cleared at the last sampling interval. If the value of the corresponding bdifthTemplateNotifyHoldDownType object is 'fireAndClearThresholds', the threshold is cleared when the current sampled value is greater than the value of bdifthThresholdClearedValue, and the threshold was considered to be fired at the last sampling interval. If the value of the corresponding bdifthTemplateNotifyHoldDownType object is other than 'fireAndClearThresholds', the threshold is cleared when the current sampled value is greater than the value of bdifthThresholdFiredValue, and the threshold was considered to be fired at the last sampling interval."
  },
  "bdifthThresholdFiredValue": {
    "name": "bdifthThresholdFiredValue",
    "oid": "1.3.6.1.4.1.3320.9.218.1.1.5.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": -2147483648,
            "max": 2147483647
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "A threshold value to check against the object identified in bdifthThresholdObject. If the value of bdifthThresholdDirection is 'rising', then the threshold is fired when the current sampled value (absolute, delta, or rate of increase, depending on the value of bdifthThresholdType) of the object identified in bdifthThresholdObject is greater than or equal to this value. If the value of bdifthThresholdDirection is 'falling', then the threshold is fired when the current sampled value (absolute, delta, or rate of increase, depending on the value of bdifthThresholdType) of the object identified in bdifthThresholdObject is less than or equal to this value."
  },
  "bdifthThresholdClearedValue": {
    "name": "bdifthThresholdClearedValue",
    "oid": "1.3.6.1.4.1.3320.9.218.1.1.5.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": -2147483648,
            "max": 2147483647
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "A threshold value to check against the object identified in bdifthThresholdObject. If the value of bdifthThresholdDirection is 'rising', then the threshold is cleared when the current sampled value (absolute, delta, or rate of increase, depending on the value of bdifthThresholdType) of the object identified in bdifthThresholdObject is less than this value. If the value of bdifthThresholdDirection is 'falling', then the threshold is cleared when the current sampled value (absolute, delta, or rate of increase, depending on the value of bdifthThresholdType) of the object identified in bdifthThresholdObject is greater than this value. This object is instantiated only when the value of bdifthTemplateNotifyHoldDownType in the bdifthTemplateEntry with the same value of bdifthTemplateIndex is 'fireAndClearThresholds'."
  },
  "bdifthThresholdSampleInterval": {
    "name": "bdifthThresholdSampleInterval",
    "oid": "1.3.6.1.4.1.3320.9.218.1.1.5.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 5,
            "max": 900000
          }
        ]
      }
    },
    "units": "milliseconds",
    "maxaccess": "read-create",
    "status": "current",
    "description": "The number of milliseconds to wait between samples of the object identified in bdifthThresholdObject. To encourage consistency in sampling, the interval is measured from the beginning of one check to the beginning of the next and the timer is restarted immediately when it expires, not when the check completes. This object is not instantiated when the value of bdifthThresholdType is 'rateOfIncreaseExponentXIfSpeed'."
  },
  "bdifthThresholdApsSwitchover": {
    "name": "bdifthThresholdApsSwitchover",
    "oid": "1.3.6.1.4.1.3320.9.218.1.1.5.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object indicates whether automatic protection switching (APS) switchover should be triggered, if applicable, when the threshold is fired. The value of this object takes effect when the template identified by bdifthTemplateIndex is assigned to an interface that is part of an APS group. One way to configure an interface in an APS group is using the cApsChanConfigTable in the BDCOM-APS-MIB."
  },
  "bdifthThresholdRowStatus": {
    "name": "bdifthThresholdRowStatus",
    "oid": "1.3.6.1.4.1.3320.9.218.1.1.5.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object is used to create and delete thresholds in templates. A new entry can only be created when there is an active entry in the bdifthTemplateTable with the same value of bdifthTemplateIndex. The values of bdifthThresholdObject, bdifthThresholdSeverity, bdifthThresholdType, and bdifthThresholdFiredValue must be provided before activating the entry. If the value of bdifthTemplateNotifyHoldDownType in the bdifthTemplateEntry with the same value of bdifthTemplateIndex is 'fireAndClearThresholds', then the value of bdifthThresholdClearedValue must also be provided before activating the entry. If the value of bdifthThresholdType is other than 'rateOfIncreaseExponentXIfSpeed', then the value of bdifthThresholdSampleInterval must also be provided before activating the entry. When an entry is activated, if there are any entries in bdifthTemplateIfAssignTable with the same value of bdifthTemplateIndex, then the threshold is activated on all interfaces identified in those entries that have instances of the object identified by bdifthThresholdObject. When an entry is destroyed, if there are any entries in bdifthTemplateIfAssignTable with the same value of bdifthTemplateIndex, then the threshold is de-activated on the interfaces identified in those entries. If there are any entries in bdifthIfThresholdFiredTable with bdifthIfThresholdFiredTemplate value equal to this value of bdifthTemplateIndex, then the bit in bdifthIfThresholdsFired corresponding to this threshold is cleared in all such entries. After the entry has been activated, this object cannot be set to any value other than 'destroy'. The row status never changes to 'notInService' after reaching the value 'active'."
  },
  "bdifthTemplateIfLastChange": {
    "name": "bdifthTemplateIfLastChange",
    "oid": "1.3.6.1.4.1.3320.9.218.1.2.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TimeStamp",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object specifies the value of sysUpTime at the last time there was either a change to any object in any entry in bdifthTemplateIfAssignTable, or an entry was created or destroyed in bdifthTemplateIfAssignTable. If no change to bdifthTemplateIfAssignTable has occurred since the last re-initialization of the local network management subsystem, then this object contains a zero value."
  },
  "bdifthTemplateIfAssignTable": {
    "name": "bdifthTemplateIfAssignTable",
    "oid": "1.3.6.1.4.1.3320.9.218.1.2.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table specifies the assignment of threshold templates to specific interfaces. Each threshold template may be assigned to multiple interfaces. Each interface may have multiple threshold templates assigned to it."
  },
  "bdifthTemplateIfAssignEntry": {
    "name": "bdifthTemplateIfAssignEntry",
    "oid": "1.3.6.1.4.1.3320.9.218.1.2.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthTemplateIndex",
        "implied": 0
      },
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthTemplateIfAssignInterface",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry describing the assignment of a particular threshold template to a particular interface. The entry is created using the bdifthTemplateIfAssignRowStatus object."
  },
  "bdifthTemplateIfAssignInterface": {
    "name": "bdifthTemplateIfAssignInterface",
    "oid": "1.3.6.1.4.1.3320.9.218.1.2.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InterfaceIndex",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This object identifies an interface to which the template is assigned."
  },
  "bdifthTemplateIfAssignOperStatus": {
    "name": "bdifthTemplateIfAssignOperStatus",
    "oid": "1.3.6.1.4.1.3320.9.218.1.2.2.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "up": 1,
          "down": 2
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates whether the threshold template identified by bdifthTemplateIndex is operational on the interface identified by bdifthTemplateIfAssignInterface. When the value of this object is 'up', this indicates that the thresholds in this template (identified by bdifthTemplateIndex) are activated on this interface, with the following exception: If a threshold is defined on an object that does not have an instance for this interface, then the threshold is not activated on this interface. If any of the thresholds are being exceeded, then a corresponding entry exists in the bdifthIfThresholdFiredTable. When the value of this object is 'down', this indicates that all thresholds in the template are de-activated on this interface and there is no corresponding entry in the bdifthIfThresholdFiredTable, regardless of whether any of the thresholds in the template are being exceeded on this interface. One reason for a template not to be operational on an interface to which it is assigned is when the interface has two (or more) templates assigned to it that contain thresholds on the same object with the same severity and direction, i.e., thresholds with the same values of bdifthThresholdObject, bdifthThresholdSeverity, and bdifthThresholdDirection. This may occur when a template is assigned to the interface, or when a threshold is added to a template that is already active on the interface. When this occurs, the implementation may operate on both (or all) threshold values, or it may take down one (or more) of the templates on this interface, which is indicated by changing the value of this object from 'up' to 'down'."
  },
  "bdifthTemplateIfAssignRowStatus": {
    "name": "bdifthTemplateIfAssignRowStatus",
    "oid": "1.3.6.1.4.1.3320.9.218.1.2.2.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object is used to create and delete entries in the table, assigning templates to interfaces and removing templates from interfaces, respectively. A new entry can only be created when there is an active entry in the bdifthTemplateTable with the same value of bdifthTemplateIndex. When an entry is activated, the thresholds in this template (identified by bdifthTemplateIndex) are activated on this interface, with the following exception: If a threshold is defined on an object that does not have an instance for this interface, then the threshold is not activated on this interface. When an entry is destroyed, all thresholds in the template are de-activated on this interface and the corresponding entry in the bdifthIfThresholdFiredTable is deleted, if it exists. After the entry has been activated, this object cannot be set to any value other than 'destroy'. The row status never changes to 'notInService' after reaching the value 'active'."
  },
  "bdifthThresholdFiredNotifyEnable": {
    "name": "bdifthThresholdFiredNotifyEnable",
    "oid": "1.3.6.1.4.1.3320.9.218.1.3.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "BdifthThresholdSeverityOrZero",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object specifies the minimum severity threshold governing the generation of bdifthIfThresholdFired and bdifthIfThresholdCleared notifications. For example, if the value of this object is set to 'degrade', then the agent generates these notifications if and only if the severity of the threshold being exceeded is 'degrade' or 'fail'. When the value is other than '0', the generation of bdifthTemplateIfStatusChange notifications is also enabled. The value of '0' disables the generation of all notifications. By default, the value of this object is set to '0'."
  },
  "bdifthThresholdFiredLastChange": {
    "name": "bdifthThresholdFiredLastChange",
    "oid": "1.3.6.1.4.1.3320.9.218.1.3.2",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TimeStamp",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object specifies the value of sysUpTime at the last time there was either a change to any object in any entry in bdifthIfThresholdFiredTable, or an entry was added or deleted in bdifthIfThresholdFiredTable. If no change to bdifthIfThresholdFiredTable has occurred since the last re-initialization of the local network management subsystem, then this object contains a zero value."
  },
  "bdifthIfThresholdFiredTable": {
    "name": "bdifthIfThresholdFiredTable",
    "oid": "1.3.6.1.4.1.3320.9.218.1.3.3",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table indicates the interfaces that currently have threshold fired conditions."
  },
  "bdifthIfThresholdFiredEntry": {
    "name": "bdifthIfThresholdFiredEntry",
    "oid": "1.3.6.1.4.1.3320.9.218.1.3.3.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      },
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthIfThresholdFiredTemplate",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry indicating an interface that currently has one or more threshold fired conditions based on one template."
  },
  "bdifthIfThresholdFiredTemplate": {
    "name": "bdifthIfThresholdFiredTemplate",
    "oid": "1.3.6.1.4.1.3320.9.218.1.3.3.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "BdifthTemplateIndex",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This object specifies a template for which one or more of the thresholds are fired on this interface."
  },
  "bdifthIfThresholdsFired": {
    "name": "bdifthIfThresholdsFired",
    "oid": "1.3.6.1.4.1.3320.9.218.1.3.3.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "BdifthThresholdList",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object specifies those thresholds that are currently being exceeded on this interface. If a threshold is currently being exceeded (i.e., the threshold is fired) on the interface, then the corresponding bit in the threshold list is set to one. Otherwise, the bit will be set to zero, or the bit will not be present. Only the first N octets are present in the threshold list, such that the highest octet present has at least one bit set to '1'. All higher octets with value '0' are truncated."
  },
  "bdifthIfLastThresholdFired": {
    "name": "bdifthIfLastThresholdFired",
    "oid": "1.3.6.1.4.1.3320.9.218.1.3.3.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "BdifthThresholdIndex",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object specifies the last threshold fired or cleared on the interface."
  },
  "bdifthIfThresholdFiredLstChange": {
    "name": "bdifthIfThresholdFiredLstChange",
    "oid": "1.3.6.1.4.1.3320.9.218.1.3.3.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TimeStamp",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object specifies the value of sysUpTime at the last time a threshold was fired or cleared on the interface."
  },
  "bdifthIfThresholdFiredLstSeverity": {
    "name": "bdifthIfThresholdFiredLstSeverity",
    "oid": "1.3.6.1.4.1.3320.9.218.1.3.3.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "BdifthThresholdSeverity",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object specifies the severity of the threshold that was last fired or cleared on the interface."
  },
  "bdifthIfThresholdFiredMaxSeverity": {
    "name": "bdifthIfThresholdFiredMaxSeverity",
    "oid": "1.3.6.1.4.1.3320.9.218.1.3.3.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "BdifthThresholdSeverity",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object specifies the highest severity among the thresholds that are currently being exceeded on this interface."
  },
  "bdIfThresholdMIBNotifications": {
    "name": "bdIfThresholdMIBNotifications",
    "oid": "1.3.6.1.4.1.3320.9.218.2",
    "class": "objectidentity"
  },
  "bdifthMIBNotificationsPrefix": {
    "name": "bdifthMIBNotificationsPrefix",
    "oid": "1.3.6.1.4.1.3320.9.218.2.0",
    "class": "objectidentity"
  },
  "bdifthIfThresholdFired": {
    "name": "bdifthIfThresholdFired",
    "oid": "1.3.6.1.4.1.3320.9.218.2.0.1",
    "class": "notificationtype",
    "objects": [
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthIfLastThresholdFired"
      },
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthIfThresholdFiredLstChange"
      },
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthIfThresholdFiredLstSeverity"
      }
    ],
    "status": "current",
    "description": "The agent generates this notification when a threshold defined in a template is asserted on an interface. If a threshold is asserted for a given interface and template, bdifthTemplateNotifyHoldDownTime is set to 'holdDownTimer' for that template, and this notification has recently been sent for the same threshold on the same interface, then this notification may be suppressed."
  },
  "bdifthIfThresholdCleared": {
    "name": "bdifthIfThresholdCleared",
    "oid": "1.3.6.1.4.1.3320.9.218.2.0.2",
    "class": "notificationtype",
    "objects": [
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthIfLastThresholdFired"
      },
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthIfThresholdFiredLstChange"
      },
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthIfThresholdFiredLstSeverity"
      }
    ],
    "status": "current",
    "description": "The agent generates this notification when a threshold, that has previously fired, is cleared on an interface. If a threshold is cleared for a given interface and template, bdifthTemplateNotifyHoldDownTime is set to 'holdDownTimer' for that template, and this notification has recently been sent for the same threshold on the same interface, then this notification may be suppressed."
  },
  "bdifthTemplateIfStatusChange": {
    "name": "bdifthTemplateIfStatusChange",
    "oid": "1.3.6.1.4.1.3320.9.218.2.0.3",
    "class": "notificationtype",
    "objects": [
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthTemplateIfAssignOperStatus"
      }
    ],
    "status": "current",
    "description": "The agent generates this notification when a template comes up or goes down on an interface to which it is assigned, i.e., when the value of bdifthTemplateIfAssignOperStatus changes. If a template becomes operationally down on an interface upon activation of a new entry in the bdifthTemplateIfAssignTable, the agent generates this notification. The agent need not generate this notification when a new entry in the bdifthTemplateIfAssignTable is activated, if the template becomes operational on the interface. The agent need not generate this notification when an entry in the bdifthTemplateIfAssignTable is destroyed."
  },
  "bdIfThresholdMIBConformance": {
    "name": "bdIfThresholdMIBConformance",
    "oid": "1.3.6.1.4.1.3320.9.218.3",
    "class": "objectidentity"
  },
  "bdIfThresholdMIBCompliances": {
    "name": "bdIfThresholdMIBCompliances",
    "oid": "1.3.6.1.4.1.3320.9.218.3.1",
    "class": "objectidentity"
  },
  "bdIfThresholdMIBGroups": {
    "name": "bdIfThresholdMIBGroups",
    "oid": "1.3.6.1.4.1.3320.9.218.3.2",
    "class": "objectidentity"
  },
  "bdIfThresholdMIBCompliance": {
    "name": "bdIfThresholdMIBCompliance",
    "oid": "1.3.6.1.4.1.3320.9.218.3.1.1",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "bdIfThresholdTemplateGroup",
        "module": "BDCOM-IF-THRESHOLD-MIB"
      },
      {
        "object": "bdIfThresholdFiredGroup",
        "module": "BDCOM-IF-THRESHOLD-MIB"
      },
      {
        "object": "bdIfThresholdNotifsGroup",
        "module": "BDCOM-IF-THRESHOLD-MIB"
      }
    ],
    "status": "current",
    "description": "The compliance statement for entities that implement the BDCOM Interface Threshold MIB."
  },
  "bdIfThresholdTemplateGroup": {
    "name": "bdIfThresholdTemplateGroup",
    "oid": "1.3.6.1.4.1.3320.9.218.3.2.1",
    "class": "objectgroup",
    "objects": [
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthTemplateIndexNext"
      },
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthTemplateLastChange"
      },
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthTemplateName"
      },
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthTemplateNotifyHoldDownType"
      },
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthTemplateRowStatus"
      },
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthThresholdLastChange"
      },
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthThresholdDescr"
      },
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthThresholdObject"
      },
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthThresholdSeverity"
      },
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthThresholdType"
      },
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthThresholdDirection"
      },
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthThresholdFiredValue"
      },
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthThresholdSampleInterval"
      },
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthThresholdRowStatus"
      },
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthTemplateIfLastChange"
      },
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthTemplateIfAssignOperStatus"
      },
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthTemplateIfAssignRowStatus"
      }
    ],
    "status": "current",
    "description": "A collection of mandatory managed objects for configuration of threshold templates."
  },
  "bdIfThresholdFiredGroup": {
    "name": "bdIfThresholdFiredGroup",
    "oid": "1.3.6.1.4.1.3320.9.218.3.2.2",
    "class": "objectgroup",
    "objects": [
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthThresholdFiredNotifyEnable"
      },
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthThresholdFiredLastChange"
      },
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthIfThresholdsFired"
      },
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthIfLastThresholdFired"
      },
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthIfThresholdFiredLstChange"
      },
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthIfThresholdFiredLstSeverity"
      },
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthIfThresholdFiredMaxSeverity"
      }
    ],
    "status": "current",
    "description": "A collection of mandatory managed objects for monitoring interfaces where thresholds have been exceeded."
  },
  "bdifthHoldDownTimerGroup": {
    "name": "bdifthHoldDownTimerGroup",
    "oid": "1.3.6.1.4.1.3320.9.218.3.2.3",
    "class": "objectgroup",
    "objects": [
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthTemplateNotifyHoldDownTime"
      }
    ],
    "status": "current",
    "description": "A collection of managed objects for configuration of a timer-based mechanism for suppression of excess notifications in a short time interval."
  },
  "bdifthHoldDownHysteresisGroup": {
    "name": "bdifthHoldDownHysteresisGroup",
    "oid": "1.3.6.1.4.1.3320.9.218.3.2.4",
    "class": "objectgroup",
    "objects": [
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthThresholdClearedValue"
      }
    ],
    "status": "current",
    "description": "A collection of managed objects for configuration of threshold values used to assert that the threshold is no longer being exceeded. These objects are part of the hysteresis mechanism used to prevent excess notifications in a short time interval."
  },
  "bdifthApsGroup": {
    "name": "bdifthApsGroup",
    "oid": "1.3.6.1.4.1.3320.9.218.3.2.5",
    "class": "objectgroup",
    "objects": [
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthThresholdApsSwitchover"
      }
    ],
    "status": "current",
    "description": "A collection of managed objects for configuration of APS switchover triggers based on interface thresholds."
  },
  "bdIfThresholdNotifsGroup": {
    "name": "bdIfThresholdNotifsGroup",
    "oid": "1.3.6.1.4.1.3320.9.218.3.2.6",
    "class": "notificationgroup",
    "objects": [
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthIfThresholdFired"
      },
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthIfThresholdCleared"
      }
    ],
    "status": "current",
    "description": "A collection of notifications generated when an interface has a threshold fired or a threshold cleared condition."
  },
  "bdifthTemplateIfNotifsGroup": {
    "name": "bdifthTemplateIfNotifsGroup",
    "oid": "1.3.6.1.4.1.3320.9.218.3.2.7",
    "class": "notificationgroup",
    "objects": [
      {
        "module": "BDCOM-IF-THRESHOLD-MIB",
        "object": "bdifthTemplateIfStatusChange"
      }
    ],
    "status": "current",
    "description": "A collection of notifications related to the assignment of templates to interfaces."
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/BDCOM-IF-THRESHOLD-MIB",
      "Produced by pysmi-0.3.4 at Fri May 24 16:36:26 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "BDCOM-IF-THRESHOLD-MIB"
  }
}