{
  "imports": {
    "class": "imports",
    "CISCO-QOS-PIB-MIB": [
      "QosLayer2Cos",
      "Dscp"
    ],
    "CISCO-SMI": [
      "ciscoMgmt"
    ],
    "CISCO-VTP-MIB": [
      "vtpVlanIndex"
    ],
    "IF-MIB": [
      "ifIndex"
    ],
    "SNMP-FRAMEWORK-MIB": [
      "SnmpAdminString"
    ],
    "SNMPv2-CONF": [
      "NOTIFICATION-GROUP",
      "MODULE-COMPLIANCE",
      "OBJECT-GROUP"
    ],
    "SNMPv2-SMI": [
      "Bits",
      "Integer32",
      "NOTIFICATION-TYPE",
      "Unsigned32",
      "iso",
      "Counter32",
      "OBJECT-IDENTITY",
      "IpAddress",
      "OBJECT-TYPE",
      "Counter64",
      "TimeTicks",
      "MODULE-IDENTITY",
      "Gauge32",
      "MibIdentifier"
    ],
    "SNMPv2-TC": [
      "TruthValue",
      "TEXTUAL-CONVENTION",
      "TimeStamp",
      "DisplayString"
    ]
  },
  "ciscoPortQosMIB": {
    "name": "ciscoPortQosMIB",
    "oid": "1.3.6.1.4.1.9.9.189",
    "class": "moduleidentity",
    "revisions": [
      {
        "revision": "2015-09-25 00:00",
        "description": "This MIB is deprecated by CISCO-CLASS-BASED-QOS-MIB. The objects in this MIB are either directly replaced or functionally derived by objects in CISCO-CLASS-BASED-QOS-MIB."
      },
      {
        "revision": "2008-09-10 00:00",
        "description": "Added the following tables: cportQosEgressQueueStatsTable, cportQosClassEgressStatsTable, cportQosClassIngressStatsTable, cportQosDscpStatsTable and cportQosCosStatsTable. Deprecated ciscoPortQosMIBComplianceRev5 added ciscoPortQosMIBComplianceRev6."
      },
      {
        "revision": "2008-03-05 00:00",
        "description": "Added cportQosVlanInProfPolicyOctets, cportQosVlanOutOfProfPolicyOctets, cportQosVlanViolateProfPolicyPkts and cportQosVlanViolateProfPolicyOctets to the cportQosInVlanStatsTable."
      },
      {
        "revision": "2008-01-09 00:00",
        "description": "Added cportQosInProfPolicyOctets, cportQosOutOfProfPolicyOctets, cportQosViolateProfPolicyPkts and cportQosViolateProfPolicyOctets to the cportQosStatsTable."
      },
      {
        "revision": "2006-02-17 00:00",
        "description": "Added per port per vlan ingress statistics table."
      },
      {
        "revision": "2005-02-23 00:00",
        "description": "Deprecated the cportQosIndexType added the cportQosIndexTypeNew which is read-write. In addition, added the cportQosInProfPolicyPkts and cportQosOutOfProfPolicyPkts objects to the statistic table."
      },
      {
        "revision": "2004-05-20 00:00",
        "description": "Extend per port QoS Statistics table by adding no_change object."
      },
      {
        "revision": "2004-01-30 00:00",
        "description": "Add cos(4) to cportQosIndexType."
      },
      {
        "revision": "2002-03-20 00:00",
        "description": "Add per port QoS Statistics table."
      },
      {
        "revision": "2001-05-15 00:00",
        "description": "Add cportQosRLConfigEnable and cportQosTSConfigEnable and renumber the objects."
      },
      {
        "revision": "2000-12-20 00:00",
        "description": "Initial version of this MIB module."
      }
    ],
    "lastupdated": "201509250000Z",
    "organization": "Cisco Systems, Inc.",
    "contactinfo": "Cisco Systems Customer Service Postal: 170 W. Tasman Drive San Jose, CA 95134-1706 USA Tel: +1 800 553-NETS E-mail: cs-port-qos@cisco.com",
    "description": "Cisco PORT QOS MIB - Overview This MIB module is for the management of Cisco's per port rate-limiting and traffic shaping on L3 switch/Router Platform(s). Per-port rate-limiting is a traffic control method. A set of rate limits are applied to the traffic traversing an interface. Each rate limit has a configurable action that is taken when rate limiting criteria is met. Per-port traffic shaping is a traffic control method. The user can restrict the amount of traffic coming out of a physical port. Excess traffic is buffered within the router/switch to the extent possible. A class represents a class of traffic. It is defined via the specification of the packet matching criteria that identifies packets that are to belong to the class. Class-default: In addition to user defined classes, a pre-existing class named 'class-default' exists to represent all packets that do not match any of the user defined classes. This class-default exists so that policies can be defined for this group of packets that do not match any user defined classes. Actions are individual policies (e.g.: policing) that can be applied to a traffic class. A policy represents a set of actions that are to be applied to a set of traffic classes. The policy is associated with a target (like a port) and the direction of traffic on that target to which the policy is to be applied. A hierarchical policy is one in which an entire policy is directly assigned to a class of traffic. Thus, a hierarchical policy is a nested policy that contains a set of the pair of a child-policy and the traffic-class to which it is applied. DSCP (Differentiated Services Code Point) is the six most significant bits of the ToS field in a IP packet header. CoS (Class of Service) is the three bits in the layer 2 header that indicates user priority value assigned to this packet. This MIB module also provides per port QoS statistics."
  },
  "ciscoPortQosMIBObjects": {
    "name": "ciscoPortQosMIBObjects",
    "oid": "1.3.6.1.4.1.9.9.189.1",
    "class": "objectidentity"
  },
  "cportQosRLConfig": {
    "name": "cportQosRLConfig",
    "oid": "1.3.6.1.4.1.9.9.189.1.1",
    "class": "objectidentity"
  },
  "cportQosTSConfig": {
    "name": "cportQosTSConfig",
    "oid": "1.3.6.1.4.1.9.9.189.1.2",
    "class": "objectidentity"
  },
  "cportQosStatistics": {
    "name": "cportQosStatistics",
    "oid": "1.3.6.1.4.1.9.9.189.1.3",
    "class": "objectidentity"
  },
  "cportQosRLConfigTable": {
    "name": "cportQosRLConfigTable",
    "oid": "1.3.6.1.4.1.9.9.189.1.1.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "deprecated",
    "description": "A table of rate limit configuration entries. Rate Limiting is a method of traffic control. It allows a set of rate limits to be configured and applied to packets flowing into/out of an interface to regulate network traffic. This object is deprecated and replaced by cbQosPoliceCfgTable in CISCO-CLASS-BASED-QOS-MIB. Rate limit is functionally same as police action in current QoS implementation on various platforms."
  },
  "cportQosRLConfigEntry": {
    "name": "cportQosRLConfigEntry",
    "oid": "1.3.6.1.4.1.9.9.189.1.1.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosRLConfigDirection",
        "implied": 0
      }
    ],
    "status": "deprecated",
    "description": "A collection of rate-limit configuration objects for a particular interface. Entries in the cportQosRLConfigTable are created and deleted by non-SNMP methods. Creation of these entries is dependent upon configuration of a physical interface. Further, the physical interfaces which are configured for port-qos, can only have these entries. The ifIndex in the INDEX clause identifies the interface number for a physical interface. This object is deprecated and replaced by cbQosPoliceCfgEntry in CISCO-CLASS-BASED-QOS-MIB."
  },
  "cportQosRLConfigDirection": {
    "name": "cportQosRLConfigDirection",
    "oid": "1.3.6.1.4.1.9.9.189.1.1.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "input": 1,
          "output": 2
        }
      }
    },
    "maxaccess": "not-accessible",
    "status": "deprecated",
    "description": "The direction in which the rate-limit is applied to packet: input statistics of the input packets. output statistics of the output packets. This object is deprecated and replaced by cbQosPolicyDirection in CISCO-CLASS-BASED-QOS-MIB. This object is deprecated for the same reason mentioned in description of cportQosRLConfigTable."
  },
  "cportQosRLConfigEnable": {
    "name": "cportQosRLConfigEnable",
    "oid": "1.3.6.1.4.1.9.9.189.1.1.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "deprecated",
    "description": "This indicates the rate-limit is enabled or disabled. A value of true(1) indicates the rate-limit is enabled and a value of false(2) indicates it's disabled. Writing a value of true(1) to this object also requires writing a valid value to the cportQosRLConfigRate at the same time. Writing to cportQosRLConfigBurstSize is optional. This object is deprecated, but there is no direct mapping to any object. To obtain information about police being configured or not on a given interface, cbQosPoliceCfgEntry can be queried. To query, cbQosPoliceCfgEntry following steps can be followed: Step 1: Use ifIndex and cbQosPolicyDirection to index into cbQosInterfacePolicyTable to obtain cbQosIFPolicyIndex, which same as cbQosPolicyIndex. Step 2: Walk through all entries for given cbQosPolicyIndex in cbQosObjectsTable. If there is entry with cbQosObjectsType as 'police', then the corresponding cbQosConfigIndex corresponds to the index for cbQosPoliceCfgEntry. If such entry exists, then policer is enabled (i.e. true) on that ifIndex in cbQosPolicyDirection, else it is not (i.e. false)."
  },
  "cportQosRLConfigRate": {
    "name": "cportQosRLConfigRate",
    "oid": "1.3.6.1.4.1.9.9.189.1.1.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 32000,
            "max": 2147483647
          }
        ]
      }
    },
    "units": "bits per second",
    "maxaccess": "read-write",
    "status": "deprecated",
    "description": "This is the sustained rate permitted by the rate limit. Writing to this object also requires writing a value of true(1) to cportQosRLConfigEnable at the same time. This object is deprecated and replaced by cbQosPoliceCfgRate in CISCO-CLASS-BASED-QOS-MIB. cbQosPoliceCfgRate is in cbQosPoliceCfgEntry, which can be queried using ifIndex and cbQosPolicyDirection in the same fashion as mentioned in cportQosRLConfigEnable."
  },
  "cportQosRLConfigBurstSize": {
    "name": "cportQosRLConfigBurstSize",
    "oid": "1.3.6.1.4.1.9.9.189.1.1.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 64000
          }
        ]
      }
    },
    "units": "bytes",
    "maxaccess": "read-write",
    "status": "deprecated",
    "description": "The burst size. The amount of traffic, in bytes, in excess of the sustained rate which will be instantaneously permitted by the rate limit. Writing to this object also requires writing a value of true(1) to cportQosRLConfigEnable and a valid value to the cportQosRLConfigRate at the same time. This object is deprecated and replaced by cbQosPoliceCfgBurstSize in CISCO-CLASS-BASED-QOS-MIB. cbQosPoliceCfgBurstSize is in cbQosPoliceCfgEntry, which can be queried using ifIndex and cbQosPolicyDirection in the same fashion as mentioned in cportQosRLConfigEnable."
  },
  "cportQosTSConfigTable": {
    "name": "cportQosTSConfigTable",
    "oid": "1.3.6.1.4.1.9.9.189.1.2.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "deprecated",
    "description": "A table of traffic-shaping action configuration entries. This object is deprecated and replaced by cbQosTSCfgTable in CISCO-CLASS-BASED-QOS-MIB."
  },
  "cportQosTSConfigEntry": {
    "name": "cportQosTSConfigEntry",
    "oid": "1.3.6.1.4.1.9.9.189.1.2.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      }
    ],
    "status": "deprecated",
    "description": "A collection of traffic shaping action configuration objects for a particular interface. Entries in the cportQosTSConfigTable are created and deleted by non-SNMP methods. Creation of these entries is dependent upon configuration of a physical interface. Further, the physical interfaces which are configured for port-qos, can only have these entries. The ifIndex in the INDEX clause identifies the interface number for a physical interface. This object is deprecated and replaced by cbQosTSCfgEntry in CISCO-CLASS-BASED-QOS-MIB."
  },
  "cportQosTSConfigEnable": {
    "name": "cportQosTSConfigEnable",
    "oid": "1.3.6.1.4.1.9.9.189.1.2.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "deprecated",
    "description": "This indicates the traffic shaping is enabled or disabled. A value of true(1) indicates the traffic shaping is enabled and a value of false(2) indicates it's disabled. Writing a value of true(1) to this object also requires writing a valid value to the cportQosTSConfigRate at the same time. Writing to cportQosTSConfigBurstSize is optional. This object is deprecated and there is no direct replacement. To obtain information about police being configured or not on a given interface, cbQosTSCfgEntry can be queried. To query cbQosTSCfgEntry for a given interface, following steps can be followed: Step 1: Use ifIndex and cbQosPolicyDirection index into to cbQosInterfacePolicyTable and obtain cbQosIFPolicyIndex which same as cbQosPolicyIndex. Step 2: Use cbQosPolicyIndex to index into cbQosObjectsTable and get all entries for this policy index. Among these entries search for entry with cbQosObjectsType as 'trafficShaping'. If such entry exists, then TS is enabled (i.e. true) , else it is not(i.e. false). This query can be run for both values of cbQosPolicyDirection, 'input' and 'output' to obtain information for a given ifIndex."
  },
  "cportQosTSConfigRate": {
    "name": "cportQosTSConfigRate",
    "oid": "1.3.6.1.4.1.9.9.189.1.2.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 32000,
            "max": 2147483647
          }
        ]
      }
    },
    "units": "bits per second",
    "maxaccess": "read-write",
    "status": "deprecated",
    "description": "This is the sustained rate permitted by the traffic shaping. Writing to this object also requires writing a value of true(1) to cportQosTSConfigEnable at the same time. This object is deprecated and replaced by cbQosTSCfgRate in CISCO-CLASS-BASED-QOS-MIB. cbQosTSCfgRate is in CbQosTSCfgEntry, which can be queried by using ifIndex and cbQosPolicyDirection in same fashion as mentioned in cportQosTSConfigEnable."
  },
  "cportQosTSConfigBurstSize": {
    "name": "cportQosTSConfigBurstSize",
    "oid": "1.3.6.1.4.1.9.9.189.1.2.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 512000
          }
        ]
      }
    },
    "units": "bits",
    "maxaccess": "read-write",
    "status": "deprecated",
    "description": "The amount of traffic, in bits, in excess of the sustained traffic shaping rate that will be instantaneously permitted by this feature. Writing to this object also requires writing a value of true(1) to cportQosTSConfigEnable and a valid value to the cportQosTSConfigRate at the same time. This object is deprecated and replaced by cbQosTSCfgBurstSize in CISCO-CLASS-BASED-QOS-MIB. cbQosTSCfgBurstSize is in CbQosTSCfgEntry, which can be queried using ifIndex and cbQosPolicyDirection in same fashion as mentioned in cportQosTSConfigEnable."
  },
  "cportQosIndexType": {
    "name": "cportQosIndexType",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "none": 1,
          "dscp": 2,
          "ipPrecedence": 3,
          "cos": 4
        }
      }
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "This object specifies the sorting mechanism used to collect and store the statistical QoS information. This object value is device dependent and it could be optionally configured via command-line. This object has been deprecated in order to make the selection of sorting mechanism selectable from the MIB. The replacement object is cportQosIndexTypeNew."
  },
  "cportQosStatsTable": {
    "name": "cportQosStatsTable",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "deprecated",
    "description": "This table specifies QoS port related Statistical information. This object is deprecated and replaced by various action specific table in CISCO-CLASS-BASED-QOS-MIB. To view port specific policy execution stats on interface, policy on that interface can be looked up and then action specific can be obtained from that policy info. Following steps illustrates this. Step 1: Use ifIndex and cbQosPolicyDirection to lookup cbQosInterfacePolicyEntry and obtain cbQosIFPolicyIndex which is same as cbQosPolicyIndex. Step 2: Index cbQosPolicyIndex into cbQosObjectsTable and obtain all entries corresponding to this policy instance of cbQosPolicyIndex. Step 3: With the obtained entries, filter the ones with desired action in cbQosObjectsType. For example, to get all policing action stats, filter on cbQosObjectsType = 'police'. Step 4: Collect all cbQosObjectsIndex for all such filtered entries. Step 5: Index cbQosPolicyIndex and cbQosObjectsIndex into corresponding action specific stats table to obtain corresponding stats. For example, for policer action, cbQosPoliceStatsEntry can be indexed. "
  },
  "cportQosStatsEntry": {
    "name": "cportQosStatsEntry",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosDirection",
        "implied": 0
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosIndex",
        "implied": 0
      }
    ],
    "status": "deprecated",
    "description": "Each entry in this table describes the QoS port statistical information which are : pre/post policy pkts/octets counts, drop pkts/octets, classified pkts/octets. This object is deprecated and replaced by various action specific stats in CISCO-CLASS-BASED-QOS-MIB as described in cportQosStatsTable."
  },
  "cportQosDirection": {
    "name": "cportQosDirection",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "ingress": 1,
          "egress": 2
        }
      }
    },
    "maxaccess": "not-accessible",
    "status": "deprecated",
    "description": "The direction of the reported statistics: -'ingress' statistics for the input direction. -'egress' statistics for the output direction. This object is deprecated and replaced by cbQosPolicyDirection in CISCO-CLASS-BASED-QOS-MIB."
  },
  "cportQosIndex": {
    "name": "cportQosIndex",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.2.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "deprecated",
    "description": "An arbitrary integer to identify this entry. cportQosIndex value, which may have non-contiguous range, is linked to cportQosIndexType: -if cportQosIndexTypeNew equals 'none', cportQosIndex is constant with the value of 1 and all statistics are classified per port -if cportQosIndexTypeNew equals 'DSCP', cportQosIndex range is from 1 to 65 and all statistics are classified per port and DSCP value. The range of DSCP values reported is shifted up one meaning a cportQosIndex of 1 translates to a packet DSCP value of 0. Value of 65 is an arbitrary number used to report aggregate counts of packets which were not displayed in the 1 to 64 range. This usually happens when the range value of cportQosIndex is non-contiguous -if cportQosIndexTypeNew equals 'ipPrecedence', cportQosIndex range is from 1 to 8 and all statistics are classified per port and IP precedence value. The range of IP precedence values reported is shifted up one meaning a cportQosIndex of 1 translates to an IP precedence value of 0 -if cportQosIndexTypeNew equals 'cos', cportQosIndex range is from 1 to 8 and all statistics are classified per interface and L2 COS value. The range of COS values reported is shifted up one meaning a cportQosIndex of 1 translates to a COS value of 0 -if cportQosIndexTypeNew equals 'police', cportQosIndex range is from 1 to 65 and all statistics are classified per interface and police index. The police indexes are arbitrary numbers that do not correlate to policers names or identifiers. This object is deprecated and has no direct replacement. As indicated in description of cportQosStatsEntry, since stats table in CISCO-CLASS-BASED-QOS-MIB are action specific, this object is not required to classify the stats per action."
  },
  "cportQosPrePolicyPkts": {
    "name": "cportQosPrePolicyPkts",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.2.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The count of packets prior to executing any QoS policies. This object is deprecated and replaced by corresponding action specific pre policy counter in CISCO-CLASS-BASED-QOS-MIB. Since CISCO-CLASS-BASED-QOS-MIB has action based stats, there is no direct mapping for this object."
  },
  "cportQosPrePolicyOctets": {
    "name": "cportQosPrePolicyOctets",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.2.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "octets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The count of octets prior to executing any QoS policies. This object is deprecated and replaced by corresponding action specific pre policy counter in CISCO-CLASS-BASED-QOS-MIB. Since CISCO-CLASS-BASED-QOS-MIB has action based stats, there is no direct mapping for this object."
  },
  "cportQosPostPolicyPkts": {
    "name": "cportQosPostPolicyPkts",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.2.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The count of packets after executing QoS policies. This object is deprecated and replaced by corresponding action specific pre policy counter in CISCO-CLASS-BASED-QOS-MIB. Since CISCO-CLASS-BASED-QOS-MIB has action based stats, there is no direct mapping for this object."
  },
  "cportQosPostPolicyOctets": {
    "name": "cportQosPostPolicyOctets",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.2.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "octets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The count of octets after executing QoS policies. This object is deprecated and replaced by corresponding action specific pre policy counter in CISCO-CLASS-BASED-QOS-MIB. Since CISCO-CLASS-BASED-QOS-MIB has action based stats, there is no direct mapping for this object."
  },
  "cportQosDropPkts": {
    "name": "cportQosDropPkts",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.2.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The count of dropped packets as the result of queuing and scheduling related QoS features that can produce drops. This object is deprecated and replaced by corresponding action specific pre policy counter in CISCO-CLASS-BASED-QOS-MIB. Since CISCO-CLASS-BASED-QOS-MIB has action based stats, there is no direct mapping for this object."
  },
  "cportQosDropOctets": {
    "name": "cportQosDropOctets",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.2.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "octets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The count of dropped octets as the result of queuing and scheduling related QoS features that can produce drops. This object is deprecated and replaced by corresponding action specific pre policy counter in CISCO-CLASS-BASED-QOS-MIB. Since CISCO-CLASS-BASED-QOS-MIB has action based stats, there is no direct mapping for this object."
  },
  "cportQosClassifiedOctets": {
    "name": "cportQosClassifiedOctets",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.2.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "octets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The count of classified octets during QoS. This object is deprecated and replaced by various stats table objects in CISCO-CLASS-BASED-QOS-MIB. cbQosCMPrePolicyByte64 in CbQosCMStatsEntry be used in place this object. Entry specific to a given ifIndex and cbQosPolicyDirection can be obtained in same fashion as described in description of cportQosStatsTable, with exception of step 5. In step 5, index cbQosPolicyIndex and cbQosObjectsIndex into CbQosCMStatsEntry to obtain cbQosCMPrePolicyByte64 in that entry. "
  },
  "cportQosClassifiedPkts": {
    "name": "cportQosClassifiedPkts",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.2.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The count of classified packets during QoS. This object is deprecated and replaced by various stats table objects in CISCO-CLASS-BASED-QOS-MIB. cbQosCMPrePolicyPkt64 in CbQosCMStatsEntry be used in place this object. Entry specific to a given ifIndex and cbQosPolicyDirection can be obtained in same fashion as described in description of cportQosStatsTable, with exception of step 5. In step 5, index cbQosPolicyIndex and cbQosObjectsIndex into CbQosCMStatsEntry to obtain cbQosCMPrePolicyPkt64 in that entry."
  },
  "cportQosNoChangePkts": {
    "name": "cportQosNoChangePkts",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.2.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The count of packets maintain unchange after executing QoS policies. This object is deprecated and replaced by various stats table object in CISCO-CLASS-BASED-QOS-MIB. There is no direct mapping of this object as it depends on action for which stats being asked for. For example, to obtain No change packet for policer action, cbQosPoliceConformedPkt64 from CbQosPoliceStatsEntry can be used. Steps to index into CbQosPoliceStatsEntry using ifIndex and cbQosPolicyDirection is described in the description of cportQosStatsTable."
  },
  "cportQosNoChangeOctets": {
    "name": "cportQosNoChangeOctets",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.2.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "octets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The count of octets maintain unchange after executing QoS policies. This object is deprecated and replaced by various stats table object in CISCO-CLASS-BASED-QOS-MIB. There is no direct mapping of this object as it depends on action for which stats being asked for. For example, to obtain No change packet for policer action, cbQosPoliceConformedPkt64 from CbQosPoliceStatsEntry can be used. Steps to index into CbQosPoliceStatsEntry using ifIndex and cbQosPolicyDirection is described in the description of cportQosStatsTable."
  },
  "cportQosInProfPolicyPkts": {
    "name": "cportQosInProfPolicyPkts",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.2.1.13",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The count of packets that are within the policer profile limit configured for this policy. This object is deprecated and replaced by cbQosPoliceConformedPkt64 in CISCO-CLASS-BASED-QOS-MIB."
  },
  "cportQosOutOfProfPolicyPkts": {
    "name": "cportQosOutOfProfPolicyPkts",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.2.1.14",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The count of packets that exceed the policer profile limit configured for this policy. This object is deprecated and replaced by cbQosPoliceExceededPkt64 in CISCO-CLASS-BASED-QOS-MIB."
  },
  "cportQosInProfPolicyOctets": {
    "name": "cportQosInProfPolicyOctets",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.2.1.15",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "octets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The count of octets that are within the policer profile limit configured for this policy. This object is deprecated and replaced by cbQosPoliceConformedByte64 in CISCO-CLASS-BASED-QOS-MIB."
  },
  "cportQosOutOfProfPolicyOctets": {
    "name": "cportQosOutOfProfPolicyOctets",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.2.1.16",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "octets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The count of octets that exceed the policer profile limit configured for this policy. This objected is deprecated and replaced by cbQosPoliceExceededByte64 in CISCO-CLASS-BASED-QOS-MIB."
  },
  "cportQosViolateProfPolicyPkts": {
    "name": "cportQosViolateProfPolicyPkts",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.2.1.17",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The count of packets that violate the policer profile limit configured for this policy. This object is deprecated and replaced by cbQosPoliceViolatedPkt64 in CISCO-CLASS-BASED-QOS-MIB."
  },
  "cportQosViolateProfPolicyOctets": {
    "name": "cportQosViolateProfPolicyOctets",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.2.1.18",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "octets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The count of octets that violate the policer profile limit configured for this policy. This object is deprecated and replaced by cbQosPoliceViolatedPkt64 in CISCO-CLASS-BASED-QOS-MIB."
  },
  "cportQosIndexTypeNew": {
    "name": "cportQosIndexTypeNew",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.3",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "none": 1,
          "dscp": 2,
          "ipPrecedence": 3,
          "cos": 4,
          "police": 5
        }
      }
    },
    "maxaccess": "read-write",
    "status": "deprecated",
    "description": "This object specifies the sorting mechanism used to collect and store the statistical QoS information. This object value is device dependent. This object is deprecated since cbQosIndex is deprecated."
  },
  "cportQosInVlanStatsTable": {
    "name": "cportQosInVlanStatsTable",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.4",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "deprecated",
    "description": "This table specifies QoS port related ingress statistical information. The type of information is controlled by the cportQosIndexTypeNew object. This table is deprecated. Stats for service policy attached to vlan on a trunk or multi-vlan access port can be accessed in same fashion as described in description of in cportQosStatsTable. In Step 1 of description, when cbQosPolicyIndex is obtained from lookup of cbQosInterfacePolicyEntry using ifIndex, this is indexed into CbQosServicePolicyEntry to obtain the cbQosVlanIndex for this policy instance. If this matches, then cbQosPolicyIndex can be used to lookup the stats in same fashion as mentioned in step 2-5 mentioned in the description of cportQosStatsTable."
  },
  "cportQosInVlanStatsEntry": {
    "name": "cportQosInVlanStatsEntry",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.4.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanIndex",
        "implied": 0
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosIndex",
        "implied": 0
      }
    ],
    "status": "deprecated",
    "description": "It exists an entry in this table for each port on which QoS is configured per port and per VLAN. This object is deprecated for the same reason mentioned in description of cportQosInVlanStatsTable."
  },
  "cportQosVlanInProfPolicyPkts": {
    "name": "cportQosVlanInProfPolicyPkts",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.4.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The count of packets that are within the policer profile limit configured for this policy. This object is deprecated and replaced by cbQosPoliceConformedPkt64 in CISCO-CLASS-BASED-QOS-MIB."
  },
  "cportQosVlanOutOfProfPolicyPkts": {
    "name": "cportQosVlanOutOfProfPolicyPkts",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.4.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The count of packets that exceeds the policer profile limit configured for this policy. This object is deprecated and replaced by cbQosPoliceExceededPkt64 in CISCO-CLASS-BASED-QOS-MIB."
  },
  "cportQosVlanInProfPolicyOctets": {
    "name": "cportQosVlanInProfPolicyOctets",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.4.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "octets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The count of octets that are within the policer profile limit configured for this policy. This object is deprecated and replaced by cbQosPoliceConformedByte64 in CISCO-CLASS-BASED-QOS-MIB."
  },
  "cportQosVlanOutOfProfPolicyOctets": {
    "name": "cportQosVlanOutOfProfPolicyOctets",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.4.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "octets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The count of octets that exceed the policer profile limit configured for this policy. This object is deprecated and replaced by cbQosPoliceExceededByte64 in CISCO-CLASS-BASED-QOS-MIB."
  },
  "cportQosVlanViolateProfPolicyPkts": {
    "name": "cportQosVlanViolateProfPolicyPkts",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.4.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The count of packets that violate the policer profile limit configured for this policy. This object is deprecated and replaced by cbQosPoliceViolatedPkt64 in CISCO-CLASS-BASED-QOS-MIB."
  },
  "cportQosVlanViolateProfPolicyOctets": {
    "name": "cportQosVlanViolateProfPolicyOctets",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.4.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "octets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The count of octets that violate the policer profile limit configured for this policy. This object is deprecated and replaced by cbQosPoliceViolatedByte64 in CISCO-CLASS-BASED-QOS-MIB."
  },
  "cportQosEgressQueueStatsTable": {
    "name": "cportQosEgressQueueStatsTable",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.5",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "deprecated",
    "description": "This table specifies QoS related statistical information for egress queues on each port. The agent will add an entry in this table for each queue, threshold and port. This object is deprecated. Port specific queueing info can be obtained from cbQosQueueingCfgTable and cbQosQueueingStatsTable if port contains policy with queueing action. The process to obtain this info is similar to what is described in cportQosStatsTable: Step 1: Use ifIndex and cbQosPolicyDirection to lookup cbQosInterfacePolicyEntry and obtain cbQosIFPolicyIndex which is same as cbQosPolicyIndex. Step 2: Index cbQosPolicyIndex into cbQosObjectsTable and obtain all entries corresponding to this policy instance of cbQosPolicyIndex. Step 3: With the obtained entries, filter the ones with action as 'queueing' in cbQosObjectsType. Step 4: Collect all cbQosObjectsIndex and cbQosConfigIndex for all such filtered entries. Step 5: To get queueing stats : Index cbQosPolicyIndex and cbQosObjectsIndex into cbQosQueueingStatsTable To get queueing config : Index cbQosConfigIndex into cbQosQueueingCfgTable."
  },
  "cportQosEgressQueueStatsEntry": {
    "name": "cportQosEgressQueueStatsEntry",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.5.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosQueueId",
        "implied": 0
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosQueueThreshold",
        "implied": 0
      }
    ],
    "status": "deprecated",
    "description": "A conceptual row in cportQosEgressQueueStatsTable. ` This object is deprecated for the same reason as mentioned in description of cportQosEgressQueueStatsTable."
  },
  "cportQosQueueId": {
    "name": "cportQosQueueId",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.5.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 2147483647
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "deprecated",
    "description": "This object identifies the queue ID of this port for which QoS statistics are collected. For example, if a port has 4 queues, this index value can be 1,2,3,4. This object is deprecated and has no direct replacement object. Queue id is no longer needed to get queueing action config as described in description of cportQosEgressQueueStatsTable."
  },
  "cportQosQueueThreshold": {
    "name": "cportQosQueueThreshold",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.5.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 2147483647
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "deprecated",
    "description": "This object identifies the threshold number of the queue threshold associated with this queue. A queue can have more than one threshold. For example, if a queue has 3 thresholds, this index could be 1,2,3. This object is deprecated and has no direct replacement."
  },
  "cportQosQueueEnqueuePkts": {
    "name": "cportQosQueueEnqueuePkts",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.5.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "Packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "This object indicates the number of egress packets that have been enqueued for this queue and threshold. This object is deprecated and replaced by cbQosQueueingCurrentQDepth in CISCO-CLASS-BASED-QOS-MIB."
  },
  "cportQosQueueDropPkts": {
    "name": "cportQosQueueDropPkts",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.5.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "Packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "This object indicates the number of egress packets that have been dropped for this queue and threshold. This object is deprecated and replaced by cbQosQueueingDiscardPkt64 in CISCO-CLASS-BASED-QOS-MIB."
  },
  "cportQosClassEgressStatsTable": {
    "name": "cportQosClassEgressStatsTable",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.6",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "deprecated",
    "description": "This table specifies egress QoS related statistical information for classes associated with an egress QoS policy. Each queue on a port is uniquely mapped to a class in an egress QoS policy. This table provides the statistical information for each class-queue on each port. The agent will add an entry in this table for each queue and threshold on a port associated with a class. This object is deprecated by corresponding class based table in CISCO-CLASS-BASED-QOS-MIB-MIB. Same information can be obtained from cbQosCMStatsTable and cbQosCMCfgTable. To access a port specific class configuration and stats, following steps can be followed: Step 1: Use ifIndex and cbQosPolicyDirection='output' to lookup cbQosInterfacePolicyEntry and obtain cbQosIFPolicyIndex which is same as cbQosPolicyIndex. Step 2: Index cbQosPolicyIndex into cbQosObjectsTable and obtain all entries corresponding to this policy instance of cbQosPolicyIndex. Step 3: With the obtained entries, filter the ones with object type as 'classmap' in cbQosObjectsType. Step 4: Collect all cbQosObjectsIndex and cbQosConfigIndex for all such filtered entries. Step 5: To get queueing stats : Index cbQosPolicyIndex and cbQosObjectsIndex into cbQosCMStatsTable To get queueing config : Index cbQosConfigIndex into cbQosCMCfgTable."
  },
  "cportQosClassEgressStatsEntry": {
    "name": "cportQosClassEgressStatsEntry",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.6.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosClassId",
        "implied": 0
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosClassThreshold",
        "implied": 0
      }
    ],
    "status": "deprecated",
    "description": "A conceptual row in cportQosClassEgressStatsTable. This object is deprecated for the same reason as mentioned in cportQosClassEgressStatsTable."
  },
  "cportQosClassId": {
    "name": "cportQosClassId",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.6.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 2147483647
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "deprecated",
    "description": "This object identifies the class-ID of the class in an egress policy for which QoS statistics are being collected. Each queue on a port is uniquely mapped to a class in an egress policy. Each class in a policy is uniquely identified by a class-ID. A value of 0 indicates the default queue/class-default. This object is deprecated and no direct mapping is available. All classes must be referred to by name, cbQosCMName, in CISCO-CLASS-BASED-QOS-MIB."
  },
  "cportQosClassThreshold": {
    "name": "cportQosClassThreshold",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.6.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 2147483647
          }
        ]
      }
    },
    "units": "Number of buffers",
    "maxaccess": "not-accessible",
    "status": "deprecated",
    "description": "This object identifies the tail-drop queue thresholds value on a class-queue on a port. These values can either be the default value or each could be an explicitly configured value. For example, if a queue has 3 thresholds, 16, 64 and 256, this index value for each threshold would be 16, 64, 256 respectively. This object is deprecated for the same reason as mentioned in cportQosClassEgressStatsTable. There is no mapping for this object."
  },
  "cportQosClassName": {
    "name": "cportQosClassName",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.6.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "This object indicates the class name that is associated with the class-ID indicated by the cportQosClassId object. This object is deprecated and replaced by cbQosCMName in CISCO-CLASS-BASED-QOS-MIB. This object is deprecated for the same reason as mentioned in cportQosClassEgressStatsTable."
  },
  "cportQosClassEnqueuePkts": {
    "name": "cportQosClassEnqueuePkts",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.6.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "Packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "This object indicates the number of egress packets that have been enqueued for this queue and threshold. This object is deprecated for the same reason as mentioned in cportQosClassEgressStatsTable. The equivalent info can be obtained from cbQosCMPrePolicyPkt64- cbQosCMDropPkt64. Access of cbQosCMPrePolicyPkt64- cbQosCMDropPkt64, can de done as described in description of cportQosClassEgressStatsTable."
  },
  "cportQosClassDropPkts": {
    "name": "cportQosClassDropPkts",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.6.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "Packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "This object indicates the number of egress packets that have been dropped for this queue and threshold. This object is deprecated and replaced by cbQosCMDropPkt64 in CISCO-CLASS-BASED-QOS-MIB. This object is deprecated for the same reason as mentioned in cportQosClassEgressStatsTable."
  },
  "cportQosClassDiscontinuityTime": {
    "name": "cportQosClassDiscontinuityTime",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.6.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TimeStamp",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The value of sysUpTime on the most recent occasion at which any of this entry's counter experienced a discontinuity. If discontinuities have not occurred since the last re-initialization of the local management subsystem, then this object contains a zero value. This object is deprecated for the same reason as mentioned in cportQosClassEgressStatsTable. Generic platform independent counters in CISCO-CLASS-BASED-QOS-MIB should be used instead of platform dependent objects in this MIB. There is no direct mapping available for object."
  },
  "cportQosClassIngressStatsTable": {
    "name": "cportQosClassIngressStatsTable",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.7",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "deprecated",
    "description": "This table specifies QoS related statistical information per port for ingress traffic belonging to QoS classes configured with an action that support statistics (for example: a policer). This object is deprecated by corresponding class based table in CISCO-CLASS-BASED-QOS-MIB-MIB. Same information can be obtained from cbQosPoliceStatsTable and cbQosCMCfgTable. To access a port specific class configuration and stats, following steps can be followed: Step 1: Use ifIndex and cbQosPolicyDirection='input' to lookup cbQosInterfacePolicyEntry and obtain cbQosIFPolicyIndex which is same as cbQosPolicyIndex. Step 2: Index cbQosPolicyIndex into cbQosObjectsTable and obtain all entries corresponding to this policy instance of cbQosPolicyIndex. Step 3: With the obtained entries, filter following: - For entries having 'classmap' in cbQosObjectsType, collect cbQosConfigIndex. - For entries having 'police' in cbQosObjectsType, collect cbQosObjectsIndex. Here the selected entries should be the ones which maps to cbQosParentObjectsIndex of the desired class. Step 4: Collect all cbQosObjectsIndex and cbQosConfigIndex for all such filtered entries. Step 5: To get policing stats : Index cbQosPolicyIndex and cbQosObjectsIndex into cbQosPoliceStatsTable To get class config : Index cbQosConfigIndex into cbQosCMCfgTable."
  },
  "cportQosClassIngressStatsEntry": {
    "name": "cportQosClassIngressStatsEntry",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.7.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosClassIdLevel1",
        "implied": 0
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosClassIdLevel2",
        "implied": 0
      }
    ],
    "status": "deprecated",
    "description": "A conceptual row in cportQosClassIngressStatsTable. An entry is added per port for ingress traffic belonging to QoS classes, indicated by cportQosClassIdLevel1 and cportQosClassIdLevel2, configured with an action that supports statistics. This object is deprecated for the same reason as mentioned in cportQosClassIngressStatsTable."
  },
  "cportQosClassIdLevel1": {
    "name": "cportQosClassIdLevel1",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.7.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 2147483647
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "deprecated",
    "description": "This object identifies the class-ID of a class at the first (highest) level of a hierarchical policy. A value of 0 indicates class default. For a non-hierarchical policy, the value of this object is always 0. This object is deprecated for the same reason as mentioned in cportQosClassEgressStatsTable. There is no mapping for this object. All classes must be referred by class name object cbQosCMName of cbQosCMCfgEntry in CISCO-CLASS-BASED-QOS-MIB."
  },
  "cportQosClassIdLevel2": {
    "name": "cportQosClassIdLevel2",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.7.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 2147483647
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "deprecated",
    "description": "This object identifies the class-ID of a class at the second level of a hierarchical policy, or at the first (only) level in a non-hierarchical policy. For a two level policy, this object identifies the class-ID at the second level of the policy. For a non-hierarchical/ single level policy this object identifies the class-ID of a class at the first (only) level of the policy. A value of 0 indicates class default. This object is deprecated for the same reason as mentioned in cportQosClassEgressStatsTable. There is no mapping for this object. All classes must be referred by class name object cbQosCMName of cbQosCMCfgEntry in CISCO-CLASS-BASED-QOS-MIB."
  },
  "cportQosClassNameLevel1": {
    "name": "cportQosClassNameLevel1",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.7.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "This object indicates the class name that is associated with the class-ID indicated by the cportQosClassIdLevel1 object. This object is deprecated and replaced by cbQosCMName in CbQosCMCfgEntry in CISCO-CLASS-BASED-QOS-MIB."
  },
  "cportQosClassNameLevel2": {
    "name": "cportQosClassNameLevel2",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.7.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "This object indicates the class name that is associated with the class-ID indicated by the cportQosClassIdLevel2 object. This object is deprecated for the same reason as mentioned in cportQosClassEgressStatsTable. This object can be mapped to cbQosCMName of cbQosCMCfgEntry which uniquely identifies a class. To lookup level 2 of hierarchical policy, cbQosConfigIndex chosen should belong to row having appropriate cbQosParentObjectsIndex."
  },
  "cportQosPoliceConformPkts": {
    "name": "cportQosPoliceConformPkts",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.7.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "Packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "This object indicates the number of ingress packets that conforms to the policing rate for traffic belonging to the classes indicated by the cportQosClassIdLevel1 and cportQosClassIdLevel2 indices. This object is deprecated for the same reason as mentioned in cportQosClassEgressStatsTable. This object can be mapped to cbQosPoliceConformedPkt64 in CISCO-CLASS-BASED-QOS-MIB."
  },
  "cportQosPoliceConformOctets": {
    "name": "cportQosPoliceConformOctets",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.7.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "Octets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "This object indicates the number of ingress octets that conforms to the policing rate for traffic belonging to the classes indicated by the cportQosClassIdLevel1 and cportQosClassIdLevel2 indices. This object is deprecated for the same reason as mentioned in cportQosClassEgressStatsTable. This object can be mapped to cbQosPoliceConformedByte64 in CISCO-CLASS-BASED-QOS-MIB."
  },
  "cportQosPoliceExceedPkts": {
    "name": "cportQosPoliceExceedPkts",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.7.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "Packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "This object indicates the number of ingress packets that exceeds the policing rate for traffic belonging to the classes indicated by the cportQosClassIdLevel1 and cportQosClassIdLevel2 indices. This object is deprecated for the same reason as mentioned in cportQosClassEgressStatsTable. This object can be mapped to cbQosPoliceExceededPkt64 in CISCO-CLASS-BASED-QOS-MIB."
  },
  "cportQosPoliceExceedOctets": {
    "name": "cportQosPoliceExceedOctets",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.7.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "Octets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "This object indicates the number of ingress octets that exceeds the policing rate for traffic belonging to the classes indicated by the cportQosClassIdLevel1 and cportQosClassIdLevel2 indices. This object is deprecated for the same reason as mentioned in cportQosClassEgressStatsTable. This object can be mapped to cbQosPoliceExceededPkt64 in CISCO-CLASS-BASED-QOS-MIB."
  },
  "cportQosPoliceViolatePkts": {
    "name": "cportQosPoliceViolatePkts",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.7.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "Packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "This object indicates the number of ingress packets that violates the policing rate for traffic belonging to the classes indicated by the cportQosClassIdLevel1 and cportQosClassIdLevel2 indices. This object is deprecated for the same reason as mentioned in cportQosClassEgressStatsTable. This object can be mapped to cbQosPoliceViolatedPkt64 in CISCO-CLASS-BASED-QOS-MIB."
  },
  "cportQosPoliceViolateOctets": {
    "name": "cportQosPoliceViolateOctets",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.7.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "Octets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "This object indicates the number of ingress octets that violates the policing rate for traffic belonging to the classes indicated by the cportQosClassIdLevel1 and cportQosClassIdLevel2 indices. This object is deprecated for the same reason as mentioned in cportQosClassEgressStatsTable. This object can be mapped to cbQosPoliceViolatedByte64 in CISCO-CLASS-BASED-QOS-MIB."
  },
  "cportQosPoliceConformRate": {
    "name": "cportQosPoliceConformRate",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.7.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "units": "bits per second",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "This object indicates the rate of ingress packets that conforms to the policing rate for traffic belonging to the classes indicated by the cportQosClassIdLevel1 and cportQosClassIdLevel2 indices. This object is deprecated for the same reason as mentioned in cportQosClassEgressStatsTable. This object can be mapped to cbQosPoliceConformedBitRate in CISCO-CLASS-BASED-QOS-MIB."
  },
  "cportQosPoliceExceedRate": {
    "name": "cportQosPoliceExceedRate",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.7.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "units": "bits per second",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "This object indicates the rate of ingress packets that exceeds the policing for traffic belonging to the classes indicated by the cportQosClassIdLevel1 and cportQosClassIdLevel2 indices. This object is deprecated for the same reason as mentioned in cportQosClassEgressStatsTable. This object can be mapped to cbQosPoliceExceedBitRate in CISCO-CLASS-BASED-QOS-MIB."
  },
  "cportQosPoliceViolateRate": {
    "name": "cportQosPoliceViolateRate",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.7.1.13",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "units": "bits per second",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "This object indicates the rate of ingress packets that violates the policing for traffic belonging to the classes indicated by the cportQosClassIdLevel1 and cportQosClassIdLevel2 indices. This object is deprecated for the same reason as mentioned in cportQosClassEgressStatsTable. This object can be mapped to cbQosPoliceViolateBitRate in CISCO-CLASS-BASED-QOS-MIB."
  },
  "cportQosPoliceDiscontinuityTime": {
    "name": "cportQosPoliceDiscontinuityTime",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.7.1.14",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TimeStamp",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The value of sysUpTime on the most recent occasion at which any of this entry's counter experienced a discontinuity. If discontinuities have not occurred since the last re-initialization of the local management subsystem, then this object contains a zero value. This object is deprecated for the same reason as mentioned in cportQosClassEgressStatsTable. There is no direct object mapped for this object."
  },
  "cportQosDscpStatsTable": {
    "name": "cportQosDscpStatsTable",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.8",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "deprecated",
    "description": "This table indicates QoS related statistical DSCP information. The statistics are collected per physical port and DSCP value. This object is deprecated. Customers should move to using generic policy based counters provided by CISCO-CLASS-BASED-QOS-MIB-MIB instead of using platform specific objects. One way to obtain port specific dscp counters would be to configure a policy with class having match on desired dscp value and no action under it. Then counters in cbQosCMStatsTable can be used to infer the packet counts in ingress and egress direction."
  },
  "cportQosDscpStatsEntry": {
    "name": "cportQosDscpStatsEntry",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.8.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosDscpValue",
        "implied": 0
      }
    ],
    "status": "deprecated",
    "description": "A conceptual row in cportQosDscpStatsTable. There is an entry in this table for each port and each DSCP value. This object is deprecated. The reason of deprecation and the alternative of obtaining same information are mentioned in cportQosDscpStatsTable."
  },
  "cportQosDscpValue": {
    "name": "cportQosDscpValue",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.8.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Dscp",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "deprecated",
    "description": "This object identifies the DSCP value for incoming or outgoing packets. This object is deprecated. The reason of deprecation and the alternative of obtaining same information are mentioned in cportQosDscpStatsTable."
  },
  "cportQosDscpIngressPkts": {
    "name": "cportQosDscpIngressPkts",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.8.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "Packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "This object indicates the number of ingress packets whose DSCP value matched the value of the cportQosDscpValue object. This object is deprecated. The reason of deprecation and the alternative of obtaining same information are mentioned in cportQosDscpStatsTable."
  },
  "cportQosDscpIngressOctets": {
    "name": "cportQosDscpIngressOctets",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.8.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "Octets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "This object indicates the number of ingress octets whose DSCP value matched the value of the cportQosDscpValue object. This object is deprecated. The reason of deprecation and the alternative of obtaining same information are mentioned in cportQosDscpStatsTable."
  },
  "cportQosDscpEgressPkts": {
    "name": "cportQosDscpEgressPkts",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.8.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "Packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "This object indicates the number of egress packets whose DSCP value matched the value of the cportQosDscpValue object. This object is deprecated. The reason of deprecation and the alternative of obtaining same information are mentioned in cportQosDscpStatsTable."
  },
  "cportQosDscpEgressOctets": {
    "name": "cportQosDscpEgressOctets",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.8.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "Octets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "This object indicates the number of egress octets whose DSCP value matched the value of the cportQosDscpValue object. This object is deprecated. The reason of deprecation and the alternative of obtaining same information are mentioned in cportQosDscpStatsTable."
  },
  "cportQosCosStatsTable": {
    "name": "cportQosCosStatsTable",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.9",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "deprecated",
    "description": "This table indicates QoS related statistical COS information. The statistics are collected per physical port and COS value. This object is deprecated. Customers should move to using generic independent counters provided by CISCO-CLASS-BASED-QOS-MIB-MIB instead of using platform specific objects. One way to obtain port specific dscp counters would be to configure a policy with class having match on desired cos value and no action under it. Then counters in cbQosCMStatsTable can be used to infer the packet counts in ingress and egress direction."
  },
  "cportQosCosStatsEntry": {
    "name": "cportQosCosStatsEntry",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.9.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosCosValue",
        "implied": 0
      }
    ],
    "status": "deprecated",
    "description": "A conceptual row in cportQosCosStatsTable. There is an entry in this table for each port and each COS value. This object is deprecated. The reason of deprecation and the alternative of obtaining same information are mentioned in cportQosCosStatsTable."
  },
  "cportQosCosValue": {
    "name": "cportQosCosValue",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.9.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "QosLayer2Cos",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "deprecated",
    "description": "This object identifies the COS value for each received or sent packet. This object is deprecated. The reason of deprecation and the alternative of obtaining same information are mentioned in cportQosCosStatsTable."
  },
  "cportQosCosIngressPkts": {
    "name": "cportQosCosIngressPkts",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.9.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "Packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "This object indicates the number of ingress packets whose COS value matched the value of the cportQosCosValue object. This object is deprecated. The reason of deprecation and the alternative of obtaining same information are mentioned in cportQosCosStatsTable."
  },
  "cportQosCosIngressOctets": {
    "name": "cportQosCosIngressOctets",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.9.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "Octets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "This object indicates the number of ingress octets whose COS value matched the value of the cportQosCosValue object. This object is deprecated. The reason of deprecation and the alternative of obtaining same information are mentioned in cportQosCosStatsTable."
  },
  "cportQosCosEgressPkts": {
    "name": "cportQosCosEgressPkts",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.9.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "Packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "This object indicates the number of egress packets whose COS value matched the value of the cportQosCosValue object. This object is deprecated. The reason of deprecation and the alternative of obtaining same information are mentioned in cportQosCosStatsTable."
  },
  "cportQosCosEgressOctets": {
    "name": "cportQosCosEgressOctets",
    "oid": "1.3.6.1.4.1.9.9.189.1.3.9.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "Octets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "This object indicates the number of egress octets whose COS value matched the value of the cportQosCosValue object. This object is deprecated. The reason of deprecation and the alternative of obtaining same information are mentioned in cportQosCosStatsTable."
  },
  "ciscoPortQosMIBNotifications": {
    "name": "ciscoPortQosMIBNotifications",
    "oid": "1.3.6.1.4.1.9.9.189.2",
    "class": "objectidentity"
  },
  "ciscoPortQosMIBConformance": {
    "name": "ciscoPortQosMIBConformance",
    "oid": "1.3.6.1.4.1.9.9.189.3",
    "class": "objectidentity"
  },
  "ciscoPortQosMIBCompliances": {
    "name": "ciscoPortQosMIBCompliances",
    "oid": "1.3.6.1.4.1.9.9.189.3.1",
    "class": "objectidentity"
  },
  "ciscoPortQosMIBGroups": {
    "name": "ciscoPortQosMIBGroups",
    "oid": "1.3.6.1.4.1.9.9.189.3.2",
    "class": "objectidentity"
  },
  "ciscoPortQosMIBCompliance": {
    "name": "ciscoPortQosMIBCompliance",
    "oid": "1.3.6.1.4.1.9.9.189.3.1.1",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "ciscoPortQosMIBGroup",
        "module": "CISCO-PORT-QOS-MIB"
      },
      {
        "object": "ciscoPortQosStatsMIBGroup",
        "module": "CISCO-PORT-QOS-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for entities which implement Port QoS functions on a Cisco router."
  },
  "ciscoPortQosMIBComplianceRev1": {
    "name": "ciscoPortQosMIBComplianceRev1",
    "oid": "1.3.6.1.4.1.9.9.189.3.1.2",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "ciscoPortQosMIBGroup",
        "module": "CISCO-PORT-QOS-MIB"
      },
      {
        "object": "ciscoPortQosStatsMIBGroupRev1",
        "module": "CISCO-PORT-QOS-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for entities which implement Port QoS functions on a Cisco router."
  },
  "ciscoPortQosMIBComplianceRev2": {
    "name": "ciscoPortQosMIBComplianceRev2",
    "oid": "1.3.6.1.4.1.9.9.189.3.1.3",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "ciscoPortQosMIBGroup",
        "module": "CISCO-PORT-QOS-MIB"
      },
      {
        "object": "ciscoPortQosStatsMIBGroupRev2",
        "module": "CISCO-PORT-QOS-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for entities which implement Port QoS functions on a Cisco router."
  },
  "ciscoPortQosMIBComplianceRev3": {
    "name": "ciscoPortQosMIBComplianceRev3",
    "oid": "1.3.6.1.4.1.9.9.189.3.1.4",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "ciscoPortQosMIBGroup",
        "module": "CISCO-PORT-QOS-MIB"
      },
      {
        "object": "ciscoPortQosStatsMIBGroupRev2",
        "module": "CISCO-PORT-QOS-MIB"
      },
      {
        "object": "ciscoPortQosStatsMIBGroupRev2Supp1",
        "module": "CISCO-PORT-QOS-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for entities which implement Port QoS functions on a Cisco router."
  },
  "ciscoPortQosMIBComplianceRev4": {
    "name": "ciscoPortQosMIBComplianceRev4",
    "oid": "1.3.6.1.4.1.9.9.189.3.1.5",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "ciscoPortQosMIBGroup",
        "module": "CISCO-PORT-QOS-MIB"
      },
      {
        "object": "ciscoPortQosStatsMIBGroupRev2",
        "module": "CISCO-PORT-QOS-MIB"
      },
      {
        "object": "ciscoPortQosStatsMIBGroupRev2Supp1",
        "module": "CISCO-PORT-QOS-MIB"
      },
      {
        "object": "ciscoPortQosStatsMIBGroupRev2Supp2",
        "module": "CISCO-PORT-QOS-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for entities which implement Port QoS functions on a Cisco router."
  },
  "ciscoPortQosMIBComplianceRev5": {
    "name": "ciscoPortQosMIBComplianceRev5",
    "oid": "1.3.6.1.4.1.9.9.189.3.1.6",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "ciscoPortQosMIBGroup",
        "module": "CISCO-PORT-QOS-MIB"
      },
      {
        "object": "ciscoPortQosStatsMIBGroupRev2",
        "module": "CISCO-PORT-QOS-MIB"
      },
      {
        "object": "ciscoPortQosStatsMIBGroupRev2Supp1",
        "module": "CISCO-PORT-QOS-MIB"
      },
      {
        "object": "ciscoPortQosStatsMIBGroupRev2Supp2",
        "module": "CISCO-PORT-QOS-MIB"
      },
      {
        "object": "ciscoPortQosStatsMIBGroupRev2Supp3",
        "module": "CISCO-PORT-QOS-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for entities which implement Port QoS functions on a Cisco router."
  },
  "ciscoPortQosMIBComplianceRev6": {
    "name": "ciscoPortQosMIBComplianceRev6",
    "oid": "1.3.6.1.4.1.9.9.189.3.1.7",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "ciscoPortQosMIBGroup",
        "module": "CISCO-PORT-QOS-MIB"
      },
      {
        "object": "ciscoPortQosStatsMIBGroupRev2",
        "module": "CISCO-PORT-QOS-MIB"
      },
      {
        "object": "ciscoPortQosStatsMIBGroupRev2Supp1",
        "module": "CISCO-PORT-QOS-MIB"
      },
      {
        "object": "ciscoPortQosStatsMIBGroupRev2Supp2",
        "module": "CISCO-PORT-QOS-MIB"
      },
      {
        "object": "ciscoPortQosStatsMIBGroupRev2Supp3",
        "module": "CISCO-PORT-QOS-MIB"
      },
      {
        "object": "ciscoPortQosStatsMIBGroupRev2Supp4",
        "module": "CISCO-PORT-QOS-MIB"
      },
      {
        "object": "ciscoPortQosStatsMIBGroupRev2Supp5",
        "module": "CISCO-PORT-QOS-MIB"
      },
      {
        "object": "ciscoPortQosStatsMIBGroupRev2Supp6",
        "module": "CISCO-PORT-QOS-MIB"
      },
      {
        "object": "ciscoPortQosStatsMIBGroupRev2Supp7",
        "module": "CISCO-PORT-QOS-MIB"
      },
      {
        "object": "ciscoPortQosStatsMIBGroupRev2Supp8",
        "module": "CISCO-PORT-QOS-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for entities which implement Port QoS functions on a Cisco router."
  },
  "ciscoPortQosMIBGroup": {
    "name": "ciscoPortQosMIBGroup",
    "oid": "1.3.6.1.4.1.9.9.189.3.2.1",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosRLConfigEnable"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosRLConfigRate"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosRLConfigBurstSize"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosTSConfigEnable"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosTSConfigRate"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosTSConfigBurstSize"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects providing Port QoS features. This object is deprecated since all the objects in this MIB file is being deprecated."
  },
  "ciscoPortQosStatsMIBGroup": {
    "name": "ciscoPortQosStatsMIBGroup",
    "oid": "1.3.6.1.4.1.9.9.189.3.2.2",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosIndexType"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosPrePolicyPkts"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosPrePolicyOctets"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosPostPolicyOctets"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosPostPolicyPkts"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosDropPkts"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosDropOctets"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosClassifiedOctets"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosClassifiedPkts"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects providing per Port QoS statistics. Replaced by: ciscoPortQosStatsMIBGroupRev1. This object is deprecated since all the objects in this MIB file is being deprecated"
  },
  "ciscoPortQosStatsMIBGroupRev1": {
    "name": "ciscoPortQosStatsMIBGroupRev1",
    "oid": "1.3.6.1.4.1.9.9.189.3.2.3",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosIndexType"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosPrePolicyPkts"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosPrePolicyOctets"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosPostPolicyOctets"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosPostPolicyPkts"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosDropPkts"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosDropOctets"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosClassifiedOctets"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosClassifiedPkts"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosNoChangePkts"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosNoChangeOctets"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects providing per Port QoS statistics. This object is deprecated since all the objects in this MIB file is being deprecated."
  },
  "ciscoPortQosStatsMIBGroupRev2": {
    "name": "ciscoPortQosStatsMIBGroupRev2",
    "oid": "1.3.6.1.4.1.9.9.189.3.2.4",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosIndexTypeNew"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosPrePolicyPkts"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosPrePolicyOctets"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosPostPolicyOctets"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosPostPolicyPkts"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosDropPkts"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosDropOctets"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosClassifiedOctets"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosClassifiedPkts"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosNoChangePkts"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosNoChangeOctets"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosInProfPolicyPkts"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosOutOfProfPolicyPkts"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects providing per Port QoS statistics. This object is deprecated since all the objects in this MIB file is being deprecated."
  },
  "ciscoPortQosStatsMIBGroupRev2Supp1": {
    "name": "ciscoPortQosStatsMIBGroupRev2Supp1",
    "oid": "1.3.6.1.4.1.9.9.189.3.2.5",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosVlanInProfPolicyPkts"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosVlanOutOfProfPolicyPkts"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects providing per Port QoS statistics. This object is deprecated since all the objects in this MIB file is being deprecated."
  },
  "ciscoPortQosStatsMIBGroupRev2Supp2": {
    "name": "ciscoPortQosStatsMIBGroupRev2Supp2",
    "oid": "1.3.6.1.4.1.9.9.189.3.2.6",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosInProfPolicyOctets"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosOutOfProfPolicyOctets"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosViolateProfPolicyPkts"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosViolateProfPolicyOctets"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects providing per Port QoS statistics. This object is deprecated since all the objects in this MIB file is being deprecated."
  },
  "ciscoPortQosStatsMIBGroupRev2Supp3": {
    "name": "ciscoPortQosStatsMIBGroupRev2Supp3",
    "oid": "1.3.6.1.4.1.9.9.189.3.2.7",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosVlanInProfPolicyOctets"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosVlanOutOfProfPolicyOctets"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosVlanViolateProfPolicyPkts"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosVlanViolateProfPolicyOctets"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects providing per Port QoS statistics. This object is deprecated since all the objects in this MIB file is being deprecated."
  },
  "ciscoPortQosStatsMIBGroupRev2Supp4": {
    "name": "ciscoPortQosStatsMIBGroupRev2Supp4",
    "oid": "1.3.6.1.4.1.9.9.189.3.2.8",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosQueueEnqueuePkts"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosQueueDropPkts"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects providing per Port QoS statistics. This object is deprecated since all the objects in this MIB file is being deprecated."
  },
  "ciscoPortQosStatsMIBGroupRev2Supp5": {
    "name": "ciscoPortQosStatsMIBGroupRev2Supp5",
    "oid": "1.3.6.1.4.1.9.9.189.3.2.9",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosClassName"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosClassEnqueuePkts"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosClassDropPkts"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosClassDiscontinuityTime"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects providing per Port QoS statistics. This object is deprecated since all the objects in this MIB file is being deprecated."
  },
  "ciscoPortQosStatsMIBGroupRev2Supp6": {
    "name": "ciscoPortQosStatsMIBGroupRev2Supp6",
    "oid": "1.3.6.1.4.1.9.9.189.3.2.10",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosClassNameLevel1"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosClassNameLevel2"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosPoliceConformPkts"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosPoliceConformOctets"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosPoliceExceedPkts"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosPoliceExceedOctets"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosPoliceViolatePkts"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosPoliceViolateOctets"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosPoliceConformRate"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosPoliceExceedRate"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosPoliceViolateRate"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosPoliceDiscontinuityTime"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects providing per Port QoS statistics. This object is deprecated since all the objects in this MIB file is being deprecated."
  },
  "ciscoPortQosStatsMIBGroupRev2Supp7": {
    "name": "ciscoPortQosStatsMIBGroupRev2Supp7",
    "oid": "1.3.6.1.4.1.9.9.189.3.2.11",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosDscpIngressPkts"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosDscpIngressOctets"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosDscpEgressPkts"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosDscpEgressOctets"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects providing per Port QoS statistics. This object is deprecated since all the objects in this MIB file is being deprecated."
  },
  "ciscoPortQosStatsMIBGroupRev2Supp8": {
    "name": "ciscoPortQosStatsMIBGroupRev2Supp8",
    "oid": "1.3.6.1.4.1.9.9.189.3.2.12",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosCosIngressPkts"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosCosIngressOctets"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosCosEgressPkts"
      },
      {
        "module": "CISCO-PORT-QOS-MIB",
        "object": "cportQosCosEgressOctets"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects providing per Port QoS statistics. This object is deprecated since all the objects in this MIB file is being deprecated."
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/CISCO-PORT-QOS-MIB",
      "Produced by pysmi-0.3.4 at Fri May 24 17:14:15 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "CISCO-PORT-QOS-MIB"
  }
}