{
  "imports": {
    "class": "imports",
    "CISCO-ITP-GSCCP-MIB": [
      "CgsccpGttGlobalTitleInd",
      "CgsccpGttTransType"
    ],
    "CISCO-ITP-GSP-MIB": [
      "cgspEventSequenceNumber",
      "cgspCLLICode",
      "cgspInstNetwork"
    ],
    "CISCO-ITP-TC-MIB": [
      "CItpTcGtaLongDisplay",
      "CItpTcNetworkName",
      "CItpTcPointCode",
      "CItpTcPointCodeMask",
      "CItpTcNAI",
      "CItpTcServiceIndicator",
      "CItpTcURL",
      "CItpTcNumberingPlan",
      "CItpTcSubSystemNumber",
      "CItpTcTableLoadStatus"
    ],
    "CISCO-SMI": [
      "ciscoMgmt"
    ],
    "SNMPv2-CONF": [
      "MODULE-COMPLIANCE",
      "NOTIFICATION-GROUP",
      "OBJECT-GROUP"
    ],
    "SNMPv2-SMI": [
      "IpAddress",
      "Counter64",
      "Integer32",
      "Gauge32",
      "NOTIFICATION-TYPE",
      "Bits",
      "OBJECT-TYPE",
      "iso",
      "Unsigned32",
      "Counter32",
      "TimeTicks",
      "OBJECT-IDENTITY",
      "MibIdentifier",
      "MODULE-IDENTITY"
    ],
    "SNMPv2-TC": [
      "TEXTUAL-CONVENTION",
      "DateAndTime",
      "TimeStamp",
      "TruthValue",
      "RowStatus",
      "DisplayString"
    ]
  },
  "ciscoMlrMIB": {
    "name": "ciscoMlrMIB",
    "oid": "1.3.6.1.4.1.9.9.396",
    "class": "moduleidentity",
    "revisions": [
      {
        "revision": "2004-09-22 00:00",
        "description": "Modification and additions to support following changes. - minimum and maximum digits parameter for global title addresses. - nature of address and numbering plan parameters on address tables - origination International Mobile Station Identity parameters - multiple message dialogs Updated cmlrRuleInputParameters object to support new parameters and added following objects. cmlrRuleDestSmeMinDigits cmlrRuleDestSmeMaxDigits cmlrRuleDestSmeTableNai cmlrRuleDestSmeTableNp cmlrRuleDestSmscMinDigits cmlrRuleDestSmscMaxDigits cmlrRuleOrigSmeMinDigits cmlrRuleOrigSmeMaxDigits cmlrRuleOrigSmeTableNai cmlrRuleOrigSmeTableNp cmlrRuleOrigImsiGta cmlrRuleOrigImsiNai cmlrRuleOrigImsiNp cmlrRuleOrigImsiMinDigits cmlrRuleOrigImsiMaxDigits cmlrRuleOrigImsiTable cmlrRuleOrigSmscMinDigits cmlrRuleOrigSmscMaxDigits "
      },
      {
        "revision": "2004-04-14 00:00",
        "description": "Allow rules to specify matches origination short message entity addresses. Added 'origSmeTable' to cmlrRuleInputParameters object. Added cmlrRuleOrigAddressTable object to cmlrRuleTable table."
      },
      {
        "revision": "2004-03-23 00:00",
        "description": "Initial version of this MIB module."
      }
    ],
    "lastupdated": "200409220000Z",
    "organization": "Cisco Systems, Inc.",
    "contactinfo": " Cisco Systems, Inc Customer Service Postal: 170 W. Tasman Drive San Jose, CA 95134 USA Tel: +1 800 553-NETS E-mail: cs-ss7@cisco.com",
    "description": "The MIB for providing information about Multi-layer Routing(MLR). This MIB will provide information used to control and measure SS7 messages signalling units in a SS7 Network. Message Signalling Units are routed based on information found in the SCCP, TCAP, MAP, and MAP-user layers. It uses information from these layers to make customizable routing decision based on the following criteria. - message A-address (origination SME) - message B-address (destination SME) - protocol identifier - operation code - called party address - calling party address The Cisco IP Transfer Point (ITP) is a hardware and software solution that transports SS7 traffic using IP. Each ITP node provides function similar to SS7 signalling point. The Multi-layer SMS router will be developed in compliance to the following standards. - GSM MAP v1, v2 and v3 MO SMS formats - GSM MAP SMS user information for MO messages - IS-41 MAP Mobile Originated SMS formats for Revisions A thru D. Acronyms and Terms A-address The originating SME of the short message. ANSI-41 ANSI standard for defining cellular radio telecommunications inter-system operation. B-address The destination SME of the short message. BCH Binary Coded Hexadecimal CdPA The SCCP Called Party Address field. CgPA The SCCP Calling Party Address field. GSM ITU standard for defining the Global System for Mobile communications. GTT Global Title Translation. A function normally performed in an STP, GTT is the procedure by which the destination signalling point and subsystem number(SSN) is determined from GTA digits (i.e., the global title) present in the signalling message. IMEI International Mobile Equipment Identity IMSI International Mobile Station Identity or International Mobile Subscriber Identity A mobile station identifier typically used in GSM networks, but is also defined for use in IS-41 networks via IS-751. IS-41 ANSI standard for defining cellular radio telecommunications inter-system operation. Unless otherwise stated, this refers to the IS-41-D specification. MAP SS7 Mobile Application Part. This layer provides mobility procedures to SS7 network applications. MAP is generically used to refer to both GSM-MAP, and the IS-41-D MAP Protocol. MC Message Center. Network element responsible for relaying and store-and-forwarding of short messages in ANSI-41 networks. MDN Mobile Directory Number. A 10-digit North American Numbering Plan number assigned to mobile users in IS-41 networks. It may be different from the MIN. MIN Mobile Identification Number. The 10-digit North American Numbering Plan number assigned to mobile users in IS-41 networks. It may be different from the MDN. MLR Multi-layer Routing MO Mobile Originated. This term is used to refer to an SMS message that is being sent from an MS to the SMSC. MS Mobile Subscriber. MS mobile station MSU Message Signal Unit MT Mobile Terminated. This term is used to refer to an SMS message that is being sent from an SMSC to an MS. MTP Message Transfer Part MTP1 Layers 1 (physical) MTP2 Layer 2 (data) and MTP3 Layer 3 (network) M2PA SS7 MTP2-User Peer-to-Peer Adaptation Layer specified by the IETF SIGTRAN working group, which provides SCTP/IP based links for MTP3. M3UA SS7 MTP3 User Adaptation Layer specified by RFC 3332 for MTP3 users like ISUP. RR Round Robin. A balancing algorithm that evenly distributes traffic among available servers. SCCP Signalling Connection Control Part. As part of the SS7 signalling protocol, it provides connectionless and connection-oriented network services above MTP Level 3. SCP Service Control Point. An element of an SS7-based Intelligent Network which performs various service functions, such as number translation, call setup and tear down, etc. SCTP Stream Control Transmission Protocol. A protocol designed by the SigTran working group of the IETF to transport messages reliably over IP networks(RFC 2960). It has been specifically designed with PSTN signalling in mind, but is meant to be a general IP transport protocol. SG Signalling Gateway. SIM Subscriber Identity Module SME Short Message Entity. An entity that may send or receive short messages, and may be fixed or mobile. SM Short Message SMD-PP Short Message Delivery Point to Point. SMS Short Message Service, as defined in GSM and IS-41-D. SMS-MO Short Message Service Mobile Originated. SMS-MT Short Message Service Mobile Terminated. SMSC Short Message Service Center. Network element responsible for relaying and store-and-forwarding of short messages. SRI Send Routing Information or Send Routing Information for Short Messages. Refers to the procedure by which an SMSC requests the HLR to send current routing information for a particular mobile user. SRI-SM Send Routing Information Short Message SSP Service Switching Point. An element of an SS7-based Intelligent Network that performs call origination, termination, or tandem switching. STP Signal Transfer Point. An element of an SS7-based Intelligent Network that performs routing of the SS7 signalling. SUA SS7 SCCP User Adaptation Layer specified by IETF SIGTRAN for SCCP users, like GSM MAP, UMTS RANAP, CDMA IS-41, CDMA IS-634, IN INAP, CAMEL CAP. TCAP Transaction Capability Application Part. The application layer of the SS7 signalling protocol. WRR Weighted Round Robin. A variation of the round robin algorithm that uses server weights to allow uneven distribution of traffic among a set of available servers. Multi-layer processing consists of four basic phases as follows. Global Title Processing Trigger Processing(primary and secondary) Rule Set Processing Result group Processing Example scenario. The SMS messages sent by origin SME (typically a mobile handset) and sent to the MSC controlling the area in which the origin SME resides. The MSC then initiates a dialogue with the home SMSC specified by the origin SME to route the SMS MO message. SMS MO traffic will arrive as an SCCP packet, and the Routing Indicator(RI) may specify either 'route-on-global-title' (RI=GT) or 'route-on-subsystem' (RI=PC/SSN). The destination GT will be used to locate the global title address that applies to the destination address. Triggers are applied directly to global title addresses. Therefore, trigger processing consists of checking for the existence of primary trigger and then processing of secondary triggers. If the message matches a trigger then rule set processing can be performed to determine what will be modified in message and how the message will be routed. The messages may be sent to new destination address, application server, point-code or result group. Or it could be forwarded without any modification (CONTINUE) or it could be dropped (BLOCK). Result processing balances the delivery of messages to Point-codes or application servers based on Weighted Round Robin(WRR). ********************************************"
  },
  "ciscoMlrMIBNotifs": {
    "name": "ciscoMlrMIBNotifs",
    "oid": "1.3.6.1.4.1.9.9.396.0",
    "class": "objectidentity"
  },
  "ciscoMlrMIBObjects": {
    "name": "ciscoMlrMIBObjects",
    "oid": "1.3.6.1.4.1.9.9.396.1",
    "class": "objectidentity"
  },
  "ciscoMlrMIBConform": {
    "name": "ciscoMlrMIBConform",
    "oid": "1.3.6.1.4.1.9.9.396.2",
    "class": "objectidentity"
  },
  "CmlrAddressDigits": {
    "name": "CmlrAddressDigits",
    "class": "textualconvention",
    "type": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 32
          }
        ]
      }
    },
    "status": "current",
    "description": "The configured digits of A-address or B-address specified in the format indicated by CmlrAddressType. All values are entered in binary and represent digits All values are encoded as hexidecimal values and represent the following characters by address type are as follows. CmlrAddressType: 'bch' GSM: Encoding Character 0000-1001 0-9 1010 * 1011 # 1100 a 1101 b 1110 c 1111 filler ANSI-41 0000-1001 0-9 1010 Spare 1011 Code 11 1100 Code 12 1101 * 1110 # 1111 ST (or filler) CmlrAddressType: 'gmsDa' |0 0 0 0 1 1 1 1 b7 b b b b |0 0 1 1 0 0 1 1 b6 4 3 2 1 |0 1 0 1 0 1 0 1 b5 ----------------------------------- 0 0 0 0 |@ . SP 0 P p 0 0 0 1 | _ ! 1 A Q a q 0 0 1 0 |$ F DQ 2 B R b r 0 0 1 1 | G # 3 C S c s 0 1 0 0 | . 4 D T d t 0 1 0 1 | . % 5 E U e u 0 1 1 0 | . & 6 F V f v 0 1 1 1 | . ' 7 G W g w 1 0 0 0 | S ( 8 H X h x 1 0 0 1 | T ) 9 I Y i y 1 0 1 0 |LF . * : J Z j z 1 0 1 1 | 1) + ; K k 1 1 0 0 | , < L l 1 1 0 1 |CR - = M m 1 1 1 0 | . > N n . 1 1 1 1 | / ? O o 'SP' - Space 'LF' - Line Feed 'DQ' - Double quote '.' = Special characters outside standard ASCII See 6.2.1 GSM 7 bit Default Alphabet Table. The string will consists of N Octets were the first n-1 octets represent the hexadecimal address. The last Octet specifies the number of bits used to match the calling address. For example, when CmlrAddressType is Binary Coded Hexadecimal the following entries illustrate why the trailing number of match bits is required. '081000000000000000000C' match '081' '0810000000000000000010' match '0810' ",
    "reference": "GSM 04.08 Table 10.5.118,ANSI T1.114.5 Figure 8 and ETSI TS 123 038 V5.0.0 (2002-03)"
  },
  "CmlrAddressType": {
    "name": "CmlrAddressType",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "bch": 1,
          "gsmDa": 2
        }
      }
    },
    "status": "current",
    "description": "List of possible table types. 'bch' : Binary Coded Hexadecimal 'gsmDa' : GSM 7 bit Default Alphabet"
  },
  "CmlrId": {
    "name": "CmlrId",
    "class": "textualconvention",
    "type": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 65535
          }
        ]
      }
    },
    "status": "current",
    "description": "A numeric identifier used to specify an entry in a list. Zero is a special value used to indicate no entry."
  },
  "CmlrName": {
    "name": "CmlrName",
    "class": "textualconvention",
    "type": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 20
          }
        ]
      }
    },
    "status": "current",
    "description": "The configured name used to identify various tables used by MLR. An octet string specified by an administrator that must be in human-readable form. The names must conform to the allowed characters that can be specified via Command Line Interface(CLI). The names cannot contain control character and should not contain leading or trailing white space."
  },
  "CmlrResultOctet": {
    "name": "CmlrResultOctet",
    "class": "textualconvention",
    "type": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 64
          },
          {
            "min": 255,
            "max": 255
          }
        ]
      }
    },
    "status": "current",
    "description": "An octet string that contains various types of output from a rule set. The information in this object will be formatted as follows. CmlrResultType: None : Octet string with length of zero. asname : Application Server name formatted as CItpTcXuaName. group : Result group formatted as CmlrName. gt : The global title address formatted as CItpTcGtaLongDisplay pc : Not applicable. block : Octet string with length of zero. continue: Octet string with length of zero. address : The address table name specified by the cmlrAddressTableName object. ruleset : The ruleset table name specified by the cmlrRuleSetName object. An octet string specified by an administrator that must be in human-readable form. The names must conform to the allowed characters that can be specified via Command Line Interface(CLI). The names cannot contain control character and should not contain leading or trailing white space."
  },
  "CmlrResultParameters": {
    "name": "CmlrResultParameters",
    "class": "textualconvention",
    "type": {
      "type": "Bits",
      "class": "type",
      "bits": {
        "network": 0,
        "octet": 1,
        "tranType": 2,
        "gti": 3,
        "np": 4,
        "nai": 5,
        "pc": 6,
        "ssn": 7
      }
    },
    "status": "current",
    "description": "In order to specify the results of MLR statements different values in the packet can be modified. These values are determined by a combination of variant and operation type. This object indicates which objects will be used to form a result action as follows. 'network' : specifies network 'octet' : specifies octet string 'tranType' : specifies translation type 'gti' : specifies global title indicator 'np' : specifies numbering plan 'nai' : specifies nature of address 'pc' : specifies point-code 'ssn' : specifies subsystem number"
  },
  "CmlrResultType": {
    "name": "CmlrResultType",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "none": 1,
          "asname": 2,
          "group": 3,
          "gt": 4,
          "pc": 5,
          "pcSsn": 6,
          "block": 7,
          "continue": 8,
          "address": 9,
          "ruleset": 10
        }
      }
    },
    "status": "current",
    "description": "List of possible result types. 'none' : Result not specified. 'asname' : Message will be routed to a particular destination M3UA or SUA Application Server(AS). 'group' : Message will be routed using information specified in result group. 'gt' : Message will be routed using SCCP global title. 'pc' : Message will be routed using the specified destination point code. 'pcSsn' : Message will be routed using the specified destination point code and subsystem number. 'block' : Message will be discarded. 'continue': Message signal units will be processed by the normal SCCP routing. 'address' : Address table will be search to allow MSU to be routed or modified based on address information. 'ruleset' : Message processed by ruleset to allow MSU to be routed or modified based on information specified in MSU."
  },
  "CmlrRuleProtocol": {
    "name": "CmlrRuleProtocol",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "none": 1,
          "gsmMap": 2,
          "ansi41": 3
        }
      }
    },
    "status": "current",
    "description": "The list of possible protocol types. 'none' : Protocol not specified and will default to value based on variant or other configuration information. 'gsmMap' : Global system for mobile communications Mobile Application Part operations should be matched by this rule. 'ansi41' : Indicates that only ANSI-41 operations should be matched by this rule."
  },
  "CmlrRuleSetName": {
    "name": "CmlrRuleSetName",
    "class": "textualconvention",
    "type": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 20
          }
        ]
      }
    },
    "status": "current",
    "description": "The configured name used to identify a set of rules within an specified network. An octet string specified by an administrator that must be in human-readable form. The names must conform to the allowed characters that can be specified via Command Line Interface(CLI). The names cannot contain control character and should not contain leading or trailing white space."
  },
  "CmlrMinimumDigits": {
    "name": "CmlrMinimumDigits",
    "class": "textualconvention",
    "type": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 20
          }
        ]
      }
    },
    "status": "current",
    "description": "Minimum number of digits that global title address can contain and match rule. The minimum number of digits must be greater than or equal to the length of the specified address. This parameter does not apply when the global title address length is set to zero."
  },
  "CmlrMaximumDigits": {
    "name": "CmlrMaximumDigits",
    "class": "textualconvention",
    "type": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 20
          }
        ]
      }
    },
    "status": "current",
    "description": "Maximum number of digits that global title address can contain and match rule. The maximum number of digits must be greater than or equal to the length of the specified address. Also, the maximum number of digits must be greater than or equal to minimum number of digits. This parameter does not apply when the global title address length is set to zero."
  },
  "cmlrScalars": {
    "name": "cmlrScalars",
    "oid": "1.3.6.1.4.1.9.9.396.1.0",
    "class": "objectidentity"
  },
  "cmlrTableLoadNotifEnabled": {
    "name": "cmlrTableLoadNotifEnabled",
    "oid": "1.3.6.1.4.1.9.9.396.1.0.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "A control to enable or disable ciscoMlrTableLoad notifications as follows: 'true' Indicates that the ciscoMlrTableLoad notification should be generated when the load operations is started or completed. That is, the notification generation is enabled. 'false' Indicates that ciscoMlrTableLoad notification generation is disabled."
  },
  "cmlrInstTable": {
    "name": "cmlrInstTable",
    "oid": "1.3.6.1.4.1.9.9.396.1.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table that is used to provide information and measurements related to multi-layer routing per per signalling point."
  },
  "cmlrInstTableEntry": {
    "name": "cmlrInstTableEntry",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-ITP-GSP-MIB",
        "object": "cgspInstNetwork",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Each entry in this table provides information on each signalling pointer supported by this device. Each entry provides information on modification to the configuration statements related to multi-layer routing and general measurements."
  },
  "cmlrInstLastChanged": {
    "name": "cmlrInstLastChanged",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TimeStamp",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The value of sysUpTime at the time of the last creation or deletion of an entry in the Multi-Layer routing table defined for this signalling point. If the local network management subsystem is re-initialized, then this object contains the sysUpTime at the time when this occurred. This value can be used to prevent unnecessary walks of the various take supporting multi-layer routing."
  },
  "cmlrInstLastLoadTime": {
    "name": "cmlrInstLastLoadTime",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TimeStamp",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The value of sysUpTime at the time of the last load of the Multi-Layer Routing table using file format for this signalling point."
  },
  "cmlrInstLoadStatus": {
    "name": "cmlrInstLoadStatus",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcTableLoadStatus",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The status of the current load or status from the prior load operation. This object will have a value of loadInProgress while the load operation is in progress. The cmlrInstLastLoadTime contains a timestamp indicating when the load operation is completed."
  },
  "cmlrInstLastURL": {
    "name": "cmlrInstLastURL",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcURL",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The last URL used to load MLR table."
  },
  "cmlrInstRoutedCounts": {
    "name": "cmlrInstRoutedCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of the number of times a packet was routed by MLR. This value is incremented when packet is routed with result type of 'asname', 'gt', 'pc' or 'pcSsn'."
  },
  "cmlrInstAbortCounts": {
    "name": "cmlrInstAbortCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of message signal units that could not be processed because of invalid data or were explicitly blocked as a result of MLR processing. The message signalling units will be discarded."
  },
  "cmlrInstContinueCounts": {
    "name": "cmlrInstContinueCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of message signal units that were passed back to normal SCCP processing."
  },
  "cmlrInstSmsMoCounts": {
    "name": "cmlrInstSmsMoCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of message signal units with operation type GSM-MAP SMS-MO."
  },
  "cmlrInstSmsMtCounts": {
    "name": "cmlrInstSmsMtCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of message signal units with operation type GSM-MAP SMS-MT."
  },
  "cmlrInstSriSmCounts": {
    "name": "cmlrInstSriSmCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of message signal units with operation type GSM-MAP SRI-SM."
  },
  "cmlrInstSmdPpCounts": {
    "name": "cmlrInstSmdPpCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of message signal units with operation type ANSI-41 SMD-PP."
  },
  "cmlrInstAlertScCounts": {
    "name": "cmlrInstAlertScCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of message signal units with operation type GSM-MAP AlertSC."
  },
  "cmlrInstSmsRequestCounts": {
    "name": "cmlrInstSmsRequestCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1.13",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of message signal units with operation type ANSI-41 SMSRequest."
  },
  "cmlrInstSmsNotifCounts": {
    "name": "cmlrInstSmsNotifCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1.14",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of message signal units with operation type ANSI-41 SMSNotification."
  },
  "cmlrInstUnsupSCCPmsgTypeCounts": {
    "name": "cmlrInstUnsupSCCPmsgTypeCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1.15",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of message signal units received with unsupported SCCP message type. This object counts are also included in the cmlrInstContinueCounts object."
  },
  "cmlrInstUnsupSegSCCPmsgCounts": {
    "name": "cmlrInstUnsupSegSCCPmsgCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1.16",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of message signal units received with unsupported segmented SCCP message. This object counts are also included in the cmlrInstContinueCounts object."
  },
  "cmlrInstUnsupportedMsgCounts": {
    "name": "cmlrInstUnsupportedMsgCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1.17",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of message signal units received that could not be processed because the messages contained an unsupported command type or contents of messages was unsupported. This object counts are also included in the cmlrInstContinueCounts object."
  },
  "cmlrInstParsingErrorCounts": {
    "name": "cmlrInstParsingErrorCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1.18",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of message signal units received that could not be processed because of a parsing error. This object counts are also included in the cmlrInstContinueCounts object."
  },
  "cmlrInstNoResultCounts": {
    "name": "cmlrInstNoResultCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1.19",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of message signal units received that matched a trigger or rule that did not specify a result. This object counts are also included in the cmlrInstContinueCounts object."
  },
  "cmlrInstResultContinueCounts": {
    "name": "cmlrInstResultContinueCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1.20",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of message signal units received that matched a trigger or rule that specified continue for the result. This object counts are also included in the cmlrInstContinueCounts object."
  },
  "cmlrInstNoServerDiscardCounts": {
    "name": "cmlrInstNoServerDiscardCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1.21",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of message signal units received that matched a trigger or rule that specified a result or result group directing MSU to application server. However, the application server was unavailable. This object counts are also included in the cmlrInstAbortCounts object."
  },
  "cmlrInstResultGttCounts": {
    "name": "cmlrInstResultGttCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1.22",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of message signal units received that matched a trigger or rule that specified GTT for the result. This object counts are also included in the cmlrInstContinueCounts object. "
  },
  "cmlrInstUnparsedCounts": {
    "name": "cmlrInstUnparsedCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1.23",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of message signal units received that could not be parsed due to some type of resource shortage. This object counts are also included in the cmlrInstAbortCounts object."
  },
  "cmlrInstResultBlockCounts": {
    "name": "cmlrInstResultBlockCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1.24",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of message signal units received that matched a trigger or rule that specified a result of block. This object counts are also included in the cmlrInstAbortCounts object."
  },
  "cmlrInstGTImismatchCounts": {
    "name": "cmlrInstGTImismatchCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1.25",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of message signal units received that could not be routed because of mis-match between GTI values. This object counts are also included in the cmlrInstAbortCounts object."
  },
  "cmlrInstAddrConvFailureCounts": {
    "name": "cmlrInstAddrConvFailureCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1.26",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of message signal units received that could not be routed because GTT address failed to convert. This object counts are also included in the cmlrInstAbortCounts object."
  },
  "cmlrInstDestUnavailableCounts": {
    "name": "cmlrInstDestUnavailableCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1.27",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of message signal units received that specified a result PC or PC and SSN and the destination point-code was unavailable. This object counts are also included in the cmlrInstAbortCounts object."
  },
  "cmlrInstFailedTrigMatchCounts": {
    "name": "cmlrInstFailedTrigMatchCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1.28",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of message signal units received that was processed and failed to mathc any trigger. This can occur when a primary trigger specifies secondary triggers and they fail to match. This object counts are also included in the cmlrInstContinueCounts object."
  },
  "cmlrInstDiscontinuityTime": {
    "name": "cmlrInstDiscontinuityTime",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1.29",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TimeStamp",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The value of sysUpTime on the most recent occasion at which the configuration was modified in such a way to force a discontinuity. All counters under this instance in the following tables will be reset when configuration is replaced. - cmlrTriggerTable - cmlrSubTriggerTable - cmlrAddressTable - cmlrRuleTable If no such discontinuities have occurred since the last re-initialization of the local management subsystem, then this object contains a zero value."
  },
  "cmlrInstNoServerContinueCounts": {
    "name": "cmlrInstNoServerContinueCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1.30",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of message signal units received that matched a trigger or rule that specified a result or result group directing MSU to application server. However, the application server was unavailable. This object counts are also included in the cmlrInstContinueCounts object."
  },
  "cmlrInstResultAsCounts": {
    "name": "cmlrInstResultAsCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1.31",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of message signal units received that matched a trigger or rule that specified result type of Application server. This object counts are also included in the cmlrInstRoutedCounts object."
  },
  "cmlrInstResultPcCounts": {
    "name": "cmlrInstResultPcCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1.32",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of message signal units received that matched a trigger or rule that specified result type Pointcode. This object counts are also included in the cmlrInstRoutedCounts object."
  },
  "cmlrInstResultPcSsnCounts": {
    "name": "cmlrInstResultPcSsnCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.1.1.33",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of message signal units received that matched a trigger or rule that specified pointcode and subsystem number. This object counts are also included in the cmlrInstRoutedCounts object."
  },
  "cmlrTriggerTable": {
    "name": "cmlrTriggerTable",
    "oid": "1.3.6.1.4.1.9.9.396.1.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table that is used to configure specific routing keys to act as trigger for multi-layer routing. Entries are added to this table via cmlrTriggerRowStatus in accordance with the RowStatus convention."
  },
  "cmlrTriggerTableEntry": {
    "name": "cmlrTriggerTableEntry",
    "oid": "1.3.6.1.4.1.9.9.396.1.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-ITP-GSP-MIB",
        "object": "cgspInstNetwork",
        "implied": 0
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrTableName",
        "implied": 0
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrTriggerNumber",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Each entry define a trigger to be used to perform non-standard routing of message signalling units. Each trigger entry contains information used to select traffic for further processing. Therefore, the information used to activate trigger must be unique. In addition, information referenced in the routing keys must be defined using objects from CISCO-ITP-GSCCP-MIB or CISCO-ITP-GRT-MIB management information bases."
  },
  "cmlrTableName": {
    "name": "cmlrTableName",
    "oid": "1.3.6.1.4.1.9.9.396.1.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrName",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A name used to define a collection of multi-layer routing statements."
  },
  "cmlrTriggerNumber": {
    "name": "cmlrTriggerNumber",
    "oid": "1.3.6.1.4.1.9.9.396.1.2.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrId",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This object specifies the index for a list of triggers specified per routing table. "
  },
  "cmlrTriggerParameters": {
    "name": "cmlrTriggerParameters",
    "oid": "1.3.6.1.4.1.9.9.396.1.2.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Bits",
      "class": "type",
      "bits": {
        "block": 0,
        "continue": 1,
        "matchAll": 2,
        "cdpa": 3,
        "cgpa": 4,
        "pc": 5,
        "gt": 6,
        "tt": 7,
        "gti": 8,
        "np": 9,
        "nai": 10,
        "ssn": 11,
        "pid": 12,
        "network": 13,
        "ruleset": 14,
        "dpc": 15,
        "opc": 16,
        "opcMask": 17,
        "si": 18
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The following options define the source and processing of triggers. 'block' : Indicates that message signal units will be dropped when they match the specified trigger. When sub-trigger(secondary triggers) exist the option will be ignored. 'continue' : Indicates that message signal units will be processed by the normal SCCP routing. The continue, block and ruleset are mutually exclusive. 'matchAll': Indicates the trigger will match all message signal unit. 'cdpa' : Indicates that the trigger is found within the SCCP called party address field(cdpa). 'cgpa' : Indicates that the trigger is found within the SCCP calling party address field(cgpa). 'pc' : Indicates that the trigger will be matched if it contains the specified point-code. The point-code within the SCCP Cdpa or CgPa will be inspected first. If the point code is not present, then the DPC in the routing label is used if CdPA, and the OPC is used for CgPA. 'gt' : Indicates that the Cgpa or CdPA trigger is to be applied to packet when routing indicator specifies global title translation(RI=GT). 'tt' : Indicates that the translation type has been specified in the cmlrTriggerTransType object. 'gti' : Indicates that the global title indicator has been specified in the cmlrTriggerGti object. 'np' : Indicates that the numbering plan has been specified in the cmlrTriggerNp object. 'nai : Indicates that the nature of specified address has been specified in the cmlrTriggerNai object. 'ssn' : Indicates that the subsystem number has been in the cmlrTriggerSsn object. 'network' : Indicates the network name has been specified in the cmlrTriggerNetwork object. 'ruleset' : Indicates the set of rules to be processed as specified in the cmlrTriggerRuleset object. 'dpc' : Indicates that the destination point-code is one of MTP3 trigger parameters. The DPC is specified in the cmlrTriggerDpc object. 'opc' : Indicates that the origination point-code is one of MTP3 trigger parameters. The OPC is specified in the cmlrTriggerOpc object. 'opcMask': Indicates that the origination point-code is qualified with a mask. one of MTP3 trigger parameters. The OPC is specified in the cmlrTriggerOpc object. 'si': Indicates that the service indicator has been specified in the cmlrTriggerSi object"
  },
  "cmlrTriggerGt": {
    "name": "cmlrTriggerGt",
    "oid": "1.3.6.1.4.1.9.9.396.1.2.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcGtaLongDisplay",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The global title address to be matched when either the 'cdpa' or 'cgpa' bits are set in the cmlrTriggerParameters object. This object will return a string of zero length when the cmlrTriggerParameters 'pc' bit is set."
  },
  "cmlrTriggerTransType": {
    "name": "cmlrTriggerTransType",
    "oid": "1.3.6.1.4.1.9.9.396.1.2.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CgsccpGttTransType",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The translation type specified within the address in the message signal unit. This object will default to value based on variant unless the 'tt' bit is set in cmlrTriggerParameters object."
  },
  "cmlrTriggerGti": {
    "name": "cmlrTriggerGti",
    "oid": "1.3.6.1.4.1.9.9.396.1.2.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CgsccpGttGlobalTitleInd",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The global title indicator value for the global tile address specified within the message signal unit. This object will default to value based on variant unless the 'gti' bit is set in cmlrTriggerParameters object."
  },
  "cmlrTriggerNp": {
    "name": "cmlrTriggerNp",
    "oid": "1.3.6.1.4.1.9.9.396.1.2.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNumberingPlan",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The numbering plan of the specified global title address. This object will default to value based on variant unless the 'np' bit is set in cmlrTriggerParameters object."
  },
  "cmlrTriggerNai": {
    "name": "cmlrTriggerNai",
    "oid": "1.3.6.1.4.1.9.9.396.1.2.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNAI",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Nature of Address Indicator (NAI) for GTT Selector. This object will default to value based on variant unless the 'nai' bit is set in cmlrTriggerParameters object."
  },
  "cmlrTriggerPc": {
    "name": "cmlrTriggerPc",
    "oid": "1.3.6.1.4.1.9.9.396.1.2.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcPointCode",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The point-code in variant-specific format. This object only has meaning when the 'pc' bit is set in the cmlrTriggerParameters object."
  },
  "cmlrTriggerSsn": {
    "name": "cmlrTriggerSsn",
    "oid": "1.3.6.1.4.1.9.9.396.1.2.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcSubSystemNumber",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The subsystem number to be matched when the when the 'pc' bit is set in the cmlrTriggerParameters object."
  },
  "cmlrTriggerDpc": {
    "name": "cmlrTriggerDpc",
    "oid": "1.3.6.1.4.1.9.9.396.1.2.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcPointCode",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The destination MTP3 point-code to be matched when the when the 'dpc' bit is set in the cmlrTriggerParameters object."
  },
  "cmlrTriggerOpc": {
    "name": "cmlrTriggerOpc",
    "oid": "1.3.6.1.4.1.9.9.396.1.2.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcPointCode",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The origination MTP3 point-code to be matched when the when the 'opc' bit is set in the cmlrTriggerParameters object."
  },
  "cmlrTriggerOpcMask": {
    "name": "cmlrTriggerOpcMask",
    "oid": "1.3.6.1.4.1.9.9.396.1.2.1.13",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcPointCodeMask",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The origination MTP3 point-code mask to be applied in combination with cmlrTriggerOpc object. The mask will be applied when 'opcMask' bit is set in the cmlrTriggerParameters object."
  },
  "cmlrTriggerSi": {
    "name": "cmlrTriggerSi",
    "oid": "1.3.6.1.4.1.9.9.396.1.2.1.14",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcServiceIndicator",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "snmm",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The Service Indicator to be matched when the when the 'si' bit is set in the cmlrTriggerParameters object."
  },
  "cmlrTriggerNetwork": {
    "name": "cmlrTriggerNetwork",
    "oid": "1.3.6.1.4.1.9.9.396.1.2.1.15",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNetworkName",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The network name is used to indicate the network in which the ruleset will be invoked. This object only has meaning when the 'network' bit is set in the cmlrTriggerParameters object."
  },
  "cmlrTriggerRuleset": {
    "name": "cmlrTriggerRuleset",
    "oid": "1.3.6.1.4.1.9.9.396.1.2.1.16",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrRuleSetName",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Specifies the ruleset table that should be used if the trigger is matched and not overruled by a secondary trigger ruleset. This object only has meaning when the 'ruleset' bit is set in the cmlrTriggerParameters object."
  },
  "cmlrTriggerActive": {
    "name": "cmlrTriggerActive",
    "oid": "1.3.6.1.4.1.9.9.396.1.2.1.17",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates whether this trigger is active. The trigger will be active when the corresponding GTA entry exists and has been linked to trigger. 'true' - Trigger is active and will be processed. 'false' - Trigger is inactive and will not be processed."
  },
  "cmlrTriggerStartDateAndTime": {
    "name": "cmlrTriggerStartDateAndTime",
    "oid": "1.3.6.1.4.1.9.9.396.1.2.1.18",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DateAndTime",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "0000000000000000",
        "format": "hex"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The local date and time when this trigger and sub-triggers will become active. When all bytes of octet string are set to zero then cmlrInstStartDateAndTime does not apply."
  },
  "cmlrTriggerEndDateAndTime": {
    "name": "cmlrTriggerEndDateAndTime",
    "oid": "1.3.6.1.4.1.9.9.396.1.2.1.19",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DateAndTime",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "0000000000000000",
        "format": "hex"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The local date and time this trigger and sub-triggers will become inactive. When all bytes of octet string are set to zero then cmlrInstEndDateAndTime does not apply."
  },
  "cmlTriggerPreliminaryMatchCounts": {
    "name": "cmlTriggerPreliminaryMatchCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.2.1.20",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This counter indicates that a packet has matched the contents of the primary trigger. This counter indicates which triggers are causing packets to be processed by multi-layer routing. Whether the trigger is fully matched will be indicated by the cmlrTriggerMatchCounts object. It is important to note that in the case where secondary triggers do not exist the cmlTriggerPreliminaryMatchCounts and cmlrTriggerMatchCounts will be the same."
  },
  "cmlrTriggerMatchCounts": {
    "name": "cmlrTriggerMatchCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.2.1.21",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This counter indicates that a packet has matched the trigger and the result action was performed. When a primary trigger has secondary triggers this counter indicates that the primary matched and at least one of the secondary triggers matched."
  },
  "cmlrTriggerRowStatus": {
    "name": "cmlrTriggerRowStatus",
    "oid": "1.3.6.1.4.1.9.9.396.1.2.1.22",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The object is used by a management station to create or delete the row entry in cmlrTriggerTable following the RowStatus textual convention."
  },
  "cmlrSubTriggerTable": {
    "name": "cmlrSubTriggerTable",
    "oid": "1.3.6.1.4.1.9.9.396.1.3",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table that is used to define additional triggers that work in combination with values specified in specific cmlrTriggerTable. Entries are added to this table via cmlrSubTriggerRowStatus in accordance with the RowStatus convention."
  },
  "cmlrSubTriggerTableEntry": {
    "name": "cmlrSubTriggerTableEntry",
    "oid": "1.3.6.1.4.1.9.9.396.1.3.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-ITP-GSP-MIB",
        "object": "cgspInstNetwork",
        "implied": 0
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrTableName",
        "implied": 0
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrTriggerNumber",
        "implied": 0
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrSubTriggerNumber",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Each entry in the cmlrSubTriggerTable works in conjunction with a entry in cmlrTriggerTable. The trigger address specified in cmlrSubTriggerTable is a secondary address and both the primary address in the cmlrTriggerTable and the secondary address must match for the packet to be routed using the specified ruleset. If the corresponding entry in the cmlrTriggerTableEntry is deleted all entries under the scope for the primary trigger will be deleted from this table. It is important to note that when cmlrTriggerBlock is set to 'true' sub-triggers cannot be created under the specified trigger(cmlrTriggerNumber)."
  },
  "cmlrSubTriggerNumber": {
    "name": "cmlrSubTriggerNumber",
    "oid": "1.3.6.1.4.1.9.9.396.1.3.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrId",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This object specifies the index for a list of secondary triggers specified per primary trigger."
  },
  "cmlrSubTriggerParameters": {
    "name": "cmlrSubTriggerParameters",
    "oid": "1.3.6.1.4.1.9.9.396.1.3.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Bits",
      "class": "type",
      "bits": {
        "block": 0,
        "continue": 1,
        "matchAll": 2,
        "cdpa": 3,
        "cgpa": 4,
        "pc": 5,
        "gt": 6,
        "tt": 7,
        "gti": 8,
        "np": 9,
        "nai": 10,
        "ssn": 11,
        "pid": 12,
        "network": 13,
        "ruleset": 14
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The following options define the source and processing of sub-triggers(secondary trigger). 'block' : Indicates that message signal units will be dropped when they match the specified secondary trigger. 'continue' : Indicates that message signal units will be processed by the normal SCCP routing. The continue, block and ruleset are mutually exclusive. 'matchAll': Indicates the secondary trigger will match all message signal unit. 'cdpa' : Indicates that the secondary trigger is found within the SCCP called party address field(cdpa). 'cgpa' : Indicates that the secondary trigger is found within the SCCP calling party address field(cgpa). 'pc' : Indicates that the secondary trigger will be matched if it contains the specified point-code. The point-code within the SCCP Cdpa or CgPa will be inspected first. If the point code is not present, then the DPC in the routing label is used if CdPA, and the OPC is used for CgPA. 'gt' : Indicates that the Cgpa or CdPA secondary trigger is to be applied to packet when routing indicator specifies global title translation(RI=GT). 'tt' : Indicates that the translation type has been specified in the cmlrSubTriggerTransType object. 'gti' : Indicates that the global title indicator has been specified in the cmlrSubTriggerGti object. 'np' : Indicates that the numbering plan has been specified in the cmlrSubTriggerNp object. 'nai' : Indicates that the nature of specified address has been specified in the cmlrSubTriggerNai object. 'ssn' : Indicates that the subsystem number has been in the cmlrSubTriggerSsn object. 'network' : Indicates the network name has been specified in the cmlrSubTriggerNetwork object. 'ruleset' : Indicates the set of rules to be processed as specified in the cmlrSubTriggerRuleset object."
  },
  "cmlrSubTriggerGt": {
    "name": "cmlrSubTriggerGt",
    "oid": "1.3.6.1.4.1.9.9.396.1.3.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcGtaLongDisplay",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The global title address to be matched when either the 'cdpa' or 'cgpa' bits are set in the cmlrSubTriggerParameters object. This object will return a string of zero length when the cmlrSubTriggerParameters 'pc' bit is set."
  },
  "cmlrSubTriggerTransType": {
    "name": "cmlrSubTriggerTransType",
    "oid": "1.3.6.1.4.1.9.9.396.1.3.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CgsccpGttTransType",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The translation type specified within the address in the message signal unit. This object will default to value based on variant unless the 'tt' bit is set in cmlrSubTriggerParameters object."
  },
  "cmlrSubTriggerGti": {
    "name": "cmlrSubTriggerGti",
    "oid": "1.3.6.1.4.1.9.9.396.1.3.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CgsccpGttGlobalTitleInd",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The global title indicator value for the global tile address specified within the message signal unit. This object will default to value based on variant unless the 'gti' bit is set in cmlrSubTriggerParameters object."
  },
  "cmlrSubTriggerNp": {
    "name": "cmlrSubTriggerNp",
    "oid": "1.3.6.1.4.1.9.9.396.1.3.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNumberingPlan",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The numbering plan of the specified global title address. This object will default to value based on variant unless the 'np' bit is set in cmlrSubTriggerParameters object."
  },
  "cmlrSubTriggerNai": {
    "name": "cmlrSubTriggerNai",
    "oid": "1.3.6.1.4.1.9.9.396.1.3.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNAI",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The nature of specified address. This object will default to value based on variant unless the 'nai' bit is set in cmlrSubTriggerParameters object."
  },
  "cmlrSubTriggerPc": {
    "name": "cmlrSubTriggerPc",
    "oid": "1.3.6.1.4.1.9.9.396.1.3.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcPointCode",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The point-code in variant-specific format. This object only has meaning when the 'pc' bit is set in the cmlrSubTriggerParameters object."
  },
  "cmlrSubTriggerSsn": {
    "name": "cmlrSubTriggerSsn",
    "oid": "1.3.6.1.4.1.9.9.396.1.3.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcSubSystemNumber",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The subsystem number to be matched when the when the 'pc' bit is set in the cmlrSubTriggerParameters object."
  },
  "cmlrSubTriggerNetwork": {
    "name": "cmlrSubTriggerNetwork",
    "oid": "1.3.6.1.4.1.9.9.396.1.3.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNetworkName",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The network name is used to indicate the network in which the ruleset will be invoked. This object only has meaning when the 'network' bit is set in the cmlrSubTriggerParameters object."
  },
  "cmlrSubTriggerRuleset": {
    "name": "cmlrSubTriggerRuleset",
    "oid": "1.3.6.1.4.1.9.9.396.1.3.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrRuleSetName",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Specifies the ruleset table that should be used if the trigger is matched and not overruled by a secondary trigger ruleset. This object only has meaning when the 'ruleset' bit is set in the cmlrSubTriggerParameters object."
  },
  "cmlrSubTriggerMatchCounts": {
    "name": "cmlrSubTriggerMatchCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.3.1.13",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of the number of times secondary trigger was matched."
  },
  "cmlrSubTriggerRowStatus": {
    "name": "cmlrSubTriggerRowStatus",
    "oid": "1.3.6.1.4.1.9.9.396.1.3.1.14",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The object is used by a management station to create or delete the row entry in cmlrSubTriggerTable following the RowStatus textual convention."
  },
  "cmlrAddressTable": {
    "name": "cmlrAddressTable",
    "oid": "1.3.6.1.4.1.9.9.396.1.4",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table used to create a collection of addresses that can be searched for exact or best matches. Entries are added to this table via cmlrAddressRowStatus in accordance with the RowStatus convention."
  },
  "cmlrAddressTableEntry": {
    "name": "cmlrAddressTableEntry",
    "oid": "1.3.6.1.4.1.9.9.396.1.4.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-ITP-GSP-MIB",
        "object": "cgspInstNetwork",
        "implied": 0
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrAddressTableName",
        "implied": 0
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrAddressType",
        "implied": 0
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrAddressDigits",
        "implied": 0
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrAddressExactMatch",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Each entry in the cmlrAddressTable is used to search for matches within a messages signalling unit. Message signalling that match a particular rule can be directed to cmlrAddressTable to allow MSU to be directed or modified based on address information. The table is searched using information specified in the rule in cmlrRuleTable Table."
  },
  "cmlrAddressTableName": {
    "name": "cmlrAddressTableName",
    "oid": "1.3.6.1.4.1.9.9.396.1.4.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrName",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A name used to define a collection of addresses used to route and modify messages signalling units."
  },
  "cmlrAddressType": {
    "name": "cmlrAddressType",
    "oid": "1.3.6.1.4.1.9.9.396.1.4.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrAddressType",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The type of addresses in the address tables. The different types will be used to determine how to format and convert cmlrAddressDigits."
  },
  "cmlrAddressDigits": {
    "name": "cmlrAddressDigits",
    "oid": "1.3.6.1.4.1.9.9.396.1.4.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrAddressDigits",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The digits of the address in following formats as indicated by cmlrAddressType object. 'hexadecimal' - The digits are hexadecimal digits specified in ASCII as follows. '0123456789ABCDEF'"
  },
  "cmlrAddressExactMatch": {
    "name": "cmlrAddressExactMatch",
    "oid": "1.3.6.1.4.1.9.9.396.1.4.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This object indicates that the address specified by cmlrAddressDigits object must exactly match value in message signalling unit. 'true' - Exact match is specified. 'false' - Best match is specified."
  },
  "cmlrAddressResultParameters": {
    "name": "cmlrAddressResultParameters",
    "oid": "1.3.6.1.4.1.9.9.396.1.4.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrResultParameters",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Many of the result parameter used in the processing of address table have default values. These values are determined by a combination of variant and operation type. This object will be provide information which parameter used in setting results have been specified as follows. 'network' : cmlrAddressSetResultNetwork 'octet' : cmlrAddressSetResultOctet 'tranType' : cmlrAddressResultTransType 'gti' : cmlrAddressResultGti 'np' : cmlrAddressResultNp 'nai' : cmlrAddressResultNai 'pc' : cmlrAddressResultPc 'ssn' : cmlrAddressResultSsn"
  },
  "cmlrAddressResultNetwork": {
    "name": "cmlrAddressResultNetwork",
    "oid": "1.3.6.1.4.1.9.9.396.1.4.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNetworkName",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The network name is used to indicate the network in which the result operation will be performed."
  },
  "cmlrAddressResultType": {
    "name": "cmlrAddressResultType",
    "oid": "1.3.6.1.4.1.9.9.396.1.4.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrResultType",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "none",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Specified the type of information to be placed into the message signal unit or how the it will be processed."
  },
  "cmlrAddressResultOctet": {
    "name": "cmlrAddressResultOctet",
    "oid": "1.3.6.1.4.1.9.9.396.1.4.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrResultOctet",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Information to be placed in the message signal unit based on the value specified by the cmlrAddressSetResultType object. When the cmlrAddressSetResultType object is set to 'pc' or 'none' this object will not be used in the result processing and will have a length of zero."
  },
  "cmlrAddressResultTransType": {
    "name": "cmlrAddressResultTransType",
    "oid": "1.3.6.1.4.1.9.9.396.1.4.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CgsccpGttTransType",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The translation type specified within the address in the message signal unit. This object only applies when the cmlrAddressSetResultType is set to 'gt' value."
  },
  "cmlrAddressResultGti": {
    "name": "cmlrAddressResultGti",
    "oid": "1.3.6.1.4.1.9.9.396.1.4.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CgsccpGttGlobalTitleInd",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The global title indicator value for the global tile address specified within the message signal unit. This object only applies when the cmlrAddressSetResultType is set to 'gt' value."
  },
  "cmlrAddressResultNp": {
    "name": "cmlrAddressResultNp",
    "oid": "1.3.6.1.4.1.9.9.396.1.4.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNumberingPlan",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The numbering plan for the global tile address specified within the message signal unit. This object only applies when the cmlrAddressSetResultType is set to 'gt' value."
  },
  "cmlrAddressResultNai": {
    "name": "cmlrAddressResultNai",
    "oid": "1.3.6.1.4.1.9.9.396.1.4.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNAI",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The nature of specified address for the global tile address specified within the message signal unit. This object only applies when the cmlrAddressSetResultType is set to 'gt' value."
  },
  "cmlrAddressResultPc": {
    "name": "cmlrAddressResultPc",
    "oid": "1.3.6.1.4.1.9.9.396.1.4.1.13",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcPointCode",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The point-code to be place in the message signal unit. This object only applies when the cmlrAddressResultType is set to 'pc' value."
  },
  "cmlrAddressResultSsn": {
    "name": "cmlrAddressResultSsn",
    "oid": "1.3.6.1.4.1.9.9.396.1.4.1.14",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcSubSystemNumber",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The subsystem number to be place in the message signal unit. This object only applies when the cmlrAddressResultType is set to 'ssn' value."
  },
  "cmlrAddressMatchCounts": {
    "name": "cmlrAddressMatchCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.4.1.15",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of the number of times address was matched. This counter is only incremented when rule matches."
  },
  "cmlrAddressRowStatus": {
    "name": "cmlrAddressRowStatus",
    "oid": "1.3.6.1.4.1.9.9.396.1.4.1.16",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The object is used by a management station to create or delete the row entry in cmlrAddressTable following the RowStatus textual convention."
  },
  "cmlrRuleSetTable": {
    "name": "cmlrRuleSetTable",
    "oid": "1.3.6.1.4.1.9.9.396.1.5",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table that is used to specify attributes of an application-layer message to be matched and the resulting behavior for handling the message. Entries are added to this table via cmlrRuleSetRowStatus in accordance with the RowStatus convention."
  },
  "cmlrRuleSetTableEntry": {
    "name": "cmlrRuleSetTableEntry",
    "oid": "1.3.6.1.4.1.9.9.396.1.5.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-ITP-GSP-MIB",
        "object": "cgspInstNetwork",
        "implied": 0
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleSetName",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Each entry in this table represents a set of addresses used to perform non-standard routing of messages signalling units.."
  },
  "cmlrRuleSetName": {
    "name": "cmlrRuleSetName",
    "oid": "1.3.6.1.4.1.9.9.396.1.5.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrRuleSetName",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A name used to define a set rules used to transform traffic."
  },
  "cmlrRuleSetSegmented": {
    "name": "cmlrRuleSetSegmented",
    "oid": "1.3.6.1.4.1.9.9.396.1.5.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object indicates whether segmented messages will be processed by rules contained in this ruleset. 'true' - Segmented messages will be processed. 'false' - Segmented messages will not be processed."
  },
  "cmlrRuleSetProtocol": {
    "name": "cmlrRuleSetProtocol",
    "oid": "1.3.6.1.4.1.9.9.396.1.5.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrRuleProtocol",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "gsmMap",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The object is used to establish a default protocol type for all rules within the rule set. If this object is set to 'none' will default to protocol specified by variant."
  },
  "cmlrRuleSetSearchType": {
    "name": "cmlrRuleSetSearchType",
    "oid": "1.3.6.1.4.1.9.9.396.1.5.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "seq": 1,
          "bestMatch": 2
        }
      }
    },
    "default": {
      "default": {
        "value": "seq",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": " Defines how the rules with the ruleset will be search as follows. 'seq' : Rules will be processed in ascending order based on the value of the cmlrRuleNumber object 'bestMatch' : Rules will be processed using a combination of operation and order number to reduce cost of locating rule providing best match."
  },
  "cmlrRuleSetStartDateAndTime": {
    "name": "cmlrRuleSetStartDateAndTime",
    "oid": "1.3.6.1.4.1.9.9.396.1.5.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DateAndTime",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "0000000000000000",
        "format": "hex"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The local date and time when this trigger and sub-triggers will become active. When the value is null then the cmlrInstStartDateAndTime does not apply. "
  },
  "cmlrRuleSetEndDateAndTime": {
    "name": "cmlrRuleSetEndDateAndTime",
    "oid": "1.3.6.1.4.1.9.9.396.1.5.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DateAndTime",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "0000000000000000",
        "format": "hex"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The local date and time this trigger and sub-triggers will become inactive. When the value is null then the cmlrInstEndDateAndTime does not apply. "
  },
  "cmlrRuleSetRowStatus": {
    "name": "cmlrRuleSetRowStatus",
    "oid": "1.3.6.1.4.1.9.9.396.1.5.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The object is used by a management station to create or delete the row entry in cmlrRuleSetTable following the RowStatus textual convention."
  },
  "cmlrRuleTable": {
    "name": "cmlrRuleTable",
    "oid": "1.3.6.1.4.1.9.9.396.1.6",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table that is used to specify attributes of an application-layer message to be matched and the resulting behavior for handling the message. Entries are added to this table via cmlrRuleRowStatus in accordance with the RowStatus convention."
  },
  "cmlrRuleTableEntry": {
    "name": "cmlrRuleTableEntry",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-ITP-GSP-MIB",
        "object": "cgspInstNetwork",
        "implied": 0
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleSetName",
        "implied": 0
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleNumber",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Entries in this table are searched in the specified order defined but cmlrRuleNumber object ----------------------------------- | operation | ANSI-41 | GSP-MAP | -----------------------------------| | alertsc | | X | | smdpp | X | | | sms-mo | | X | | sms-mt | | X | | smsnot | X | | | smsreq | X | | | sri-sm | | X | ---------- ------------------------- Rule parameters by operation ---------------------------------------------- | operation | sme | smsc | | |port| | |---------|---------| | |----| | |dest|orig|orig|dest|pid|tid|dest| ---------------------------------------------| | smdPp | X | X | | | | X | | | smsReq | X | | | | | X | | | smsNotify | X | | | | | X | | | smsMo | X | X | | X | X | | X | | smsMt | X | X | X | | X | | X | | sriSm | X | | X | | | | | | altertSc | X | | | X | | | | | all | | | | | | | | ---------------------------------------------- Parameters format by operation ------------------------------------------------------------ | operation |digit | | | | |length|dest-sme-addr-type |dest-sme-addr-type| ------------------------------------------------------------ |alertSc |1-16 |noa/np defaults to | specific np/noa | | | |International/E.164 | | | | | | | |smdPp |1-20 | | | | | | | | |smsMo |1-20 |noa/np defaults to | specific np/noa | | | |International/E.164 | | | | | | | |smsMt |1-20 |noa/np defaults to | specific np/noa | | | |International/E.164 | | | | | | | |smsNotif |1-20 | | | | | | | | |smsReq |1-20 | | | | | | | | |sriSm |1-16 |noa/np defaults to | specific np/noa | | | |International/E.164 | | | | | | | ------------------------------------------------------------ "
  },
  "cmlrRuleNumber": {
    "name": "cmlrRuleNumber",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrId",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This object specifies the index for a list of secondary triggers specified per routing table. The trigger will be processed in ascending order."
  },
  "cmlrRuleOperationType": {
    "name": "cmlrRuleOperationType",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "unknown": 0,
          "alertSc": 1,
          "smdPp": 2,
          "smsMo": 3,
          "smsMt": 4,
          "smsReg": 5,
          "sriSm": 6,
          "smsNotify": 7,
          "all": 255
        }
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The list of possible operation types. 'unknown' : undefined operation type. 'alertSc' : Used to identify AlertServiceCenter request messages in GSM MAP. 'smdPp' : Used to identify SMS DeliveryPointToPoint request messages for the GSM MAP and ANSI-41. 'smsMo' : Used to identify SMS MO request messages for the GSM MAP and ANSI-41. 'smsMt' : Used to identify SMS MT request messages for the GSM MAP and ANSI-41. 'smsReq' : Used to identify the SMSRequest request messages within ANSI-41. 'sriSm' : Used to identify SRI SM request messages in GSM MAP and SMSRequest messages in ANSI-41. 'smsNotify' : Used to identify Alert Service Center messages in GSM MAP and SMSNotification messages in ANSI-41. 'all' : Used to identify a match of any valid operation code."
  },
  "cmlrRuleProtocol": {
    "name": "cmlrRuleProtocol",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrRuleProtocol",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Protocol used to examine message. 'none' : Will use protocol specified in cmlrRuleSetProtocol object. 'gsmMap' : Global system for mobile communications Mobile Application Part operations should be matched by this rule. 'is41' : Indicates that only ANSI-41 operations should be matched by this rule."
  },
  "cmlrRuleInputParameters": {
    "name": "cmlrRuleInputParameters",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Bits",
      "class": "type",
      "bits": {
        "destPort": 0,
        "destSmeGta": 1,
        "destSmeExact": 2,
        "destSmeNai": 3,
        "destSmeNp": 4,
        "destSmeImsi": 5,
        "destSmeMin": 6,
        "destSmscGta": 7,
        "destSmscExact": 8,
        "destSmscNai": 9,
        "destSmscNp": 10,
        "origSmeGta": 11,
        "origSmeExact": 12,
        "origSmeNai": 13,
        "origSmeNp": 14,
        "origSmscGta": 15,
        "origSmscExact": 16,
        "origSmscNai": 17,
        "origSmscNp": 18,
        "pid": 19,
        "tid": 20,
        "default": 21,
        "destSmeTable": 22,
        "origSmeTable": 23,
        "destSmeMinDigits": 24,
        "destSmeMaxDigits": 25,
        "destSmeTableImsi": 26,
        "destSmeTableNai": 27,
        "destSmeTableNp": 28,
        "destSmscMinDigits": 29,
        "destSmscMaxDigits": 30,
        "origSmeMinDigits": 31,
        "origSmeMaxDigits": 32,
        "origSmeTableNai": 33,
        "origSmeTableNp": 34,
        "origImsiGta": 35,
        "origImsiExact": 36,
        "origImsiNai": 37,
        "origImsiNp": 38,
        "origImsiMinDigits": 39,
        "origImsiMaxDigits": 40,
        "origImsiUnknown": 41,
        "origImsiTable": 42,
        "origSmscMinDigits": 43,
        "origSmscMaxDigits": 44,
        "multiMessageDialog": 45
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Many of the parameter used in the processing of rules have default values. These values are determined by a combination of variant and operation type. This object will be provide information which parameter has been specified as follows. 'destPort' : Indicates that the destination Port number is specified in the cmlrRuleDestPort object. 'destSmeGta' : Indicates that a global title address is specified in the cmlrRuleDestSmeGta object. 'destSmeExact': Indicates that the cmlrRuleDestSmeGta address must be an exact match. 'destSmeNai' : Indicates that the nature of specified address is specified in the cmlrRuleDestSmeNai object. 'destSmeNp' : Indicates that the numbering plan is specified in the cmlrRuleDestSmeNp object. 'destSmeImsi' : Indicates that the address specified in the International Mobile Subscriber Identification address. This indicator applies to the cmlrRuleDestSmeGta object. 'destSmeMin' : Indicates that the address specified in the Mobile Identification Number. This indicator applies to the cmlrRuleDestSmeGta object. 'destSmscGta' : Indicates that a global title address is specified in the cmlrRuleDestSmscGta object. 'destSmscExact':Indicates that the cmlrRuleDestSmscGta address must be an exact match. 'destSmscNai' : Indicates that the nature of specified address is specified in the cmlrRuleDestSmscNai object. 'destSmscNp' : Indicates that the numbering plan is specified in the cmlrRuleDestSmscNp object. 'origSmeGta' : Indicates that a global title address is specified in the cmlrRuleOrigSmeGta object. 'origSmeExact': Indicates that the cmlrRuleOrigSmeGta address must be an exact match. 'origSmeNai' : Indicates that the nature of specified address is specified in the cmlrRuleOrigSmeNai object. 'origSmeNp' : Indicates that the numbering plan is specified in the cmlrRuleOrigSmeNp object. 'origSmscGta' : Indicates that a global title address is specified in the cmlrRuleOrigSmscGta object. 'origSmscExact':Indicates that the cmlrRuleOrigSmeGta address must be an exact match. 'origSmscNai' : Indicates that the nature of specified address is specified in the cmlrRuleOrigSmscNai object. 'origSmscNp' : Indicates that the numbering plan is specified in the cmlrRuleOrigSmscNp object. 'pid' : Indicates that the Protocol Identifier has been specified in the cmlrRuleProtocolId object. 'tid' : Indicates that the Teleservice Identifier has been specified in the cmlrRuleTeleserviceId object. 'default' : Indicates the processing of messages that match the specified operation_name only. 'destSmeTable': A table of destination short message entity addresses. The name of the table is specified in the cmlrRuleAddressTable object. 'origSmeTable': A table of origination short message entity addresses. The name of the table is specified in the cmlrRuleOrigAddressTable object. 'destSmeMinDigits' : Minimum number global title address digits specified in the cmlrRuleDestSmeGta object using the cmlrRuleDestSmeMinDigits object. 'destSmeMaxDigits' : Maximum number global title address digits specified in the cmlrRuleDestSmeGta object using the cmlrRuleDestSmeMaxDigits object. 'destSmeTableImsi' : Indicates that the addresses specified in the cmlrRuleAddressTable are International Mobile Subscriber Identification addresses. 'destSmeTableNai' : Indicates that the all nature of specified address is specified in the cmlrRuleDestSmeTableNai object. 'destSmeTableNp' : Indicates that the numbering plan is specified in the cmlrRuleDestSmeTableNp object. 'destSmscMinDigits' : Minimum number global title address digits specified in the cmlrRuleDestSmscGta object using the cmlrRuleDestSmscMinDigits object. 'destSmscMaxDigits' : Maximum number global title address digits specified in the cmlrRuleDestSmscGta object using the cmlrRuleDestSmscMaxDigits object. 'origSmeMinDigits' : Minimum number global title address digits specified in the cmlrRuleOrigSmeGta object using the cmlrRuleOrigSmeMinDigits object. 'origSmeMaxDigits' : Maximum number global title address digits specified in the cmlrRuleOrigSmeGta object using the cmlrRuleOrigSmeMaxDigits object. 'origSmeTableNai' : Indicates that the all nature of specified address is specified in the cmlrRuleOrigSmeTableNai object. 'origSmeTableNp' : Indicates that the numbering plan is specified in the cmlrRuleOrigSmeTableNp object. 'origImsiGta' : Indicates that a global title address is specified in the cmlrRuleDestSmeGta object. 'origImsiExact' : Indicates that the cmlrRuleDestSmeGta address must be an exact match. 'origImsiNai' : Indicates that the nature of specified address is specified in the cmlrRuleDestSmeNai object. 'origImsiNp' : Indicates that the numbering plan is specified in the cmlrRuleDestSmeNp object. 'origImsiMinDigits' : Minimum number global title address digits specified in the cmlrRuleOrigImsiGta object using the cmlrRuleOrigImsiMinDigits object. 'origImsiMaxDigits' : Maximum number global title address digits specified in the cmlrRuleOrigImsiGta object using the cmlrRuleOrigImsiMaxDigits object. 'origImsiUnknown' : Indicates that the rule can match when packets do not contain the origination IMSI address. That is, when the address is unknown or unspecified. The IMSI address is only specified in map version 3. Therefore, the packets using version 1 or 2 when match when this parameter is specified. 'origImsiTable' : A table of origination IMSI addresses. The name of the table is specified in the cmlrRuleOrigImsiTable object. 'origSmscMinDigits' : Minimum number global title address digits specified in the cmlrRuleOrigSmscGta object using the cmlrRuleOrigSmscMinDigits object. 'origSmscMaxDigits' : Maximum number global title address digits specified in the cmlrRuleOrigSmscGta object using the cmlrRuleOrigSmscMaxDigits object. 'multiMessageDialog' : Indicates that this rules applies to packet that are part of multiple message dialogs."
  },
  "cmlrRuleDestPort": {
    "name": "cmlrRuleDestPort",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "A destination application port number. The value of the port number maps to the values specified in the User Data Header (UDH) of the SMS message. This object only applies when the 'destPort' bit is set in the cmlrRuleInputParameters object."
  },
  "cmlrRuleDestSmeGta": {
    "name": "cmlrRuleDestSmeGta",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcGtaLongDisplay",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The destination short message entity global title address. When the length of the global title address is zero it specified a wildcard match and all global title will match GTA clause of rule. This object only applies when the 'destSmeGta' bit is set in the cmlrRuleInputParameters object."
  },
  "cmlrRuleDestSmeNai": {
    "name": "cmlrRuleDestSmeNai",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNAI",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The nature of specified address for the destination short message entity global title address specified within the message signal unit. This object only applies when the 'destSmeNai' bit is set in the cmlrRuleInputParameters object."
  },
  "cmlrRuleDestSmeNp": {
    "name": "cmlrRuleDestSmeNp",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNumberingPlan",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The numbering plan for the destination short message entity global title address specified within the message signal unit. This object only applies when the 'destSmeNp' bit is set in the cmlrRuleInputParameters object."
  },
  "cmlrRuleDestSmscGta": {
    "name": "cmlrRuleDestSmscGta",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcGtaLongDisplay",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The destination short message service center global title address. When the length of the global title address is zero it specified a wildcard match and all global title will match GTA clause of rule. This object only applies when the 'destSmscGta' bit is set in the cmlrRuleInputParameters object."
  },
  "cmlrRuleDestSmscNai": {
    "name": "cmlrRuleDestSmscNai",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNAI",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The nature of specified address for the destination short message service center global title address specified within the message signal unit. This object only applies when the 'destSmscNai' bit is set in the cmlrRuleInputParameters object."
  },
  "cmlrRuleDestSmscNp": {
    "name": "cmlrRuleDestSmscNp",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNumberingPlan",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The numbering plan for the destination short message service center global title address specified within the message signal unit. This object only applies when the 'destSmscNp' bit is set in the cmlrRuleInputParameters object."
  },
  "cmlrRuleOrigSmeGta": {
    "name": "cmlrRuleOrigSmeGta",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcGtaLongDisplay",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The origination short message entity global title address. When the length of the global title address is zero it specified a wildcard match and all global title will match GTA clause of rule. This object only applies when the 'origSmeGta' bit is set in the cmlrRuleInputParameters object."
  },
  "cmlrRuleOrigSmeNai": {
    "name": "cmlrRuleOrigSmeNai",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.13",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNAI",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The nature of specified address for the origination short message entity global title address specified within the message signal unit. This object only applies when the 'origSmeNai' bit is set in the cmlrRuleInputParameters object."
  },
  "cmlrRuleOrigSmeNp": {
    "name": "cmlrRuleOrigSmeNp",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.14",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNumberingPlan",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The numbering plan for the origination short message entity global title address specified within the message signal unit. This object only applies when the 'origSmeNp' bit is set in the cmlrRuleInputParameters object."
  },
  "cmlrRuleOrigSmscGta": {
    "name": "cmlrRuleOrigSmscGta",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.15",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcGtaLongDisplay",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The origination short message service center global title address. When the length of the global title address is zero it specified a wildcard match and all global title will match GTA clause of rule. This object only applies when the 'origSmscGta' bit is set in the cmlrRuleInputParameters object."
  },
  "cmlrRuleOrigSmscNai": {
    "name": "cmlrRuleOrigSmscNai",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.16",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNAI",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The nature of specified address for the origination short message service center global title address specified within the message signal unit. This object only applies when the 'origSmscNai' bit is set in the cmlrRuleInputParameters object."
  },
  "cmlrRuleOrigSmscNp": {
    "name": "cmlrRuleOrigSmscNp",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.17",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNumberingPlan",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The numbering plan for the origination short message service center global title address specified within the message signal unit. This object only applies when the 'origSmscNp' bit is set in the cmlrRuleInputParameters object."
  },
  "cmlrRuleProtocolId": {
    "name": "cmlrRuleProtocolId",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.18",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 255
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The protocol identifier value used for the 'smsMo and 'smsMt' operations specified by the cmlrRuleParmsOperationType object. The value of the cmlrRuleParmsMatchPid object maps to the values specified for the TP-PID SMS parameter. This object only applies when the 'pid' bit is set in the cmlrRuleInputParameters object."
  },
  "cmlrRuleTeleserviceId": {
    "name": "cmlrRuleTeleserviceId",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.19",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The Teleservice identifier value for the following types of operations specified by the cmlrRuleParmsOperationType object. 'smdPp' 'smsMo' 'smsMt' 'smsNotify' The value of the cmlrRuleParmsMatchTid object maps to the values specified for the SMS_TeleserviceIdentifier parameter in ANSI-41. This object only applies when the 'tid' bit is set in the cmlrRuleInputParameters object."
  },
  "cmlrRuleAddressTable": {
    "name": "cmlrRuleAddressTable",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.20",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrName",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The name of the entry in the cmlrAddressTable that will be searched for matches. The table will be search for the following types of addresses based on values set in the cmlrRuleInputParameters object. This object only applies when the 'destSmeTable' bit is set in the cmlrRuleInputParameters object."
  },
  "cmlrRuleResultParameters": {
    "name": "cmlrRuleResultParameters",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.21",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrResultParameters",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Many of the parameter used in the processing of rules have default values. These values are determined by a combination of variant and operation type. This object will be provide information on which parameter have been specified as follows. 'network' : cmlrRuleSetResultNetwork 'octet' : cmlrRuleSetResultOctet 'tranType' : cmlrRuleResultTransType 'gti' : cmlrRuleResultGti 'np' : cmlrRuleResultNp 'nai' : cmlrRuleResultNai 'pc' : cmlrRuleResultPc 'ssn' : cmlrRuleResultSsn"
  },
  "cmlrRuleResultNetwork": {
    "name": "cmlrRuleResultNetwork",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.22",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNetworkName",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The network name is used to indicate the network in which the result operation will be performed."
  },
  "cmlrRuleResultType": {
    "name": "cmlrRuleResultType",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.23",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrResultType",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "none",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Specified the type of information to be placed into the message signal unit or how the it will be processed."
  },
  "cmlrRuleResultOctet": {
    "name": "cmlrRuleResultOctet",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.24",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrResultOctet",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Information to be placed in the message signal unit based on the value specified by the cmlrRuleSetResultType object. When the cmlrRuleSetResultType object is set to 'pc' or 'none' this object will not be used in the result processing and will have a length of zero."
  },
  "cmlrRuleResultTransType": {
    "name": "cmlrRuleResultTransType",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.25",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CgsccpGttTransType",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The translation type specified within the address in the message signal unit. This object only applies when the cmlrRuleSetResultType is set to 'gt' value."
  },
  "cmlrRuleResultGti": {
    "name": "cmlrRuleResultGti",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.26",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CgsccpGttGlobalTitleInd",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The global title indicator value for the global tile address specified within the message signal unit. This object only applies when the cmlrRuleSetResultType is set to 'gt' value."
  },
  "cmlrRuleResultNp": {
    "name": "cmlrRuleResultNp",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.27",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNumberingPlan",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The numbering plan for the global tile address specified within the message signal unit. This object only applies when the cmlrRuleSetResultType is set to 'gt' value."
  },
  "cmlrRuleResultNai": {
    "name": "cmlrRuleResultNai",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.28",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNAI",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The nature of specified address for the global tile address specified within the message signal unit. This object only applies when the cmlrRuleSetResultType is set to 'gt' value."
  },
  "cmlrRuleResultPc": {
    "name": "cmlrRuleResultPc",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.29",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcPointCode",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The point-code to be place in the message signal unit. This object only applies when the cmlrRuleResultType is set to 'pc' value."
  },
  "cmlrRuleResultSsn": {
    "name": "cmlrRuleResultSsn",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.30",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcSubSystemNumber",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The subsytem number to be place in the message signal unit. This object only applies when the cmlrRuleResultType is set to 'ssn' value."
  },
  "cmlrRuleMatchCounts": {
    "name": "cmlrRuleMatchCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.31",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of the number of times this rule was matched."
  },
  "cmlrRuleRowStatus": {
    "name": "cmlrRuleRowStatus",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.32",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The object is used by a management station to create or delete the row entry in cmlrRuleTable following the RowStatus textual convention."
  },
  "cmlrRuleOrigAddressTable": {
    "name": "cmlrRuleOrigAddressTable",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.33",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrName",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The name of the entry in the cmlrAddressTable that will be searched for matches. The table will be search for the following types of addresses based on values set in the cmlrRuleInputParameters object. This object only applies when the 'origSmeTable' bit is set in the cmlrRuleInputParameters object."
  },
  "cmlrRuleDestSmeMinDigits": {
    "name": "cmlrRuleDestSmeMinDigits",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.34",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrMinimumDigits",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Specifies the minimum number of digits that the global title address specified by the cmlrRuleDestSmeGta object can contain for rule to match. This object only applies when the 'destSmeMinDigits' bit is set in the cmlrRuleInputParameters object."
  },
  "cmlrRuleDestSmeMaxDigits": {
    "name": "cmlrRuleDestSmeMaxDigits",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.35",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrMaximumDigits",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Specifies the maximum number of digits that the global title address specified by the cmlrRuleDestSmeGta object can contain for rule to match. This object only applies when the 'destSmeMaxDigits' bit is set in the cmlrRuleInputParameters object."
  },
  "cmlrRuleDestSmeTableNai": {
    "name": "cmlrRuleDestSmeTableNai",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.36",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNAI",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The nature of specified address for the global tile address specified within the message signal unit. This object only applies when the 'destSmeTableNai' bit is set in the cmlrRuleInputParameters object. When operation type, cmlrRuleOperationType is 'smsMt' this object does not apply."
  },
  "cmlrRuleDestSmeTableNp": {
    "name": "cmlrRuleDestSmeTableNp",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.37",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNumberingPlan",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The numbering plan for the destination short message service center global title address specified within the message signal unit. This object only applies when the 'destSmeTableNp' bit is set in the cmlrRuleInputParameters object. When operation type, cmlrRuleOperationType is 'smsMt' this object does not apply."
  },
  "cmlrRuleDestSmscMinDigits": {
    "name": "cmlrRuleDestSmscMinDigits",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.38",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrMinimumDigits",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Specifies the minimum number of digits that the global title address specified by the cmlrRuleDestSmscGta object can contain for rule to match. This object only applies when the 'destSmscMinDigits' bit is set in the cmlrRuleInputParameters object."
  },
  "cmlrRuleDestSmscMaxDigits": {
    "name": "cmlrRuleDestSmscMaxDigits",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.39",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrMaximumDigits",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Specifies the maximum number of digits that the global title address specified by the cmlrRuleDestSmscGta object can contain for rule to match. This object only applies when the 'destSmscMaxDigits' bit is set in the cmlrRuleInputParameters object."
  },
  "cmlrRuleOrigSmeMinDigits": {
    "name": "cmlrRuleOrigSmeMinDigits",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.40",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrMinimumDigits",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Specifies the minimum number of digits that the global title address specified by the cmlrRuleOrigSmeGta object can contain for rule to match. This object only applies when the 'origSmeMinDigits' bit is set in the cmlrRuleInputParameters object."
  },
  "cmlrRuleOrigSmeMaxDigits": {
    "name": "cmlrRuleOrigSmeMaxDigits",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.41",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrMaximumDigits",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Specifies the maximum number of digits that the global title address specified by the cmlrRuleOrigSmeGta can contain for rule to match. This object only applies when the 'origSmeMaxDigits' bit is set in the cmlrRuleInputParameters object."
  },
  "cmlrRuleOrigSmeTableNai": {
    "name": "cmlrRuleOrigSmeTableNai",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.42",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNAI",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The nature of specified address for the global tile address specified within the message signal unit. This object only applies when the 'origSmeTableNai' bit is set in the cmlrRuleInputParameters object."
  },
  "cmlrRuleOrigSmeTableNp": {
    "name": "cmlrRuleOrigSmeTableNp",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.43",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNumberingPlan",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The numbering plan for the destination short message service center global title address specified within the message signal unit. This object only applies when the 'origSmeTableNp' bit is set in the cmlrRuleInputParameters object."
  },
  "cmlrRuleOrigImsiGta": {
    "name": "cmlrRuleOrigImsiGta",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.44",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcGtaLongDisplay",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The origination short message entity global title address. When the length of the global title address is zero it specified a wildcard match and all global title will match GTA clause of rule. This object only applies when the 'origImsiGta' bit is set in the cmlrRuleInputParameters object."
  },
  "cmlrRuleOrigImsiNai": {
    "name": "cmlrRuleOrigImsiNai",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.45",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNAI",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The nature of specified address for the origination short message entity global title address specified within the message signal unit. This object only applies when the 'origImsiNai' bit is set in the cmlrRuleInputParameters object."
  },
  "cmlrRuleOrigImsiNp": {
    "name": "cmlrRuleOrigImsiNp",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.46",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNumberingPlan",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The numbering plan for the origination short message entity global title address specified within the message signal unit. This object only applies when the 'origImsiNp' bit is set in the cmlrRuleInputParameters object."
  },
  "cmlrRuleOrigImsiMinDigits": {
    "name": "cmlrRuleOrigImsiMinDigits",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.47",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrMinimumDigits",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Specifies the minimum number of digits that the global title address specified by the cmlrRuleOrigImsiGta object can contain for rule to match. This object only applies when the 'origImsiMinDigits' bit is set in the cmlrRuleInputParameters object."
  },
  "cmlrRuleOrigImsiMaxDigits": {
    "name": "cmlrRuleOrigImsiMaxDigits",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.48",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrMaximumDigits",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Specifies the maximum number of digits that the global title address specified by the cmlrRuleOrigImsiGta object can contain for rule to match. This object only applies when the 'origImsiMaxDigits' bit is set in the cmlrRuleInputParameters object."
  },
  "cmlrRuleOrigImsiTable": {
    "name": "cmlrRuleOrigImsiTable",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.49",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrName",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The name of the entry in the cmlrAddressTable that will be searched for matches. The table will be search for the following types of addresses based on values set in the cmlrRuleInputParameters object. This object only applies when the 'origImsiTable' bit is set in the cmlrRuleInputParameters object."
  },
  "cmlrRuleOrigSmscMinDigits": {
    "name": "cmlrRuleOrigSmscMinDigits",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.50",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrMinimumDigits",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Specifies the minimum number of digits that the global title address specified by the cmlrRuleOrigSmscGta object can contain for rule to match. This object only applies when the 'origSmscMinDigits' bit is set in the cmlrRuleInputParameters object."
  },
  "cmlrRuleOrigSmscMaxDigits": {
    "name": "cmlrRuleOrigSmscMaxDigits",
    "oid": "1.3.6.1.4.1.9.9.396.1.6.1.51",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrMaximumDigits",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Specifies the maximum number of digits that the global title address specified by the cmlrRuleOrigSmscGta object can contain for rule to match. This object only applies when the 'origSmscMaxDigits' bit is set in the cmlrRuleInputParameters object."
  },
  "cmlrResultSetTable": {
    "name": "cmlrResultSetTable",
    "oid": "1.3.6.1.4.1.9.9.396.1.8",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table used to identify a group of results and define parameter that apply to all result within the group. Entries are added to this table via cmlrResultSetRowStatus object in accordance with the RowStatus convention."
  },
  "cmlrResultSetTableEntry": {
    "name": "cmlrResultSetTableEntry",
    "oid": "1.3.6.1.4.1.9.9.396.1.8.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-ITP-GSP-MIB",
        "object": "cgspInstNetwork",
        "implied": 0
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrResultSetName",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "This table is used to define a collection of results."
  },
  "cmlrResultSetName": {
    "name": "cmlrResultSetName",
    "oid": "1.3.6.1.4.1.9.9.396.1.8.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrName",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A name used to define a result group."
  },
  "cmlrResultSetUnavailDiscard": {
    "name": "cmlrResultSetUnavailDiscard",
    "oid": "1.3.6.1.4.1.9.9.396.1.8.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "true",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "When all results in a group are unavailable this object defines whether to discard packet or to return packet to SCCP layer for normal processing. 'true' Packet will be discarded. 'false' Packet will be returned to SCCP layer for normal processing."
  },
  "cmlrResultSetRowStatus": {
    "name": "cmlrResultSetRowStatus",
    "oid": "1.3.6.1.4.1.9.9.396.1.8.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The object is used by a management station to create or delete the row entry in cmlrResultSetTable following the RowStatus textual convention."
  },
  "cmlrResultTable": {
    "name": "cmlrResultTable",
    "oid": "1.3.6.1.4.1.9.9.396.1.9",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table used to identify a group of destination resources The result group lists the appropriate destination resources, and the mechanism used to select a single destination for a given packet. State information is determined for each possible destination. Congested resources will only be used if no available, non-congested destinations exist. Only available destinations are considered for routing. Entries are added to this table via cmlrResultRowStatus object in accordance with the RowStatus convention."
  },
  "cmlrResultTableEntry": {
    "name": "cmlrResultTableEntry",
    "oid": "1.3.6.1.4.1.9.9.396.1.9.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-ITP-GSP-MIB",
        "object": "cgspInstNetwork",
        "implied": 0
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrResultSetName",
        "implied": 0
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrResultNumber",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "This table is used to define a collection of multi-layer routing statements."
  },
  "cmlrResultNumber": {
    "name": "cmlrResultNumber",
    "oid": "1.3.6.1.4.1.9.9.396.1.9.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrId",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This object specifies the index for a list of results specified per result group. "
  },
  "cmlrResultType": {
    "name": "cmlrResultType",
    "oid": "1.3.6.1.4.1.9.9.396.1.9.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrResultType",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "none",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Result type used to route MSU."
  },
  "cmlrResultNetwork": {
    "name": "cmlrResultNetwork",
    "oid": "1.3.6.1.4.1.9.9.396.1.9.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNetworkName",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The network name is used to indicate the network in which the result parameters exist."
  },
  "cmlrResultOctet": {
    "name": "cmlrResultOctet",
    "oid": "1.3.6.1.4.1.9.9.396.1.9.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrResultOctet",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Specified the information used to route the MSU based on cmlrResultType object."
  },
  "cmlrResultPc": {
    "name": "cmlrResultPc",
    "oid": "1.3.6.1.4.1.9.9.396.1.9.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcPointCode",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "A destination point code that must exist in the MTP3 routing table, and its state is extracted from MTP3 for availability purposes. This object only has applies when the cmlrResultType has the 'pc' value. Otherwise, this object will return zero value."
  },
  "cmlrResultSsn": {
    "name": "cmlrResultSsn",
    "oid": "1.3.6.1.4.1.9.9.396.1.9.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcSubSystemNumber",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The subsystem number to be inserted into MSU. This object only has applies when the cmlrResultType has the 'pcSsn' value. Otherwise, this object will return zero value."
  },
  "cmlrResultWeight": {
    "name": "cmlrResultWeight",
    "oid": "1.3.6.1.4.1.9.9.396.1.9.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 10
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object specifies the weight applied to the weighted round robin distribution algorithm used for multi-layer result group. An integer value in the range of 0 to 10. A value of ten indicates the resource should be selected ten times more than a resource assigned a weight of one."
  },
  "cmlrResultCounts": {
    "name": "cmlrResultCounts",
    "oid": "1.3.6.1.4.1.9.9.396.1.9.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Number of times this entry was invoked."
  },
  "cmlrResultRowStatus": {
    "name": "cmlrResultRowStatus",
    "oid": "1.3.6.1.4.1.9.9.396.1.9.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The object is used by a management station to create or delete the row entry in cmlrResultsTable following the RowStatus textual convention."
  },
  "ciscoMlrTableLoad": {
    "name": "ciscoMlrTableLoad",
    "oid": "1.3.6.1.4.1.9.9.396.0.1",
    "class": "notificationtype",
    "objects": [
      {
        "module": "CISCO-ITP-GSP-MIB",
        "object": "cgspEventSequenceNumber"
      },
      {
        "module": "CISCO-ITP-GSP-MIB",
        "object": "cgspCLLICode"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstLoadStatus"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstLastURL"
      }
    ],
    "status": "current",
    "description": "This notification is generated whenever a load operation is started or completed. Route table configurations can be loaded by CLI requests. In addition, route tables can loaded using configuration statements. This allows mlr tables to be reloaded whenever a device restarts."
  },
  "ciscoMlrMIBCompliances": {
    "name": "ciscoMlrMIBCompliances",
    "oid": "1.3.6.1.4.1.9.9.396.2.1",
    "class": "objectidentity"
  },
  "ciscoMlrMIBGroups": {
    "name": "ciscoMlrMIBGroups",
    "oid": "1.3.6.1.4.1.9.9.396.2.2",
    "class": "objectidentity"
  },
  "ciscoMlrMIBCompliance": {
    "name": "ciscoMlrMIBCompliance",
    "oid": "1.3.6.1.4.1.9.9.396.2.1.1",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "ciscoMlrTableGroup",
        "module": "CISCO-ITP-MLR-MIB"
      },
      {
        "object": "ciscoMlrTriggerGroup",
        "module": "CISCO-ITP-MLR-MIB"
      },
      {
        "object": "ciscoMlrAddressGroup",
        "module": "CISCO-ITP-MLR-MIB"
      },
      {
        "object": "ciscoMlrRuleSetGroup",
        "module": "CISCO-ITP-MLR-MIB"
      },
      {
        "object": "ciscoMlrResultGroup",
        "module": "CISCO-ITP-MLR-MIB"
      },
      {
        "object": "ciscoMlrNotificationsGroup",
        "module": "CISCO-ITP-MLR-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for entities which implement the Cisco CISCO-ITP-MLR-MIB"
  },
  "ciscoMlrMIBComplianceRev1": {
    "name": "ciscoMlrMIBComplianceRev1",
    "oid": "1.3.6.1.4.1.9.9.396.2.1.2",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "ciscoMlrTableGroup",
        "module": "CISCO-ITP-MLR-MIB"
      },
      {
        "object": "ciscoMlrTriggerGroup",
        "module": "CISCO-ITP-MLR-MIB"
      },
      {
        "object": "ciscoMlrAddressGroup",
        "module": "CISCO-ITP-MLR-MIB"
      },
      {
        "object": "ciscoMlrRuleSetGroupRev1",
        "module": "CISCO-ITP-MLR-MIB"
      },
      {
        "object": "ciscoMlrResultGroup",
        "module": "CISCO-ITP-MLR-MIB"
      },
      {
        "object": "ciscoMlrNotificationsGroup",
        "module": "CISCO-ITP-MLR-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for entities which implement the Cisco CISCO-ITP-MLR-MIB"
  },
  "ciscoMlrMIBComplianceRev2": {
    "name": "ciscoMlrMIBComplianceRev2",
    "oid": "1.3.6.1.4.1.9.9.396.2.1.3",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "ciscoMlrTableGroup",
        "module": "CISCO-ITP-MLR-MIB"
      },
      {
        "object": "ciscoMlrTriggerGroup",
        "module": "CISCO-ITP-MLR-MIB"
      },
      {
        "object": "ciscoMlrAddressGroup",
        "module": "CISCO-ITP-MLR-MIB"
      },
      {
        "object": "ciscoMlrRuleSetGroupRev2",
        "module": "CISCO-ITP-MLR-MIB"
      },
      {
        "object": "ciscoMlrResultGroup",
        "module": "CISCO-ITP-MLR-MIB"
      },
      {
        "object": "ciscoMlrNotificationsGroup",
        "module": "CISCO-ITP-MLR-MIB"
      }
    ],
    "status": "current",
    "description": "The compliance statement for entities which implement the Cisco CISCO-ITP-MLR-MIB"
  },
  "ciscoMlrTableGroup": {
    "name": "ciscoMlrTableGroup",
    "oid": "1.3.6.1.4.1.9.9.396.2.2.1",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrTableLoadNotifEnabled"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstLastChanged"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstLastLoadTime"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstLoadStatus"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstLastURL"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstRoutedCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstAbortCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstContinueCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstSmsMoCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstSmsMtCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstSriSmCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstSmdPpCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstAlertScCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstSmsRequestCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstSmsNotifCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstUnsupSCCPmsgTypeCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstUnsupSegSCCPmsgCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstUnsupportedMsgCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstParsingErrorCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstNoResultCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstResultContinueCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstNoServerDiscardCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstResultGttCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstUnparsedCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstResultBlockCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstGTImismatchCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstAddrConvFailureCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstDestUnavailableCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstFailedTrigMatchCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstDiscontinuityTime"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstNoServerContinueCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstResultAsCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstResultPcCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrInstResultPcSsnCounts"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing Mult-layer routing feature."
  },
  "ciscoMlrTriggerGroup": {
    "name": "ciscoMlrTriggerGroup",
    "oid": "1.3.6.1.4.1.9.9.396.2.2.2",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrTriggerParameters"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrTriggerGt"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrTriggerTransType"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrTriggerGti"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrTriggerNp"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrTriggerNai"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrTriggerPc"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrTriggerSsn"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrTriggerDpc"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrTriggerOpc"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrTriggerOpcMask"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrTriggerSi"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrTriggerNetwork"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrTriggerRuleset"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrTriggerActive"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrTriggerStartDateAndTime"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrTriggerEndDateAndTime"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlTriggerPreliminaryMatchCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrTriggerMatchCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrTriggerRowStatus"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrSubTriggerParameters"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrSubTriggerGt"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrSubTriggerTransType"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrSubTriggerGti"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrSubTriggerNp"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrSubTriggerNai"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrSubTriggerPc"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrSubTriggerSsn"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrSubTriggerNetwork"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrSubTriggerRuleset"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrSubTriggerMatchCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrSubTriggerRowStatus"
      }
    ],
    "status": "current",
    "description": "A collection of objects related to Multi-layer triggers."
  },
  "ciscoMlrAddressGroup": {
    "name": "ciscoMlrAddressGroup",
    "oid": "1.3.6.1.4.1.9.9.396.2.2.3",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrAddressResultParameters"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrAddressResultNetwork"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrAddressResultType"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrAddressResultOctet"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrAddressResultTransType"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrAddressResultGti"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrAddressResultNp"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrAddressResultNai"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrAddressResultPc"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrAddressResultSsn"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrAddressMatchCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrAddressRowStatus"
      }
    ],
    "status": "current",
    "description": "A collection of objects related to Multi-layer Addresses."
  },
  "ciscoMlrRuleSetGroup": {
    "name": "ciscoMlrRuleSetGroup",
    "oid": "1.3.6.1.4.1.9.9.396.2.2.4",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleSetSegmented"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleSetProtocol"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleSetSearchType"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleSetStartDateAndTime"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleSetEndDateAndTime"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleSetRowStatus"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOperationType"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleProtocol"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleInputParameters"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleDestPort"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleDestSmeGta"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleDestSmeNai"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleDestSmeNp"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleDestSmscGta"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleDestSmscNai"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleDestSmscNp"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOrigSmeGta"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOrigSmeNai"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOrigSmeNp"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOrigSmscGta"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOrigSmscNai"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOrigSmscNp"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleProtocolId"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleTeleserviceId"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleAddressTable"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleResultParameters"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleResultNetwork"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleResultType"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleResultOctet"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleResultTransType"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleResultGti"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleResultNp"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleResultNai"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleResultPc"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleResultSsn"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleMatchCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleRowStatus"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects related to Multi-layer rule sets."
  },
  "ciscoMlrResultGroup": {
    "name": "ciscoMlrResultGroup",
    "oid": "1.3.6.1.4.1.9.9.396.2.2.5",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrResultSetUnavailDiscard"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrResultSetRowStatus"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrResultNetwork"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrResultType"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrResultOctet"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrResultPc"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrResultSsn"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrResultWeight"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrResultCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrResultRowStatus"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing Multi-layer results feature."
  },
  "ciscoMlrNotificationsGroup": {
    "name": "ciscoMlrNotificationsGroup",
    "oid": "1.3.6.1.4.1.9.9.396.2.2.6",
    "class": "notificationgroup",
    "objects": [
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "ciscoMlrTableLoad"
      }
    ],
    "status": "current",
    "description": "Mult-layer routing notification objects."
  },
  "ciscoMlrRuleSetGroupRev1": {
    "name": "ciscoMlrRuleSetGroupRev1",
    "oid": "1.3.6.1.4.1.9.9.396.2.2.7",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleSetSegmented"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleSetProtocol"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleSetSearchType"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleSetStartDateAndTime"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleSetEndDateAndTime"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleSetRowStatus"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOperationType"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleProtocol"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleInputParameters"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleDestPort"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleDestSmeGta"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleDestSmeNai"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleDestSmeNp"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleDestSmscGta"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleDestSmscNai"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleDestSmscNp"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOrigSmeGta"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOrigSmeNai"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOrigSmeNp"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOrigSmscGta"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOrigSmscNai"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOrigSmscNp"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleProtocolId"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleTeleserviceId"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleAddressTable"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleResultParameters"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleResultNetwork"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleResultType"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleResultOctet"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleResultTransType"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleResultGti"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleResultNp"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleResultNai"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleResultPc"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleResultSsn"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleMatchCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleRowStatus"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOrigAddressTable"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects related to Multi-layer rule sets."
  },
  "ciscoMlrRuleSetGroupRev2": {
    "name": "ciscoMlrRuleSetGroupRev2",
    "oid": "1.3.6.1.4.1.9.9.396.2.2.8",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleSetSegmented"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleSetProtocol"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleSetSearchType"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleSetStartDateAndTime"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleSetEndDateAndTime"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleSetRowStatus"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOperationType"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleProtocol"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleInputParameters"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleDestPort"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleDestSmeGta"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleDestSmeNai"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleDestSmeNp"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleDestSmscGta"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleDestSmscNai"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleDestSmscNp"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOrigSmeGta"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOrigSmeNai"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOrigSmeNp"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOrigSmscGta"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOrigSmscNai"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOrigSmscNp"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleProtocolId"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleTeleserviceId"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleAddressTable"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleResultParameters"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleResultNetwork"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleResultType"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleResultOctet"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleResultTransType"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleResultGti"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleResultNp"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleResultNai"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleResultPc"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleResultSsn"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleMatchCounts"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleRowStatus"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOrigAddressTable"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleDestSmeMinDigits"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleDestSmeMaxDigits"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleDestSmeTableNai"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleDestSmeTableNp"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleDestSmscMinDigits"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleDestSmscMaxDigits"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOrigSmeMinDigits"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOrigSmeMaxDigits"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOrigSmeTableNai"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOrigSmeTableNp"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOrigImsiGta"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOrigImsiNai"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOrigImsiNp"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOrigImsiMinDigits"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOrigImsiMaxDigits"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOrigImsiTable"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOrigSmscMinDigits"
      },
      {
        "module": "CISCO-ITP-MLR-MIB",
        "object": "cmlrRuleOrigSmscMaxDigits"
      }
    ],
    "status": "current",
    "description": "A collection of objects related to Multi-layer rule sets."
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/CISCO-ITP-MLR-MIB",
      "Produced by pysmi-0.3.4 at Fri May 24 17:07:21 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "CISCO-ITP-MLR-MIB"
  }
}