{
  "imports": {
    "class": "imports",
    "CISCO-SMI": [
      "ciscoExperiment"
    ],
    "IF-MIB": [
      "ifIndex"
    ],
    "SNMPv2-CONF": [
      "MODULE-COMPLIANCE",
      "NOTIFICATION-GROUP",
      "OBJECT-GROUP"
    ],
    "SNMPv2-SMI": [
      "Unsigned32",
      "MibIdentifier",
      "Gauge32",
      "iso",
      "OBJECT-IDENTITY",
      "Counter32",
      "TimeTicks",
      "Integer32",
      "NOTIFICATION-TYPE",
      "IpAddress",
      "OBJECT-TYPE",
      "Counter64",
      "MODULE-IDENTITY",
      "Bits"
    ],
    "SNMPv2-TC": [
      "DisplayString",
      "TruthValue",
      "TEXTUAL-CONVENTION"
    ]
  },
  "ciscoDot11RadioDiagMIB": {
    "name": "ciscoDot11RadioDiagMIB",
    "oid": "1.3.6.1.4.1.9.10.105",
    "class": "moduleidentity",
    "revisions": [
      {
        "revision": "2003-12-23 00:00",
        "description": "The changes made are as follows. 1) The MIB has been modified to add support for 802.11a and 802.11g based interfaces. 2) The definition for the object cDot11RadioDiagTempChannel has been modified to specify the possible channel values for 802.11a based interfaces. 3) Two new objects, cDot11RadioDiagTempClientTxPower and cDot11RadioDiagTempDataRateSet have been added to the MIB. "
      },
      {
        "revision": "2003-05-08 00:00",
        "description": "Initial version of this MIB module. "
      }
    ],
    "lastupdated": "200312230000Z",
    "organization": "Cisco System Inc.",
    "contactinfo": " Cisco Systems, Customer Service Postal: 170 West Tasman Drive San Jose, CA 95134 USA Tel: +1 800 553-NETS E-mail: cs-dot11@cisco.com",
    "description": "This MIB is intended to be implemented on all 802.11 based Access Points and Wireless Bridges that need to participate in radio environment diagnosis. The devices mentioned above may house any one of the 802.11a/802.11b/802.11g standard- based radio interfaces in them for data communication in the form of radio waves. The administrator, through the NMS, temporarily alters the power and channel configurations of an 802.11 radio interface and the transmits power levels of the associated clients, if any, by setting appropriate values to the objects of this MIB to perform activities like discovering neighboring APs, measuring strength of the signals as received from other APs, studying RF interference levels at various APs, characterizing APs' coverage etc. These changes to the radio interface and the clients' configuration through this MIB are temporary and won't be retained across reloads. GLOSSARY Access Point ( AP ) An entity that contains an 802.11 medium access control ( MAC ) and physical layer ( PHY ) interface and provides access to the distribution services via the wireless medium for associated clients. Wireless Bridge An 802.11 entity that provides wireless connectivity between two wired LAN segments and is used in point- to-point or point-multipoint configurations. Mobile Node ( MN ) A roaming 802.11 wireless device in a wireless network associated with an access point. Repeater-AP A repeater is a 'wireless AP' that is attached to a parent AP on an 802.11 primary port. The Ethernet port is disabled in a Repeater-AP. Radio Diagnosis This process includes continuously monitoring the radio environment to discover new 802.11 stations, measure signal strengths, adapt robustly to interferers and provide a visualization of the radio topology to the administrator. Association The process by which an 802.11 client identifies and gets connected to its parent AP through which it gets the uplink to the wired network. Note that the association happens at the MAC level and the AP holds the MAC addresses of all the clients for whom the AP provides uplink to the wired network. A client, at any point of time, can remain associated only with one AP. Channel An instance of medium use for the purpose of passing protocol data units (PDUs) that may be used simultaneously, in the same volume of space, with other instances of medium use (on other channels) by other instances of the same physical layer (PHY), with an acceptably low frame error ratio due to mutual interference. Some PHYs provide only one channel, whereas others provide multiple channels. Beacons Beacons are short frames that are sent from Access Point to stations or station-to-station in order to organize and synchronize the wireless communication on the Wireless LAN. Beacons serve to achieve time synchronization among clients, exchange SSID information, exchange information about data rates supported by the 802.11 devices etc., Site Survey Site survey is done to discover the RF behavior, coverage and interference to decide the placement of WLAN infrastructure devices like Access Points and Wireless bridges to ensure that all the clients experience continually strong RF signal strength as they roam. 802.11a This is a high speed physical layer extension to the 802.11 standard on the 5 GHz band. Interfaces compliant to 802.11a support data rates upto 54Mbps and operate at 5.15-5.25, 5.25-5.35 and 5.725-5.825 GHz Unlicensed National Information Infrastructure (U-NII) bands as regulated in the United States by the code of Federal Regulations, Title 47, Section 15.407. The radio uses the Orthogonal Frequency Division Multiplexing (OFDM) as the modulation scheme that enables higher speeds at 54Mbps. 802.11b The 802.11b standard operates at 2.4GHz and is backward compatible with 802.11. An 802.11b system operates at 5.5 and 11 Mbps in addition to the 1 and 2 Mbps datarates specified by the 802.11 standard. 802.11b uses a modulation technique known as Complementary Code Keying (CCK) which allows the higher data speeds. 802.11g This is the most recently approved standard. This standard specifies an operational frequency of 2.4GHz and datarates upto 54Mbps. 802.11g systems are backward compatible with 802.11b systems because of the same operational frequencies. Like 802.11a, 802.11g uses the OFDM modulation scheme to achieve higher speeds. "
  },
  "cDot11RadioDiagMIBNotifs": {
    "name": "cDot11RadioDiagMIBNotifs",
    "oid": "1.3.6.1.4.1.9.10.105.0",
    "class": "objectidentity"
  },
  "cDot11RadioDiagMIBObjects": {
    "name": "cDot11RadioDiagMIBObjects",
    "oid": "1.3.6.1.4.1.9.10.105.1",
    "class": "objectidentity"
  },
  "cDot11RadioDiagConfigGlobal": {
    "name": "cDot11RadioDiagConfigGlobal",
    "oid": "1.3.6.1.4.1.9.10.105.1.1",
    "class": "objectidentity"
  },
  "cDot11RadioDiagTable": {
    "name": "cDot11RadioDiagTable",
    "oid": "1.3.6.1.4.1.9.10.105.1.1.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table allows a network management system to control the behavior of the radio interface on an 802.11 station and the 802.11 clients associated with that station through that particular interface for the purpose of radio environment diagnosis. The administrator can modify the MIB objects in this table to temporarily alter the behavior of that particular dot11 radio interface and the respective associated clients. This table has a sparse dependent relationship with ifTable defined in IF-MIB. There exists a row in this table corresponding to the row for each dot11 interface found in ifTable. However, this table is not applicable for virtual dot11 interfaces. "
  },
  "cDot11RadioDiagEntry": {
    "name": "cDot11RadioDiagEntry",
    "oid": "1.3.6.1.4.1.9.10.105.1.1.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry holds the set of temporary values for the parameters to be applied to one particular dot11 interface and the respective clients to temporarily alter their behavior. "
  },
  "cDot11RadioDiagTempChannel": {
    "name": "cDot11RadioDiagTempChannel",
    "oid": "1.3.6.1.4.1.9.10.105.1.1.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 14
          },
          {
            "min": 34,
            "max": 34
          },
          {
            "min": 36,
            "max": 36
          },
          {
            "min": 38,
            "max": 38
          },
          {
            "min": 40,
            "max": 40
          },
          {
            "min": 42,
            "max": 42
          },
          {
            "min": 44,
            "max": 44
          },
          {
            "min": 46,
            "max": 46
          },
          {
            "min": 48,
            "max": 48
          },
          {
            "min": 52,
            "max": 52
          },
          {
            "min": 56,
            "max": 56
          },
          {
            "min": 60,
            "max": 60
          },
          {
            "min": 64,
            "max": 64
          },
          {
            "min": 100,
            "max": 100
          },
          {
            "min": 104,
            "max": 104
          },
          {
            "min": 108,
            "max": 108
          },
          {
            "min": 112,
            "max": 112
          },
          {
            "min": 116,
            "max": 116
          },
          {
            "min": 120,
            "max": 120
          },
          {
            "min": 124,
            "max": 124
          },
          {
            "min": 128,
            "max": 128
          },
          {
            "min": 132,
            "max": 132
          },
          {
            "min": 136,
            "max": 136
          },
          {
            "min": 140,
            "max": 140
          },
          {
            "min": 149,
            "max": 149
          },
          {
            "min": 153,
            "max": 153
          },
          {
            "min": 157,
            "max": 157
          },
          {
            "min": 161,
            "max": 161
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "reference": "IEEE Standard 802.11-1999, 15.4.6.2, IEEE Standard 802.11a-1999, 17.3.8.3.3, IEEE Standard 802.11g-2003, Annex D, ASN.1 coding of MAC and PHY MIB. ",
    "status": "current",
    "description": "Temporary channel number for the 802.11 interface identified by ifIndex. The value this object takes depends on the value of the object dot11PHYType defined in IEEE802dot11-MIB. The semantics are as follows. If dot11PHYType equals 'ofdm', the acceptable values for this object are 34, 36, 38, 40, 42, 44, 46, 48, 52, 56, 60, 64, 100, 104, 108, 112, 116, 120, 124, 128, 132, 136, 140, 149, 153, 157 and 161. If dot11PHYType equals 'dsss' or 'erp', the acceptable values for this object are from 1 to 14. The channel numbers that can be assigned to this object from the set of acceptable values mentioned above vary depending on the value of the MIB object cd11IfCurrentCarrierSet defined in CISCO-DOT11-IF MIB. The object cDot11RadioDiagSettingsEnabled must be set to 'true' to apply the temporary value specified through this object to the 802.11 interface. Setting cDot11RadioDiagSettingsEnabled to 'false' temporary value to that interface restores the channel setting of this interface to the original value that was there before applying the temporary value to that interface. A value of 0 indicates that this object hasn't been configured with a valid channel number. "
  },
  "cDot11RadioDiagTempTxPowerLevel": {
    "name": "cDot11RadioDiagTempTxPowerLevel",
    "oid": "1.3.6.1.4.1.9.10.105.1.1.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 8
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Temporary transmit power level for the 802.11 interface identified by ifIndex. A value in the range of 1 to 8 refers to one of the power levels from the MIB table 'dot11PhyTxPowerTable' in IEEE802dot11-MIB. The power levels that can be assigned to this object from the set of acceptable values mentioned above vary depending on the value of the MIB object cd11IfCurrentCarrierSet defined in CISCO-DOT11-IF-MIB. The object cDot11RadioDiagSettingsEnabled must be set to 'true' to apply the temporary value specified through this object to the 802.11 interface. Setting cDot11RadioDiagSettingsEnabled to 'false' restores the power setting of this interface to the original value that was there before applying the temporary value to that interface. A value of 0 indicates that this object hasn't been configured with a valid power level. "
  },
  "cDot11RadioDiagMode": {
    "name": "cDot11RadioDiagMode",
    "oid": "1.3.6.1.4.1.9.10.105.1.1.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "normal": 1,
          "apRadioDiscovery": 2,
          "siteSurveyTempSettings": 3,
          "siteSurveyNonTempSettings": 4
        }
      }
    },
    "default": {
      "default": {
        "value": "normal",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Test mode as carried by the Cisco Radio Management Extensions in the 802.11 beacon frame. The semantics are described as follows. normal - Indicates that the station is operating in non-test mode. apRadioDiscovery - Indicates that this station is operating in AP Discovery mode. In this mode, APs transmit and measure each other's beacons. APs measure signal strength as received from other APs, levels of RF interference experienced during transmission / reception and report back the same to the NM. siteSurveyTempSettings - Indicates that the station is operating in AP assisted site survey mode with temporary channel and transmit power settings applied to the dot11 interface identified by ifIndex. siteSurveyNonTempSettings - Indicates that station is operating in AP assisted site survey mode with it's original channel and transmit power with the temporary settings not applied to the dot11 interface identified by ifIndex. "
  },
  "cDot11RadioDiagSettingsEnabled": {
    "name": "cDot11RadioDiagSettingsEnabled",
    "oid": "1.3.6.1.4.1.9.10.105.1.1.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "A flag to indicate whether the station will apply the temporary channel, transmit power settings and the data rate sets configured in this entry to the particular dot11 interface and the client transmit power setting to the clients associated with this station through that dot11 interface. A value of 'true' indicates that the station will apply the temporary channel, transmit power settings and the data rate sets configured in this entry to the dot11 interface and the client transmit power to the respective associated clients. A value of 'false' indicates that station will use it's original channel, transmit power and data rate sets for data communication over the respective dot11 interface. Also, the station will revert back the transmit power of the clients associated through the particular dot11 interface to their original transmit power levels. "
  },
  "cDot11RadioDiagTempClientTxPower": {
    "name": "cDot11RadioDiagTempClientTxPower",
    "oid": "1.3.6.1.4.1.9.10.105.1.1.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 8
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Temporary transmit power level for the 802.11 clients associated with this station through the 802.11 interface identified by ifIndex. The value configured through this object is carried by the beacon frames transmitted by this 802.11 station and picked up by the associated clients, if any, from these beacon frames to set their respective transmit power levels. A value in the range of 1 to 8 refers to one of the recommended power levels from the table cd11IfClientTxPowerTable defined in CISCO-DOT11-IF-MIB. The power levels that can be assigned to this object from the set of acceptable values mentioned above vary depending on the value of the MIB object cd11IfCurrentCarrierSet defined in CISCO-DOT11-IF-MIB. The object cDot11RadioDiagSettingsEnabled must be set to 'true' to apply the temporary value specified through this object to the respective clients. Setting cDot11RadioDiagSettingsEnabled to 'false' restores the transmit power setting of the associated clients to the original value that was there before applying this temporary value to those clients. A value of 0 indicates that this object hasn't been configured with a valid power level. "
  },
  "cDot11RadioDiagTempDataRateSet": {
    "name": "cDot11RadioDiagTempDataRateSet",
    "oid": "1.3.6.1.4.1.9.10.105.1.1.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 126
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object specifies the set of data rates at which the station may transmit data through the dot11 interface identified by ifIndex. The semantics of this object are similar to that of the object dot11OperationalRateSet of IEEE802dot11-MIB. Each octet contains a value representing a rate. Each rate shall be within the range from 2 to 127, corresponding to data rates in increments of 500 kb/s from 1 Mb/s to 63.5 Mb/s, and shall be supported as indicated in the object dot11SupportedDataRatesTxTable of IEEE802dot11-MIB for receiving data. The object cDot11RadioDiagSettingsEnabled must be set to 'true' to apply the temporary value specified through this object to the 802.11 interface. Setting cDot11RadioDiagSettingsEnabled to 'false' restores the data rate setting of this interface to the original value that was there before applying the temporary value to that interface. A query to this object returns a value of zero for each octet of the octet string representing this object, if this object hasn't been configured with a valid data rate set. "
  },
  "cDot11RadioDiagMIBConform": {
    "name": "cDot11RadioDiagMIBConform",
    "oid": "1.3.6.1.4.1.9.10.105.2",
    "class": "objectidentity"
  },
  "cDot11RadioDiagMIBCompliances": {
    "name": "cDot11RadioDiagMIBCompliances",
    "oid": "1.3.6.1.4.1.9.10.105.2.1",
    "class": "objectidentity"
  },
  "cDot11RadioDiagMIBGroups": {
    "name": "cDot11RadioDiagMIBGroups",
    "oid": "1.3.6.1.4.1.9.10.105.2.2",
    "class": "objectidentity"
  },
  "cDot11RadioDiagMIBCompliance": {
    "name": "cDot11RadioDiagMIBCompliance",
    "oid": "1.3.6.1.4.1.9.10.105.2.1.1",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "cDot11RadioDiagConfigGlobalGroup",
        "module": "CISCO-DOT11-RADIO-DIAGNOSTIC-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for the SNMP entities that implement the ciscoDot11RadioDiagMIB module."
  },
  "cDot11RadioDiagMIBComplianceRev1": {
    "name": "cDot11RadioDiagMIBComplianceRev1",
    "oid": "1.3.6.1.4.1.9.10.105.2.1.2",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "cDot11RadioDiagConfigGroupRev1",
        "module": "CISCO-DOT11-RADIO-DIAGNOSTIC-MIB"
      }
    ],
    "status": "current",
    "description": "The compliance statement for the SNMP entities that implement the ciscoDot11RadioDiagMIB module."
  },
  "cDot11RadioDiagConfigGlobalGroup": {
    "name": "cDot11RadioDiagConfigGlobalGroup",
    "oid": "1.3.6.1.4.1.9.10.105.2.2.1",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-DOT11-RADIO-DIAGNOSTIC-MIB",
        "object": "cDot11RadioDiagTempChannel"
      },
      {
        "module": "CISCO-DOT11-RADIO-DIAGNOSTIC-MIB",
        "object": "cDot11RadioDiagTempTxPowerLevel"
      },
      {
        "module": "CISCO-DOT11-RADIO-DIAGNOSTIC-MIB",
        "object": "cDot11RadioDiagMode"
      },
      {
        "module": "CISCO-DOT11-RADIO-DIAGNOSTIC-MIB",
        "object": "cDot11RadioDiagSettingsEnabled"
      }
    ],
    "status": "deprecated",
    "description": "This collection of objects provide information about the temporary radio configuration to be applied to the station's 802.11 interfaces. "
  },
  "cDot11RadioDiagConfigGroupRev1": {
    "name": "cDot11RadioDiagConfigGroupRev1",
    "oid": "1.3.6.1.4.1.9.10.105.2.2.2",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-DOT11-RADIO-DIAGNOSTIC-MIB",
        "object": "cDot11RadioDiagTempChannel"
      },
      {
        "module": "CISCO-DOT11-RADIO-DIAGNOSTIC-MIB",
        "object": "cDot11RadioDiagTempTxPowerLevel"
      },
      {
        "module": "CISCO-DOT11-RADIO-DIAGNOSTIC-MIB",
        "object": "cDot11RadioDiagMode"
      },
      {
        "module": "CISCO-DOT11-RADIO-DIAGNOSTIC-MIB",
        "object": "cDot11RadioDiagSettingsEnabled"
      },
      {
        "module": "CISCO-DOT11-RADIO-DIAGNOSTIC-MIB",
        "object": "cDot11RadioDiagTempClientTxPower"
      },
      {
        "module": "CISCO-DOT11-RADIO-DIAGNOSTIC-MIB",
        "object": "cDot11RadioDiagTempDataRateSet"
      }
    ],
    "status": "current",
    "description": "This collection of objects provide information about the temporary radio configuration to be applied to the station's 802.11 interfaces and the associated clients. "
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/CISCO-DOT11-RADIO-DIAGNOSTIC-MIB",
      "Produced by pysmi-0.3.4 at Fri May 24 17:00:13 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "CISCO-DOT11-RADIO-DIAGNOSTIC-MIB"
  }
}