{
  "imports": {
    "class": "imports",
    "CISCO-ITP-GSCCP-MIB": [
      "CgsccpGttGlobalTitleInd",
      "CgsccpGttTransType"
    ],
    "CISCO-ITP-GSP-MIB": [
      "cgspEventSequenceNumber",
      "cgspCLLICode",
      "cgspInstNetwork"
    ],
    "CISCO-ITP-MLR-MIB": [
      "CmlrAddressDigits",
      "CmlrName",
      "CmlrAddressType",
      "CmlrRuleProtocol",
      "CmlrId",
      "CmlrRuleSetName"
    ],
    "CISCO-ITP-TC-MIB": [
      "CItpTcGtaLongDisplay",
      "CItpTcNetworkName",
      "CItpTcPointCode",
      "CItpTcNAI",
      "CItpTcURL",
      "CItpTcNumberingPlan",
      "CItpTcSubSystemNumber",
      "CItpTcTableLoadStatus"
    ],
    "CISCO-SMI": [
      "ciscoMgmt"
    ],
    "INET-ADDRESS-MIB": [
      "InetPortNumber",
      "InetAddress",
      "InetAddressType"
    ],
    "SNMPv2-CONF": [
      "MODULE-COMPLIANCE",
      "NOTIFICATION-GROUP",
      "OBJECT-GROUP"
    ],
    "SNMPv2-SMI": [
      "IpAddress",
      "Counter64",
      "Integer32",
      "Gauge32",
      "NOTIFICATION-TYPE",
      "Bits",
      "OBJECT-TYPE",
      "iso",
      "Unsigned32",
      "Counter32",
      "TimeTicks",
      "OBJECT-IDENTITY",
      "MibIdentifier",
      "MODULE-IDENTITY"
    ],
    "SNMPv2-TC": [
      "TEXTUAL-CONVENTION",
      "DateAndTime",
      "TimeStamp",
      "TruthValue",
      "RowStatus",
      "DisplayString"
    ]
  },
  "ciscoItpDsmrMIB": {
    "name": "ciscoItpDsmrMIB",
    "oid": "1.3.6.1.4.1.9.9.1300",
    "class": "moduleidentity",
    "revisions": [
      {
        "revision": "2005-05-17 00:00",
        "description": "Initial version of this MIB module."
      }
    ],
    "lastupdated": "200505170000Z",
    "organization": "Cisco Systems, Inc.",
    "contactinfo": " Cisco Systems, Inc Customer Service Postal: 170 W. Tasman Drive San Jose, CA 95134 USA Tel: +1 800 553-NETS E-mail: cs-ss7@cisco.com",
    "description": "The MIB for providing information about Distributed Short Message Routing for Short Message Service Center. This MIB will provide information used to control and measure SS7 messages signalling units in a SS7 Network. Message Signalling Units are routed based on information found in the SCCP, TCAP, MAP, and MAP-user layers. It uses information from these layers to make customizable routing decision based on the following criteria. - message A-address (origination SME) - message B-address (destination SME) - protocol identifier - operation code - called party address - calling party address The Cisco IP Transfer Point (ITP) is a hardware and software solution that transports SS7 traffic using IP. Each ITP node provides function similar to SS7 signalling point. The Distributed Short Message Routing will be developed in compliance to the following standards. - GSM MAP v1, v2 and v3 MO SMS formats - GSM MAP SMS user information for MO messages - IS-41 MAP Mobile Originated SMS formats for Revisions A thru D. Acronyms and Terms A-address The originating SME of the short message. AO Application Originated (synonymous with FO). This term is used to refer to an SMS message that is being sent from an application to the SMSC, typically over SMPP. Traffic alerts, stock quotes, sports updates are typically AO. ANSI-41 ANSI standard for defining cellular radio telecommunications inter-system operation. AT Application Terminated (synonymous with FT). This term is used to refer to an SMS message that is being sent to an application from the SMSC, typically over SMPP. Voting traffic is typically AT. B-address The destination SME of the short message. BCH Binary Coded Hexadecimal CdPA The SCCP Called Party Address field. CgPA The SCCP Calling Party Address field. ESME External Short Message Entity. DSMR Distributed Short Message Routing FO Fixed Originated (synonymous with AO) FT Fixed Terminated (synonymous with AT) GSM ITU standard for defining the Global System for Mobile communications. GTT Global Title Translation. A function normally performed in an STP, GTT is the procedure by which the destination signalling point and subsystem number(SSN) is determined from GTA digits (i.e., the global title) present in the signalling message. IMEI International Mobile Equipment Identity IMSI International Mobile Station Identity or International Mobile Subscriber Identity A mobile station identifier typically used in GSM networks, but is also defined for use in IS-41 networks via IS-751. IS-41 ANSI standard for defining cellular radio telecommunications inter-system operation. Unless otherwise stated, this refers to the IS-41-D specification. MAP SS7 Mobile Application Part. This layer provides mobility procedures to SS7 network applications. MAP is generically used to refer to both GSM-MAP, and the IS-41-D MAP Protocol. MC Message Center. Network element responsible for relaying and store-and-forwarding of short messages in ANSI-41 networks. MDN Mobile Directory Number. A 10-digit North American Numbering Plan number assigned to mobile users in IS-41 networks. It may be different from the MIN. MIN Mobile Identification Number. The 10-digit North American Numbering Plan number assigned to mobile users in IS-41 networks. It may be different from the MDN. MLR Multi-layer Routing MO Mobile Originated. This term is used to refer to an SMS message that is being sent from an MS to the SMSC. MS Mobile Subscriber. MS mobile station MSU Message Signal Unit MT Mobile Terminated. This term is used to refer to an SMS message that is being sent from an SMSC to an MS. MTP Message Transfer Part MTP1 Layers 1 (physical) MTP2 Layer 2 (data) and MTP3 Layer 3 (network) M2PA SS7 MTP2-User Peer-to-Peer Adaptation Layer specified by the IETF SIGTRAN working group, which provides SCTP/IP based links for MTP3. M3UA SS7 MTP3 User Adaptation Layer specified by RFC 3332 for MTP3 users like ISUP. RR Round Robin. A balancing algorithm that evenly distributes traffic among available servers. SCCP Signalling Connection Control Part. As part of the SS7 signalling protocol, it provides connectionless and connection-oriented network services above MTP Level 3. SCP Service Control Point. An element of an SS7-based Intelligent Network which performs various service functions, such as number translation, call setup and tear down, etc. SCTP Stream Control Transmission Protocol. A protocol designed by the SigTran working group of the IETF to transport messages reliably over IP networks(RFC 2960). It has been specifically designed with PSTN signalling in mind, but is meant to be a general IP transport protocol. SG Signalling Gateway. SIM Subscriber Identity Module SME Short Message Entity. An entity that may send or receive short messages, and may be fixed or mobile. SM Short Message SMPP Short Message Peer-to-Peer (protocol) SMD-PP Short Message Delivery Point to Point. SMS Short Message Service, as defined in GSM and IS-41-D. SMS-MO Short Message Service Mobile Originated. SMS-MT Short Message Service Mobile Terminated. SMSC Short Message Service Center. Network element responsible for relaying and store-and-forwarding of short messages. SRI Send Routing Information or Send Routing Information for Short Messages. Refers to the procedure by which an SMSC requests the HLR to send current routing information for a particular mobile user. SRI-SM Send Routing Information Short Message SSP Service Switching Point. An element of an SS7-based Intelligent Network that performs call origination, termination, or tandem switching. STP Signal Transfer Point. An element of an SS7-based Intelligent Network that performs routing of the SS7 signalling. SUA SS7 SCCP User Adaptation Layer specified by IETF SIGTRAN for SCCP users, like GSM MAP, UMTS RANAP, CDMA IS-41, CDMA IS-634, IN INAP, CAMEL CAP. TCAP Transaction Capability Application Part. The application layer of the SS7 signalling protocol. UCP Universal Computer Protocol. WRR Weighted Round Robin. A variation of the round robin algorithm that uses server weights to allow uneven distribution of traffic among a set of available servers. All objects defined as Counter32 apply from the time the statement is activated until it is deleted. ********************************************"
  },
  "ciscoItpDsmrMIBNotifs": {
    "name": "ciscoItpDsmrMIBNotifs",
    "oid": "1.3.6.1.4.1.9.9.1300.0",
    "class": "objectidentity"
  },
  "ciscoItpDsmrMIBObjects": {
    "name": "ciscoItpDsmrMIBObjects",
    "oid": "1.3.6.1.4.1.9.9.1300.1",
    "class": "objectidentity"
  },
  "ciscoItpDsmrMIBConform": {
    "name": "ciscoItpDsmrMIBConform",
    "oid": "1.3.6.1.4.1.9.9.1300.2",
    "class": "objectidentity"
  },
  "CdsmrMaximumDigits": {
    "name": "CdsmrMaximumDigits",
    "class": "textualconvention",
    "type": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 20
          }
        ]
      }
    },
    "status": "current",
    "description": "Maximum number of digits that global title address can contain and match rule. The maximum number of digits must be greater than or equal to the length of the specified address. Also, the maximum number of digits must be greater than or equal to minimum number of digits. A value of zero indicates the ranges is not be applied."
  },
  "CdsmrMinimumDigits": {
    "name": "CdsmrMinimumDigits",
    "class": "textualconvention",
    "type": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 20
          }
        ]
      }
    },
    "status": "current",
    "description": "Minimum number of digits that global title address can contain and match rule. The minimum number of digits must be greater than or equal to the length of the specified address. A value of zero indicates the ranges is not be applied. does not apply when the global title address length is set to zero."
  },
  "CdsmrResultDestinationType": {
    "name": "CdsmrResultDestinationType",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "none": 1,
          "gt": 2,
          "smpp": 3,
          "ucp": 4,
          "pc": 5,
          "pcSsn": 6
        }
      }
    },
    "status": "current",
    "description": "List of possible destination types as follows. 'none' : Result not specified. 'gt' : The global title address formatted as CItpTcGtaLongDisplay 'smpp' : Short Message Peer-to-Peer protocol destination. 'ucp' : Universal Computer Protocol destination. 'pc' : Point-code destination. 'pcSsn' : Point-code and subsystem number destination."
  },
  "CdsmrResultOctet": {
    "name": "CdsmrResultOctet",
    "class": "textualconvention",
    "type": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 64
          }
        ]
      }
    },
    "status": "current",
    "description": "An octet string that contains various types of output from a rule. The information in this textual convention is formatted as follows: CdsmrResultType: None : Octet string with length of zero. pc : Not applicable pcSsn : Not applicable. gt : The global title address formatted as CItpTcGtaLongDisplay group : Result group formatted as CmlrName. smpp : Result group formatted as CmlrName ucp : Result group formatted as CmlrName block : Not applicable. ruleNext : Not applicable. ruleNumber: Not applicable. deliveryMt: Not applicable. origImsi : Not Applicable origImsiNext: Not Applicable When the result octet is not used as a parameter, not applicable, the length will be set to zero. An octet string specified by an administrator that must be in human-readable form. The names must conform to the allowed characters that can be specified via Command Line Interface(CLI). The names cannot contain control character and should not contain leading or trailing white space."
  },
  "CdsmrResultParameters": {
    "name": "CdsmrResultParameters",
    "class": "textualconvention",
    "type": {
      "type": "Bits",
      "class": "type",
      "bits": {
        "network": 0,
        "octet": 1,
        "tranType": 2,
        "gti": 3,
        "np": 4,
        "nai": 5,
        "pc": 6,
        "ssn": 7,
        "ruleNumber": 8
      }
    },
    "status": "current",
    "description": "In order to specify the results of DSMR statements different values in the packet can be modified. These values are determined by a combination of variant and operation type. This object indicates which objects will be used to form a result action as follows. This textual convention defines the result actions of DSMR which are determined by a combination of variant and operation type. The possible result actions of DSMR are as follows: 'network' : specifies network 'octet' : specifies octet string 'tranType' : specifies translation type 'gti' : specifies global title indicator 'np' : specifies numbering plan 'nai' : specifies nature of address 'pc' : specifies point-code 'ssn' : specifies subsystem number 'ruleNumber': specifies next rule to execute"
  },
  "CdsmrResultType": {
    "name": "CdsmrResultType",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "none": 0,
          "pc": 1,
          "pcSsn": 2,
          "gt": 3,
          "group": 4,
          "smpp": 5,
          "ucp": 6,
          "block": 7,
          "ruleNext": 8,
          "ruleNumber": 9,
          "deliverMt": 10,
          "origImsi": 11,
          "origImsiNext": 12
        }
      }
    },
    "status": "current",
    "description": "This textual convention defines the result type of DSMR. The possible result types are as follows: 'none' : Result not specified. 'block' : Message will be discarded. 'pc' : Message will be routed using the specified destination point code. 'pcSsn' : Message will be routed using the specified destination point code and subsystem number. destination M3UA or SUA Application Server(AS). 'gt' : Message will be routed using SCCP global title. 'group' : Message will be routed using information specified in result group. 'smpp' : Delivery via Short Message Peer-to-Peer 'ucp' : Delivery via Universal Computer Protocol 'ruleNext' : When address matches entry in table processing will continue with next rule. 'ruleNumber' : When address matches entry in table processing will continue with specified rule. 'deliverMt': Indicates that a delivery attempt should be attempted to the destination SME as a mobile device. 'origImsi': Attempt to obtain the original IMSI address and us it to delivery packet. When the IMSI address is unavailable fail packet. 'origImsiNext': Attempt to obtain the original IMSI address and us it to delivery packet. When the IMSI address is unavailable continue processing with next rule. "
  },
  "cdsmrScalars": {
    "name": "cdsmrScalars",
    "oid": "1.3.6.1.4.1.9.9.1300.1.1",
    "class": "objectidentity"
  },
  "cdsmrTableLoadNotifEnabled": {
    "name": "cdsmrTableLoadNotifEnabled",
    "oid": "1.3.6.1.4.1.9.9.1300.1.1.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object controls the generation of ciscoDsmrTableLoad as follows: 'true(1)' - the generation of ciscoDsmrTableLoad notifications is enabled. 'false(2)' - the generation of ciscoDsmrTableLoad notifications is disabled."
  },
  "cdsmrInstTable": {
    "name": "cdsmrInstTable",
    "oid": "1.3.6.1.4.1.9.9.1300.1.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table that is used to provide information and measurements related to Distributed Short Message Routing per signalling point. Entries are added to this table via cdsmrInstRowStatus in accordance with the RowStatus convention."
  },
  "cdsmrInstTableEntry": {
    "name": "cdsmrInstTableEntry",
    "oid": "1.3.6.1.4.1.9.9.1300.1.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-ITP-GSP-MIB",
        "object": "cgspInstNetwork",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Each entry in this table provides information on each signalling point supported by this device."
  },
  "cdsmrInstLastChanged": {
    "name": "cdsmrInstLastChanged",
    "oid": "1.3.6.1.4.1.9.9.1300.1.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TimeStamp",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The value of sysUpTime at the time of the last creation or deletion of an entry in the Multi-Layer configurations defined for this signalling point. If the local network management subsystem is re-initialized, then this object contains the sysUpTime at the time when this occurred. This value can be used to prevent unnecessary walks of the various tables supporting Distributed Short Message Routing."
  },
  "cdsmrInstLastLoadTime": {
    "name": "cdsmrInstLastLoadTime",
    "oid": "1.3.6.1.4.1.9.9.1300.1.2.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TimeStamp",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The value of sysUpTime at the time of the last load of a file supporting Distributed Short Message Routing for this signalling point."
  },
  "cdsmrInstLoadStatus": {
    "name": "cdsmrInstLoadStatus",
    "oid": "1.3.6.1.4.1.9.9.1300.1.2.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcTableLoadStatus",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The status of the current load or status from the prior load operation. This object will have a value of loadInProgress while the load operation is in progress. The cdsmrInstLastLoadTime contains a timestamp indicating when the load operation is completed."
  },
  "cdsmrInstLastURL": {
    "name": "cdsmrInstLastURL",
    "oid": "1.3.6.1.4.1.9.9.1300.1.2.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcURL",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The last URL used to load a file used to configure Distributed Short Message Routing."
  },
  "cdsmrInstDeliveredSmppCounts": {
    "name": "cdsmrInstDeliveredSmppCounts",
    "oid": "1.3.6.1.4.1.9.9.1300.1.2.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of the number of times a packet was routed using Short Message Peer-to-Peer protocol."
  },
  "cdsmrInstDeliveredUcpCounts": {
    "name": "cdsmrInstDeliveredUcpCounts",
    "oid": "1.3.6.1.4.1.9.9.1300.1.2.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of the number of times a packet was routed using Universal Computer Protocol(UCP)."
  },
  "cdsmrInstDeliveredGsmCounts": {
    "name": "cdsmrInstDeliveredGsmCounts",
    "oid": "1.3.6.1.4.1.9.9.1300.1.2.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of the number of times a GSM packet was delivered."
  },
  "cdsmrInstDeferredGsmCounts": {
    "name": "cdsmrInstDeferredGsmCounts",
    "oid": "1.3.6.1.4.1.9.9.1300.1.2.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of the number of times a GSM packet was deferred."
  },
  "cdsmrInstGsmStatusReports": {
    "name": "cdsmrInstGsmStatusReports",
    "oid": "1.3.6.1.4.1.9.9.1300.1.2.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of the number GSM status reports issued by device."
  },
  "cdsmrInstUcpNotifications": {
    "name": "cdsmrInstUcpNotifications",
    "oid": "1.3.6.1.4.1.9.9.1300.1.2.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of the number UCP notifications issued by device."
  },
  "cdsmrInstSmppDeliveryReceipts": {
    "name": "cdsmrInstSmppDeliveryReceipts",
    "oid": "1.3.6.1.4.1.9.9.1300.1.2.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of the number SMPP delivery receipts issued by device."
  },
  "cdsmrInstRoutingFailures": {
    "name": "cdsmrInstRoutingFailures",
    "oid": "1.3.6.1.4.1.9.9.1300.1.2.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of the number of times a packet could not be delivered because route was not configured."
  },
  "cdsmrInstResultFailures": {
    "name": "cdsmrInstResultFailures",
    "oid": "1.3.6.1.4.1.9.9.1300.1.2.1.13",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of the number of times processing of packet did not produce valid result."
  },
  "cdsmrInstInternalErrors": {
    "name": "cdsmrInstInternalErrors",
    "oid": "1.3.6.1.4.1.9.9.1300.1.2.1.14",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of the number of times processing of packet was not completed due to internal error."
  },
  "cdsmrInstParseErrors": {
    "name": "cdsmrInstParseErrors",
    "oid": "1.3.6.1.4.1.9.9.1300.1.2.1.15",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of the number of times processing of packet was not completed due to parsing error."
  },
  "cdsmrInstResourceErrors": {
    "name": "cdsmrInstResourceErrors",
    "oid": "1.3.6.1.4.1.9.9.1300.1.2.1.16",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of the number of times processing of packet was not completed due to unavailable resources on device."
  },
  "cdsmrInstProvisioningErrors": {
    "name": "cdsmrInstProvisioningErrors",
    "oid": "1.3.6.1.4.1.9.9.1300.1.2.1.17",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of the number of times processing of packet was not completed due to provisioning errors on device."
  },
  "cdsmrInstDestUnreachableErrors": {
    "name": "cdsmrInstDestUnreachableErrors",
    "oid": "1.3.6.1.4.1.9.9.1300.1.2.1.18",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of the number of times packet was not routed because destination was unreachable."
  },
  "cdsmrInstDestSignalErrors": {
    "name": "cdsmrInstDestSignalErrors",
    "oid": "1.3.6.1.4.1.9.9.1300.1.2.1.19",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of the number of times packet was not routed because destination had signal error."
  },
  "cdsmrInstTimeOuts": {
    "name": "cdsmrInstTimeOuts",
    "oid": "1.3.6.1.4.1.9.9.1300.1.2.1.20",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of the number of times packet was not delivered due to timeout."
  },
  "cdsmrInstBlockedPackets": {
    "name": "cdsmrInstBlockedPackets",
    "oid": "1.3.6.1.4.1.9.9.1300.1.2.1.21",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of the number of times packets were blocked by processing."
  },
  "cdsmrInstRoutingRequestsRcvdGsm": {
    "name": "cdsmrInstRoutingRequestsRcvdGsm",
    "oid": "1.3.6.1.4.1.9.9.1300.1.2.1.22",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of the number of routing requests received were traffic was GSM based."
  },
  "cdsmrInstRoutingRequestsRcvdIs41": {
    "name": "cdsmrInstRoutingRequestsRcvdIs41",
    "oid": "1.3.6.1.4.1.9.9.1300.1.2.1.23",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of the number of routing requests received were traffic was IS-41 based."
  },
  "cdsmrInstRoutingRequestsRcvdUcp": {
    "name": "cdsmrInstRoutingRequestsRcvdUcp",
    "oid": "1.3.6.1.4.1.9.9.1300.1.2.1.24",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of the number of routing requests received were traffic was UCP based."
  },
  "cdsmrInstRoutingRequestsRcvdSmpp": {
    "name": "cdsmrInstRoutingRequestsRcvdSmpp",
    "oid": "1.3.6.1.4.1.9.9.1300.1.2.1.25",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of the number of routing requests received were traffic was SMPP based."
  },
  "cdsmrInstRowStatus": {
    "name": "cdsmrInstRowStatus",
    "oid": "1.3.6.1.4.1.9.9.1300.1.2.1.26",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The object is used by a management station to create or delete the row entry in cdsmrInstTable following the RowStatus textual convention."
  },
  "cdsmrResultGroupTable": {
    "name": "cdsmrResultGroupTable",
    "oid": "1.3.6.1.4.1.9.9.1300.1.3",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table used to identify a group of results and define parameter that apply to all result within the group. Entries are added to this table via cdsmrResultGroupRowStatus in accordance with the RowStatus convention."
  },
  "cdsmrResultGroupTableEntry": {
    "name": "cdsmrResultGroupTableEntry",
    "oid": "1.3.6.1.4.1.9.9.1300.1.3.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-ITP-GSP-MIB",
        "object": "cgspInstNetwork",
        "implied": 0
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultGroupName",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "This table is used to define a collection of results."
  },
  "cdsmrResultGroupName": {
    "name": "cdsmrResultGroupName",
    "oid": "1.3.6.1.4.1.9.9.1300.1.3.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrName",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A name used to define a result group."
  },
  "cdsmrResultGroupServerType": {
    "name": "cdsmrResultGroupServerType",
    "oid": "1.3.6.1.4.1.9.9.1300.1.3.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "esme": 1,
          "smsc": 2
        }
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object specifies the server type as follows. 'esme' - Indicates this result group represents an external short message entity (ESME). Coding this parameter will allow the user to enter ESME specific parameters and enable the Distributed Short Message Routing to properly characterize the routing of the message. 'smsc' - Indicates this result group represents a short message service center (SMSC). Coding this parameter will allow the user to enter SMSC specific parameters and enable the Distributed Short Message Routing to properly characterize the routing of the message."
  },
  "cdsmrResultGroupCdrConsolidation": {
    "name": "cdsmrResultGroupCdrConsolidation",
    "oid": "1.3.6.1.4.1.9.9.1300.1.3.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 5
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The object provides a one to five ASCII characters ESME (large account) consolidation string. This object only applies when the cdsmrResultGroupServerType object specifies ESME. The object returns the null string when not specified."
  },
  "cdsmrResultGroupIdentifier": {
    "name": "cdsmrResultGroupIdentifier",
    "oid": "1.3.6.1.4.1.9.9.1300.1.3.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 0
          },
          {
            "min": 100,
            "max": 9999
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The object provides a ESME (large account) identifier. This object only applies when the cdsmrResultGroupServerType object specifies ESME. The zero value is usedt to indicate that the object has not been specified."
  },
  "cdsmrResultGroupQueueLimit": {
    "name": "cdsmrResultGroupQueueLimit",
    "oid": "1.3.6.1.4.1.9.9.1300.1.3.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 100000
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object defines the maximum number of elements on outbound queue for any destination. The value of 0 indicates that there is no limit on the number of entries."
  },
  "cdsmrResultGroupQueueTimeLimit": {
    "name": "cdsmrResultGroupQueueTimeLimit",
    "oid": "1.3.6.1.4.1.9.9.1300.1.3.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "units": "milliseconds",
    "maxaccess": "read-create",
    "status": "current",
    "description": "Maximum time element can exist in outbound queue."
  },
  "cdsmrResultGroupMatchSmppId": {
    "name": "cdsmrResultGroupMatchSmppId",
    "oid": "1.3.6.1.4.1.9.9.1300.1.3.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 15
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "When specified this object provides 1 to 15 character ESME system identifier. This object only applies when the cdsmrResultGroupServerType object specifies ESME."
  },
  "cdsmrResultGroupMatchSmppType": {
    "name": "cdsmrResultGroupMatchSmppType",
    "oid": "1.3.6.1.4.1.9.9.1300.1.3.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 12
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "When specified this object provides 1 to 12 character ESME system type. This object only applies when the cdsmrResultGroupServerType object specifies ESME. When this object is not specified it will return the null sting."
  },
  "cdsmrResultGroupMatchUcpId": {
    "name": "cdsmrResultGroupMatchUcpId",
    "oid": "1.3.6.1.4.1.9.9.1300.1.3.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 16
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The object provides 1 to 16 character ESME ESME UCP address code. This object only applies when the cdsmrResultGroupServerType object specifies ESME."
  },
  "cdsmrResultGroupRowStatus": {
    "name": "cdsmrResultGroupRowStatus",
    "oid": "1.3.6.1.4.1.9.9.1300.1.3.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The object is used by a management station to create or delete the row entry in cdsmrResultGroupTable following the RowStatus textual convention."
  },
  "cdsmrResultIpTable": {
    "name": "cdsmrResultIpTable",
    "oid": "1.3.6.1.4.1.9.9.1300.1.4",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table used to configure parameters to allow destination to be establish at request of partner. Entries are added to this table via cdsmrResultIpRowStatus in accordance with the RowStatus convention."
  },
  "cdsmrResultIpTableEntry": {
    "name": "cdsmrResultIpTableEntry",
    "oid": "1.3.6.1.4.1.9.9.1300.1.4.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-ITP-GSP-MIB",
        "object": "cgspInstNetwork",
        "implied": 0
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultGroupName",
        "implied": 0
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultIpNumber",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "This table is used to define a list of IP addresses and ports from which destination and establish connection."
  },
  "cdsmrResultIpNumber": {
    "name": "cdsmrResultIpNumber",
    "oid": "1.3.6.1.4.1.9.9.1300.1.4.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrId",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This object specifies the index for a list of results specified per result group. "
  },
  "cdsmrResultIpRemotePortNumber": {
    "name": "cdsmrResultIpRemotePortNumber",
    "oid": "1.3.6.1.4.1.9.9.1300.1.4.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetPortNumber",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Remote port number used to establish connection. The value of zero indicates that any port number will be accepted."
  },
  "cdsmrResultIpRemoteIpAddrType": {
    "name": "cdsmrResultIpRemoteIpAddrType",
    "oid": "1.3.6.1.4.1.9.9.1300.1.4.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressType",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object contains the type of the remote IP address used to create an session."
  },
  "cdsmrResultIpRemoteIpAddress": {
    "name": "cdsmrResultIpRemoteIpAddress",
    "oid": "1.3.6.1.4.1.9.9.1300.1.4.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object contains the remote IP address allowed to request the session."
  },
  "cdsmrResultIpProfileName": {
    "name": "cdsmrResultIpProfileName",
    "oid": "1.3.6.1.4.1.9.9.1300.1.4.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrName",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The name of the profile used to specify parameter for session as follows. 'smpp': cdsmrSmppProfileName 'ucp': cdsmrUcpProfileName For all other values this object is ignored."
  },
  "cdsmrResultIpWeight": {
    "name": "cdsmrResultIpWeight",
    "oid": "1.3.6.1.4.1.9.9.1300.1.4.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 10
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object specifies the weight applied to the weighted round robin distribution algorithm used for multi-layer result group. An integer value in the range of 0 to 10. A value of ten indicates the resource should be selected ten times more than a resource assigned a weight of one."
  },
  "cdsmrResultIpRowStatus": {
    "name": "cdsmrResultIpRowStatus",
    "oid": "1.3.6.1.4.1.9.9.1300.1.4.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The object is used by a management station to create or delete the row entry in cdsmrResultIpTable following the RowStatus textual convention."
  },
  "cdsmrResultTable": {
    "name": "cdsmrResultTable",
    "oid": "1.3.6.1.4.1.9.9.1300.1.5",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table used to configure parameters for destination resources. The result group lists the appropriate destination resources, and the mechanism used to select a single destination for a given packet. State information is determined for each possible destination. Entries are added to this table via cdsmrResultRowStatus in accordance with the RowStatus convention."
  },
  "cdsmrResultTableEntry": {
    "name": "cdsmrResultTableEntry",
    "oid": "1.3.6.1.4.1.9.9.1300.1.5.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-ITP-GSP-MIB",
        "object": "cgspInstNetwork",
        "implied": 0
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultGroupName",
        "implied": 0
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultNumber",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "This table is used to define a collection of multi-layer routing statements."
  },
  "cdsmrResultNumber": {
    "name": "cdsmrResultNumber",
    "oid": "1.3.6.1.4.1.9.9.1300.1.5.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrId",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This object specifies the index for a list of results specified per result group. "
  },
  "cdsmrResultDestinationType": {
    "name": "cdsmrResultDestinationType",
    "oid": "1.3.6.1.4.1.9.9.1300.1.5.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CdsmrResultDestinationType",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Destination type."
  },
  "cdsmrResultParameters": {
    "name": "cdsmrResultParameters",
    "oid": "1.3.6.1.4.1.9.9.1300.1.5.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CdsmrResultParameters",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Many of the result parameter used creating result are optional. This object is used to indicate which options are provided as follows. 'tranType' : cdsmrResultTransType 'gti' : cdsmrResultGti 'np' : cdsmrResultNp 'nai' : cdsmrResultNai 'pc' : cdsmrResultPc 'ssn' : cdsmrResultSsn "
  },
  "cdsmrResultDestinationName": {
    "name": "cdsmrResultDestinationName",
    "oid": "1.3.6.1.4.1.9.9.1300.1.5.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrName",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The name of the destination as follows based on cdsmrResultDestinationType: 'smpp': cdsmrSmppDestName 'ucp': cdsmrUcpDestName For all other values this object is ignored."
  },
  "cdsmrResultPc": {
    "name": "cdsmrResultPc",
    "oid": "1.3.6.1.4.1.9.9.1300.1.5.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcPointCode",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "A destination point code that must exist in the MTP3 routing table, and its state is extracted from MTP3 for availability purposes. This object only has applies when the cdsmrResultDestinationType object has the 'pc' or 'pcSsn' values. Otherwise, this object will return zero value."
  },
  "cdsmrResultSsn": {
    "name": "cdsmrResultSsn",
    "oid": "1.3.6.1.4.1.9.9.1300.1.5.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcSubSystemNumber",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The subsystem number to be inserted into MSU. This object only has applies when the cdsmrResultDestinationType object has the 'pcSsn' value. Otherwise, this object will return zero value."
  },
  "cdsmrResultGt": {
    "name": "cdsmrResultGt",
    "oid": "1.3.6.1.4.1.9.9.1300.1.5.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcGtaLongDisplay",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The global title address. When the length of the global title address is zero it specified a wildcard match and all global title will match GTA clause of rule. This object only applies when the CdsmrResultDestinationType is set to 'gt' value."
  },
  "cdsmrResultTransType": {
    "name": "cdsmrResultTransType",
    "oid": "1.3.6.1.4.1.9.9.1300.1.5.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CgsccpGttTransType",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The translation type specified within the address in the message signal unit. This object only applies when the CdsmrResultDestinationType is set to 'gt' value and the 'tranType' bit is set in the cdsmrResultResultParameters object."
  },
  "cdsmrResultGti": {
    "name": "cdsmrResultGti",
    "oid": "1.3.6.1.4.1.9.9.1300.1.5.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CgsccpGttGlobalTitleInd",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The global title indicator value for the global tile address specified within the message signal unit. This object only applies when the CdsmrResultDestinationType is set to 'gt' value."
  },
  "cdsmrResultNp": {
    "name": "cdsmrResultNp",
    "oid": "1.3.6.1.4.1.9.9.1300.1.5.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNumberingPlan",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The numbering plan for the global tile address specified within the message signal unit. This object only applies when the CdsmrResultDestinationType is set to 'gt' value."
  },
  "cdsmrResultNai": {
    "name": "cdsmrResultNai",
    "oid": "1.3.6.1.4.1.9.9.1300.1.5.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNAI",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The nature of specified address for the global tile address specified within the message signal unit. This object only applies when the cdsmrResultDestinationType is set to 'gt' value."
  },
  "cdsmrResultWeight": {
    "name": "cdsmrResultWeight",
    "oid": "1.3.6.1.4.1.9.9.1300.1.5.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 10
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object specifies the weight applied to the weighted round robin distribution algorithm used for multi-layer result group. An integer value in the range of 0 to 10. A value of ten indicates the resource should be selected ten times more than a resource assigned a weight of one."
  },
  "cdsmrResultNetwork": {
    "name": "cdsmrResultNetwork",
    "oid": "1.3.6.1.4.1.9.9.1300.1.5.1.13",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNetworkName",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The network name is used to indicate the network in which the result operation will be performed."
  },
  "cdsmrResultCounts": {
    "name": "cdsmrResultCounts",
    "oid": "1.3.6.1.4.1.9.9.1300.1.5.1.14",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "matches",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Number of times this entry was invoked."
  },
  "cdsmrResultRowStatus": {
    "name": "cdsmrResultRowStatus",
    "oid": "1.3.6.1.4.1.9.9.1300.1.5.1.15",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The object is used by a management station to create or delete the row entry in cdsmrResultTable following the RowStatus textual convention."
  },
  "cdsmrAddressTable": {
    "name": "cdsmrAddressTable",
    "oid": "1.3.6.1.4.1.9.9.1300.1.6",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table used to create a collection of addresses that can be searched for exact or best matches. Entries are added to this table via cdsmrAddressRowStatus in accordance with the RowStatus convention."
  },
  "cdsmrAddressTableEntry": {
    "name": "cdsmrAddressTableEntry",
    "oid": "1.3.6.1.4.1.9.9.1300.1.6.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-ITP-GSP-MIB",
        "object": "cgspInstNetwork",
        "implied": 0
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrAddressTableName",
        "implied": 0
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrAddressType",
        "implied": 0
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrAddressDigits",
        "implied": 0
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrAddressExactMatch",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Each entry in the cdsmrAddressTable is used to search for matches within a messages signalling unit. Message signalling that match a particular rule can be directed to cdsmrAddressTable to allow MSU to be directed or modified based on address information. The table is searched using information specified in the rule in cdsmrRuleTable Table."
  },
  "cdsmrAddressTableName": {
    "name": "cdsmrAddressTableName",
    "oid": "1.3.6.1.4.1.9.9.1300.1.6.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrName",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A name used to define a collection of addresses used to route and modify messages signalling units."
  },
  "cdsmrAddressType": {
    "name": "cdsmrAddressType",
    "oid": "1.3.6.1.4.1.9.9.1300.1.6.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrAddressType",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The type of addresses in the address tables. The different types will be used to determine how to format and convert cdsmrAddressDigits."
  },
  "cdsmrAddressDigits": {
    "name": "cdsmrAddressDigits",
    "oid": "1.3.6.1.4.1.9.9.1300.1.6.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrAddressDigits",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The digits of the address in following formats as indicated by cdsmrAddressType object. 'hexadecimal' - The digits are hexadecimal digits specified in ASCII as follows. '0123456789ABCDEF'"
  },
  "cdsmrAddressExactMatch": {
    "name": "cdsmrAddressExactMatch",
    "oid": "1.3.6.1.4.1.9.9.1300.1.6.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This object indicates that the address specified by cdsmrAddressDigits object must exactly match value in message signalling unit. 'true' - Exact match is specified. 'false' - Best match is specified."
  },
  "cdsmrAddressResultParameters": {
    "name": "cdsmrAddressResultParameters",
    "oid": "1.3.6.1.4.1.9.9.1300.1.6.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CdsmrResultParameters",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Many of the result parameter used in the processing of address table have default values. These values are determined by a combination of variant and operation type. This object will be provide information which parameter used in setting results have been specified as follows. 'network' : cdsmrAddressSetResultNetwork 'octet' : cdsmrAddressSetResultOctet 'tranType' : cdsmrAddressResultTransType 'gti' : cdsmrAddressResultGti 'np' : cdsmrAddressResultNp 'nai' : cdsmrAddressResultNai 'pc' : cdsmrAddressResultPc 'ssn' : cdsmrAddressResultSsn"
  },
  "cdsmrAddressResultNetwork": {
    "name": "cdsmrAddressResultNetwork",
    "oid": "1.3.6.1.4.1.9.9.1300.1.6.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNetworkName",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The network name is used to indicate the network in which the result operation will be performed."
  },
  "cdsmrAddressResultType": {
    "name": "cdsmrAddressResultType",
    "oid": "1.3.6.1.4.1.9.9.1300.1.6.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CdsmrResultType",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Specified the type of information to be placed into the message signal unit or how the it will be processed."
  },
  "cdsmrAddressResultOctet": {
    "name": "cdsmrAddressResultOctet",
    "oid": "1.3.6.1.4.1.9.9.1300.1.6.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CdsmrResultOctet",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Information to be placed in the message signal unit based on the value specified by the cdsmrAddressResultType object. When the cdsmrAddressResultType object is set to 'group' or 'gt' this object will contain the string specifying output. For all other values the this object will not be used in the result processing and will have a length of zero. "
  },
  "cdsmrAddressResultTransType": {
    "name": "cdsmrAddressResultTransType",
    "oid": "1.3.6.1.4.1.9.9.1300.1.6.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CgsccpGttTransType",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The translation type specified within the address in the message signal unit. This object only applies when the cdsmrAddressResultType is set to 'gt' value and the 'tranType' bit is set in the cdsmrAddressResultParameters object."
  },
  "cdsmrAddressResultGti": {
    "name": "cdsmrAddressResultGti",
    "oid": "1.3.6.1.4.1.9.9.1300.1.6.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CgsccpGttGlobalTitleInd",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The global title indicator value for the global tile address specified within the message signal unit. This object only applies when the cdsmrAddressResultType is set to 'gt' value."
  },
  "cdsmrAddressResultNp": {
    "name": "cdsmrAddressResultNp",
    "oid": "1.3.6.1.4.1.9.9.1300.1.6.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNumberingPlan",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The numbering plan for the global tile address specified within the message signal unit. This object only applies when the cdsmrAddressResultType is set to 'gt' value."
  },
  "cdsmrAddressResultNai": {
    "name": "cdsmrAddressResultNai",
    "oid": "1.3.6.1.4.1.9.9.1300.1.6.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNAI",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The nature of specified address for the global tile address specified within the message signal unit. This object only applies when the cdsmrAddressResultType is set to 'gt' value."
  },
  "cdsmrAddressResultPc": {
    "name": "cdsmrAddressResultPc",
    "oid": "1.3.6.1.4.1.9.9.1300.1.6.1.13",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcPointCode",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The point-code to be place in the message signal unit. This object only applies when the cdsmrAddressResultType is set to 'pc' value."
  },
  "cdsmrAddressResultSsn": {
    "name": "cdsmrAddressResultSsn",
    "oid": "1.3.6.1.4.1.9.9.1300.1.6.1.14",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcSubSystemNumber",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The subsystem number to be place in the message signal unit. This object only applies when the cdsmrAddressResultType is set to 'pcSsn' value."
  },
  "cdsmrAddressResultRuleNumber": {
    "name": "cdsmrAddressResultRuleNumber",
    "oid": "1.3.6.1.4.1.9.9.1300.1.6.1.15",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrId",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Processing continues with rule number specified by this object. This object only applies when the cdsmrAddressResultType is set to 'ruleNumber' value."
  },
  "cdsmrAddressMatchCounts": {
    "name": "cdsmrAddressMatchCounts",
    "oid": "1.3.6.1.4.1.9.9.1300.1.6.1.16",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "matches",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of the number of times address was matched. This counter is only incremented when rule matches."
  },
  "cdsmrAddressRowStatus": {
    "name": "cdsmrAddressRowStatus",
    "oid": "1.3.6.1.4.1.9.9.1300.1.6.1.17",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The object is used by a management station to create or delete the row entry in cdsmrAddressTable following the RowStatus textual convention."
  },
  "cdsmrRuleSetTable": {
    "name": "cdsmrRuleSetTable",
    "oid": "1.3.6.1.4.1.9.9.1300.1.7",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table that is used to specify attributes of an application-layer message to be matched and the resulting behavior for handling the message. Entries are added to this table via cdsmrRuleSetRowStatus in accordance with the RowStatus convention."
  },
  "cdsmrRuleSetTableEntry": {
    "name": "cdsmrRuleSetTableEntry",
    "oid": "1.3.6.1.4.1.9.9.1300.1.7.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-ITP-GSP-MIB",
        "object": "cgspInstNetwork",
        "implied": 0
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleSetName",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Each entry in this table represents a set of addresses used to perform non-standard routing of messages signalling units.."
  },
  "cdsmrRuleSetName": {
    "name": "cdsmrRuleSetName",
    "oid": "1.3.6.1.4.1.9.9.1300.1.7.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrRuleSetName",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A name used to define a set rules used to transform traffic."
  },
  "cdsmrRuleSetProtocol": {
    "name": "cdsmrRuleSetProtocol",
    "oid": "1.3.6.1.4.1.9.9.1300.1.7.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrRuleProtocol",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The object is used to establish a default protocol type for all rules within the rule set. If this object is set to 'none' will default to protocol specified by variant."
  },
  "cdsmrRuleSetStartDateAndTime": {
    "name": "cdsmrRuleSetStartDateAndTime",
    "oid": "1.3.6.1.4.1.9.9.1300.1.7.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DateAndTime",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The local date and time when this trigger and sub-triggers will become active. When the value is null then the cdsmrInstStartDateAndTime does not apply. "
  },
  "cdsmrRuleSetEndDateAndTime": {
    "name": "cdsmrRuleSetEndDateAndTime",
    "oid": "1.3.6.1.4.1.9.9.1300.1.7.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DateAndTime",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The local date and time this trigger and sub-triggers will become inactive. When the value is null then the cdsmrInstEndDateAndTime does not apply. "
  },
  "cdsmrRuleSetRowStatus": {
    "name": "cdsmrRuleSetRowStatus",
    "oid": "1.3.6.1.4.1.9.9.1300.1.7.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The object is used by a management station to create or delete the row entry in cdsmrRuleSetTable following the RowStatus textual convention."
  },
  "cdsmrRuleTable": {
    "name": "cdsmrRuleTable",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table that is used to specify attributes of an application-layer message to be matched and the resulting behavior for handling the message. Entries are added to this table via cdsmrRuleResultRowStatus in accordance with the RowStatus convention."
  },
  "cdsmrRuleTableEntry": {
    "name": "cdsmrRuleTableEntry",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-ITP-GSP-MIB",
        "object": "cgspInstNetwork",
        "implied": 0
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleSetName",
        "implied": 0
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleNumber",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Entries in this table are searched in the specified order defined by cdsmrRuleNumber object. "
  },
  "cdsmrRuleNumber": {
    "name": "cdsmrRuleNumber",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrId",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This object specifies the index for a list of secondary triggers specified per routing table. The trigger will be processed in ascending order."
  },
  "cdsmrRuleOperationType": {
    "name": "cdsmrRuleOperationType",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "all": 1,
          "smdPp": 2,
          "smsMo": 3,
          "smsMt": 4,
          "smsSri": 5,
          "smsReg": 6,
          "smsNot": 7,
          "ucpSubmit": 8
        }
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The list of possible operation types. 'all' - All operations types. 'smdPp' - ANSI-41 Short message service delivery point to point. 'smsMo' - GSM-MAP Short message service mobile originated request. 'smsMt' - GSM-MAP Short message service mobile terminated request. 'smsSri' - GSM-MAP send routing info for short message. 'smsReg' - ANSI-41 Short message service request. 'smsNot' - ANSI-41 Short message service notification request 'ucpSubmit' - Match UCP Submit Short Message requests"
  },
  "cdsmrRuleCdrServiceQueue": {
    "name": "cdsmrRuleCdrServiceQueue",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "none": 0,
          "available": 1,
          "congested": 2,
          "unavailable": 3
        }
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Protocol used to examine message. 'none' : CDR Service queue not specified. 'available' : Matches when CDR service queue is available. 'congested' : Matches when CDR service queue is congested. 'unavailable': Matches when CDR service queue is unavailable. "
  },
  "cdsmrRuleInputParameters": {
    "name": "cdsmrRuleInputParameters",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Bits",
      "class": "type",
      "bits": {
        "cdrService": 0,
        "destPort": 1,
        "destSmeGta": 2,
        "destSmeExact": 3,
        "destSmeNai": 4,
        "destSmeNp": 5,
        "destSmeImsi": 6,
        "destSmeMin": 7,
        "destSmeMinDigits": 8,
        "destSmeMaxDigits": 9,
        "destSmeTable": 10,
        "destSmeTableLoc": 11,
        "destSmeTableImsi": 12,
        "destSmeTableMin": 13,
        "destSmeTableNai": 14,
        "destSmeTableNp": 15,
        "destSmscGta": 16,
        "destSmscExact": 17,
        "destSmscNai": 18,
        "destSmscNp": 19,
        "destSmscMinDigits": 20,
        "destSmscMaxDigits": 21,
        "origImsiGta": 22,
        "origImsiExact": 23,
        "origImsiUnknown": 24,
        "origImsiNai": 25,
        "origImsiNp": 26,
        "origImsiMinDigits": 27,
        "origImsiMaxDigits": 28,
        "origImsiTable": 29,
        "origImsiTableLoc": 30,
        "origSmeGta": 31,
        "origSmeExact": 32,
        "origSmeNai": 33,
        "origSmeNp": 34,
        "origSmeMinDigits": 35,
        "origSmeMaxDigits": 36,
        "origSmeTable": 37,
        "origSmeTableLoc": 38,
        "origSmeTableNai": 39,
        "origSmeTableNp": 40,
        "origSmscGta": 41,
        "origSmscExact": 42,
        "origSmscNai": 43,
        "origSmscNp": 44,
        "origSmscMinDigits": 45,
        "origSmscMaxDigits": 46,
        "origSmscTable": 47,
        "origSmscTableLoc": 48,
        "origSmscTableNai": 49,
        "origSmscTableNp": 50,
        "pid": 51,
        "tid": 52,
        "default": 53
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Many of the parameter used in the processing of rules have default values. These values are determined by a combination of variant and operation type. This object will be provide information which parameter has been specified as follows. 'cdrService' : Indicates that CDR service queue parameter is specified in cdsmrRuleCdrServiceQueue 'destPort' : Indicates that the destination Port number is specified in the cdsmrRuleDestPort object. 'destSmeGta' : Indicates that a global title address is specified in the cdsmrRuleDestSmeGta object. 'destSmeExact': Indicates that the cdsmrRuleDestSmeGta address must be an exact match. 'destSmeNai' : Indicates that the nature of specified address is specified in the cdsmrRuleDestSmeNai object. 'destSmeNp' : Indicates that the numbering plan is specified in the cdsmrRuleDestSmeNp object. 'destSmeImsi' : Indicates that the address specified in the International Mobile Subscriber Identification address. This indicator applies to the cdsmrRuleDestSmeGta object. 'destSmeMin' : Indicates that the address specified in the Mobile Identification Number. This indicator applies to the cdsmrRuleDestSmeGta object. 'destSmeMinDigits' : Minimum number global title address digits specified in the cdsmrRuleDestSmeGta object using the cdsmrRuleDestSmeMinDigits object. 'destSmeMaxDigits' : Maximum number global title address digits specified in the cdsmrRuleDestSmeGta object using the cdsmrRuleDestSmeMaxDigits object. 'destSmeTable' : A table of destination short message entity addresses. The name of the table is specified in the cdsmrRuleDestSmeTable object. 'destSmeTableLoc' : Specifies the location of the address table as follows. 'true' - The name specified in the cdsmrRuleDestSmeTable object exists in the cdsmrAddressTable table. 'false' - The name specified in the cdsmrRuleDestSmeTable object exists in the cmlrAddressTableEntry table from the CISCO-ITP-MLR-MIB. 'destSmeTableImsi' : Indicates that the addresses specified in the cdsmrRuleDestSmeTable are International Mobile Subscriber Identification addresses. 'destSmeTableNai' : Indicates that the all nature of specified address is specified in the cdsmrRuleDestSmeTableNai object. 'destSmeTableNp' : Indicates that the numbering plan is specified in the cdsmrRuleDestSmeTableNp object. 'destSmscGta' : Indicates that a global title address is specified in the cdsmrRuleDestSmscGta object. 'destSmscExact' : Indicates that the cdsmrRuleDestSmscGta address must be an exact match. 'destSmscNai' : Indicates that the nature of specified address is specified in the cdsmrRuleDestSmscNai object. 'destSmscNp' : Indicates that the numbering plan is specified in the cdsmrRuleDestSmscNp object. 'destSmscMinDigits' : Minimum number global title address digits specified in the cdsmrRuleDestSmscGta object using the cdsmrRuleDestSmscMinDigits object. 'destSmscMaxDigits' : Maximum number global title address digits specified in the cdsmrRuleDestSmscGta object using the cdsmrRuleDestSmscMaxDigits object. 'origImsiGta' : Indicates that a global title address is specified in the cdsmrRuleDestSmeGta object. 'origImsiExact' : Indicates that the cdsmrRuleDestSmeGta address must be an exact match. 'origImsiUnknown' : Indicates that the rule can match when packets do not contain the orgination IMSI address. That is, when the address is unknown or unspecified. The IMSI address is only specified in map version 3. Therefore, the packets using version 1 or 2 when match when this parameter is specified. 'origImsiNai' : Indicates that the nature of specified address is specified in the cdsmrRuleDestSmeNai object. 'origImsiNp' : Indicates that the numbering plan is specified in the cdsmrRuleDestSmeNp object. 'origImsiMinDigits' : Minimum number global title address digits specified in the cdsmrRuleOrigImsiGta object using the cdsmrRuleOrigImsiMinDigits object. 'origImsiMaxDigits' : Maximum number global title address digits specified in the cdsmrRuleOrigImsiGta object using the cdsmrRuleOrigImsiMaxDigits object. 'origImsiTable' : A table of orgination IMSI addresses. The name of the table is specified in the cdsmrRuleOrigImsiTable object. 'origImsiTableLoc' : Specifies the location of the address table as follows. 'true' - The name specified in the cdsmrRuleOrigImsiTable object exists in the cdsmrAddressTable table. 'false' - The name specified in the cdsmrRuleOrigImsiTable object exists in the cmlrAddressTableEntry table from the CISCO-ITP-MLR-MIB. 'origSmeGta' : Indicates that a global title address is specified in the cdsmrRuleOrigSmeGta object. 'origSmeExact': Indicates that the cdsmrRuleOrigSmeGta address must be an exact match. 'origSmeNai' : Indicates that the nature of specified address is specified in the cdsmrRuleOrigSmeNai object. 'origSmeNp' : Indicates that the numbering plan is specified in the cdsmrRuleOrigSmeNp object. 'origSmeMinDigits' : Minimum number global title address digits specified in the cdsmrRuleOrigSmeGta object using the cdsmrRuleOrigSmeMinDigits object. 'origSmeMaxDigits' : Maximum number global title address digits specified in the cdsmrRuleOrigSmeGta object using the cdsmrRuleOrigSmeMaxDigits object. 'origSmeTable': A table of origination short message entity addresses. The name of the table is specified in the cdsmrRuleOrigSmeTable object. 'origSmeTableLoc': : Specifies the location of the address table as follows. 'true' - The name specified in the cdsmrRuleOrigSmeTable object exists in the cdsmrAddressTable table. 'false' - The name specified in the cdsmrRuleOrigSmeTable object exists in the cmlrAddressTableEntry table from the CISCO-ITP-MLR-MIB. 'origSmeTableNai' : Indicates that the all nature of specified address is specified in the cdsmrRuleOrigSmeTableNai object. 'origSmeTableNp' : Indicates that the numbering plan is specified in the cdsmrRuleOrigSmeTableNp object. 'origSmscGta' : Indicates that a global title address is specified in the cdsmrRuleOrigSmscGta object. 'origSmscExact':Indicates that the cdsmrRuleOrigSmeGta address must be an exact match. 'origSmscNai' : Indicates that the nature of specified address is specified in the cdsmrRuleOrigSmscNai object. 'origSmscNp' : Indicates that the numbering plan is specified in the cdsmrRuleOrigSmscNp object. 'origSmscMinDigits' : Minimum number global title address digits specified in the cdsmrRuleOrigSmscGta object using the cdsmrRuleOrigSmscMinDigits object. 'origSmscMaxDigits' : Maximum number global title address digits specified in the cdsmrRuleOrigSmscGta object using the cdsmrRuleOrigSmscMaxDigits object. 'origSmscTable' : A table of Short Message Service Center addresses. The name of the table is specified in the cdsmrRuleOrigSmscTable object. 'origSmscTableLoc' : Specifies the location of the address table as follows. 'true' - The name specified in the cdsmrRuleOrigSmscTable object exists in the cdsmrAddressTable table. 'false' - The name specified in the cdsmrRuleOrigSmscTable object exists in the cmlrAddressTableEntry table from the CISCO-ITP-MLR-MIB. 'origSmscTableNai' : Indicates that the all nature of specified address is specified in the cdsmrRuleOrigSmscTableNai object. 'origSmscTableNp' : Indicates that the numbering plan is specified in the cdsmrRuleOrigSmscTableNp object. 'pid' : Indicates that the Protocol Identifier has been specified in the cdsmrRuleProtocolId object. 'tid' : Indicates that the Teleservice Identifier has been specified in the cdsmrRuleTeleserviceId object. "
  },
  "cdsmrRuleDestPort": {
    "name": "cdsmrRuleDestPort",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "A destination application port number. The value of the port number maps to the values specified in the User Data Header (UDH) of the SMS message. This object only applies when the 'destPort' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleDestSmeGta": {
    "name": "cdsmrRuleDestSmeGta",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcGtaLongDisplay",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The destination short message entity global title address. When the length of the global title address is zero it specified a wildcard match and all global title will match GTA clause of rule. This object only applies when the 'destSmeGta' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleDestSmeNai": {
    "name": "cdsmrRuleDestSmeNai",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNAI",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The nature of specified address for the destination short message entity global title address specified within the message signal unit. This object only applies when the 'destSmeNai' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleDestSmeNp": {
    "name": "cdsmrRuleDestSmeNp",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNumberingPlan",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The numbering plan for the destination short message entity global title address specified within the message signal unit. This object only applies when the 'destSmeNp' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleDestSmeMinDigits": {
    "name": "cdsmrRuleDestSmeMinDigits",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CdsmrMinimumDigits",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Specifies the minimum number of digits that the global title address specified by the cdsmrRuleDestSmeGta object can contain for rule to match. This object only applies when the 'destSmeMinDigits' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleDestSmeMaxDigits": {
    "name": "cdsmrRuleDestSmeMaxDigits",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CdsmrMaximumDigits",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Specifies the maximum number of digits that the global title address specified by the cdsmrRuleDestSmeGta object can contain for rule to match. This object only applies when the 'destSmeMaxDigits' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleDestSmeTable": {
    "name": "cdsmrRuleDestSmeTable",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrName",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The name of the entry in the cdsmrAddressTable that will be searched for matches. The table will be search for the following types of addresses based on values set in the cdsmrRuleInputParameters object. This object only applies when the 'destSmeTable' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleDestSmeTableNai": {
    "name": "cdsmrRuleDestSmeTableNai",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNAI",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The nature of specified address for the global tile address specified within the message signal unit. This object only applies when the 'destSmeTableNai' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleDestSmeTableNp": {
    "name": "cdsmrRuleDestSmeTableNp",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.13",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNumberingPlan",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The numbering plan for the destination short message service center global title address specified within the message signal unit. This object only applies when the 'destSmeTableNp' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleDestSmscGta": {
    "name": "cdsmrRuleDestSmscGta",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.14",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcGtaLongDisplay",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The destination short message service center global title address. When the length of the global title address is zero it specified a wildcard match and all global title will match GTA clause of rule. This object only applies when the 'destSmscGta' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleDestSmscNai": {
    "name": "cdsmrRuleDestSmscNai",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.15",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNAI",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The nature of specified address for the destination short message service center global title address specified within the message signal unit. This object only applies when the 'destSmscNai' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleDestSmscNp": {
    "name": "cdsmrRuleDestSmscNp",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.16",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNumberingPlan",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The numbering plan for the destination short message service center global title address specified within the message signal unit. This object only applies when the 'destSmscNp' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleDestSmscMinDigits": {
    "name": "cdsmrRuleDestSmscMinDigits",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.17",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CdsmrMinimumDigits",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Specifies the minimum number of digits that the global title address specified by the cdsmrRuleDestSmscGta object can contain for rule to match. This object only applies when the 'destSmscMinDigits' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleDestSmscMaxDigits": {
    "name": "cdsmrRuleDestSmscMaxDigits",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.18",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CdsmrMaximumDigits",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Specifies the maximum number of digits that the global title address specified by the cdsmrRuleDestSmscGta object can contain for rule to match. This object only applies when the 'destSmscMaxDigits' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleOrigImsiGta": {
    "name": "cdsmrRuleOrigImsiGta",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.19",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcGtaLongDisplay",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The origination short message entity global title address. When the length of the global title address is zero it specified a wildcard match and all global title will match GTA clause of rule. This object only applies when the 'origImsiGta' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleOrigImsiNai": {
    "name": "cdsmrRuleOrigImsiNai",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.20",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNAI",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The nature of specified address for the origination short message entity global title address specified within the message signal unit. This object only applies when the 'origImsiNai' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleOrigImsiNp": {
    "name": "cdsmrRuleOrigImsiNp",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.21",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNumberingPlan",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The numbering plan for the origination short message entity global title address specified within the message signal unit. This object only applies when the 'origImsiNp' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleOrigImsiMinDigits": {
    "name": "cdsmrRuleOrigImsiMinDigits",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.22",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CdsmrMinimumDigits",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Specifies the minimum number of digits that the global title address specified by the cdsmrRuleOrigImsiGta object can contain for rule to match. This object only applies when the 'origImsiMinDigits' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleOrigImsiMaxDigits": {
    "name": "cdsmrRuleOrigImsiMaxDigits",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.23",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CdsmrMaximumDigits",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Specifies the maximum number of digits that the global title address specified by the cdsmrRuleOrigImsiGta object can contain for rule to match. This object only applies when the 'origImsiMaxDigits' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleOrigImsiTable": {
    "name": "cdsmrRuleOrigImsiTable",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.24",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrName",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The name of the entry in the cdsmrAddressTable that will be searched for matches. The table will be search for the following types of addresses based on values set in the cdsmrRuleInputParameters object. This object only applies when the 'origImsiTable' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleOrigSmeGta": {
    "name": "cdsmrRuleOrigSmeGta",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.25",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcGtaLongDisplay",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The origination short message entity global title address. When the length of the global title address is zero it specified a wildcard match and all global title will match GTA clause of rule. This object only applies when the 'origSmeGta' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleOrigSmeNai": {
    "name": "cdsmrRuleOrigSmeNai",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.26",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNAI",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The nature of specified address for the origination short message entity global title address specified within the message signal unit. This object only applies when the 'origSmeNai' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleOrigSmeNp": {
    "name": "cdsmrRuleOrigSmeNp",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.27",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNumberingPlan",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The numbering plan for the origination short message entity global title address specified within the message signal unit. This object only applies when the 'origSmeNp' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleOrigSmeMinDigits": {
    "name": "cdsmrRuleOrigSmeMinDigits",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.28",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CdsmrMinimumDigits",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Specifies the minimum number of digits that the global title address specified by the cdsmrRuleOrigSmeGta object can contain for rule to match. This object only applies when the 'origSmeMinDigits' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleOrigSmeMaxDigits": {
    "name": "cdsmrRuleOrigSmeMaxDigits",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.29",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CdsmrMaximumDigits",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Specifies the maximum number of digits that the global title address specified by the cdsmrRuleOrigSmeGta can contain for rule to match. This object only applies when the 'origSmeMaxDigits' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleOrigSmeTable": {
    "name": "cdsmrRuleOrigSmeTable",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.30",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrName",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The name of the entry in the cdsmrAddressTable that will be searched for matches. The table will be search for the following types of addresses based on values set in the cdsmrRuleInputParameters object. This object only applies when the 'origSmeTable' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleOrigSmeTableNai": {
    "name": "cdsmrRuleOrigSmeTableNai",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.31",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNAI",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The nature of specified address for the global tile address specified within the message signal unit. This object only applies when the 'origSmeTableNai' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleOrigSmeTableNp": {
    "name": "cdsmrRuleOrigSmeTableNp",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.32",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNumberingPlan",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The numbering plan for the destination short message service center global title address specified within the message signal unit. This object only applies when the 'origSmeTableNp' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleOrigSmscGta": {
    "name": "cdsmrRuleOrigSmscGta",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.33",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcGtaLongDisplay",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The origination short message service center global title address. When the length of the global title address is zero it specified a wildcard match and all global title will match GTA clause of rule. This object only applies when the 'origSmscGta' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleOrigSmscNai": {
    "name": "cdsmrRuleOrigSmscNai",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.34",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNAI",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The nature of specified address for the origination short message service center global title address specified within the message signal unit. This object only applies when the 'origSmscNai' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleOrigSmscNp": {
    "name": "cdsmrRuleOrigSmscNp",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.35",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNumberingPlan",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The numbering plan for the origination short message service center global title address specified within the message signal unit. This object only applies when the 'origSmscNp' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleOrigSmscMinDigits": {
    "name": "cdsmrRuleOrigSmscMinDigits",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.36",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CdsmrMinimumDigits",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Specifies the minimum number of digits that the global title address specified by the cdsmrRuleOrigSmscGta object can contain for rule to match. This object only applies when the 'origSmscMinDigits' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleOrigSmscMaxDigits": {
    "name": "cdsmrRuleOrigSmscMaxDigits",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.37",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CdsmrMaximumDigits",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Specifies the maximum number of digits that the global title address specified by the cdsmrRuleOrigSmscGta object can contain for rule to match. This object only applies when the 'origSmscMaxDigits' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleOrigSmscTable": {
    "name": "cdsmrRuleOrigSmscTable",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.38",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrName",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The name of the entry in the cdsmrAddressTable that will be searched for matches. The table will be search for the following types of addresses based on values set in the cdsmrRuleInputParameters object. This object only applies when the 'origSmscTable' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleOrigSmscTableNai": {
    "name": "cdsmrRuleOrigSmscTableNai",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.39",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNAI",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The nature of specified address for the global tile address specified within the message signal unit. This object only applies when the 'origSmscTableNai' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleOrigSmscTableNp": {
    "name": "cdsmrRuleOrigSmscTableNp",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.40",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNumberingPlan",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The numbering plan for the destination short message service center global title address specified within the message signal unit. This object only applies when the 'origSmscTableNp' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleProtocolId": {
    "name": "cdsmrRuleProtocolId",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.41",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 255
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The protocol identifier value used for the 'smsMo and 'smsMt' operations specified by the cdsmrRuleParmsOperationType object. The value of the cdsmrRuleParmsMatchPid object maps to the values specified for the TP-PID SMS parameter. This object only applies when the 'pid' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleTeleserviceId": {
    "name": "cdsmrRuleTeleserviceId",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.42",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The Teleservice identifier value for the following types of operations specified by the cdsmrRuleParmsOperationType object. 'smdPp' 'smsMo' 'smsMt' 'smsNotify' The value of the cdsmrRuleParmsMatchTid object maps to the values specified for the SMS_TeleserviceIdentifier parameter in ANSI-41. This object only applies when the 'tid' bit is set in the cdsmrRuleInputParameters object."
  },
  "cdsmrRuleResultParameters": {
    "name": "cdsmrRuleResultParameters",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.43",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CdsmrResultParameters",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Many of the parameter used in the processing of rules have default values. These values are determined by a combination of variant and operation type. This object will be provide information on which parameter have been specified as follows. 'network' : cdsmrRuleSetResultNetwork 'octet' : cdsmrRuleSetResultOctet 'tranType' : cdsmrRuleResultTransType 'gti' : cdsmrRuleResultGti 'np' : cdsmrRuleResultNp 'nai' : cdsmrRuleResultNai 'pc' : cdsmrRuleResultPc 'ssn' : cdsmrRuleResultSsn 'ruleNumber': cdsmrRuleResultRuleNumber"
  },
  "cdsmrRuleResultNetwork": {
    "name": "cdsmrRuleResultNetwork",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.44",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNetworkName",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The network name is used to indicate the network in which the result operation will be performed."
  },
  "cdsmrRuleResultType": {
    "name": "cdsmrRuleResultType",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.45",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CdsmrResultType",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Specified the type of information to be placed into the message signal unit or how the it will be processed."
  },
  "cdsmrRuleResultOctet": {
    "name": "cdsmrRuleResultOctet",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.46",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CdsmrResultOctet",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Information to be placed in the message signal unit based on the value specified by the cdsmrRuleSetResultType object. When the cdsmrRuleSetResultType object is set to 'pc' or 'none' this object will not be used in the result processing and will have a length of zero."
  },
  "cdsmrRuleResultTransType": {
    "name": "cdsmrRuleResultTransType",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.47",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CgsccpGttTransType",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The translation type specified within the address in the message signal unit. This object only applies when the cdsmrRuleSetResultType is set to 'gt' value."
  },
  "cdsmrRuleResultGti": {
    "name": "cdsmrRuleResultGti",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.48",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CgsccpGttGlobalTitleInd",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The global title indicator value for the global tile address specified within the message signal unit. This object only applies when the cdsmrRuleSetResultType is set to 'gt' value."
  },
  "cdsmrRuleResultNp": {
    "name": "cdsmrRuleResultNp",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.49",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNumberingPlan",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The numbering plan for the global tile address specified within the message signal unit. This object only applies when the cdsmrRuleSetResultType is set to 'gt' value."
  },
  "cdsmrRuleResultNai": {
    "name": "cdsmrRuleResultNai",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.50",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcNAI",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The nature of specified address for the global tile address specified within the message signal unit. This object only applies when the cdsmrRuleSetResultType is set to 'gt' value."
  },
  "cdsmrRuleResultPc": {
    "name": "cdsmrRuleResultPc",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.51",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcPointCode",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The point-code to be place in the message signal unit. This object only applies when the cdsmrRuleResultType is set to 'pc' value."
  },
  "cdsmrRuleResultSsn": {
    "name": "cdsmrRuleResultSsn",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.52",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CItpTcSubSystemNumber",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The subsystem number to be place in the message signal unit. This object only applies when the cdsmrRuleResultType is set to 'ssn' value."
  },
  "cdsmrRuleResultRuleNumber": {
    "name": "cdsmrRuleResultRuleNumber",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.53",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CmlrId",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object specifies the next rule to execute when rule matches. The specified rule number must be greater than current rule."
  },
  "cdsmrRuleResultRowStatus": {
    "name": "cdsmrRuleResultRowStatus",
    "oid": "1.3.6.1.4.1.9.9.1300.1.8.1.54",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The object is used by a management station to create or delete the row entry in cdsmrRuleTable following the RowStatus textual convention."
  },
  "cdsmrRuleStatsTable": {
    "name": "cdsmrRuleStatsTable",
    "oid": "1.3.6.1.4.1.9.9.1300.1.9",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table that is used to specify attributes of an application-layer message to be matched and the resulting behavior for handling the message."
  },
  "cdsmrRuleStatsTableEntry": {
    "name": "cdsmrRuleStatsTableEntry",
    "oid": "1.3.6.1.4.1.9.9.1300.1.9.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-ITP-GSP-MIB",
        "object": "cgspInstNetwork",
        "implied": 0
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleSetName",
        "implied": 0
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleNumber",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Entries in this table provide measurements for entries in cdsmrRuleTable."
  },
  "cdsmrRuleStatsCheckedCounts": {
    "name": "cdsmrRuleStatsCheckedCounts",
    "oid": "1.3.6.1.4.1.9.9.1300.1.9.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "checks",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of the number of times this rule was checked."
  },
  "cdsmrRuleStatsMatchCounts": {
    "name": "cdsmrRuleStatsMatchCounts",
    "oid": "1.3.6.1.4.1.9.9.1300.1.9.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "matches",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of the number of times this rule was matched."
  },
  "cdsmrRuleStatsRoutedCounts": {
    "name": "cdsmrRuleStatsRoutedCounts",
    "oid": "1.3.6.1.4.1.9.9.1300.1.9.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "successes",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Count of the number of times this rule was matched and packet was routed using mechanism specified by result."
  },
  "ciscoItpDsmrTableLoad": {
    "name": "ciscoItpDsmrTableLoad",
    "oid": "1.3.6.1.4.1.9.9.1300.0.1",
    "class": "notificationtype",
    "objects": [
      {
        "module": "CISCO-ITP-GSP-MIB",
        "object": "cgspEventSequenceNumber"
      },
      {
        "module": "CISCO-ITP-GSP-MIB",
        "object": "cgspCLLICode"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrInstLoadStatus"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrInstLastURL"
      }
    ],
    "status": "current",
    "description": "This notification is generated whenever a load operation is started or completed."
  },
  "ciscoItpDsmrMIBCompliances": {
    "name": "ciscoItpDsmrMIBCompliances",
    "oid": "1.3.6.1.4.1.9.9.1300.2.1",
    "class": "objectidentity"
  },
  "ciscoItpDsmrMIBGroups": {
    "name": "ciscoItpDsmrMIBGroups",
    "oid": "1.3.6.1.4.1.9.9.1300.2.2",
    "class": "objectidentity"
  },
  "ciscoItpDsmrMIBCompliance": {
    "name": "ciscoItpDsmrMIBCompliance",
    "oid": "1.3.6.1.4.1.9.9.1300.2.1.1",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "ciscoItpDsmrInstanceGroup",
        "module": "CISCO-ITP-DSMR-MIB"
      },
      {
        "object": "ciscoItpDsmrResultGroup",
        "module": "CISCO-ITP-DSMR-MIB"
      },
      {
        "object": "ciscoItpDsmrAddressGroup",
        "module": "CISCO-ITP-DSMR-MIB"
      },
      {
        "object": "ciscoItpDsmrRulesGroup",
        "module": "CISCO-ITP-DSMR-MIB"
      },
      {
        "object": "ciscoItpDsmrNotificationsGroup",
        "module": "CISCO-ITP-DSMR-MIB"
      }
    ],
    "status": "current",
    "description": "The compliance statement for entities which implement the Cisco CISCO-ITP-MLR-MIB"
  },
  "ciscoItpDsmrInstanceGroup": {
    "name": "ciscoItpDsmrInstanceGroup",
    "oid": "1.3.6.1.4.1.9.9.1300.2.2.1",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrTableLoadNotifEnabled"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrInstLastChanged"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrInstLastLoadTime"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrInstLoadStatus"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrInstLastURL"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrInstDeliveredSmppCounts"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrInstDeliveredUcpCounts"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrInstDeliveredGsmCounts"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrInstDeferredGsmCounts"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrInstGsmStatusReports"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrInstUcpNotifications"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrInstSmppDeliveryReceipts"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrInstRoutingFailures"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrInstResultFailures"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrInstInternalErrors"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrInstParseErrors"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrInstResourceErrors"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrInstProvisioningErrors"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrInstDestUnreachableErrors"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrInstDestSignalErrors"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrInstTimeOuts"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrInstBlockedPackets"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrInstRoutingRequestsRcvdGsm"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrInstRoutingRequestsRcvdIs41"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrInstRoutingRequestsRcvdUcp"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrInstRoutingRequestsRcvdSmpp"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrInstRowStatus"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing information on DSMR per instance of signalling point."
  },
  "ciscoItpDsmrResultGroup": {
    "name": "ciscoItpDsmrResultGroup",
    "oid": "1.3.6.1.4.1.9.9.1300.2.2.2",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultGroupServerType"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultGroupCdrConsolidation"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultGroupIdentifier"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultGroupQueueLimit"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultGroupQueueTimeLimit"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultGroupMatchSmppId"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultGroupMatchSmppType"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultGroupMatchUcpId"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultGroupRowStatus"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultDestinationType"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultParameters"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultDestinationName"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultPc"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultSsn"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultGt"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultTransType"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultGti"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultNp"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultNai"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultWeight"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultCounts"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultNetwork"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultRowStatus"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultIpRemotePortNumber"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultIpRemoteIpAddrType"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultIpRemoteIpAddress"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultIpProfileName"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultIpWeight"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrResultIpRowStatus"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing information used to configure distributed short message routing result groups and entries."
  },
  "ciscoItpDsmrAddressGroup": {
    "name": "ciscoItpDsmrAddressGroup",
    "oid": "1.3.6.1.4.1.9.9.1300.2.2.3",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrAddressResultParameters"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrAddressResultNetwork"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrAddressResultType"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrAddressResultOctet"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrAddressResultTransType"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrAddressResultGti"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrAddressResultNp"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrAddressResultNai"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrAddressResultPc"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrAddressResultSsn"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrAddressResultRuleNumber"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrAddressMatchCounts"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrAddressRowStatus"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing information used to configure distributed short message routing address tables."
  },
  "ciscoItpDsmrRulesGroup": {
    "name": "ciscoItpDsmrRulesGroup",
    "oid": "1.3.6.1.4.1.9.9.1300.2.2.4",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleSetProtocol"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleSetStartDateAndTime"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleSetEndDateAndTime"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleSetRowStatus"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleOperationType"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleCdrServiceQueue"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleInputParameters"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleDestPort"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleDestSmeGta"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleDestSmeNai"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleDestSmeNp"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleDestSmeMinDigits"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleDestSmeMaxDigits"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleDestSmeTable"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleDestSmeTableNai"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleDestSmeTableNp"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleDestSmscGta"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleDestSmscNai"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleDestSmscNp"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleDestSmscMinDigits"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleDestSmscMaxDigits"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleOrigImsiGta"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleOrigImsiNai"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleOrigImsiNp"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleOrigImsiMinDigits"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleOrigImsiMaxDigits"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleOrigImsiTable"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleOrigSmeGta"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleOrigSmeNai"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleOrigSmeNp"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleOrigSmeMinDigits"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleOrigSmeMaxDigits"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleOrigSmeTable"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleOrigSmeTableNai"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleOrigSmeTableNp"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleOrigSmscGta"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleOrigSmscNai"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleOrigSmscNp"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleOrigSmscMinDigits"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleOrigSmscMaxDigits"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleOrigSmscTable"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleOrigSmscTableNai"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleOrigSmscTableNp"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleProtocolId"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleTeleserviceId"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleResultParameters"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleResultNetwork"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleResultType"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleResultOctet"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleResultTransType"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleResultGti"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleResultNp"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleResultNai"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleResultPc"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleResultSsn"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleResultRuleNumber"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleResultRowStatus"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleStatsMatchCounts"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleStatsCheckedCounts"
      },
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "cdsmrRuleStatsRoutedCounts"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing information used to configure rules used for distributed short message routing."
  },
  "ciscoItpDsmrNotificationsGroup": {
    "name": "ciscoItpDsmrNotificationsGroup",
    "oid": "1.3.6.1.4.1.9.9.1300.2.2.6",
    "class": "notificationgroup",
    "objects": [
      {
        "module": "CISCO-ITP-DSMR-MIB",
        "object": "ciscoItpDsmrTableLoad"
      }
    ],
    "status": "current",
    "description": "Distributed short message routing notification objects."
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/CISCO-ITP-DSMR-MIB",
      "Produced by pysmi-0.3.4 at Fri May 24 17:07:21 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "CISCO-ITP-DSMR-MIB"
  }
}