{
  "imports": {
    "class": "imports",
    "CISCO-SMI": [
      "ciscoMgmt"
    ],
    "CISCO-TC": [
      "CiscoBridgeDomain"
    ],
    "SNMP-FRAMEWORK-MIB": [
      "SnmpAdminString"
    ],
    "SNMPv2-CONF": [
      "NOTIFICATION-GROUP",
      "MODULE-COMPLIANCE",
      "OBJECT-GROUP"
    ],
    "SNMPv2-SMI": [
      "MibIdentifier",
      "TimeTicks",
      "OBJECT-TYPE",
      "MODULE-IDENTITY",
      "Counter32",
      "NOTIFICATION-TYPE",
      "OBJECT-IDENTITY",
      "IpAddress",
      "Bits",
      "Integer32",
      "Counter64",
      "Unsigned32",
      "Gauge32",
      "iso"
    ],
    "SNMPv2-TC": [
      "StorageType",
      "DisplayString",
      "TEXTUAL-CONVENTION",
      "RowStatus"
    ]
  },
  "ciscoContextMappingMIB": {
    "name": "ciscoContextMappingMIB",
    "oid": "1.3.6.1.4.1.9.9.468",
    "class": "moduleidentity",
    "revisions": [
      {
        "revision": "2008-11-22 00:00",
        "description": "Added New Table cContextMappingLicenseGroupTable to provide SNMP Context support for license package groups. Added cContextMappingLicenseGroupDataGroup in OBJECT-GROUP Added cContextMappingMIBComplianceRev2 in MODULE-COMPLIANCE Updated the MIB description to indicate the use of the above additions"
      },
      {
        "revision": "2008-05-30 00:00",
        "description": "Add cContextMappingBridgeInstanceTable. Added cContextMappingBridgeInstanceDataGroup. Deprecated cContextMappingMIBComplianceRev1 and added cContextMappingMIBComplianceRev2 compliance statement."
      },
      {
        "revision": "2008-02-01 00:00",
        "description": "Added New Table cContextMappingBridgeDomainTable to provide SNMP context support to the Bridge Domain. Added cContextMappingBridgeDomainDataGroup in OBJECT-GROUP Added cContextMappingMIBComplianceRev1 in MODULE-COMPLIANCE"
      },
      {
        "revision": "2005-03-17 00:00",
        "description": "Initial version of the MIB module."
      }
    ],
    "lastupdated": "200811220000Z",
    "organization": "Cisco Systems, Inc.",
    "contactinfo": "Cisco Systems Customer Service Postal: 170 W Tasman Drive San Jose, CA 95134 USA Tel: +1 800 553-NETS E-mail: cs-snmp@cisco.com",
    "description": "A single SNMP agent sometimes needs to support multiple instances of the same MIB module, and does so through the use of multiple SNMP contexts. This typically occurs because the technology has evolved to have extra dimension(s), i.e., one or more extra data and/or identifier values which are different in the different contexts, but were not defined in INDEX clause(s) of the original MIB module. In such cases, network management applications need to know the specific data/identifier values in each context, and this MIB module provides mapping tables which contain that information. Within a network there can be multiple Virtual Private Networks (VPNs) configured using Virtual Routing and Forwarding Instances (VRFs). Within a VPN there can be multiple topologies when Multi-topology Routing (MTR) is used. Also, Interior Gateway Protocols (IGPs) can have multiple protocol instances running on the device. A network can have multiple broadcast domains configured using Bridge Domain Identifiers. With MTR routing, VRFs, and Bridge domains, a router now needs to support multiple instances of several existing MIB modules, and this can be achieved if the router's SNMP agent provides access to each instance of the same MIB module via a different SNMP context (see Section 3.1.1 of RFC 3411). For MTR routing, VRFs, and Bridge domains, a different SNMP context is needed depending on one or more of the following: the VRF, the topology-identifier, the routing protocol instance, and the bridge domain identifier. In other words, the router's management information can be accessed through multiple SNMP contexts where each such context represents a specific VRF, a specific topology-identifier, a specific routing protocol instance and/or a bridge domain identifier. This MIB module provides a mapping of each such SNMP context to the corresponding VRF, the corresponding topology, the corresponding routing protocol instance, and the corresponding bridge domain identifier. Some SNMP contexts are independent of VRFs, independent of a topology, independent of a routing protocol instance, or independent of a bridge domain and in such a case, the mapping is to the zero length string. With the Cisco package licensing strategy, the features available in the image are grouped into multiple packages and each packages can be managed to operate at different feature levels based on the available license. This MIB module provides option to associate an SNMP context to a feature package group. This will allow manageability of license MIB objects specific to a feature package group. As technology evolves more we may need additional identifiers to identify the context. Then we would need to add those additional identifiers into the mapping."
  },
  "cContextMappingMIBObjects": {
    "name": "cContextMappingMIBObjects",
    "oid": "1.3.6.1.4.1.9.9.468.1",
    "class": "objectidentity"
  },
  "cContextMappingMIBConformance": {
    "name": "cContextMappingMIBConformance",
    "oid": "1.3.6.1.4.1.9.9.468.2",
    "class": "objectidentity"
  },
  "cContextMappingTable": {
    "name": "cContextMappingTable",
    "oid": "1.3.6.1.4.1.9.9.468.1.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains information on which cContextMappingVacmContextName is mapped to which VRF, topology, and routing protocol instance. This table is indexed by SNMP VACM context. Configuring a row in this table for an SNMP context does not require that the context be already defined, i.e., a row can be created in this table for a context before the corresponding row is created in RFC 3415's vacmContextTable. To create a row in this table, a manager must set cContextMappingRowStatus to either 'createAndGo' or 'createAndWait'. To delete a row in this table, a manager must set cContextMappingRowStatus to 'destroy'."
  },
  "cContextMappingEntry": {
    "name": "cContextMappingEntry",
    "oid": "1.3.6.1.4.1.9.9.468.1.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-CONTEXT-MAPPING-MIB",
        "object": "cContextMappingVacmContextName",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Information relating to a single mapping of cContextMappingVacmContextName to the corresponding VRF, the corresponding topology, and the corresponding routing protocol instance."
  },
  "cContextMappingVacmContextName": {
    "name": "cContextMappingVacmContextName",
    "oid": "1.3.6.1.4.1.9.9.468.1.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 32
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The vacmContextName given to the SNMP context. This is a human readable name identifying a particular SNMP VACM context at a particular SNMP entity. The empty contextName (zero length) represents the default context."
  },
  "cContextMappingVrfName": {
    "name": "cContextMappingVrfName",
    "oid": "1.3.6.1.4.1.9.9.468.1.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 32
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The value of an instance of this object identifies the name given to the VRF to which the SNMP context is mapped to. This is typically a human-readable string. This is the same ASCII string used in the router's console interface to refer to this VRF. When the value of this object is the zero length string it indicates that the SNMP context is independent of any VRF."
  },
  "cContextMappingTopologyName": {
    "name": "cContextMappingTopologyName",
    "oid": "1.3.6.1.4.1.9.9.468.1.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 32
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The value of an instance of this object identifies the name given to the topology to which the SNMP context is mapped to. This is typically a human-readable string. This is the same ASCII string used in the router's console interface to refer to this topology. When the value of this object is the zero length string it indicates that the SNMP context is independent of any topology."
  },
  "cContextMappingProtoInstName": {
    "name": "cContextMappingProtoInstName",
    "oid": "1.3.6.1.4.1.9.9.468.1.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 32
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The value of an instance of this object identifies the name given to the protocol instance to which the SNMP context is mapped to. This is typically a human-readable string. This is the same ASCII string used in the router's console interface to refer to this protocol instance. When the value of this object is the zero length string it indicates that the SNMP context is independent of any protocol instance."
  },
  "cContextMappingStorageType": {
    "name": "cContextMappingStorageType",
    "oid": "1.3.6.1.4.1.9.9.468.1.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "StorageType",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "nonVolatile",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The storage type for this conceptual row. Conceptual rows having the value 'permanent' need not allow write-access to any columnar objects in the row."
  },
  "cContextMappingRowStatus": {
    "name": "cContextMappingRowStatus",
    "oid": "1.3.6.1.4.1.9.9.468.1.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object facilitates the creation, modification, or deletion of a conceptual row in this table."
  },
  "cContextMappingBridgeDomainTable": {
    "name": "cContextMappingBridgeDomainTable",
    "oid": "1.3.6.1.4.1.9.9.468.1.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains information on which cContextMappingVacmContextName is mapped to which bridge domain. A Bridge Domain is one of the means by which it is possible to define an Ethernet broadcast domain on a bridging device. A network can have multiple broadcast domains configured. This table helps the network management personnel to find out the details of various broadcast domains configured in the network. An entry need to exist in cContextMappingTable, to create an entry in this table."
  },
  "cContextMappingBridgeDomainEntry": {
    "name": "cContextMappingBridgeDomainEntry",
    "oid": "1.3.6.1.4.1.9.9.468.1.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-CONTEXT-MAPPING-MIB",
        "object": "cContextMappingVacmContextName",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Information relating to a single mapping of cContextMappingVacmContextName to the corresponding bridge domain. To create a row in this table, a manager must set cContextMappingBridgeDomainRowStatus to either 'createAndGo' or 'createAndWait'. To delete a row in this table, a manager must set cContextMappingBridgeDomainRowStatus to 'destroy'."
  },
  "cContextMappingBridgeDomainIdentifier": {
    "name": "cContextMappingBridgeDomainIdentifier",
    "oid": "1.3.6.1.4.1.9.9.468.1.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CiscoBridgeDomain",
      "class": "type"
    },
    "maxaccess": "read-create",
    "reference": "CISCO-BRIDGE-DOMAIN-MIB",
    "status": "current",
    "description": "The value of an instance of this object identifies the bridge domain to which the SNMP context is mapped to."
  },
  "cContextMappingBridgeDomainStorageType": {
    "name": "cContextMappingBridgeDomainStorageType",
    "oid": "1.3.6.1.4.1.9.9.468.1.2.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "StorageType",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "nonVolatile",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The storage type for this conceptual row. Conceptual rows having the value 'permanent' need not allow write-access to any columnar objects in the row."
  },
  "cContextMappingBridgeDomainRowStatus": {
    "name": "cContextMappingBridgeDomainRowStatus",
    "oid": "1.3.6.1.4.1.9.9.468.1.2.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object facilitates the creation, modification, or deletion of a conceptual row in this table."
  },
  "cContextMappingBridgeInstanceTable": {
    "name": "cContextMappingBridgeInstanceTable",
    "oid": "1.3.6.1.4.1.9.9.468.1.3",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "reference": "BRIDGE-MIB",
    "status": "current",
    "description": "This table contains information on mapping between cContextMappingVacmContextName and bridge instance. Bridge instance is an instance of a physical or logical bridge which has unique bridge-id. If an entry is deleted from cContextMappingTable, the corresponding entry in this table will also get deleted. If an entry needs to be created in this table, the corresponding entry must exist in cContextMappingTable."
  },
  "cContextMappingBridgeInstanceEntry": {
    "name": "cContextMappingBridgeInstanceEntry",
    "oid": "1.3.6.1.4.1.9.9.468.1.3.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-CONTEXT-MAPPING-MIB",
        "object": "cContextMappingVacmContextName",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Information relating to a single mapping of cContextMappingVacmContextName to the corresponding bridge instance. To create a row in this table, a manager must set cContextMappingBridgeInstRowStatus to either 'createAndGo' or 'createAndWait'. To delete a row in this table, a manager must set cContextMappingBridgeInstRowStatus to 'destroy'."
  },
  "cContextMappingBridgeInstName": {
    "name": "cContextMappingBridgeInstName",
    "oid": "1.3.6.1.4.1.9.9.468.1.3.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The object identifies the name given to bridge instance to which the SNMP context is mapped to. Value of this object cannot be changed when the RowStatus object in the same row is 'active'. This is typically a human-readable string. This is the same ASCII string used in the router's console interface to refer to this bridge instance. When the value of this object is a zero length string, it indicates that the SNMP context is independent of any bridge instances."
  },
  "cContextMappingBridgeInstStorageType": {
    "name": "cContextMappingBridgeInstStorageType",
    "oid": "1.3.6.1.4.1.9.9.468.1.3.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "StorageType",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "nonVolatile",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The storage type for this conceptual row. Value of this object cannot be changed when the RowStatus object in the same row is 'active'. Conceptual rows having the value 'permanent' need not allow write-access to any columnar objects in the row."
  },
  "cContextMappingBridgeInstRowStatus": {
    "name": "cContextMappingBridgeInstRowStatus",
    "oid": "1.3.6.1.4.1.9.9.468.1.3.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object facilitates the creation, modification, or deletion of a conceptual row in this table."
  },
  "cContextMappingLicenseGroupTable": {
    "name": "cContextMappingLicenseGroupTable",
    "oid": "1.3.6.1.4.1.9.9.468.1.4",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains information on which cContextMappingVacmContextName is mapped to which License Group. Group level licensing is used where each Technology Package is enabled via a License."
  },
  "cContextMappingLicenseGroupEntry": {
    "name": "cContextMappingLicenseGroupEntry",
    "oid": "1.3.6.1.4.1.9.9.468.1.4.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-CONTEXT-MAPPING-MIB",
        "object": "cContextMappingVacmContextName",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Information relating to a single mapping of CContextMappingVacmContextName to the corresponding License Group."
  },
  "cContextMappingLicenseGroupName": {
    "name": "cContextMappingLicenseGroupName",
    "oid": "1.3.6.1.4.1.9.9.468.1.4.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 32
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The value of an instance of this object identifies the name given to the Group to which the SNMP context is mapped. Feature sets from all groups will be combined to form universal image. User can configure multiple groups as needed. For example: In Next generation ISRs will use the universal image package level licensing model for its licensing need. Each group has the feature set needed for that specific technology. Feature sets from different groups are combined to form universal image and each feature set for a group can be enabled using a valid license key. There will be a base level ipbase package in which the router boots with out any license key. The following are the different Technology Groups. 1.crypto 2.data 3.ip 4.legacy 5.novpn-security 6.security 7.uc"
  },
  "cContextMappingLicenseGroupStorageType": {
    "name": "cContextMappingLicenseGroupStorageType",
    "oid": "1.3.6.1.4.1.9.9.468.1.4.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "StorageType",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "nonVolatile",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The storage type for this conceptual row. Conceptual rows having the value 'permanent' need not allow write-access to any columnar objects in the row."
  },
  "cContextMappingLicenseGroupRowStatus": {
    "name": "cContextMappingLicenseGroupRowStatus",
    "oid": "1.3.6.1.4.1.9.9.468.1.4.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object facilitates the creation, modification, or deletion of a conceptual row in this table."
  },
  "cContextMappingMIBCompliances": {
    "name": "cContextMappingMIBCompliances",
    "oid": "1.3.6.1.4.1.9.9.468.2.1",
    "class": "objectidentity"
  },
  "cContextMappingMIBGroups": {
    "name": "cContextMappingMIBGroups",
    "oid": "1.3.6.1.4.1.9.9.468.2.2",
    "class": "objectidentity"
  },
  "cContextMappingMIBCompliance": {
    "name": "cContextMappingMIBCompliance",
    "oid": "1.3.6.1.4.1.9.9.468.2.1.1",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "cContextMappingDataGroup",
        "module": "CISCO-CONTEXT-MAPPING-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for entities which implement the CISCO-CONTEXT-MAPPING-MIB."
  },
  "cContextMappingMIBComplianceRev1": {
    "name": "cContextMappingMIBComplianceRev1",
    "oid": "1.3.6.1.4.1.9.9.468.2.1.2",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "cContextMappingDataGroup",
        "module": "CISCO-CONTEXT-MAPPING-MIB"
      },
      {
        "object": "cContextMappingBridgeDomainDataGroup",
        "module": "CISCO-CONTEXT-MAPPING-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for entities which implement the CISCO-CONTEXT-MAPPING-MIB. This compliance statement is superceded by cContextMappingMIBComplianceRev2."
  },
  "cContextMappingMIBComplianceRev2": {
    "name": "cContextMappingMIBComplianceRev2",
    "oid": "1.3.6.1.4.1.9.9.468.2.1.3",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "cContextMappingDataGroup",
        "module": "CISCO-CONTEXT-MAPPING-MIB"
      },
      {
        "object": "cContextMappingBridgeDomainDataGroup",
        "module": "CISCO-CONTEXT-MAPPING-MIB"
      },
      {
        "object": "cContextMappingBridgeInstanceDataGroup",
        "module": "CISCO-CONTEXT-MAPPING-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for entities which implement the CISCO-CONTEXT-MAPPING-MIB."
  },
  "cContextMappingMIBComplianceRev3": {
    "name": "cContextMappingMIBComplianceRev3",
    "oid": "1.3.6.1.4.1.9.9.468.2.1.4",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "cContextMappingDataGroup",
        "module": "CISCO-CONTEXT-MAPPING-MIB"
      },
      {
        "object": "cContextMappingBridgeDomainDataGroup",
        "module": "CISCO-CONTEXT-MAPPING-MIB"
      },
      {
        "object": "cContextMappingBridgeInstanceDataGroup",
        "module": "CISCO-CONTEXT-MAPPING-MIB"
      },
      {
        "object": "cContextMappingLicenseGroupDataGroup",
        "module": "CISCO-CONTEXT-MAPPING-MIB"
      }
    ],
    "status": "current",
    "description": "The compliance statement for entities which implement the CISCO-CONTEXT-MAPPING-MIB."
  },
  "cContextMappingDataGroup": {
    "name": "cContextMappingDataGroup",
    "oid": "1.3.6.1.4.1.9.9.468.2.2.1",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-CONTEXT-MAPPING-MIB",
        "object": "cContextMappingVrfName"
      },
      {
        "module": "CISCO-CONTEXT-MAPPING-MIB",
        "object": "cContextMappingTopologyName"
      },
      {
        "module": "CISCO-CONTEXT-MAPPING-MIB",
        "object": "cContextMappingProtoInstName"
      },
      {
        "module": "CISCO-CONTEXT-MAPPING-MIB",
        "object": "cContextMappingStorageType"
      },
      {
        "module": "CISCO-CONTEXT-MAPPING-MIB",
        "object": "cContextMappingRowStatus"
      }
    ],
    "status": "current",
    "description": "The collection of objects providing the context mapping data between the SNMP context to the corresponding VRF, the corresponding topology, and the corresponding routing protocol instance."
  },
  "cContextMappingBridgeDomainDataGroup": {
    "name": "cContextMappingBridgeDomainDataGroup",
    "oid": "1.3.6.1.4.1.9.9.468.2.2.2",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-CONTEXT-MAPPING-MIB",
        "object": "cContextMappingBridgeDomainIdentifier"
      },
      {
        "module": "CISCO-CONTEXT-MAPPING-MIB",
        "object": "cContextMappingBridgeDomainStorageType"
      },
      {
        "module": "CISCO-CONTEXT-MAPPING-MIB",
        "object": "cContextMappingBridgeDomainRowStatus"
      }
    ],
    "status": "current",
    "description": "The collection of objects providing the context mapping data between the SNMP context to the corresponding bridge domain."
  },
  "cContextMappingBridgeInstanceDataGroup": {
    "name": "cContextMappingBridgeInstanceDataGroup",
    "oid": "1.3.6.1.4.1.9.9.468.2.2.3",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-CONTEXT-MAPPING-MIB",
        "object": "cContextMappingBridgeInstName"
      },
      {
        "module": "CISCO-CONTEXT-MAPPING-MIB",
        "object": "cContextMappingBridgeInstStorageType"
      },
      {
        "module": "CISCO-CONTEXT-MAPPING-MIB",
        "object": "cContextMappingBridgeInstRowStatus"
      }
    ],
    "status": "current",
    "description": "The collection of objects providing the context mapping data between the SNMP context to the corresponding bridge instance."
  },
  "cContextMappingLicenseGroupDataGroup": {
    "name": "cContextMappingLicenseGroupDataGroup",
    "oid": "1.3.6.1.4.1.9.9.468.2.2.4",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-CONTEXT-MAPPING-MIB",
        "object": "cContextMappingLicenseGroupName"
      },
      {
        "module": "CISCO-CONTEXT-MAPPING-MIB",
        "object": "cContextMappingLicenseGroupStorageType"
      },
      {
        "module": "CISCO-CONTEXT-MAPPING-MIB",
        "object": "cContextMappingLicenseGroupStorageType"
      },
      {
        "module": "CISCO-CONTEXT-MAPPING-MIB",
        "object": "cContextMappingLicenseGroupRowStatus"
      }
    ],
    "status": "current",
    "description": "The collection of objects providing the context mapping data between the SNMP context to the corresponding LicenseGroupName."
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/CISCO-CONTEXT-MAPPING-MIB",
      "Produced by pysmi-0.3.4 at Fri May 24 16:58:05 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "CISCO-CONTEXT-MAPPING-MIB"
  }
}