{
  "imports": {
    "class": "imports",
    "CISCO-SMI": [
      "ciscoMgmt"
    ],
    "ENTITY-MIB": [
      "entPhysicalIndex",
      "PhysicalIndex"
    ],
    "SNMPv2-CONF": [
      "OBJECT-GROUP",
      "NOTIFICATION-GROUP",
      "MODULE-COMPLIANCE"
    ],
    "SNMPv2-SMI": [
      "Integer32",
      "MODULE-IDENTITY",
      "IpAddress",
      "TimeTicks",
      "OBJECT-TYPE",
      "Counter32",
      "OBJECT-IDENTITY",
      "MibIdentifier",
      "iso",
      "Bits",
      "NOTIFICATION-TYPE",
      "Unsigned32",
      "Counter64",
      "Gauge32"
    ],
    "SNMPv2-TC": [
      "RowStatus",
      "TruthValue",
      "DisplayString",
      "TEXTUAL-CONVENTION",
      "TimeStamp"
    ]
  },
  "ciscoAtmNetworkClockMIB": {
    "name": "ciscoAtmNetworkClockMIB",
    "oid": "1.3.6.1.4.1.9.9.121",
    "class": "moduleidentity",
    "revisions": [
      {
        "revision": "2008-02-18 00:00",
        "description": "The SYNTAX of following objects changed from INTEGER to Integer32. cncNcdpMessageInterval, cncNcdpHoldTime ,cncNcdpPriority , CncNcdpAtmEntry ,cncNcdpAdminWeight,cncNcdpVpi, cncNcdpVci ."
      },
      {
        "revision": "2001-12-11 00:00",
        "description": "Intial MIB version."
      }
    ],
    "lastupdated": "200802180000Z",
    "organization": "Cisco System Inc.",
    "contactinfo": "Cisco Systems Customer Service Postal: 170 West Tasman Drive, San Jose CA 95134-1706. USA Tel: +1 800 553-NETS E-mail: cs-atm@cisco.com",
    "description": "The MIB module for management of network clock distribution and the Network Clock Distribution Protocol (NCDP) in Cisco devices. In the context of this MIB 'network clock' refers to the clock signal that is used to time the physical interfaces. Network clock distribution refers to the distribution of a clock signal through a device and between devices for use by the physical interfaces. (See Bell Communications Research, GR-1244-CORE, 'Clocks for the Synchronized Network: Common Generic Criteria' and Bell Communications Research, GR-436-CORE, 'Digital Network Synchronization Plan'). NCDP is used to configure the network clocking hardware of the platform on which an NCDP entity exists. The underlying network clocking hardware in turn distributes a clock signal through the device for use by the physical interfaces. When all of the interfaces that support synchronous clock recovery in a network are timed to one master clock signal, the network is said to be synchronized. NCDP protocol entities residing on adjacent devices cooperate through the exchange of protocol messages to construct a spanning network clock distribution tree. The tree preserves the synchronous digital hierarchy. After NCDP has determined that its algorithm has converged it superimposes the clock distribution tree on the underlying network and the result is a synchronized network."
  },
  "ciscoAtmNetworkClockMIBObjects": {
    "name": "ciscoAtmNetworkClockMIBObjects",
    "oid": "1.3.6.1.4.1.9.9.121.1",
    "class": "objectidentity"
  },
  "cncGlobal": {
    "name": "cncGlobal",
    "oid": "1.3.6.1.4.1.9.9.121.1.1",
    "class": "objectidentity"
  },
  "cncManualSource": {
    "name": "cncManualSource",
    "oid": "1.3.6.1.4.1.9.9.121.1.2",
    "class": "objectidentity"
  },
  "cncNcdpSource": {
    "name": "cncNcdpSource",
    "oid": "1.3.6.1.4.1.9.9.121.1.3",
    "class": "objectidentity"
  },
  "cncNcdp": {
    "name": "cncNcdp",
    "oid": "1.3.6.1.4.1.9.9.121.1.4",
    "class": "objectidentity"
  },
  "CncStratum": {
    "name": "CncStratum",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "s1": 1,
          "s2e": 2,
          "s2": 3,
          "s3e": 4,
          "s3": 5,
          "s4e": 6,
          "s4": 7,
          "other": 8
        }
      }
    },
    "status": "current",
    "description": "The stratum level associated with a source of network clock or a device. (See American National Standards Institute, ANSI T1.101, 'Synchronization Interface for Digital Networks' and Bell Communications Research, GR-436-CORE, 'Digital Network Synchronization Plan' for more detailed information.)"
  },
  "CncHealth": {
    "name": "CncHealth",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "good": 1,
          "bad": 2,
          "unknown": 3
        }
      }
    },
    "status": "current",
    "description": "The health of a source of network clock. A value of 'good' indicates that a given source of network clock is known by the managed system to be good. A value of 'bad' indicates that a given source of network clock is known by the managed system to be bad. A value of 'unknown' indicates that the health of the source of network clock is unknown to the managed system."
  },
  "cncDistributionMethod": {
    "name": "cncDistributionMethod",
    "oid": "1.3.6.1.4.1.9.9.121.1.1.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "ncdp": 1,
          "manual": 2
        }
      }
    },
    "default": {
      "default": {
        "value": "manual",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The method used to distribute network clock for the device. When the mode of operation is 'ncdp', the services provided by the NCDP entity are in use. When this is the case, NCDP entities residing on adjacent nodes exchange protocol messages that are used by the resident NCDP entity to select clock source such that a network-wide clock distribution tree is constructed. When the mode of operation is manual, the NCDP entity is not in use and sources of network clock are statically configured. When this is the case, the construction of a network-wide clock distribution tree is done manually by a network administrator or NMS application."
  },
  "cncNotificationOnChange": {
    "name": "cncNotificationOnChange",
    "oid": "1.3.6.1.4.1.9.9.121.1.1.2",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "true",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The value of this object determines whether a notification should be generated due to a change in the device's root clock source (given by the value of cncRootClockSource). A value of 'true' enables the generation of notifications; 'false' disables notification generation."
  },
  "cncNodeStratum": {
    "name": "cncNodeStratum",
    "oid": "1.3.6.1.4.1.9.9.121.1.1.3",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "CncStratum",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The stratum at which the device exists in the Synchronous Digital Hierarchy (See American National Standards Institute, ANSI T1.101, 'Synchronization Interface for Digital Networks' and Bell Communications Research, GR-436-CORE, 'Digital Network Synchronization Plan' for more detailed information regarding stratum.). The resident NCDP entity uses the value of this object to enforce the network clock distribution stratum hierarchy. This object is only used by the NCDP protocol entity."
  },
  "cncNcdpMaxDiameter": {
    "name": "cncNcdpMaxDiameter",
    "oid": "1.3.6.1.4.1.9.9.121.1.1.4",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 3,
            "max": 255
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The maximum possible height of a network clock distribution tree in the network. (Alternatively this is known as the maximum diameter of the network of devices that are participating in NCDP.) If all of the nodes in the network are participating in the protocol then the maximum height of the network clock distribution tree is exactly the maximum diameter of the network. If a proper subset of the nodes are participating in the NCDP then the maximum height of a network clock distribution tree is the maximum diameter of the subnetwork induced by the removal of the non-participating nodes and their associated links. The NCDP protocol entity uses the value of this object to determine when the NCDP algorithm has converged. All devices participating in NCDP within the bounds of the network must use the same value for maximum network diameter for the NCDP algorithm to operate properly. If the value of this object is set too small the resultant network may exhibit unstable clocking characteristics and may constantly switch clock sources. If the value is much larger than the network diameter, the algorithm will take longer to declare convergence than if the diameter were set closer to the actual maximum network diameter, the result being that it will take longer for the network to resynchronize after a switchover to a secondary clock source located on a secondary device. This object is only used by the NCDP protocol entity."
  },
  "cncNcdpMessageInterval": {
    "name": "cncNcdpMessageInterval",
    "oid": "1.3.6.1.4.1.9.9.121.1.1.5",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 75,
            "max": 60000
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 500,
        "format": "decimal"
      }
    },
    "units": "milliseconds",
    "maxaccess": "read-write",
    "status": "current",
    "description": "The interval at which NCDP configuration PDUs are to be generated. The message interval directly affects the convergence time of the NCDP algorithm. Convergence time is equal to the max network diameter * message interval + transmission delays + the time a configuration PDU is spent being processed in each device. Thus if transmission delays and processing delays are both close to 0, the convergence time is approximately ( max network diameter * message interval ) milliseconds. The value of cncNcdpHoldTime should normally match the value of this object. This object is only used by the NCDP protocol entity."
  },
  "cncNcdpHoldTime": {
    "name": "cncNcdpHoldTime",
    "oid": "1.3.6.1.4.1.9.9.121.1.1.6",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 75,
            "max": 60000
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 500,
        "format": "decimal"
      }
    },
    "units": "milliseconds",
    "maxaccess": "read-write",
    "status": "current",
    "description": "The delay between the transmission of NCDP configuration PDUs. The hold time is used to limit the transmission of NCDP configuration PDUs out of an interface to a maximum of one configuration PDU per hold time interval per interface. The value of this object should normally be set to match the value of cncNcdpMessageInterval. If the value of this object is higher than the value of cncNcdpMessageInterval, NCDP configuration PDUs will end up being propagated at the rate specified by the value of this object instead. This object is only used by the NCDP protocol entity."
  },
  "cncSourceChangeReason": {
    "name": "cncSourceChangeReason",
    "oid": "1.3.6.1.4.1.9.9.121.1.1.7",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "none": 1,
          "lossOfLock": 2,
          "lossOfActivity": 3,
          "ncdpRestructure": 4,
          "other": 5
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The reason for the most recent change of a source of network clock, as indicated by the change in the value of cncSourceChangeTimeStamp. 'none' indicates that the source of network clock has not changed. 'lossOfLock' indicates that the clock source was changed because the network clocking hardware lost lock on the previous network clock source. 'lossOfActivity' indicates that the clock source was changed because the network clocking hardware detected a loss of activity on the previous network clock source. 'ncdpRestructure' indicates that the NCDP entity has changed the clock source as a result of a network-wide network clock distribution tree restructuring process. When the reason for a clock switchover is none of the above, the value of this object is 'other'."
  },
  "cncSourceChangeTimeStamp": {
    "name": "cncSourceChangeTimeStamp",
    "oid": "1.3.6.1.4.1.9.9.121.1.1.8",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TimeStamp",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The value of sysUpTime when the most recent change of a source of network clock occurred. A value of 0 indicates that no such event has occurred since the instantiation of this object."
  },
  "cncRootClockSource": {
    "name": "cncRootClockSource",
    "oid": "1.3.6.1.4.1.9.9.121.1.1.9",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "PhysicalIndex",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The entPhysicalIndex of the network clock source that is actively supplying network clock within the device."
  },
  "cncManualSourceTable": {
    "name": "cncManualSourceTable",
    "oid": "1.3.6.1.4.1.9.9.121.1.2.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table of network clock sources available to the managed system."
  },
  "cncManualSourceEntry": {
    "name": "cncManualSourceEntry",
    "oid": "1.3.6.1.4.1.9.9.121.1.2.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-ATM-NETWORK-CLOCK-MIB",
        "object": "cncManualSourcePriority",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Network clock status and statistics for sources of network clock. When the value of cncDistributionMethod is 'manual', the managed system uses this table to select a source of network clock for the managed system. Within this table a physical entity that is a source of network clock is identified by cncManualSourceId. Table entries are indexed by priority (cncManualSourcePriority). A source of network clock for the device may be an oscillator local to the device, a Building Integrated Timing Supply (BITS) port or an interface that supports synchronous clock recovery. (BITS is explained in more detail in Bell Communications Research, GR-436-CORE, 'Digital Network Synchronization Plan'.) When the managed system initializes it creates a row for the device's default source of network clock, (the entry having cncManualSourcePriority with value 'default'). The only operations allowed on the columnar objects in this particular row are read operations. Other rows are created or destroyed by a management station or through the device's local management interface when a source of network clock is configured or removed. When a management station creates a row it creates it explicitly using RowStatus with either createAndGo or createAndWait. A row is not made active until a valid value for cncManualSourceId is supplied. A management station may perform a write operation on any columnar object while the row is active or not in service. The value of any instance of cncManualSourceId located in the table is unique except when the value refers to the device's default source of network clock; any instance of cncManualSourceId within the table may have this value at any time."
  },
  "cncManualSourcePriority": {
    "name": "cncManualSourcePriority",
    "oid": "1.3.6.1.4.1.9.9.121.1.2.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "primary": 1,
          "secondary": 2,
          "default": 3
        }
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A value used to identify a source of network clock available to the device's manual network clock selection algorithm."
  },
  "cncManualSourceId": {
    "name": "cncManualSourceId",
    "oid": "1.3.6.1.4.1.9.9.121.1.2.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PhysicalIndex",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The entPhysicalIndex that uniquely identifies a source of network clock within the managed system."
  },
  "cncManualSourceHealth": {
    "name": "cncManualSourceHealth",
    "oid": "1.3.6.1.4.1.9.9.121.1.2.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CncHealth",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The health of the clock source identified by cncManualSourceId."
  },
  "cncManualRowStatus": {
    "name": "cncManualRowStatus",
    "oid": "1.3.6.1.4.1.9.9.121.1.2.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status of this conceptual row."
  },
  "cncNcdpSourceTable": {
    "name": "cncNcdpSourceTable",
    "oid": "1.3.6.1.4.1.9.9.121.1.3.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table of configured network clock sources available to the managed system for use by the NCDP protocol entity."
  },
  "cncNcdpSourceEntry": {
    "name": "cncNcdpSourceEntry",
    "oid": "1.3.6.1.4.1.9.9.121.1.3.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "ENTITY-MIB",
        "object": "entPhysicalIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Network clock status and statistics for sources of network clock identified by entPhysicalIndex and used by the managed system when the value of cncDistributionMethod is 'ncdp'. A source of network clock for the device may be an oscillator local to the device, a Building Integrated Timing Supply (BITS) port or an interface that supports synchronous clock recovery. (BITS is explained in more detail in Bell Communications Research, GR-436-CORE, 'Digital Network Synchronization Plan'.) The NCDP protocol entity selects one entry in this table to advertise as the best available clock source for the device. Cooperating NCDP protocol entities select the best available clock source among those advertised within the cooperating group and build a clock distribution tree rooted at that clock source. When the value of cncRootClockSource is used as an index into this table and the indicated clock source has cncNcdpBestClockSource with value 'true' then the indicated clock source is the root of some clock distribution tree. If only one such root exists on all participating devices in the network, then it is the root of a network wide clock distribution tree. When the managed system initializes it creates a row for the device's default source of network clock. This row cannot be destroyed by a management station. Within this row a write operation is only allowed on the cncNcdpPriority object; only read operations are allowed on all other columnar objects within this specific row. The status of this row is always active. The default source can always be found by issuing a read operation on the row within cncManualSourceTable indexed by 'default' (as the value of cncManualSourcePriority). The cncManualSourceId object contains the entPhysicalIndex of the default source of network clock and identifies it within this table. Other rows are created or destroyed by a management station or through the device's local management interface when a source of network clock is configured or removed. When a management station creates a row it creates it explicitly using RowStatus with either createAndGo or createAndWait. A row is not made active until all read-create objects not having default values are properly initialized. The values of cncNcdpPriority, cncNcdpStratum and cncNcdpPRSReference collectively describe a source of network clock, that is they are three components of a vector used as an input to the NCDP algorithm to make clock source selection decisions. The management station must make the row notInService before changing the values of any of these objects."
  },
  "cncNcdpBestClockSource": {
    "name": "cncNcdpBestClockSource",
    "oid": "1.3.6.1.4.1.9.9.121.1.3.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "An indication of whether the NCDP entity is presently advertising this clock source as the best clock source available in this table."
  },
  "cncNcdpPriority": {
    "name": "cncNcdpPriority",
    "oid": "1.3.6.1.4.1.9.9.121.1.3.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 255
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 128,
        "format": "decimal"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The network-wide priority of this clock source if configured as a source of network clock for NCDP. The highest priority clock source is that clock source having the lowest positive numeric value. The clock source with the highest priority is selected as the root of the clock distribution tree by the NCDP algorithm. If more that one clock source is configured with with the same priority the NCDP algorithm uses the value cncNcdpStratum as a tiebreaker."
  },
  "cncNcdpStratum": {
    "name": "cncNcdpStratum",
    "oid": "1.3.6.1.4.1.9.9.121.1.3.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CncStratum",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The stratum level associated with this clock source if configured as a source of network clock for NCDP. (See American National Standards Institute, ANSI T1.101, 'Synchronization Interface for Digital Networks' and Bell Communications Research, GR-436-CORE, 'Digital Network Synchronization Plan' for more detailed information regarding stratum.). If the value of this object is used as a tiebreaker by the NCDP protocol entity, the lower of the given values is the winner. If the values are the same, the value of cncNcdpPRSReference is used as a tiebreaker by the NCDP algorithm."
  },
  "cncNcdpPRSReference": {
    "name": "cncNcdpPRSReference",
    "oid": "1.3.6.1.4.1.9.9.121.1.3.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "internal": 1,
          "external": 2
        }
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "An value that identifies the primary reference source that the network clock available from this source is traceable to if configured as a source of network clock for NCDP. (See American National Standards Institute, ANSI T1.101, 'Synchronization Interface for Digital Networks' and Bell Communications Research, GR-436-CORE, 'Digital Network Synchronization Plan' for more detailed information regarding Primary Reference Sources.). If a source of network clock is an onboard oscillator local to the device it is 'internal' otherwise it is 'external'. If the value of this object is used as a tiebreaker by the NCDP algorithm,'external' wins over 'internal'. All 'external' sources of network clock are assumed to be traceable to the same PRS by the NCDP protocol entity."
  },
  "cncNcdpSourceHealth": {
    "name": "cncNcdpSourceHealth",
    "oid": "1.3.6.1.4.1.9.9.121.1.3.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CncHealth",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The health of the clock source associated with this row."
  },
  "cncNcdpRowStatus": {
    "name": "cncNcdpRowStatus",
    "oid": "1.3.6.1.4.1.9.9.121.1.3.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status of this conceptual row."
  },
  "cncNcdpAtmTable": {
    "name": "cncNcdpAtmTable",
    "oid": "1.3.6.1.4.1.9.9.121.1.4.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table containing the status of NCDP on the device's ATM interfaces."
  },
  "cncNcdpAtmEntry": {
    "name": "cncNcdpAtmEntry",
    "oid": "1.3.6.1.4.1.9.9.121.1.4.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "ENTITY-MIB",
        "object": "entPhysicalIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry in the cncNcdpAtm table containing the status of Ncdp on an ATM interface. A row in this table is created by the managed system and disappears when the associated physical entity disappears. When a row is created all of the row objects are instantiated."
  },
  "cncNcdpEnable": {
    "name": "cncNcdpEnable",
    "oid": "1.3.6.1.4.1.9.9.121.1.4.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "An indication of whether NCDP is presently running on an interface. When NCDP is enabled for an interface, the interface is an active member of the clock distribution topology as seen by the NCDP protocol entity. After this object is instantiated by the agent the managed system initializes the value of this object to 'true' if it determines that the physical interface is an ATM Network-to-Network Interface (see ATM Forum Private Network-Network Interface Specification Version 1.0). In all other cases the managed system initializes the value of this object to 'false'."
  },
  "cncNcdpAdminWeight": {
    "name": "cncNcdpAdminWeight",
    "oid": "1.3.6.1.4.1.9.9.121.1.4.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 16777215
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 10,
        "format": "decimal"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "A weight metric used by the NCDP protocol entity and associated with a physical interface that supports synchronous clock recovery. When NCDP is enabled for the physical interface the value of this object is used by NCDP algorithms during tree computations. The lower the administrative weight, the more attractive the given link is to the NCDP algorithm. If the weight of a link is changed, it can cause the NCDP protocol entity to reconstruct the clock distribution tree."
  },
  "cncNcdpVpi": {
    "name": "cncNcdpVpi",
    "oid": "1.3.6.1.4.1.9.9.121.1.4.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 4095
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The VPI value of the VCC supporting the NCDP entity at this ATM interface. If the values of cncNcdpVpi and cncNcdpVci are both equal to zero then the NCDP entity is not supported at this ATM interface."
  },
  "cncNcdpVci": {
    "name": "cncNcdpVci",
    "oid": "1.3.6.1.4.1.9.9.121.1.4.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 65535
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 34,
        "format": "decimal"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The VCI value of the VCC supporting the NCDP entity at this ATM interface. If the values of cncNcdpVpi and cncNcdpVci are both equal to zero then the NCDP entity is not supported at this ATM interface."
  },
  "cncNcdpHealth": {
    "name": "cncNcdpHealth",
    "oid": "1.3.6.1.4.1.9.9.121.1.4.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CncHealth",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The health of the clock source associated with this row."
  },
  "ciscoAtmNetworkClockNotificationPrefix": {
    "name": "ciscoAtmNetworkClockNotificationPrefix",
    "oid": "1.3.6.1.4.1.9.9.121.2",
    "class": "objectidentity"
  },
  "ciscoAtmNetworkClockMIBNotifications": {
    "name": "ciscoAtmNetworkClockMIBNotifications",
    "oid": "1.3.6.1.4.1.9.9.121.2.0",
    "class": "objectidentity"
  },
  "cncNotifySourceChange": {
    "name": "cncNotifySourceChange",
    "oid": "1.3.6.1.4.1.9.9.121.2.0.1",
    "class": "notificationtype",
    "objects": [
      {
        "module": "CISCO-ATM-NETWORK-CLOCK-MIB",
        "object": "cncSourceChangeReason"
      }
    ],
    "status": "current",
    "description": "This notification indicates that the agent has detected a change in the device's root source of network clock. This notification is generated whenever there is a switchover from one clock source to another."
  },
  "ciscoAtmNetworkClockConformance": {
    "name": "ciscoAtmNetworkClockConformance",
    "oid": "1.3.6.1.4.1.9.9.121.3",
    "class": "objectidentity"
  },
  "ciscoAtmNetworkClockMIBCompliances": {
    "name": "ciscoAtmNetworkClockMIBCompliances",
    "oid": "1.3.6.1.4.1.9.9.121.3.1",
    "class": "objectidentity"
  },
  "ciscoAtmNetworkClockMIBGroups": {
    "name": "ciscoAtmNetworkClockMIBGroups",
    "oid": "1.3.6.1.4.1.9.9.121.3.2",
    "class": "objectidentity"
  },
  "cncMIBCompliance": {
    "name": "cncMIBCompliance",
    "oid": "1.3.6.1.4.1.9.9.121.3.1.1",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "cncGroup",
        "module": "CISCO-ATM-NETWORK-CLOCK-MIB"
      },
      {
        "object": "cncNotificationGroup",
        "module": "CISCO-ATM-NETWORK-CLOCK-MIB"
      }
    ],
    "status": "current",
    "description": "The compliance statement for SNMPv2 entities which implement network clock distribution methods and NCDP."
  },
  "cncGroup": {
    "name": "cncGroup",
    "oid": "1.3.6.1.4.1.9.9.121.3.2.1",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ATM-NETWORK-CLOCK-MIB",
        "object": "cncDistributionMethod"
      },
      {
        "module": "CISCO-ATM-NETWORK-CLOCK-MIB",
        "object": "cncNotificationOnChange"
      },
      {
        "module": "CISCO-ATM-NETWORK-CLOCK-MIB",
        "object": "cncNodeStratum"
      },
      {
        "module": "CISCO-ATM-NETWORK-CLOCK-MIB",
        "object": "cncNcdpMaxDiameter"
      },
      {
        "module": "CISCO-ATM-NETWORK-CLOCK-MIB",
        "object": "cncNcdpMessageInterval"
      },
      {
        "module": "CISCO-ATM-NETWORK-CLOCK-MIB",
        "object": "cncNcdpHoldTime"
      },
      {
        "module": "CISCO-ATM-NETWORK-CLOCK-MIB",
        "object": "cncSourceChangeReason"
      },
      {
        "module": "CISCO-ATM-NETWORK-CLOCK-MIB",
        "object": "cncSourceChangeTimeStamp"
      },
      {
        "module": "CISCO-ATM-NETWORK-CLOCK-MIB",
        "object": "cncRootClockSource"
      },
      {
        "module": "CISCO-ATM-NETWORK-CLOCK-MIB",
        "object": "cncManualSourceId"
      },
      {
        "module": "CISCO-ATM-NETWORK-CLOCK-MIB",
        "object": "cncManualSourceHealth"
      },
      {
        "module": "CISCO-ATM-NETWORK-CLOCK-MIB",
        "object": "cncManualRowStatus"
      },
      {
        "module": "CISCO-ATM-NETWORK-CLOCK-MIB",
        "object": "cncNcdpBestClockSource"
      },
      {
        "module": "CISCO-ATM-NETWORK-CLOCK-MIB",
        "object": "cncNcdpPriority"
      },
      {
        "module": "CISCO-ATM-NETWORK-CLOCK-MIB",
        "object": "cncNcdpStratum"
      },
      {
        "module": "CISCO-ATM-NETWORK-CLOCK-MIB",
        "object": "cncNcdpPRSReference"
      },
      {
        "module": "CISCO-ATM-NETWORK-CLOCK-MIB",
        "object": "cncNcdpSourceHealth"
      },
      {
        "module": "CISCO-ATM-NETWORK-CLOCK-MIB",
        "object": "cncNcdpRowStatus"
      },
      {
        "module": "CISCO-ATM-NETWORK-CLOCK-MIB",
        "object": "cncNcdpEnable"
      },
      {
        "module": "CISCO-ATM-NETWORK-CLOCK-MIB",
        "object": "cncNcdpAdminWeight"
      },
      {
        "module": "CISCO-ATM-NETWORK-CLOCK-MIB",
        "object": "cncNcdpVpi"
      },
      {
        "module": "CISCO-ATM-NETWORK-CLOCK-MIB",
        "object": "cncNcdpVci"
      },
      {
        "module": "CISCO-ATM-NETWORK-CLOCK-MIB",
        "object": "cncNcdpHealth"
      }
    ],
    "status": "current",
    "description": "The cnc group of objects providing for management of network clock distribution and NCDP entities."
  },
  "cncNotificationGroup": {
    "name": "cncNotificationGroup",
    "oid": "1.3.6.1.4.1.9.9.121.3.2.2",
    "class": "notificationgroup",
    "objects": [
      {
        "module": "CISCO-ATM-NETWORK-CLOCK-MIB",
        "object": "cncNotifySourceChange"
      }
    ],
    "status": "current",
    "description": "Conformance group for cnc notifications."
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/CISCO-ATM-NETWORK-CLOCK-MIB",
      "Produced by pysmi-0.3.4 at Fri May 24 16:54:37 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "CISCO-ATM-NETWORK-CLOCK-MIB"
  }
}