{
  "imports": {
    "class": "imports",
    "CISCO-NS-MIB": [
      "FcGs3RejectReasonCode"
    ],
    "CISCO-SMI": [
      "ciscoMgmt"
    ],
    "CISCO-ST-TC": [
      "VsanIndex",
      "DomainIdOrZero",
      "FcNameId",
      "FcAddressId"
    ],
    "CISCO-VSAN-MIB": [
      "vsanIndex"
    ],
    "IF-MIB": [
      "ifIndex",
      "InterfaceIndexOrZero"
    ],
    "INET-ADDRESS-MIB": [
      "InetAddress",
      "InetAddressType"
    ],
    "SNMP-FRAMEWORK-MIB": [
      "SnmpAdminString"
    ],
    "SNMPv2-CONF": [
      "MODULE-COMPLIANCE",
      "NOTIFICATION-GROUP",
      "OBJECT-GROUP"
    ],
    "SNMPv2-SMI": [
      "Gauge32",
      "iso",
      "Counter64",
      "Unsigned32",
      "TimeTicks",
      "MibIdentifier",
      "Counter32",
      "Integer32",
      "NOTIFICATION-TYPE",
      "OBJECT-TYPE",
      "MODULE-IDENTITY",
      "Bits",
      "IpAddress",
      "OBJECT-IDENTITY"
    ],
    "SNMPv2-TC": [
      "DisplayString",
      "RowStatus",
      "TestAndIncr",
      "TEXTUAL-CONVENTION",
      "TruthValue",
      "TimeStamp"
    ]
  },
  "ciscoZsMIB": {
    "name": "ciscoZsMIB",
    "oid": "1.3.6.1.4.1.9.9.294",
    "class": "moduleidentity",
    "revisions": [
      {
        "revision": "2005-11-10 00:00",
        "description": "Added new enum 'ipAddrv6' to ZoneMemberType TC. Added description to the object zoneMemberID corresponding to this enum. Added zoneSetZoneListTable and zoneSetEnforcedZoneListTable to increase the number of zones that can be associated with a zoneset to 8192 from 2048. Changed the upper limit of zoneIndex and zoneMemberParentIndex objects to 8192 from 2048. Added zoneCompactTable and zoneCompactNotify. Added new enum 'deviceAlias' to ZoneMemberType TC. Deprecated zoneCopyActiveToFullOnVsan object. Added new objects zoneCopyActToFullSpinLock, zoneCopyActToFullMode and zoneCopyActToFullVsan. Enhanced zoneMergeFailure notification to include information regarding the details of merge failure."
      },
      {
        "revision": "2005-04-07 00:00",
        "description": "Added zoneDbHardZoningEnabled to zoneDbTable. Added zoneSetClone, zoneClone and zoneAliasClone objects. Added zoneActivateNotify notification. Added zoneSwitchWwn object to be used in zoneActivateNotify notification."
      },
      {
        "revision": "2004-09-01 00:00",
        "description": "Added objects zoneQos, zoneQosPriority, zoneBroadcast and zoneAttribObjIndex to zoneTable. Added objects zoneEnforcedZoneQos, zoneEnforcedZoneQosPriority and zoneEnforcedZoneBroadcast to zoneEnforcedZoneTable. Added zoneDefaultZoneQos, zoneDefaultZoneQosPriority and zoneDefaultZoneBroadcast to zoneDefaultZoneTable. Changed DESCRIPTION of zoneSetName and zoneAliasName objects to indicate that they support renaming."
      },
      {
        "revision": "2004-01-27 00:00",
        "description": "Added zoneZoneSetDistributeVsan, zoneZoneSetDistributeResult and zoneZoneSetDistributeFailReason objects for supporting full zoneset distribution."
      },
      {
        "revision": "2003-12-12 00:00",
        "description": "Added new notification zoneUnsuppMemInIntOpModeNotify and corresponding notification control object zoneUnsuppMemInIntOpNotifyEnable. Added object zoneVsanId to be used in the above notification."
      },
      {
        "revision": "2003-08-25 00:00",
        "description": "Added zoneCopyTable. Added 2 new member types to ZoneMemberType TC - domainIntf and ipAddr."
      },
      {
        "revision": "2003-08-01 00:00",
        "description": "Added zoneLunStatsTable and zoneRoZoneStatsTable. Changed the max size of zoneMemberID and zoneEnforcedMemberID to 255 from 256. Added zoneDefaultZoneReadOnly object to zoneDefaultZoneTable. Modified the DESCRIPTION of zoneName object in zoneTable so that it can be renamed. Added zoneAliasLastChange object to zoneAliasTable. Deprecated zoneEnforcedZoneAliasTable. Added 2 new member types (domainPort and intf) to ZoneMemberType TC."
      },
      {
        "revision": "2003-03-26 00:00",
        "description": "Added TC FcChangeProtoFailCause and objects zoneSetFailCause and zoneSetFailDomId to the zoneSetActivateTable. Added objects zoneDbEnforcedEqualsLocal and zoneDbClearDb to new table zoneDbTable. Added zoneReadOnly object to zoneTable and zoneEnforcedZoneReadOnly object to zoneEnforcedZoneTable."
      },
      {
        "revision": "2003-01-17 00:00",
        "description": "Added symNodeName, a new enumeration to the ZoneMemberType TC."
      },
      {
        "revision": "2002-11-08 00:00",
        "description": "Added zoneCopyActiveToFullOnVsan object."
      },
      {
        "revision": "2002-10-28 00:00",
        "description": "Added zoneSetPropagationTable."
      },
      {
        "revision": "2002-10-03 00:00",
        "description": "Initial version of this MIB."
      }
    ],
    "lastupdated": "200511100000Z",
    "organization": "Cisco Systems Inc.",
    "contactinfo": " Cisco Systems Customer Service Postal: 170 W Tasman Drive San Jose, CA 95134 USA Tel: +1 800 553 -NETS E-mail: cs-san@cisco.com",
    "description": "The MIB module for the management of zoning within the framework of Cisco's Zoning Server (ZS) Archi- tecture which realizes the FC-GS3 requirements for Zone Server. This MIB enables managers to configure and monitor zoning server parameters. Additionally, Cisco's Zoning Server allows for configuration of Lun zoning, which is an extension to the Zoning Server standard specified by FC-GS3. Glossary of terms used ---------------------- VSAN - Virtual Storage Area Network. Zone Merge - When the ISL (Inter Switch Link) between 2 switches is brought up, the zoning databases on the 2 switches are compared by means of the Zone Merge protocol. If the 2 databases can be merged, the ISL is brought up. Otherwise, the link is isolated."
  },
  "ciscoZoningMIBObjects": {
    "name": "ciscoZoningMIBObjects",
    "oid": "1.3.6.1.4.1.9.9.294.1",
    "class": "objectidentity"
  },
  "zoneServerMIBConformance": {
    "name": "zoneServerMIBConformance",
    "oid": "1.3.6.1.4.1.9.9.294.2",
    "class": "objectidentity"
  },
  "zoneConfiguration": {
    "name": "zoneConfiguration",
    "oid": "1.3.6.1.4.1.9.9.294.1.1",
    "class": "objectidentity"
  },
  "zoneStats": {
    "name": "zoneStats",
    "oid": "1.3.6.1.4.1.9.9.294.1.2",
    "class": "objectidentity"
  },
  "zoneInformation": {
    "name": "zoneInformation",
    "oid": "1.3.6.1.4.1.9.9.294.1.3",
    "class": "objectidentity"
  },
  "zoneNotification": {
    "name": "zoneNotification",
    "oid": "1.3.6.1.4.1.9.9.294.1.4",
    "class": "objectidentity"
  },
  "zoneNotifications": {
    "name": "zoneNotifications",
    "oid": "1.3.6.1.4.1.9.9.294.1.4.0",
    "class": "objectidentity"
  },
  "ZoneMemberType": {
    "name": "ZoneMemberType",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "wwn": 1,
          "domainPort": 2,
          "fcAddr": 3,
          "fwwn": 4,
          "symNodeName": 5,
          "intf": 6,
          "domainIntf": 7,
          "ipAddr": 8,
          "ipAddrv6": 9,
          "deviceAlias": 10
        }
      }
    },
    "status": "current",
    "description": "Represents the addressing mechanism by which a member is identified. wwn(1) - The Port World Wide Name (PWWN). domainPort(2) - Domain and Port number format. fcAddr(3) - FC-ID. fwwn(4) - Fabric Port World Wide Name. This is used for Port based zoning. symNodeName(5) - Symbolic Node Name used for iSCSI zoning. intf(6) - interface format. domainIntf(7) - Domain and Interface format. ipAddr(8) - IPv4 address format. ipAddrv6(9) - IPv6 address format. deviceAlias(10) - Device Alias. This is a human readable string used to alias a World Wide Name (WWN). It is defined in CISCO-FC-DEVICE-ALIAS-MIB."
  },
  "FcZoneServerRejReasonExpl": {
    "name": "FcZoneServerRejReasonExpl",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "noAdditionalExplanation": 1,
          "zonesNotSupported": 2,
          "zoneSetNameUnknown": 3,
          "noZoneSetActive": 4,
          "zoneNameUnknown": 5,
          "zoneStateUnknown": 6,
          "incorrectPayloadLen": 7,
          "tooLargeZoneSet": 8,
          "deactivateZoneSetFailed": 9,
          "reqNotSupported": 10,
          "capabilityNotSupported": 11,
          "zoneMemberIDTypeNotSupp": 12,
          "invalidZoneSetDefinition": 13
        }
      }
    },
    "status": "current",
    "description": "The reject reason code explanation for a zone server request. noAdditionalExplanation(1) - there is no additional explanation. zonesNotSupported(2) - zones are not supported. zoneSetNameUnknown(3) - zone set name is not known. noZoneSetActive(4) - no zone set is currently active. zoneNameUnknown(5) - zone name is unknown. zoneStateUnknown(6) - state of the zone is not known. incorrectPayloadLen(7) - payload len is not correct. tooLargeZoneSet(8) - zone set is larger than permitted size. deactivateZoneSetFailed(9) - deactivation of zone set failed. reqNotSupported(10) - request is not supported. capabilityNotSupported(11) - capability is not supported. zoneMemberIDTypeNotSupp(12)- type of zone member is not supported. invalidZoneSetDefinition(13) - zone set definition is invalid."
  },
  "FcList": {
    "name": "FcList",
    "class": "textualconvention",
    "type": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 256
          }
        ]
      }
    },
    "status": "current",
    "description": "Represents a list of entities. Each octet within the value of an object of this type, specifies a set of eight entities, with the first octet specifying entities 1 through 8, the second octet specifying entities 9 through 16, etc. Within each octet, the most significant bit represents the lowest numbered entity and the least significant bit represents the highest numbered entity. If the length of an object of this type is less than 256 bytes, then the entities which are not represented are not considered to be part of this list, i.e., effectively, the string is extended to be of length 256 bytes by appending bytes containing x'00'. Note that this means that the zero length string represents the 'list is empty' value."
  },
  "FcChangeProtoFailCause": {
    "name": "FcChangeProtoFailCause",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "none": 1,
          "rcvdSfcBusy": 2,
          "rcvdUfcBusy": 3,
          "acaRetryExceed": 4,
          "sfcRetryExceed": 5,
          "ufcRetryExceed": 6,
          "unsuppCmd": 7,
          "notAuth": 8,
          "fabricChange": 9,
          "updateNotStaged": 10,
          "invalidZsetFormat": 11,
          "systemErr": 12,
          "vsanNotPresent": 13,
          "vsanInactive": 14,
          "zsetNotPresent": 15,
          "dbUpdateInProgress": 16,
          "zsetNotActive": 17,
          "hwOperFailed": 18,
          "fc2SeqSizeExceed": 19,
          "fc2SendFailed": 20,
          "zsetUnchangedAndActive": 21,
          "fabricUnstable": 22,
          "nonInteropMember": 23,
          "lcUpgradeInProgress": 24
        }
      }
    },
    "status": "current",
    "description": "The reason for the failure of Change Protocol, which kicks in due to zone set activation/de-activation. none(1) - no error. rcvdSfcBusy(2) - the local Zone Server received a busy from one of the Zone Servers in the fabric in response to SFC. rcvdUfcBusy(3) - the local Zone Server received a busy from one of the Zone Servers in the fabric in response to UFC. acaRetryExceed(4) - the number of ACA retries by the local Zone Server has exceeded the retry count. sfcRetryExceed(5) - the number of SFC retries by the local Zone Server has exceeded the retry count. ufcRetryExceed(6) - the number of UFC retries by the local Zone Server has exceeded the retry count. unsuppCmd(7) - the local Zone Server has received response from one of the Zone Servers in the fabric that it does not support the particular command. notAuth(8) - the local Zone Server has received response from one of the Zone Servers in the fabric that the local Zone Server is not authorized to carry out the particular command. fabricChange(9) - the local Zone Server has received response from one of the Zone Servers that the fabric from it's viewpoint is changing. updateNotStaged(10) - the local Zone Server has received response from one of the Zone Servers in the fabric that it has received a UFC before an SFC. invalidZsetFormat(11) - the local Zone Server has received response from one of the Zone Servers in the fabric that the zone set format in the pdu sent to it is invalid. systemErr(12) - a system error has occured on the local Zone Server. vsanNotPresent(13) - the specified VSAN is not present on the local Zone Server. vsanInactive(14) - the specifed VSAN is not active on the local Zone Server. zsetNotPresent(15) - the specified zone set is not present on the local Zone Server. dbUpdateInProgress(16) - the local Zone Server's database is being updated. zsetNotActive(17) - the zone set specified for deactivation is not active on the local Zone Server. hwOperFailed(18) - the hardware update on the local Zone Server failed. fc2SeqSizeExceed(19) - the Change Protocol frame has exceeded the allowed maximum FC-2 sequence size on the local Zone Server. fc2SendFailed(20) - the FC-2 stack failed to send the frame on the local Zone Server. zsetUnchangedAndActive(21) - the zone set specified for activation is already active and unchanged since the last activation on the local Zone Server. fabricUnstable(22) - the fabric has become unstable as detected by the local Zone Server. nonInteropMember(23) - one or more of the members specified in the zone set(s) to be activated, are in non-interoperable format and the interop mode is turned on, on the local Zone Server. lcUpgradeInProgress(24) - line card upgrade is in progress on the local Zone Server."
  },
  "ZoneCopyProtocol": {
    "name": "ZoneCopyProtocol",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "tftp": 1,
          "ftp": 2,
          "sftp": 3,
          "scp": 4
        }
      }
    },
    "status": "current",
    "description": "The protocol to be used for copying the active zoneset over the network. If the copy is to occur on the local device, then the method of transfer is left to the implementation and is not restricted to these protocols."
  },
  "ZoneFileType": {
    "name": "ZoneFileType",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "networkFile": 1,
          "localFile": 2
        }
      }
    },
    "status": "current",
    "description": "The various types of files onto which the active zoneset can be copied. networkFile(1) - the active zoneset needs to be copied over the network. localFile(2) - the active zoneset needs to be copied to a file on the local device."
  },
  "ZoneQosPriorityLevel": {
    "name": "ZoneQosPriorityLevel",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "none": 1,
          "low": 2,
          "medium": 3,
          "high": 4
        }
      }
    },
    "status": "current",
    "description": "Specifies the priority level for qos attribute applied to a zone. none - not applicable. low - indicates low priority. medium - indicates medium priority. high - indicates high priority."
  },
  "ZoneMergeFailCause": {
    "name": "ZoneMergeFailCause",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "other": 1,
          "zoningModeMismatch": 2,
          "qosNotEnabled": 3,
          "qosConflict": 4,
          "bcastNotEnabled": 5,
          "mergeCtrlMismatch": 6,
          "defZoneMismatch": 7,
          "qosAttrMissing": 8,
          "bcastAttrMissing": 9,
          "rdonlyAttrMissing": 10,
          "memberMismatch": 11,
          "invPayloadFormat": 12,
          "sizeExceeded": 13,
          "unlicensedMember": 14,
          "nonInteropZoneset": 15
        }
      }
    },
    "status": "current",
    "description": "Specifies the reason for zone merge failure. When the Zone Merge takes place, the local database is compared with the database of the adjacent switch. The following errors/mismatches can take place: other - reason other than those specified below. zoningModeMismatch - mismatch in zoning modes between the 2 switches. qosNotEnabled - qos is not enabled on one of the switches and qos attribute is present in one of the zones. qosConflict - conflict between VSAN based Qos and zone attribute qos. bcastNotEnabled - broadcast service has not been enabled on one of the switches and broadcast attribute is present in one of the zones. mergeCtrlMismatch - there is a mismatch in the merge control flag value. defZoneMismatch - there is a mismatch in the default zone policy. qosAttrMissing - qos attribute is missing. bcastAttrMissing - broadcast attribute is missing. rdonlyAttrMissing - read only attribute is missing. memberMismatch - there is a mismatch in the members. invPayloadFormat - the payload format is invalid. sizeExceeded - the payload exceeded the maximum size. unlicensedMember - a member is unlicensed. nonInteropZoneset - a zone attribute/member which cannot be supported in the current interop mode of the switch."
  },
  "zoneDefaultZoneTable": {
    "name": "zoneDefaultZoneTable",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table containing information on all default zones on all VSANs on the local Zone Server."
  },
  "zoneDefaultZoneEntry": {
    "name": "zoneDefaultZoneEntry",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-VSAN-MIB",
        "object": "vsanIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry (conceptual row) in this table."
  },
  "zoneDefaultZoneBehaviour": {
    "name": "zoneDefaultZoneBehaviour",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "permit": 1,
          "deny": 2
        }
      }
    },
    "default": {
      "default": {
        "value": "deny",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object controls the behaviour of the default zone on this VSAN. If this object is set to 'permit', then the members of the default zone on this VSAN can communicate with each other. If this object is set to 'deny', then the members of the default zone on this VSAN cannot communicate with each other."
  },
  "zoneDefaultZoneReadOnly": {
    "name": "zoneDefaultZoneReadOnly",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object indicates if only SCSI read operations are allowed on members of the default zone which are SCSI targets, on this VSAN. If this object is set to 'true', then only SCSI read operations are permitted. So, this default zone becomes a read-only default zone on this VSAN. If this object is set to 'false', then both SCSI read and write operations are permitted."
  },
  "zoneDefaultZoneQos": {
    "name": "zoneDefaultZoneQos",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object specifies if qos attribute for the default zone on this VSAN is enabled. If this object is set to 'true', then qos attribute for the default zone on this VSAN is enabled. If this object is set to 'false', then qos attribute for the default zone on this VSAN is disabled. If this attribute is enabled for this default zone, then only traffic with the configured priority level will be allowed between the members of this default zone. The priority can be specified by means of the corresponding instance of zoneDefaultZoneQosPriority object."
  },
  "zoneDefaultZoneQosPriority": {
    "name": "zoneDefaultZoneQosPriority",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZoneQosPriorityLevel",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "none",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Specifies the qos priority value. The value of this object is relevant only if the corresponding instance of zoneDefaultZoneQos object is enabled by setting it to 'true'."
  },
  "zoneDefaultZoneBroadcast": {
    "name": "zoneDefaultZoneBroadcast",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object specifies if broadcast zoning is enabled on this default zone on this VSAN. If this object is set to 'true', then it is enabled. If this object is set to 'false', then it is disabled. If broadcast zoning is enabled on this default zone, then broadcast frames generated by a member in this default zone will be restricted to members in this default zone."
  },
  "zoneSetPropagationTable": {
    "name": "zoneSetPropagationTable",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table containing information related to propagation of zone set information during Merge/Change protocols on all VSANs on the local Zone Server."
  },
  "zoneSetPropagationEntry": {
    "name": "zoneSetPropagationEntry",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-VSAN-MIB",
        "object": "vsanIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry (conceptual row) in this table."
  },
  "zoneSetPropagationMode": {
    "name": "zoneSetPropagationMode",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "fullZoneSet": 1,
          "activeZoneSet": 2
        }
      }
    },
    "default": {
      "default": {
        "value": "activeZoneSet",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object controls the way zone set information is propagated during Merge/Change protocols on this VSAN. If this object is set to 'fullZoneSet', then the entire zone set database is sent during Change/Merge protocol exchanges on this VSAN. If this object is set to 'activeZoneSet', only the active zone set is sent during Change/Merge protocol exchanges on this VSAN."
  },
  "zoneSetNumber": {
    "name": "zoneSetNumber",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.3",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 8388608
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of entries currently present in the zoneSetTable."
  },
  "zoneSetTable": {
    "name": "zoneSetTable",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.4",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table containing information on each Zone Set which is configured and available on any VSAN known to the local Zone Server. The zoneSetTable lists all the zone sets configured on all the VSANs configured on the local zone server. There could be multiple zone sets configured on a VSAN. But only one zone set is allowed to be active at a time in each VSAN. A Zone Set is a collection of zones."
  },
  "zoneSetEntry": {
    "name": "zoneSetEntry",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.4.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-VSAN-MIB",
        "object": "vsanIndex",
        "implied": 0
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry (conceptual row) in the zoneSetTable. The zone sets are defined with respect to a VSAN. Hence, this table is indexed by the vsanIndex, in addition to the zoneSetIndex. The sequence of operations to be performed in order to create a zone set is as follows: - create zone entries in the ZoneTable. - create an entry in this table and set the zoneSetZoneList bitmap object to contain the required zones. - Note that it is perfectly valid to create an empty zone set."
  },
  "zoneSetIndex": {
    "name": "zoneSetIndex",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.4.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 2048
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The index of a zone set. This object uniquely identifies a zone set on a particular VSAN."
  },
  "zoneSetName": {
    "name": "zoneSetName",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.4.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 64
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The name of this zone set. The zoneSetName should be unique within a VSAN. The zone set can be renamed by setting this object to a new value. This object MUST be set before or concurrently with setting the corresponding instance of zoneSetRowStatus to 'active'."
  },
  "zoneSetZoneList": {
    "name": "zoneSetZoneList",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.4.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "FcList",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The set of zones which form this zone set on this VSAN. The zones are identified by zoneIndex object in the zoneTable. If a particular bit has a value of '1', then the corresponding zone is a part of this zone set. All other zones have '0' in their positions or not present in the string. The default value is the zero length string."
  },
  "zoneSetLastChange": {
    "name": "zoneSetLastChange",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.4.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TimeStamp",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The value of sysUpTime at the time of the last change to this zone set entry. If the entry has not been modified since the last re-initialization of the local network management system, then this object will contain a zero value."
  },
  "zoneSetRowStatus": {
    "name": "zoneSetRowStatus",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.4.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status of this conceptual row. This object can not be set to 'active' unless the corresponding value of zoneSetName is unique within the VSAN."
  },
  "zoneSetClone": {
    "name": "zoneSetClone",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.4.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 64
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Setting this object to a name will result in this zone set being cloned and the cloned zone set will be set to this name. When this object is read, the zero-length string is returned."
  },
  "zoneSetActivateTable": {
    "name": "zoneSetActivateTable",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.5",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains atmost one entry for each VSAN that is configured. These entries reflect the state of the activation of a zone set on the corresponding VSAN. The management station needs to create an entry in this table on the desired VSAN before a zone set can be activated on that VSAN."
  },
  "zoneSetActivateEntry": {
    "name": "zoneSetActivateEntry",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.5.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-VSAN-MIB",
        "object": "vsanIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry (conceptual row) in this table."
  },
  "zoneSetActivate": {
    "name": "zoneSetActivate",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.5.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 2048
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Setting this object to a value is a request for a zone set to be activated on the particular VSAN, i.e., for the current configuration of that zone set to be cloned with the clone becoming the active zone set for the particular VSAN. Setting this object to a value (say, N) identifies the zone set to be cloned as the zone set identified by zoneSetIndex object having the same value N. Even though there could be multiple zone sets on a VSAN, only one can be active at a time. If a zone set is already active on a VSAN and a second zone set is activated on the same VSAN, then the first zone set is automatically deactivated and the second zone set is activated. The value of this object when read is always 0."
  },
  "zoneSetActivateResult": {
    "name": "zoneSetActivateResult",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.5.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "activateSuccess": 1,
          "activateFailure": 2,
          "deactivateSuccess": 3,
          "deactivateFailure": 4,
          "inProgress": 5,
          "newEntry": 6
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the outcome of the most recent activation/deactivation. When the value of this object is 'inProgress', the values of the corresponding instances of zoneSetActivate, zoneSetDeActivate and zoneSetActivateRowStatus cannot be modified. The value 'newEntry' indicates that after the entry has been created, activation/de-activation has not yet been attempted on the entry."
  },
  "zoneSetDeActivate": {
    "name": "zoneSetDeActivate",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.5.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "deactivate": 1,
          "noop": 2
        }
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Setting this object to 'deactivate' is a request to deactivate the currently active zone set on this VSAN. No action is taken if this object is set to 'noop'. The value of this object when read is always 'noop'."
  },
  "zoneSetActivateRowStatus": {
    "name": "zoneSetActivateRowStatus",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.5.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status of this conceptual row."
  },
  "zoneSetFailCause": {
    "name": "zoneSetFailCause",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.5.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "FcChangeProtoFailCause",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The reason for the failure of the zone set activation/de-activation. The value of this object contains the reason for the failure only if the value of the corresponding instance of zoneSetActivateResult is either 'activateFailure' or 'deactivateFailure'."
  },
  "zoneSetFailDomId": {
    "name": "zoneSetFailDomId",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.5.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DomainIdOrZero",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The domain id of the device in the fabric that has caused the Change Protocol to fail. This object will contain a valid domain id if the activation/deactivation has failed and the corresponding instance of zoneSetFailCause has a value between rcvdSfcBusy(2) and invalidZsetFormat(11). These errors are flagged by Zone Server modules running on other devices in the entire fabric as part of the Change Protocol. The remaining errors are those that are detected on the local Zone Server. In that case, this object will contain the value 0."
  },
  "zoneNumber": {
    "name": "zoneNumber",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.6",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 8388608
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of entries currently present in the zoneTable."
  },
  "zoneTable": {
    "name": "zoneTable",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.7",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table gives information on all the zones/aliases and lists all their members."
  },
  "zoneEntry": {
    "name": "zoneEntry",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.7.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-VSAN-MIB",
        "object": "vsanIndex",
        "implied": 0
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry (conceptual row) in the zoneTable. The sequence of operations to be performed in order to create a zone is as follows: - create an entry in this table. - create zone members in the zoneMemberTable that belong to this zone. - if aliases need to be created, create an alias entry in the zoneAliasTable, create alias members in the zoneMemberTable and associate the alias with the required zone entry by setting the zoneAliasList object in this table appropriately."
  },
  "zoneIndex": {
    "name": "zoneIndex",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.7.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 8192
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The index of a zone on this VSAN."
  },
  "zoneName": {
    "name": "zoneName",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.7.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 64
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The name of this zone. The zoneName should be unique within a VSAN. The zone can be renamed by setting this object to a new value. This object MUST be set before or concurrently with setting the corresponding instance of zoneRowStatus to 'active'."
  },
  "zoneMemberList": {
    "name": "zoneMemberList",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.7.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "FcList",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The set of zone members that form this zone on this VSAN. The zone members are identified by zoneMemberIndex object in the zoneMemberTable. If a particular bit has a value of '1', then the corresponding zone member is a part of this zone. All other zone members have '0' in their positions or not present in the string. This object is read-only; changes to its value are made by the agent as and when associated entries are created/deleted in the zoneMemberTable. The default value is the zero length string."
  },
  "zoneAliasList": {
    "name": "zoneAliasList",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.7.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "FcList",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The set of aliases that form this zone on this VSAN. The aliases are identified by the zoneAliasIndex object in the zoneAliasTable. If a particular bit has a value of '1', then the corresponding alias is a part of this zone. All other aliases have '0' in their positions or not present in the string. The default value is the zero length string."
  },
  "zoneLastChange": {
    "name": "zoneLastChange",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.7.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TimeStamp",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The value of sysUpTime at the time of the last change to this zone entry. If the entry has not been modified since the last re-initialization of the local network management system, then this object will contain a zero value."
  },
  "zoneRowStatus": {
    "name": "zoneRowStatus",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.7.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status of this conceptual row. This object can not be set to 'active' unless the corresponding value of zoneName is unique within the VSAN."
  },
  "zoneReadOnly": {
    "name": "zoneReadOnly",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.7.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object indicates if only SCSI read operations are allowed on the members of this zone which are SCSI targets. If the value of this object is set to 'true', then only SCSI read operations are permitted. So, this becomes a read-only zone. If the value of this object is set to 'false', then both SCSI read and write operations are permitted."
  },
  "zoneQos": {
    "name": "zoneQos",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.7.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object specifies if qos attribute for this zone is enabled. If this object is set to 'true', then qos attribute for this zone is enabled. If this object is set to 'false', then qos attribute for this zone is disabled. If this attribute is enabled for this zone, then only traffic with the configured priority level will be allowed between the members of this zone. The priority can be specified by means of the corresponding instance of zoneQosPriority object."
  },
  "zoneQosPriority": {
    "name": "zoneQosPriority",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.7.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZoneQosPriorityLevel",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "none",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Specifies the qos priority value. The value of this object is relevant only if the corresponding instance of zoneQos object is enabled by setting it to 'true'."
  },
  "zoneBroadcast": {
    "name": "zoneBroadcast",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.7.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object specifies if broadcast zoning is enabled on this zone. If this object is set to 'true', then it is enabled. If this object is set to 'false', then it is disabled. If broadcast zoning is enabled on this zone, then broadcast frames generated by a member in this zone will be restricted to members in this zone."
  },
  "zoneClone": {
    "name": "zoneClone",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.7.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 64
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Setting this object to a name will result in this zone being cloned and the cloned zone will be set to this name. When this object is read, the zero-length string is returned."
  },
  "zoneAliasNumber": {
    "name": "zoneAliasNumber",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.8",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 8388608
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of entries currently present in the zoneAliasTable."
  },
  "zoneAliasTable": {
    "name": "zoneAliasTable",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.9",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table gives information on all the aliases and their members."
  },
  "zoneAliasEntry": {
    "name": "zoneAliasEntry",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.9.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-VSAN-MIB",
        "object": "vsanIndex",
        "implied": 0
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry (conceptual row) in this table."
  },
  "zoneAliasIndex": {
    "name": "zoneAliasIndex",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.9.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 2048
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The index of an alias entry on this VSAN."
  },
  "zoneAliasName": {
    "name": "zoneAliasName",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.9.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 64
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The name of this alias. The name of the alias should be unique within a VSAN. The alias can be renamed by setting this object to a new value. This object MUST be set before or concurrently with setting the corresponding instance of zoneAliasRowStatus to 'active'."
  },
  "zoneAliasMemberList": {
    "name": "zoneAliasMemberList",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.9.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "FcList",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The set of zone members which form this alias on this VSAN. The members of an alias are identified by the zoneMemberIndex object in the zoneMemberTable. If a particular bit has a value of '1', then the corresponding zone member is a part of this alias. All other zone members have '0' in their positions or not present in the string. This object is read-only; changes to its value are made by the agent as and when associated entries are created/deleted in the zoneMemberTable. The default value is the zero length string."
  },
  "zoneAliasRowStatus": {
    "name": "zoneAliasRowStatus",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.9.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status of this conceptual row. This object can not be set to 'active' unless the corresponding value of zoneAliasName is unique within the VSAN."
  },
  "zoneAliasLastChange": {
    "name": "zoneAliasLastChange",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.9.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TimeStamp",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The value of sysUpTime at the time of the last change to this alias entry. If the entry has not been modified since the last re-initialization of the local network management system, then this object will contain a zero value."
  },
  "zoneAliasClone": {
    "name": "zoneAliasClone",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.9.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 64
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Setting this object to a name will result in this alias being cloned and the cloned alias will be set to this name. When this object is read, the zero-length string is returned."
  },
  "zoneMemberNumber": {
    "name": "zoneMemberNumber",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.10",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 16777216
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of entries currently present in the zoneMemberTable."
  },
  "zoneMemberTable": {
    "name": "zoneMemberTable",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.11",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains all members of a zone/alias and information about those members."
  },
  "zoneMemberEntry": {
    "name": "zoneMemberEntry",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.11.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-VSAN-MIB",
        "object": "vsanIndex",
        "implied": 0
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberTypeIndex",
        "implied": 0
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberParentIndex",
        "implied": 0
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry (conceptual row) in the zoneMemberTable. Each entry represents the relationship between a member and (one of) its 'parent(s)', i.e., a zone or alias to which the member belongs, within a particular VSAN."
  },
  "zoneMemberTypeIndex": {
    "name": "zoneMemberTypeIndex",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.11.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "zone": 1,
          "alias": 2
        }
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This object determines whether this member belongs to a zone or an alias."
  },
  "zoneMemberParentIndex": {
    "name": "zoneMemberParentIndex",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.11.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 8192
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This object contains the value of the index of the zone or alias to which this member belongs to. If the value of the corresponding instance of zoneMemberTypeIndex is 'zone', then this object will contain the value of the zoneIndex object of the zone to which this member belongs to. If the value of the corresponding instance of zoneMemberTypeIndex is 'alias', then this object will contain the value of the zoneAliasIndex object of the alias to which this member belongs to."
  },
  "zoneMemberIndex": {
    "name": "zoneMemberIndex",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.11.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 2048
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The index of this zone member on this VSAN on this zone/alias."
  },
  "zoneMemberFormat": {
    "name": "zoneMemberFormat",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.11.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZoneMemberType",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object identifies the format of the zone/alias member's identifier contained in zoneMemberID. This object cannot be modified while the corresponding value of zoneMemberRowStatus object is 'active'."
  },
  "zoneMemberID": {
    "name": "zoneMemberID",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.11.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 255
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object represents the zone/alias member ID. The interpretation of this object depends on the zoneMemberFormat object. If the value of corresponding instance of zoneMemberFormat object is 'wwn', then this object holds an 8 octet long Port WWN. If the value of corresponding instance of zoneMemberFormat object is 'domainPort', then this object contains a 2 octet value. The first octet will represent the domain and the second octet will represent the port. If the value of the corresponding instance of zoneMemberFormat object is 'fcAddr', then this object contains the 3 octet N_Port FC-ID. If the value of the corresponding instance of zoneMemberFormat object is 'fwwn', then this object contains the 8 octet Fabric Port WWN. If the value of the corresponding instance of zoneMemberFormat object is 'symNodeName', then this object contains a symbolic node name which could be of length 1 to 255 bytes. If the value of corresponding instance of zoneMemberFormat object is 'intf', then this object will contain a 12 octet value which is a concatenation of 4 octets containing an interface index (ifIndex) encoded in network byte order, and 8 octets containing the WWN of a switch. If the value of corresponding instance of zoneMemberFormat object is 'domainIntf', then this object will contain a 5 octet value which is a concatenation of 1 octet representing the domain and 4 octets representing an interface index (ifIndex) encoded in network byte order. If the value of corresponding instance of zoneMemberFormat object is 'ipAddr', then this object will contain a 4 octet IP address value followed by an optional 4 octets of subnet mask. If the value of corresponding instance of zoneMemberFormat object is 'ipAddrv6', then this object will contain a 16 octet IPv6 address value followed by an optional 4 octets of prefix length encoded in network byte order. If the value of the corresponding instance of zoneMemberFormat object is 'deviceAlias', then this object contains a Device Alias which could be of length 1 to 64 bytes. This object cannot be modified while the corresponding value of zoneMemberRowStatus object is 'active'."
  },
  "zoneMemberLunID": {
    "name": "zoneMemberLunID",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.11.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 0
          },
          {
            "min": 8,
            "max": 8
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object specifies the Lun ID if Lun zoning is configured. If this object is the zero-length string, then Lun zoning is not configured. Lun zoning cannot be configured when the corresponding instance of zoneMemberFormat object has a value of 'fwwn', 'intf' or 'symNodeName'. This object cannot be modified while the corresponding value of zoneMemberRowStatus object is 'active'."
  },
  "zoneMemberRowStatus": {
    "name": "zoneMemberRowStatus",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.11.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status of this conceptual row. zoneMemberID and zoneMemberFormat objects MUST be set before or concurrently with setting the corresponding instance of zoneMemberRowStatus to 'active'. If Lun zoning needs to be configured, then zoneMemberLunID object also needs to be set before or concurrently with setting the corresponding instance of zoneMemberRowStatus to 'active'."
  },
  "zoneEnforcedZoneSetNumber": {
    "name": "zoneEnforcedZoneSetNumber",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.12",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 2048
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of entries currently present in the zoneEnforcedZoneSetTable."
  },
  "zoneEnforcedZoneSetTable": {
    "name": "zoneEnforcedZoneSetTable",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.13",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table containing information on all currently enforced zone sets (active zone sets) on all VSANs. Only one zone set can be activated per VSAN. The active zone set is one which is copied from the zone set database (zoneSetTable) at the time it was activated. This active zone set is then enforced on the fabric. This active zone set cannot be modified. Note that this table will be empty when no zone set is activated."
  },
  "zoneEnforcedZoneSetEntry": {
    "name": "zoneEnforcedZoneSetEntry",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.13.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-VSAN-MIB",
        "object": "vsanIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry (conceptual row) in the zoneEnforcedZoneSetTable."
  },
  "zoneEnforcedZoneSetName": {
    "name": "zoneEnforcedZoneSetName",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.13.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 64
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The name of this zone set on this VSAN."
  },
  "zoneEnforcedZoneSetZoneList": {
    "name": "zoneEnforcedZoneSetZoneList",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.13.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "FcList",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The set of zones which form this zone set on this VSAN. This object was copied from the zoneSetZoneList object in the zoneSetTable at the time when the currently active zone set was activated."
  },
  "zoneEnforcedZoneSetActivateTime": {
    "name": "zoneEnforcedZoneSetActivateTime",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.13.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TimeStamp",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The sysUpTime at which this entry was most recently activated. If this entry has been activated prior to the last re-initialization of the local network management system, then this object will contain a zero value."
  },
  "zoneEnforcedZoneNumber": {
    "name": "zoneEnforcedZoneNumber",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.14",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 8388608
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of entries currently present in the zoneEnforcedZoneTable."
  },
  "zoneEnforcedZoneTable": {
    "name": "zoneEnforcedZoneTable",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.15",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains all the zones/aliases that are present in the active zone sets on all VSANs."
  },
  "zoneEnforcedZoneEntry": {
    "name": "zoneEnforcedZoneEntry",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.15.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-VSAN-MIB",
        "object": "vsanIndex",
        "implied": 0
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry (conceptual row) in this table."
  },
  "zoneEnforcedZoneName": {
    "name": "zoneEnforcedZoneName",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.15.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 64
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The name of this zone."
  },
  "zoneEnforcedZoneMemberList": {
    "name": "zoneEnforcedZoneMemberList",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.15.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "FcList",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The set of members that form this zone on this VSAN. This object was copied from the zoneMemberList object in the zoneTable at the time when the currently active zone set was activated."
  },
  "zoneEnforcedZoneAliasList": {
    "name": "zoneEnforcedZoneAliasList",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.15.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "FcList",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The set of aliases that form this zone on this VSAN. This object was copied from the zoneAliasList object in the zoneTable at the time when the currently active zone set was activated."
  },
  "zoneEnforcedZoneActivateTime": {
    "name": "zoneEnforcedZoneActivateTime",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.15.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TimeStamp",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The sysUpTime at which this entry was most recently activated. If this entry has been activated prior to the last re-initialization of the local network management system, then this object will contain a zero value."
  },
  "zoneEnforcedZoneReadOnly": {
    "name": "zoneEnforcedZoneReadOnly",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.15.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates whether this is a read-only zone. This object was copied from the zoneReadOnly object in the zoneTable at the time when the currently active zone set was activated."
  },
  "zoneEnforcedZoneQos": {
    "name": "zoneEnforcedZoneQos",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.15.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates whether this is a qos enabled zone. This object was copied from the zoneQos object in the zoneTable at the time when the currently active zone set was activated."
  },
  "zoneEnforcedZoneQosPriority": {
    "name": "zoneEnforcedZoneQosPriority",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.15.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZoneQosPriorityLevel",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the priority of qos if it is a qos enabled zone. This object was copied from the zoneQosPriority object in the zoneTable at the time when the currently active zone set was activated."
  },
  "zoneEnforcedZoneBroadcast": {
    "name": "zoneEnforcedZoneBroadcast",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.15.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates whether broadcast zoning is enabled. This object was copied from the zoneBroadcast object in the zoneTable at the time when the currently active zone set was activated."
  },
  "zoneEnforcedZoneAliasNumber": {
    "name": "zoneEnforcedZoneAliasNumber",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.16",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 8488608
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The number of entries currently present in the zoneEnforcedZoneAliasTable."
  },
  "zoneEnforcedZoneAliasTable": {
    "name": "zoneEnforcedZoneAliasTable",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.17",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "deprecated",
    "description": "This table contains all the aliases that are a part of active zone sets on all VSANs."
  },
  "zoneEnforcedZoneAliasEntry": {
    "name": "zoneEnforcedZoneAliasEntry",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.17.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-VSAN-MIB",
        "object": "vsanIndex",
        "implied": 0
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasIndex",
        "implied": 0
      }
    ],
    "status": "deprecated",
    "description": "An entry (conceptual row) in this table."
  },
  "zoneEnforcedZoneAliasName": {
    "name": "zoneEnforcedZoneAliasName",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.17.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 64
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The name of this alias."
  },
  "zoneEnforcedZoneAliasMemberList": {
    "name": "zoneEnforcedZoneAliasMemberList",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.17.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "FcList",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The set of members that form this alias on this VSAN. This object was copied from the zoneAliasMemberList object in the zoneAliasTable at the time when the currently active zone set was activated."
  },
  "zoneEnforcedZoneMemberNumber": {
    "name": "zoneEnforcedZoneMemberNumber",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.18",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 16777216
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of entries currently present in the zoneEnforcedZoneMemberTable."
  },
  "zoneEnforcedZoneMemberTable": {
    "name": "zoneEnforcedZoneMemberTable",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.19",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains all members that are part of a zone/alias and are part of the active zone sets on all VSANs."
  },
  "zoneEnforcedZoneMemberEntry": {
    "name": "zoneEnforcedZoneMemberEntry",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.19.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-VSAN-MIB",
        "object": "vsanIndex",
        "implied": 0
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberTypeIndex",
        "implied": 0
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberParentIndex",
        "implied": 0
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry (conceptual row) in this table."
  },
  "zoneEnforcedZoneMemberFormat": {
    "name": "zoneEnforcedZoneMemberFormat",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.19.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZoneMemberType",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object identifies the address format of this member. The address is contained in the corresponding instance of zoneEnforcedZoneMemberID object."
  },
  "zoneEnforcedZoneMemberID": {
    "name": "zoneEnforcedZoneMemberID",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.19.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 255
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object represents this member's address. This object was copied from the zoneMemberID object in the zoneMemberTable at the time when the currently active zone set was activated."
  },
  "zoneEnforcedZoneMemberLunID": {
    "name": "zoneEnforcedZoneMemberLunID",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.19.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 0
          },
          {
            "min": 8,
            "max": 8
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object specifies the Lun ID if LUN zoning is configured. This object was copied from the zoneMemberLunID object in the zoneMemberTable at the time when the currently active zone set was activated."
  },
  "zoneMergeFailRecoverSpinLock": {
    "name": "zoneMergeFailRecoverSpinLock",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.20",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TestAndIncr",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object is used to facilitate modification of zoneMergeFailRecoverInterface, zoneMergeFailRecoverVsan and zoneMergeFailRecoverOper by multiple managers. The procedure for modifying these objects is as follows: 1. Determine new values for zoneMergeFailRecoverInterface, zoneMergeFail- RecoverVsan and zoneMergeFailRecoverOper. 2. Retrieve the value of zoneMergeFailRecoverSpinLock. 3. Set the value of zoneMergeFailRecoverSpinLock to the retrieved value, and (in the same PDU) the value of zoneMergeFailRecoverInterface to the new value. If the set fails for zoneMergeFailRecoverSpinLock object, go back to step 2. 4. Set the value of zoneMergeFailRecoverSpinLock to the retrieved value plus one, and (in the same PDU) the value of zoneMergeFailRecoverVsan to the new value. If the set fails for zoneMergeFailRecoverSpinLock object, go back to step 2. 5. Set the value of zoneMergeFailRecoverSpinLock to the retrieved value plus two, and (in the same PDU) the value of zoneMergeFailRecoverOper to the new value. If the set fails for zoneMergeFailRecoverSpinLock object, go back to step 2. Note that if it's possible to include zoneMergeFailRecoverVsan and/or zoneMergeFailRecoverOper in the (Set Req) PDU of an earlier step, then steps 4 and/or 5 can be eliminated."
  },
  "zoneMergeFailRecoverInterface": {
    "name": "zoneMergeFailRecoverInterface",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.21",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "InterfaceIndexOrZero",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The interface on which the Merge Failure Recovery needs to be carried out. The value of this object before the first set operation will be zero."
  },
  "zoneMergeFailRecoverVsan": {
    "name": "zoneMergeFailRecoverVsan",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.22",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "VsanIndex",
      "class": "type"
    },
    "default": {
      "default": {
        "value": 1,
        "format": "decimal"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The VSAN on which the Merge Failure Recovery needs to be carried out."
  },
  "zoneMergeFailRecoverOper": {
    "name": "zoneMergeFailRecoverOper",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.23",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "import": 1,
          "export": 2,
          "noop": 3
        }
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The operation to be carried out. If this object is set to 'import', then the Active Zone Set from across the isolated link is imported. If this object is set to 'export', then the Active Zone Set on the local system is exported across the isolated link. No action is taken if this object is set to 'noop'. The value of this object when read is always 'noop'."
  },
  "zoneMergeFailRecoverResult": {
    "name": "zoneMergeFailRecoverResult",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.24",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "success": 1,
          "failure": 2,
          "inProgress": 3
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The result of the last Merge Failure Recovery operation that was attempted. If the value of this object is 'success', then the merge fail recovery operation was successful. If the value of this object is 'failure', then the merge fail recovery operation failed. If the value of this object is 'inProgress', then the merge fail recovery operation is still in progress."
  },
  "zoneCopyActiveToFullOnVsan": {
    "name": "zoneCopyActiveToFullOnVsan",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.25",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "VsanIndex",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "deprecated",
    "description": "The VSAN on which the enforced zone set (active zone set) needs to be copied to the zone set database (full zone set). Setting this object to a valid VSAN will trigger a copy of the enforced zone set on that VSAN to the zone set database on the same VSAN. Setting this object to an invalid VSAN-id will result in an error and no copy will take place."
  },
  "zoneTotalGS3Rejects": {
    "name": "zoneTotalGS3Rejects",
    "oid": "1.3.6.1.4.1.9.9.294.1.2.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The total number of GS3 requests rejected by this Zone Server across all VSANs."
  },
  "zoneStatsTable": {
    "name": "zoneStatsTable",
    "oid": "1.3.6.1.4.1.9.9.294.1.2.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains statistic counters which are maintained by the Zone Server. These counters are maintained per VSAN."
  },
  "zoneStatsEntry": {
    "name": "zoneStatsEntry",
    "oid": "1.3.6.1.4.1.9.9.294.1.2.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-VSAN-MIB",
        "object": "vsanIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry (conceptual row) in this table."
  },
  "zoneTxMergeReqs": {
    "name": "zoneTxMergeReqs",
    "oid": "1.3.6.1.4.1.9.9.294.1.2.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of Merge Request Frames sent by this Zone Server to other Zone Servers in the fabric on this VSAN."
  },
  "zoneRxMergeAccepts": {
    "name": "zoneRxMergeAccepts",
    "oid": "1.3.6.1.4.1.9.9.294.1.2.2.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of Merge Accept Frames received by this Zone Server from other Zone Servers in the fabric on this VSAN."
  },
  "zoneRxMergeReqs": {
    "name": "zoneRxMergeReqs",
    "oid": "1.3.6.1.4.1.9.9.294.1.2.2.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of Merge Request Frames received by this Zone Server from other Zone Servers in the fabric on this VSAN."
  },
  "zoneTxMergeAccepts": {
    "name": "zoneTxMergeAccepts",
    "oid": "1.3.6.1.4.1.9.9.294.1.2.2.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of Merge Accept Frames sent by this Zone Server to other Zone Servers in the fabric on this VSAN."
  },
  "zoneTxChangeReqs": {
    "name": "zoneTxChangeReqs",
    "oid": "1.3.6.1.4.1.9.9.294.1.2.2.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of Change Requests sent by this Zone Server to other Zone Servers in the fabric on this VSAN. This includes Acquire Change Authorization requests, Stage Fabric Config Update requests, Update Fabric Config requests and Release Change Authorization requests."
  },
  "zoneRxChangeAccepts": {
    "name": "zoneRxChangeAccepts",
    "oid": "1.3.6.1.4.1.9.9.294.1.2.2.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of Change Responses received by this Zone Server from other Zone Servers in the fabric on this VSAN. This includes Acquire Change Authorization Accept, Stage Fabric Config Update Accept, Update Fabric Config Accept and Release Change Authorization Accept frames."
  },
  "zoneRxChangeReqs": {
    "name": "zoneRxChangeReqs",
    "oid": "1.3.6.1.4.1.9.9.294.1.2.2.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of Change Requests received by this Zone Server from other Zone Servers in the fabric on this VSAN. This includes Acquire Change Authorization requests, Stage Fabric Config Update requests, Update Fabric Config requests and Release Change Authorization requests."
  },
  "zoneTxChangeAccepts": {
    "name": "zoneTxChangeAccepts",
    "oid": "1.3.6.1.4.1.9.9.294.1.2.2.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of Change Responses sent by this Zone Server to other Zone Servers in the fabric on this VSAN. This includes Acquire Change Authorization Accept, Stage Fabric Config Update Accept, Update Fabric Config Accept and Release Change Authorization Accept frames."
  },
  "zoneRxGS3Reqs": {
    "name": "zoneRxGS3Reqs",
    "oid": "1.3.6.1.4.1.9.9.294.1.2.2.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of GS3 requests received by this Zone Server on this VSAN."
  },
  "zoneTxGS3Rejects": {
    "name": "zoneTxGS3Rejects",
    "oid": "1.3.6.1.4.1.9.9.294.1.2.2.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of GS3 requests rejected by this Zone Server on this VSAN."
  },
  "zoneLunStatsTable": {
    "name": "zoneLunStatsTable",
    "oid": "1.3.6.1.4.1.9.9.294.1.2.3",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains statistic counters related to LUNs. These counters are populated by the local Zone Server based on SCSI frames that are forwarded to it because the LUNs being accessed have been zoned out from a initiator's list of accessible LUNs. These counters are maintained per VSAN, per SCSI initiator-target pair, per LUN."
  },
  "zoneLunStatsEntry": {
    "name": "zoneLunStatsEntry",
    "oid": "1.3.6.1.4.1.9.9.294.1.2.3.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-VSAN-MIB",
        "object": "vsanIndex",
        "implied": 0
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneLunSrcFcId",
        "implied": 0
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneLunDstFcId",
        "implied": 0
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneLunNum",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Each entry provides SCSI statistics, at the local Zone Server, for the host identified by zoneLunSrcFcId trying to access the LUN identified by zoneLunNum, that has been zoned out from zoneLunSrcFcId's list of accessible LUNs, on the disk identified by zoneLunDstFcId on the VSAN identified by vsanIndex."
  },
  "zoneLunSrcFcId": {
    "name": "zoneLunSrcFcId",
    "oid": "1.3.6.1.4.1.9.9.294.1.2.3.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "FcAddressId",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The FC-ID of a SCSI initiator that is accessing a LUN identified by zoneLunNum."
  },
  "zoneLunDstFcId": {
    "name": "zoneLunDstFcId",
    "oid": "1.3.6.1.4.1.9.9.294.1.2.3.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "FcAddressId",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The FC-ID of a SCSI target containing the LUN identified by zoneLunNum."
  },
  "zoneLunNum": {
    "name": "zoneLunNum",
    "oid": "1.3.6.1.4.1.9.9.294.1.2.3.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 8,
            "max": 8
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The LUN that is being accessed."
  },
  "zoneLunRxInqReqs": {
    "name": "zoneLunRxInqReqs",
    "oid": "1.3.6.1.4.1.9.9.294.1.2.3.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "Section 7.4 INQUIRY command. SCSI Primary Commands- 3 (SPC-3)",
    "status": "current",
    "description": "The number of SCSI INQUIRY commands that have been received by the local Zone Server from the SCSI initiator zoneLunSrcFcId to the SCSI target zoneLunDstFcId for the LUN zoneLunNum, on the VSAN vsanIndex."
  },
  "zoneLunRxRepLunReqs": {
    "name": "zoneLunRxRepLunReqs",
    "oid": "1.3.6.1.4.1.9.9.294.1.2.3.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "Section 7.22 REPORT LUNS command. SCSI Primary Commands- 3 (SPC-3)",
    "status": "current",
    "description": "The number of SCSI Report LUNs commands that have been received by the local Zone Server from the SCSI initiator zoneLunSrcFcId to the SCSI target zoneLunDstFcId for the LUN zoneLunNum, on the VSAN vsanIndex. Typically the Report LUNs command is sent only for LUN 0."
  },
  "zoneLunRxSenseReqs": {
    "name": "zoneLunRxSenseReqs",
    "oid": "1.3.6.1.4.1.9.9.294.1.2.3.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "Section 7.25 REQUEST SENSE command. SCSI Primary Commands- 3 (SPC-3)",
    "status": "current",
    "description": "The number of SCSI SENSE commands that have been received by the local Zone Server from the SCSI initiator zoneLunSrcFcId to the SCSI target zoneLunDstFcId for the LUN zoneLunNum, on the VSAN vsanIndex."
  },
  "zoneLunRxOtherCmds": {
    "name": "zoneLunRxOtherCmds",
    "oid": "1.3.6.1.4.1.9.9.294.1.2.3.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of SCSI Read, Write, Seek etc. commands received by the local Zone Server from the SCSI initiator zoneLunSrcFcId to the SCSI target zoneLunDstFcId for the LUN zoneLunNum, on the VSAN vsanIndex, during changes to the zoning configuration."
  },
  "zoneLunTxInqDataNoLus": {
    "name": "zoneLunTxInqDataNoLus",
    "oid": "1.3.6.1.4.1.9.9.294.1.2.3.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "Section 5.9.3 Incorrect Logical Unit Selection SCSI Architectural Model- 2 (SAM-2)",
    "status": "current",
    "description": "The number of 'No LU' error responses sent by the local Zone Server in response to SCSI INQUIRY commands from the SCSI initiator zoneLunSrcFcId to the SCSI target zoneLunDstFcId for the LUN zoneLunNum, on the VSAN vsanIndex."
  },
  "zoneLunTxIllegalReqs": {
    "name": "zoneLunTxIllegalReqs",
    "oid": "1.3.6.1.4.1.9.9.294.1.2.3.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "Section 5.9.3 Incorrect Logical Unit Selection SCSI Architectural Model- 2 (SAM-2)",
    "status": "current",
    "description": "The number of 'Illegal Request Check Condition' responses sent by the local Zone Server in response to SCSI commands from the SCSI initiator zoneLunSrcFcId to the SCSI target zoneLunDstFcId for the LUN zoneLunNum, on the VSAN vsanIndex."
  },
  "zoneRoZoneStatsTable": {
    "name": "zoneRoZoneStatsTable",
    "oid": "1.3.6.1.4.1.9.9.294.1.2.4",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains statistic counter(s) related to read-only zones which are maintained by the Zone Server. These counters are maintained per VSAN, per SCSI initiator target pair, per LUN."
  },
  "zoneRoZoneStatsEntry": {
    "name": "zoneRoZoneStatsEntry",
    "oid": "1.3.6.1.4.1.9.9.294.1.2.4.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-VSAN-MIB",
        "object": "vsanIndex",
        "implied": 0
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneRoZoneSrcFcId",
        "implied": 0
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneRoZoneDstFcId",
        "implied": 0
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneRoZoneLunNum",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Each entry provides statistics for the host identified by zoneRoZoneSrcFcId accessing the LUN identified by zoneRoZoneLunNum on the disk identified by zoneRoZoneDstFcId on the VSAN identified by vsanIndex."
  },
  "zoneRoZoneSrcFcId": {
    "name": "zoneRoZoneSrcFcId",
    "oid": "1.3.6.1.4.1.9.9.294.1.2.4.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "FcAddressId",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The FC-ID of a SCSI initiator that is accessing a LUN identified by zoneRoZoneLunNum."
  },
  "zoneRoZoneDstFcId": {
    "name": "zoneRoZoneDstFcId",
    "oid": "1.3.6.1.4.1.9.9.294.1.2.4.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "FcAddressId",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The FC-ID of a SCSI target containing the LUN identified by zoneRoZoneLunNum."
  },
  "zoneRoZoneLunNum": {
    "name": "zoneRoZoneLunNum",
    "oid": "1.3.6.1.4.1.9.9.294.1.2.4.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 8,
            "max": 8
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The LUN that is being accessed."
  },
  "zoneRoZoneTxDataProts": {
    "name": "zoneRoZoneTxDataProts",
    "oid": "1.3.6.1.4.1.9.9.294.1.2.4.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "Section 5.1.13 Error Reporting, SCSI-3 Block Commands (SBC)",
    "status": "current",
    "description": "The number of 'Data protected Check Condition' error responses sent by the local Zone Server, when the SCSI initiator identified by zoneRoZoneSrcFcId tries to modify a LUN identified by zoneRoZoneLunNum on the SCSI target zoneRoZoneDstFcId."
  },
  "zoneServiceRejReasonCode": {
    "name": "zoneServiceRejReasonCode",
    "oid": "1.3.6.1.4.1.9.9.294.1.3.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "FcGs3RejectReasonCode",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object contains the reason code corresponding to the latest Zone Server request rejection."
  },
  "zoneServiceRejReasonCodeExp": {
    "name": "zoneServiceRejReasonCodeExp",
    "oid": "1.3.6.1.4.1.9.9.294.1.3.2",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "FcZoneServerRejReasonExpl",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object contains the reason code explanation if the reason code is 'Unable to perform command req'. This object also corresponds to the latest Zone Server request rejection."
  },
  "zoneMergeFailureVSANNum": {
    "name": "zoneMergeFailureVSANNum",
    "oid": "1.3.6.1.4.1.9.9.294.1.3.3",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 4096
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object contains the number of the VSAN on an interface on which the last zone merge failed. If the zone merge has failed on all VSANs, then this object will contain the value of 0."
  },
  "zoneMergeSuccessVSANNum": {
    "name": "zoneMergeSuccessVSANNum",
    "oid": "1.3.6.1.4.1.9.9.294.1.3.4",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 4096
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object contains the number of the VSAN on an interface on which the last zone merge succeeded. If the zone merge has succeeded on all VSANs, then this object will contain the value of 0."
  },
  "zoneMergeFailureObject": {
    "name": "zoneMergeFailureObject",
    "oid": "1.3.6.1.4.1.9.9.294.1.3.5",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type"
    },
    "maxaccess": "accessible-for-notify",
    "status": "current",
    "description": "This object contains the name of the zoning database object which was the cause of the merge failure. In cases where it is not applicable, this object will contain the null string."
  },
  "zoneMergeFailureReason": {
    "name": "zoneMergeFailureReason",
    "oid": "1.3.6.1.4.1.9.9.294.1.3.6",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "ZoneMergeFailCause",
      "class": "type"
    },
    "maxaccess": "accessible-for-notify",
    "status": "current",
    "description": "This object contains the reason for the the merge failure."
  },
  "zoneServiceReqRejNotifyEnable": {
    "name": "zoneServiceReqRejNotifyEnable",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.26",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object specifies if the Zone Server should issue a 'zoneServiceReqRejNotify' notification. If the value of this object is 'true', then the notification is issued. If the value of this object is 'false', then the notification is not issued."
  },
  "zoneMergeFailureNotifyEnable": {
    "name": "zoneMergeFailureNotifyEnable",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.27",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object specifies if the zone server should issue a zoneMergeFailureNotify notification. If the value of this object is 'true', then the notification is issued. If the value of this object is 'false', then the notification is not issued."
  },
  "zoneMergeSuccessNotifyEnable": {
    "name": "zoneMergeSuccessNotifyEnable",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.28",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object specifies if the zone server should issue a zoneMergeSuccessNotify notification. If the value of this object is 'true', then the notification is issued. If the value of this object is 'false', then the notification is not issued."
  },
  "zoneDefZoneBehvrChngNotifyEnable": {
    "name": "zoneDefZoneBehvrChngNotifyEnable",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.29",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object specifies if the zone server should issue a zoneDefZoneBehaviourChngNotify notification. If the value of this object is 'true', then the notification is issued. If the value of this object is 'false', then the notification is not issued."
  },
  "zoneDbTable": {
    "name": "zoneDbTable",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.30",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains one entry for each VSAN that is configured. These entries provide the capability to perform operations on the local zone server database on a VSAN."
  },
  "zoneDbEntry": {
    "name": "zoneDbEntry",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.30.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-VSAN-MIB",
        "object": "vsanIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry (conceptual row) in this table."
  },
  "zoneDbClearDb": {
    "name": "zoneDbClearDb",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.30.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "clear": 1,
          "noop": 2
        }
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Setting this object to 'clear(1)', will result in the local zone server database being deleted on this VSAN. Setting this object to 'noop(2)', results in no action. When read, the value of this object is always 'noop(2)'."
  },
  "zoneDbEnforcedEqualsLocal": {
    "name": "zoneDbEnforcedEqualsLocal",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.30.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates if the enforced database is the same as the local database on this VSAN. If the value of this object is 'true', then they are the same. If the value of this object is 'false', then they are not the same."
  },
  "zoneDbHardZoningEnabled": {
    "name": "zoneDbHardZoningEnabled",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.30.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates if hard zoning is enabled on this VSAN. Hard Zoning is a mechanism by which zoning is enforced in hardware. If the value of this object is 'true', then hard zoning is enabled on this VSAN. If the value of this object is 'false', then hard zoning is not enabled on this VSAN."
  },
  "zoneCopyTable": {
    "name": "zoneCopyTable",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.31",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "In this table, for each VSAN that is configured, atmost one entry can be created. These entries provide the capability to copy the active zone set on a VSAN to a file on the local device and/or to a remote device over the network. At any point of time, only one copy operation can be active for all the VSANs. If a second copy is attempted, it will result in error."
  },
  "zoneCopyEntry": {
    "name": "zoneCopyEntry",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.31.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-VSAN-MIB",
        "object": "vsanIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry (conceptual row) in this table."
  },
  "zoneCopyProto": {
    "name": "zoneCopyProto",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.31.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZoneCopyProtocol",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "tftp",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The protocol to be used for the copy of the active zone set on this VSAN. If the copy needs to take place on the local device, then the value of this object will be ignored."
  },
  "zoneCopyDestFileType": {
    "name": "zoneCopyDestFileType",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.31.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZoneFileType",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "localFile",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The type of file to which the active zoneset needs to be copied. If the value of this object is set to 'networkFile(1)', then values must be set for the corresponding instances of zoneCopyServerAddr and zoneCopyDestFileName objects. If the value of this object is set to 'localFile(2)', then the corresponding instance of zoneCopyDestFileName must be set."
  },
  "zoneCopyServerAddrType": {
    "name": "zoneCopyServerAddrType",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.31.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressType",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "ipv4",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The type of address of the remote device as specified by the corresponding instance of zoneCopyServerAddr object."
  },
  "zoneCopyServerAddr": {
    "name": "zoneCopyServerAddr",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.31.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The ip address of the remote device to which the active zoneset on this VSAN needs to be copied. This object must be set to a valid value when the corresponding instance of zoneCopyDestFileType is set to 'networkFile' before the copy can be initiated by means of the zoneCopyStartCopy object. The protocol to be used for the copy operation is specified by the value of the corresponding instance of zoneCopyProto object."
  },
  "zoneCopyDestFileName": {
    "name": "zoneCopyDestFileName",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.31.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 255
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The file-name, including the full path, of the file to which the active zoneset on this VSAN needs to be copied. This object must be set to a valid value before the copy can be initiated by means of the zoneCopyStartCopy object."
  },
  "zoneCopyUserName": {
    "name": "zoneCopyUserName",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.31.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 32
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The user name on the remote device onto which the active zoneset on this VSAN needs to be copied. This object needs to be set only if the value of the corresponding instance of zoneCopyDestFileType object is 'networkFile'."
  },
  "zoneCopyUserPassword": {
    "name": "zoneCopyUserPassword",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.31.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 32
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The password corresponding to the user name specified by zoneCopyUserName object on the remote device. This object is meaningful only if the corresponding instance of zoneCopyDestFileType object is 'networkFile' and the protocol to be used as specified by zoneCopyProto is 'ftp' or 'sftp' or 'scp'. The value of this object when read is always the zero length string for security reasons."
  },
  "zoneCopyStartCopy": {
    "name": "zoneCopyStartCopy",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.31.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "copy": 1,
          "noop": 2
        }
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object provides the capability to start the copy operation of the active zoneset on this VSAN to the desired destination. When set to 'copy(1)', the copy of the active zoneset on this VSAN is started. No action is taken if this object is set to 'noop(2)'. The value of this object when read is always 'noop'."
  },
  "zoneCopyState": {
    "name": "zoneCopyState",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.31.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "success": 1,
          "timeout": 2,
          "badFileName": 3,
          "inProgress": 4,
          "badUserNamePasswd": 5,
          "incompleteConfig": 6,
          "unknown": 7,
          "sysErr": 8,
          "anotherCopyInProgress": 9
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The result of the most recent copy operation on this VSAN. success(1) - indicates that the copy operation was successful. timeout(2) - indicates that the copy operation failed due to a timeout. badFileName(3) - indicates that the file name/ path/permissions are incorrect. inProgress(4) - indicates that this copy operation is currently in progress. badUserNamePasswd(5) - indicates that the user name/password of the remote device is incorrect. incompleteConfig(6) - configuration is incomplete. unknown(7) - error is unknown. sysErr(8) - system error anotherCopyInProgress(9) - indicates that a copy operation on the same VSAN or another VSAN is already in progress."
  },
  "zoneCopyRowStatus": {
    "name": "zoneCopyRowStatus",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.31.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status of this conceptual row."
  },
  "zoneUnsuppMemInIntOpNotifyEnable": {
    "name": "zoneUnsuppMemInIntOpNotifyEnable",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.32",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object specifies if the zone server should issue a zoneUnsuppMemInIntOpModeNotify notification. If the value of this object is 'true', then the notification is issued. If the value of this object is 'false', then the notification is not issued."
  },
  "zoneVsanId": {
    "name": "zoneVsanId",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.33",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "VsanIndex",
      "class": "type"
    },
    "maxaccess": "accessible-for-notify",
    "status": "current",
    "description": "This object represents the VSAN id on which a mismatch between the operating mode of the local switch and the type of zone members has been detected."
  },
  "zoneZoneSetDistributeVsan": {
    "name": "zoneZoneSetDistributeVsan",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.34",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "VsanIndex",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object represents the VSAN on which the full zoneset information needs to be distributed throughout the fabric. Setting this object to a valid VSAN will trigger such an operation. Setting this object to an invalid VSAN will result in an error and no action will be taken. It is to be noted that this operation of full zoneset distribution on this VSAN is done immediately and this is independent of activation/deactivation. This is supported only in 'interop' modes 2 and 3. When a full zoneset distribute operation is in process on a VSAN, any attempt to start the same on another VSAN will result in error."
  },
  "zoneZoneSetDistributeResult": {
    "name": "zoneZoneSetDistributeResult",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.35",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "success": 1,
          "failure": 2,
          "inProgress": 3
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The outcome of the full zoneset distribute operation on the VSAN indicated by zoneZoneSetDistributeVsan object."
  },
  "zoneZoneSetDistributeFailReason": {
    "name": "zoneZoneSetDistributeFailReason",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.36",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "FcChangeProtoFailCause",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "If the outcome of distributing the full zoneset on a VSAN is failure, then this object will contain the reason for the failure. In other cases, the value of this object does not make sense."
  },
  "zoneSwitchWwn": {
    "name": "zoneSwitchWwn",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.37",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "FcNameId",
      "class": "type"
    },
    "maxaccess": "accessible-for-notify",
    "status": "current",
    "description": "This object represents the WWN of the local device. It is used in the notification zoneActivateNotify."
  },
  "zoneSetZoneListTable": {
    "name": "zoneSetZoneListTable",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.38",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table is an extension to the zoneSetTable defined above. The object zoneSetZoneList in zoneSetTable represents the set of zones that form a zoneset. However, this object has the limitation of being able to represent only 2048 zones. This table which extends the zoneSetTable overcomes this limitation and the number of zones that form a zoneset is increased to 8192."
  },
  "zoneSetZoneListEntry": {
    "name": "zoneSetZoneListEntry",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.38.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "augmention": {
      "name": "zoneSetZoneListEntry",
      "module": "CISCO-ZS-MIB",
      "object": "zoneSetEntry"
    },
    "status": "current",
    "description": "An entry (conceptual row) in this table represents a set of 6144 zones that can be associated with the zoneset represented by zoneSetIndex on VSAN represented by vsanIndex."
  },
  "zoneSetZoneListBmap4k": {
    "name": "zoneSetZoneListBmap4k",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.38.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "FcList",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The set of zones from ids 2049 to 4096 which form this zone set on this VSAN. The zones are identified by zoneIndex object in the zoneTable. If a particular bit has a value of '1', then the corresponding zone is a part of this zone set. All other zones have '0' in their positions or not present in the string. The default value is the zero length string."
  },
  "zoneSetZoneListBmap6k": {
    "name": "zoneSetZoneListBmap6k",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.38.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "FcList",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The set of zones from ids 4097 to 6144 which form this zone set on this VSAN. The zones are identified by zoneIndex object in the zoneTable. If a particular bit has a value of '1', then the corresponding zone is a part of this zone set. All other zones have '0' in their positions or not present in the string. The default value is the zero length string."
  },
  "zoneSetZoneListBmap8k": {
    "name": "zoneSetZoneListBmap8k",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.38.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "FcList",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The set of zones from ids 6145 to 8192 which form this zone set on this VSAN. The zones are identified by zoneIndex object in the zoneTable. If a particular bit has a value of '1', then the corresponding zone is a part of this zone set. All other zones have '0' in their positions or not present in the string. The default value is the zero length string."
  },
  "zoneSetEnforcedZoneListTable": {
    "name": "zoneSetEnforcedZoneListTable",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.39",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table is an extension to the zoneEnforcedZoneSetTable defined above. The object zoneEnforcedZoneSetZoneList in zoneEnforcedZoneSetTable represents the set of enforced zones that form an enforced zoneset. However, this object has the limitation of being able to represent only 2048 zones. This table which extends the zoneEnforcedZoneSetTable overcomes this limitation and the number of enforced zones that form an enforced zoneset is increased to 8192."
  },
  "zoneSetEnforcedZoneListEntry": {
    "name": "zoneSetEnforcedZoneListEntry",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.39.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "augmention": {
      "name": "zoneSetEnforcedZoneListEntry",
      "module": "CISCO-ZS-MIB",
      "object": "zoneEnforcedZoneSetEntry"
    },
    "status": "current",
    "description": "An entry (conceptual row) in this table represents a set of upto 6144 enforced zones that can be associated with the enforced zoneset on VSAN represented by vsanIndex."
  },
  "zoneSetEnforcedZoneListBmap4k": {
    "name": "zoneSetEnforcedZoneListBmap4k",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.39.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "FcList",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The set of zones from ids 2049 to 4096 which form the enforced zone set on this VSAN. The enforced zones are identified by zoneIndex object in the zoneEnforcedZoneTable. If a particular bit has a value of '1', then the corresponding zone is a part of this zone set. All other zones have '0' in their positions or not present in the string."
  },
  "zoneSetEnforcedZoneListBmap6k": {
    "name": "zoneSetEnforcedZoneListBmap6k",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.39.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "FcList",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The set of zones from ids 4097 to 6144 which form the enforced zone set on this VSAN. The enforced zones are identified by zoneIndex object in the zoneEnforcedZoneTable. If a particular bit has a value of '1', then the corresponding zone is a part of this zone set. All other zones have '0' in their positions or not present in the string."
  },
  "zoneSetEnforcedZoneListBmap8k": {
    "name": "zoneSetEnforcedZoneListBmap8k",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.39.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "FcList",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The set of zones from ids 6145 to 8192 which form the enforced zone set on this VSAN. The enforced zones are identified by zoneIndex object in the zoneEnforcedZoneTable. If a particular bit has a value of '1', then the corresponding zone is a part of this zone set. All other zones have '0' in their positions or not present in the string."
  },
  "zoneCompactTable": {
    "name": "zoneCompactTable",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.40",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The zoneSetZoneList object and the zoneSetZoneListTable allow upto 8192 zones to be associated with a zoneset. This is done with the help of 4 bitmaps each of which represent 2048 zones. There may exist a situation where the 'lowest' bitmap may not be fully populated but 'higher' bitmaps may have bits set in them. Semantically what this means is: the lowest 2048 zones have not been fully associated, but zones with higher ids have been associated. This kind of a situation causes problems for management stations which are only aware of older versions of this MIB. They are only aware of zoneSetZoneList object and hence only the 'lowest' 2048 zones that are associated with a zoneset. In the above situation, the total number of zones associated with the zoneset could be less than 2048. But by virtue of being distributed in the 'higher' bitmaps, those zones will not be seen by those management stations as they are not aware of the new objects in zoneSetZoneListTable. In such a situation, a management station which is aware of this version of the MIB, can choose to compact the zones associated with zonesets on a VSAN, so that the holes in the lowest 2048 zones are filled. Note that this table facilitates compaction of only the first 2048 zones and not zones belonging to 'higher' bitmaps."
  },
  "zoneCompactEntry": {
    "name": "zoneCompactEntry",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.40.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-VSAN-MIB",
        "object": "vsanIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry allows compaction to be carried out on a VSAN."
  },
  "zoneCompactFirst2k": {
    "name": "zoneCompactFirst2k",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.40.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "compact": 1,
          "noop": 2
        }
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Setting this object to 'compact' will result in compaction of the lowest 2048 zones that are associated to zonesets on this VSAN. Zones present in higher bitmaps will be moved down so that the holes in the lowest 2048 zones are filled. As a result of this, the ids of the corresponding zones are changed and a management station should re-read the zoneTable. If such a compaction is not possible or the lowest 2048 zones are already compacted, the SET operation will result in error. If a compaction operation goes through successfully, then the notification zoneCompactNotify is generated. Setting this object to 'noop', will result in no action being taken. The value of this object when read is always 'noop'."
  },
  "zoneCompactVsan": {
    "name": "zoneCompactVsan",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.41",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "VsanIndex",
      "class": "type"
    },
    "maxaccess": "accessible-for-notify",
    "status": "current",
    "description": "This object represents the VSAN on which a successful zone compaction has taken place. It is used in the notification zoneCompactNotify."
  },
  "zoneCopyActToFullSpinLock": {
    "name": "zoneCopyActToFullSpinLock",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.42",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TestAndIncr",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object is used to facilitate modification of zoneCopyActToFullMode and zoneCopyActToFullOnVsan by multiple managers. The procedure for modifying these objects is as follows: 1. Determine new values for zoneCopyActToFullMode, zoneCopyActToFullOnVsan. 2. Retrieve the value of zoneCopyActToFullSpinLock. 3. Set the value of zoneCopyActToFullSpinLock to the retrieved value, and (in the same PDU) the value of zoneCopyActToFullMode to the new value. If the set fails for zoneCopyActToFullSpinLock, go back to step 2. 4. Set the value of zoneCopyActToFullSpinLock to the retrieved value plus one, and (in the same PDU) the value of zoneCopyActToFullOnVsan to the new value. If the set fails for zoneCopyActToFullSpinLock object, go back to step 2. Note that if it's possible to include zoneCopyActToFullOnVsan in the (Set Req) PDU of the earlier step, then step 4 can be eliminated."
  },
  "zoneCopyActToFullMode": {
    "name": "zoneCopyActToFullMode",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.43",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "includeAutoZones": 1,
          "excludeAutoZones": 2,
          "noop": 3
        }
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Setting this object to 'includeAutoZones', results in certain internal zones created by Zone Server being copied along with the enforced database to the full zoneset database. Setting this object to 'excludeAutoZones', does not copy those zones. Setting this object to 'noop' results in no action being taken. The value of this object when read is always 'noop'."
  },
  "zoneCopyActToFullVsan": {
    "name": "zoneCopyActToFullVsan",
    "oid": "1.3.6.1.4.1.9.9.294.1.1.44",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "VsanIndex",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The VSAN on which the enforced zone set (active zone set) needs to be copied to the zone set database (full zone set). Setting this object to a valid VSAN will trigger a copy of the enforced zone set on that VSAN to the zone set database on the same VSAN. Setting this object to an invalid VSAN-id will result in an error and no copy will take place."
  },
  "zoneServiceReqRejNotify": {
    "name": "zoneServiceReqRejNotify",
    "oid": "1.3.6.1.4.1.9.9.294.1.4.0.1",
    "class": "notificationtype",
    "objects": [
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberFormat"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberID"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneServiceRejReasonCode"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneServiceRejReasonCodeExp"
      }
    ],
    "status": "current",
    "description": "This notification is generated whenever the local Zone Server rejects a registration request. The Zone Server should update the zoneServiceRejReasonCode and zoneServiceRejReason- CodeExp objects with the corresponding reason code and reason code explanation before sending the notification. The zoneMemberType and zoneMemberID identify the source of the request."
  },
  "zoneMergeFailureNotify": {
    "name": "zoneMergeFailureNotify",
    "oid": "1.3.6.1.4.1.9.9.294.1.4.0.2",
    "class": "notificationtype",
    "objects": [
      {
        "module": "IF-MIB",
        "object": "ifIndex"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailureVSANNum"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailureObject"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailureReason"
      }
    ],
    "status": "current",
    "description": "This notification is generated whenever there is a zone merge failure. If all VSANs on a link have a zone-merge failure at the same time, then just one notification is generated in which zoneMergeFailureVSANNum object has a zero value. The zoneMergeFailureObject and zoneMergeFailureReason assist in providing information regarding the point of merge failure."
  },
  "zoneMergeSuccessNotify": {
    "name": "zoneMergeSuccessNotify",
    "oid": "1.3.6.1.4.1.9.9.294.1.4.0.3",
    "class": "notificationtype",
    "objects": [
      {
        "module": "IF-MIB",
        "object": "ifIndex"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeSuccessVSANNum"
      }
    ],
    "status": "current",
    "description": "This notification is generated whenever a zone merge happens successfully. If all VSANs on a link have a zone-merge success at the same time, then just one notification is generated in which zoneMergeSuccessVSANNum object has a zero value."
  },
  "zoneDefZoneBehaviourChngNotify": {
    "name": "zoneDefZoneBehaviourChngNotify",
    "oid": "1.3.6.1.4.1.9.9.294.1.4.0.4",
    "class": "notificationtype",
    "objects": [
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDefaultZoneBehaviour"
      }
    ],
    "status": "current",
    "description": "This notification is generated whenever the value of zoneDefaultZoneBehaviour changes."
  },
  "zoneUnsuppMemInIntOpModeNotify": {
    "name": "zoneUnsuppMemInIntOpModeNotify",
    "oid": "1.3.6.1.4.1.9.9.294.1.4.0.5",
    "class": "notificationtype",
    "objects": [
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneVsanId"
      }
    ],
    "status": "current",
    "description": "This notification is generated whenever one or more zone members are not supported in the mode in which the local switch is currently configured to function. The switch can be configured to operate in certain 'interoperable' modes on a VSAN basis to enable it to work with switches from other vendors. The zoneVsanId object identifies the VSAN on which the mismatch has been identified."
  },
  "zoneActivateNotify": {
    "name": "zoneActivateNotify",
    "oid": "1.3.6.1.4.1.9.9.294.1.4.0.6",
    "class": "notificationtype",
    "objects": [
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetActivateResult"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSwitchWwn"
      }
    ],
    "status": "current",
    "description": "This notification is generated whenever a zone set is activated/deactivated on a VSAN. The zoneSetActivateResult object denotes the outcome of the activation/deactivation. The zoneSwitchWwn object represents the WWN of the local device."
  },
  "zoneCompactNotify": {
    "name": "zoneCompactNotify",
    "oid": "1.3.6.1.4.1.9.9.294.1.4.0.7",
    "class": "notificationtype",
    "objects": [
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCompactVsan"
      }
    ],
    "status": "current",
    "description": "This notification is generated whenever a zone compaction on the VSAN specified by zoneCompactVsan happens successfully."
  },
  "zoneServerMIBCompliances": {
    "name": "zoneServerMIBCompliances",
    "oid": "1.3.6.1.4.1.9.9.294.2.1",
    "class": "objectidentity"
  },
  "zoneServerMIBGroups": {
    "name": "zoneServerMIBGroups",
    "oid": "1.3.6.1.4.1.9.9.294.2.2",
    "class": "objectidentity"
  },
  "zoneServerMIBCompliance": {
    "name": "zoneServerMIBCompliance",
    "oid": "1.3.6.1.4.1.9.9.294.2.1.1",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "zoneConfigurationGroup",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneStatisticsGroup",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneNotificationControlGroup",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneNotificationGroup",
        "module": "CISCO-ZS-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for entities which implement the Zone Server."
  },
  "zoneServerMIBCompliance1": {
    "name": "zoneServerMIBCompliance1",
    "oid": "1.3.6.1.4.1.9.9.294.2.1.2",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "zoneConfigurationGroup1",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneStatisticsGroup",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneNotificationControlGroup",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneNotificationGroup",
        "module": "CISCO-ZS-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for entities which implement the Zone Server."
  },
  "zoneServerMIBComplianceRev2": {
    "name": "zoneServerMIBComplianceRev2",
    "oid": "1.3.6.1.4.1.9.9.294.2.1.3",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "zoneConfigurationGroup2",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneStatisticsGroup",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneNotificationControlGroup",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneNotificationGroup",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneLunStatsGroup",
        "module": "CISCO-ZS-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for entities which implement the Zone Server."
  },
  "zoneServerMIBComplianceRev3": {
    "name": "zoneServerMIBComplianceRev3",
    "oid": "1.3.6.1.4.1.9.9.294.2.1.4",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "zoneConfigurationGroup3",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneStatisticsGroup",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneNotificationControlGroup",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneNotificationGroup",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneLunStatsGroup",
        "module": "CISCO-ZS-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for entities which implement the Zone Server."
  },
  "zoneServerMIBComplianceRev4": {
    "name": "zoneServerMIBComplianceRev4",
    "oid": "1.3.6.1.4.1.9.9.294.2.1.5",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "zoneConfigurationGroup3",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneStatisticsGroup",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneNotificationControlGroup1",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneNotificationGroup1",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneLunStatsGroup",
        "module": "CISCO-ZS-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for entities which implement the Zone Server."
  },
  "zoneServerMIBComplianceRev5": {
    "name": "zoneServerMIBComplianceRev5",
    "oid": "1.3.6.1.4.1.9.9.294.2.1.6",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "zoneConfigurationGroup4",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneStatisticsGroup",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneNotificationControlGroup1",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneNotificationGroup1",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneLunStatsGroup",
        "module": "CISCO-ZS-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for entities which implement the Zone Server."
  },
  "zoneServerMIBComplianceRev6": {
    "name": "zoneServerMIBComplianceRev6",
    "oid": "1.3.6.1.4.1.9.9.294.2.1.7",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "zoneConfigurationGroup5",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneStatisticsGroup",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneNotificationControlGroup1",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneNotificationGroup1",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneLunStatsGroup",
        "module": "CISCO-ZS-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for entities which implement the Zone Server."
  },
  "zoneServerMIBComplianceRev7": {
    "name": "zoneServerMIBComplianceRev7",
    "oid": "1.3.6.1.4.1.9.9.294.2.1.8",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "zoneConfigurationGroup6",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneStatisticsGroup",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneNotificationControlGroup1",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneNotificationGroup2",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneNotificationControlGroup1Sup1",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneLunStatsGroup",
        "module": "CISCO-ZS-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for entities which implement the Zone Server."
  },
  "zoneServerMIBComplianceRev8": {
    "name": "zoneServerMIBComplianceRev8",
    "oid": "1.3.6.1.4.1.9.9.294.2.1.9",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "zoneConfigurationGroup7",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneStatisticsGroup",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneNotificationControlGroup1",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneNotificationGroup2",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneNotificationControlGroup1Sup1",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneConfigGroupSup2",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneLunStatsGroup",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneConfigGroupSup1",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneNotificationControlGroup1Sup2",
        "module": "CISCO-ZS-MIB"
      },
      {
        "object": "zoneNotificationGroup2Sup1",
        "module": "CISCO-ZS-MIB"
      }
    ],
    "status": "current",
    "description": "The compliance statement for entities which implement the Zone Server."
  },
  "zoneConfigurationGroup": {
    "name": "zoneConfigurationGroup",
    "oid": "1.3.6.1.4.1.9.9.294.2.2.1",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetPropagationMode"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDefaultZoneBehaviour"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetZoneList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetLastChange"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetActivate"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetActivateResult"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetDeActivate"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetActivateRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneLastChange"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasMemberList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberFormat"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberID"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberLunID"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneSetNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneSetName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneSetZoneList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneSetActivateTime"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneAliasList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneActivateTime"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneAliasNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneAliasName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneAliasMemberList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberFormat"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberID"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberLunID"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverSpinLock"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverInterface"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverVsan"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverOper"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverResult"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyActiveToFullOnVsan"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects for displaying and configuring Zone Membership."
  },
  "zoneStatisticsGroup": {
    "name": "zoneStatisticsGroup",
    "oid": "1.3.6.1.4.1.9.9.294.2.2.2",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneTotalGS3Rejects"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneTxMergeReqs"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneRxMergeAccepts"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneRxMergeReqs"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneTxMergeAccepts"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneTxChangeReqs"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneRxChangeAccepts"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneRxChangeReqs"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneTxChangeAccepts"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneRxGS3Reqs"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneTxGS3Rejects"
      }
    ],
    "status": "current",
    "description": "A collection of objects for displaying the Zone Server statistics information."
  },
  "zoneNotificationControlGroup": {
    "name": "zoneNotificationControlGroup",
    "oid": "1.3.6.1.4.1.9.9.294.2.2.3",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneServiceReqRejNotifyEnable"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailureNotifyEnable"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeSuccessNotifyEnable"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDefZoneBehvrChngNotifyEnable"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneServiceRejReasonCode"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneServiceRejReasonCodeExp"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailureVSANNum"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeSuccessVSANNum"
      }
    ],
    "status": "deprecated",
    "description": "A collection of notification control and notification information objects for monitoring Zone Server request rejection and zone merge failures."
  },
  "zoneNotificationGroup": {
    "name": "zoneNotificationGroup",
    "oid": "1.3.6.1.4.1.9.9.294.2.2.4",
    "class": "notificationgroup",
    "objects": [
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneServiceReqRejNotify"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailureNotify"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeSuccessNotify"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDefZoneBehaviourChngNotify"
      }
    ],
    "status": "deprecated",
    "description": "A collection of notification(s) for monitoring Zone Server request rejection, zone merge failures and successes and default zoning behavioural changes."
  },
  "zoneConfigurationGroup1": {
    "name": "zoneConfigurationGroup1",
    "oid": "1.3.6.1.4.1.9.9.294.2.2.5",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetPropagationMode"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDefaultZoneBehaviour"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetZoneList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetLastChange"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetActivate"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetActivateResult"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetDeActivate"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetActivateRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetFailCause"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetFailDomId"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneLastChange"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneReadOnly"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasMemberList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberFormat"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberID"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberLunID"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneSetNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneSetName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneSetZoneList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneSetActivateTime"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneAliasList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneActivateTime"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneReadOnly"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneAliasNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneAliasName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneAliasMemberList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberFormat"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberID"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberLunID"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverSpinLock"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverInterface"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverVsan"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverOper"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverResult"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyActiveToFullOnVsan"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDbClearDb"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDbEnforcedEqualsLocal"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects for displaying and configuring Zone Membership and deleting the local zone server database."
  },
  "zoneConfigurationGroup2": {
    "name": "zoneConfigurationGroup2",
    "oid": "1.3.6.1.4.1.9.9.294.2.2.6",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetPropagationMode"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDefaultZoneBehaviour"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDefaultZoneReadOnly"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetZoneList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetLastChange"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetActivate"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetActivateResult"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetDeActivate"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetActivateRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetFailCause"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetFailDomId"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneLastChange"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneReadOnly"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasMemberList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasLastChange"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberFormat"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberID"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberLunID"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneSetNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneSetName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneSetZoneList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneSetActivateTime"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneAliasList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneActivateTime"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneReadOnly"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberFormat"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberID"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberLunID"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverSpinLock"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverInterface"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverVsan"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverOper"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverResult"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyActiveToFullOnVsan"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDbClearDb"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDbEnforcedEqualsLocal"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects for displaying and configuring Zone Membership and deleting the local zone server database."
  },
  "zoneLunStatsGroup": {
    "name": "zoneLunStatsGroup",
    "oid": "1.3.6.1.4.1.9.9.294.2.2.7",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneLunRxInqReqs"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneLunRxRepLunReqs"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneLunRxSenseReqs"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneLunRxOtherCmds"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneLunTxInqDataNoLus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneLunTxIllegalReqs"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneRoZoneTxDataProts"
      }
    ],
    "status": "current",
    "description": "A collection of objects for displaying the Zone Server LUN statistics information."
  },
  "zoneConfigurationGroup3": {
    "name": "zoneConfigurationGroup3",
    "oid": "1.3.6.1.4.1.9.9.294.2.2.8",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetPropagationMode"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDefaultZoneBehaviour"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDefaultZoneReadOnly"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetZoneList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetLastChange"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetActivate"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetActivateResult"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetDeActivate"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetActivateRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetFailCause"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetFailDomId"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneLastChange"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneReadOnly"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasMemberList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasLastChange"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberFormat"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberID"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberLunID"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneSetNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneSetName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneSetZoneList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneSetActivateTime"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneAliasList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneActivateTime"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneReadOnly"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberFormat"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberID"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberLunID"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverSpinLock"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverInterface"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverVsan"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverOper"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverResult"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyActiveToFullOnVsan"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDbClearDb"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDbEnforcedEqualsLocal"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyProto"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyDestFileType"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyServerAddrType"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyServerAddr"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyDestFileName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyUserName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyUserPassword"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyStartCopy"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyState"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyRowStatus"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects for displaying and configuring Zone Membership and deleting the local zone server database."
  },
  "zoneNotificationControlGroup1": {
    "name": "zoneNotificationControlGroup1",
    "oid": "1.3.6.1.4.1.9.9.294.2.2.9",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneServiceReqRejNotifyEnable"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailureNotifyEnable"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeSuccessNotifyEnable"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDefZoneBehvrChngNotifyEnable"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneUnsuppMemInIntOpNotifyEnable"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneServiceRejReasonCode"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneServiceRejReasonCodeExp"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailureVSANNum"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeSuccessVSANNum"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneVsanId"
      }
    ],
    "status": "current",
    "description": "A collection of notification control and notification information objects for monitoring Zone Server request rejection and zone merge failures."
  },
  "zoneNotificationGroup1": {
    "name": "zoneNotificationGroup1",
    "oid": "1.3.6.1.4.1.9.9.294.2.2.10",
    "class": "notificationgroup",
    "objects": [
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneServiceReqRejNotify"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailureNotify"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeSuccessNotify"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDefZoneBehaviourChngNotify"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneUnsuppMemInIntOpModeNotify"
      }
    ],
    "status": "deprecated",
    "description": "A collection of notification(s) for monitoring Zone Server request rejection, zone merge failures and successes and default zoning behavioural changes."
  },
  "zoneConfigurationGroup4": {
    "name": "zoneConfigurationGroup4",
    "oid": "1.3.6.1.4.1.9.9.294.2.2.11",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetPropagationMode"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDefaultZoneBehaviour"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDefaultZoneReadOnly"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetZoneList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetLastChange"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetActivate"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetActivateResult"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetDeActivate"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetActivateRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetFailCause"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetFailDomId"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneLastChange"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneReadOnly"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasMemberList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasLastChange"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberFormat"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberID"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberLunID"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneSetNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneSetName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneSetZoneList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneSetActivateTime"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneAliasList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneActivateTime"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneReadOnly"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberFormat"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberID"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberLunID"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverSpinLock"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverInterface"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverVsan"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverOper"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverResult"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyActiveToFullOnVsan"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDbClearDb"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDbEnforcedEqualsLocal"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyProto"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyDestFileType"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyServerAddrType"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyServerAddr"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyDestFileName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyUserName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyUserPassword"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyStartCopy"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyState"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneZoneSetDistributeVsan"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneZoneSetDistributeResult"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneZoneSetDistributeFailReason"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects for displaying and configuring Zone Membership and deleting the local zone server database."
  },
  "zoneConfigurationGroup5": {
    "name": "zoneConfigurationGroup5",
    "oid": "1.3.6.1.4.1.9.9.294.2.2.12",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetPropagationMode"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDefaultZoneBehaviour"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDefaultZoneReadOnly"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDefaultZoneQos"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDefaultZoneQosPriority"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDefaultZoneBroadcast"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetZoneList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetLastChange"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetActivate"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetActivateResult"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetDeActivate"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetActivateRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetFailCause"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetFailDomId"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneLastChange"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneReadOnly"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneQos"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneQosPriority"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneBroadcast"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasMemberList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasLastChange"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberFormat"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberID"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberLunID"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneSetNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneSetName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneSetZoneList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneSetActivateTime"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneAliasList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneActivateTime"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneReadOnly"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneQos"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneQosPriority"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneBroadcast"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberFormat"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberID"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberLunID"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverSpinLock"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverInterface"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverVsan"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverOper"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverResult"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyActiveToFullOnVsan"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDbClearDb"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDbEnforcedEqualsLocal"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyProto"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyDestFileType"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyServerAddrType"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyServerAddr"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyDestFileName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyUserName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyUserPassword"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyStartCopy"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyState"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneZoneSetDistributeVsan"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneZoneSetDistributeResult"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneZoneSetDistributeFailReason"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects for displaying and configuring Zone Membership and deleting the local zone server database."
  },
  "zoneConfigurationGroup6": {
    "name": "zoneConfigurationGroup6",
    "oid": "1.3.6.1.4.1.9.9.294.2.2.13",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetPropagationMode"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDefaultZoneBehaviour"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDefaultZoneReadOnly"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDefaultZoneQos"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDefaultZoneQosPriority"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDefaultZoneBroadcast"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetZoneList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetLastChange"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetClone"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetActivate"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetActivateResult"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetDeActivate"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetActivateRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetFailCause"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetFailDomId"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneLastChange"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneReadOnly"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneQos"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneQosPriority"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneBroadcast"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneClone"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasMemberList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasLastChange"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasClone"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberFormat"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberID"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberLunID"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneSetNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneSetName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneSetZoneList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneSetActivateTime"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneAliasList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneActivateTime"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneReadOnly"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneQos"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneQosPriority"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneBroadcast"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberFormat"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberID"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberLunID"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverSpinLock"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverInterface"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverVsan"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverOper"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverResult"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyActiveToFullOnVsan"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDbClearDb"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDbEnforcedEqualsLocal"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDbHardZoningEnabled"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyProto"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyDestFileType"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyServerAddrType"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyServerAddr"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyDestFileName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyUserName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyUserPassword"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyStartCopy"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyState"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneZoneSetDistributeVsan"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneZoneSetDistributeResult"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneZoneSetDistributeFailReason"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects for displaying and configuring Zone Membership and deleting the local zone server database."
  },
  "zoneNotificationGroup2": {
    "name": "zoneNotificationGroup2",
    "oid": "1.3.6.1.4.1.9.9.294.2.2.14",
    "class": "notificationgroup",
    "objects": [
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneServiceReqRejNotify"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailureNotify"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeSuccessNotify"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDefZoneBehaviourChngNotify"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneUnsuppMemInIntOpModeNotify"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneActivateNotify"
      }
    ],
    "status": "current",
    "description": "A collection of notification(s) for monitoring Zone Server request rejection, zone merge failures and successes and default zoning behavioural changes."
  },
  "zoneNotificationControlGroup1Sup1": {
    "name": "zoneNotificationControlGroup1Sup1",
    "oid": "1.3.6.1.4.1.9.9.294.2.2.15",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSwitchWwn"
      }
    ],
    "status": "current",
    "description": "A group that supplements zoneNotificationControlGroup1 with additional object(s)."
  },
  "zoneConfigGroupSup1": {
    "name": "zoneConfigGroupSup1",
    "oid": "1.3.6.1.4.1.9.9.294.2.2.16",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetZoneListBmap4k"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetZoneListBmap6k"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetZoneListBmap8k"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetEnforcedZoneListBmap4k"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetEnforcedZoneListBmap6k"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetEnforcedZoneListBmap8k"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCompactFirst2k"
      }
    ],
    "status": "current",
    "description": "A collection of objects to associate zones to zonesets and facilitate compaction of first 2k zones associated with zonesets."
  },
  "zoneNotificationControlGroup1Sup2": {
    "name": "zoneNotificationControlGroup1Sup2",
    "oid": "1.3.6.1.4.1.9.9.294.2.2.17",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCompactVsan"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailureObject"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailureReason"
      }
    ],
    "status": "current",
    "description": "A group that supplements zoneNotificationControlGroup1 with additional notification information object(s)."
  },
  "zoneNotificationGroup2Sup1": {
    "name": "zoneNotificationGroup2Sup1",
    "oid": "1.3.6.1.4.1.9.9.294.2.2.18",
    "class": "notificationgroup",
    "objects": [
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCompactNotify"
      }
    ],
    "status": "current",
    "description": "A group that supplements zoneNotificationGroup2 with additional notification(s)."
  },
  "zoneConfigGroupSup2": {
    "name": "zoneConfigGroupSup2",
    "oid": "1.3.6.1.4.1.9.9.294.2.2.19",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyActToFullSpinLock"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyActToFullMode"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyActToFullVsan"
      }
    ],
    "status": "current",
    "description": "A collection of objects to copy active zonesets to full zonesets on a VSAN."
  },
  "zoneConfigurationGroup7": {
    "name": "zoneConfigurationGroup7",
    "oid": "1.3.6.1.4.1.9.9.294.2.2.20",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetPropagationMode"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDefaultZoneBehaviour"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDefaultZoneReadOnly"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDefaultZoneQos"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDefaultZoneQosPriority"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDefaultZoneBroadcast"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetZoneList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetLastChange"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetClone"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetActivate"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetActivateResult"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetDeActivate"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetActivateRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetFailCause"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneSetFailDomId"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneLastChange"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneReadOnly"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneQos"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneQosPriority"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneBroadcast"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneClone"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasMemberList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasLastChange"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneAliasClone"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberFormat"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberID"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberLunID"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMemberRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneSetNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneSetName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneSetZoneList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneSetActivateTime"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneAliasList"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneActivateTime"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneReadOnly"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneQos"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneQosPriority"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneBroadcast"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberNumber"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberFormat"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberID"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneEnforcedZoneMemberLunID"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverSpinLock"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverInterface"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverVsan"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverOper"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneMergeFailRecoverResult"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDbClearDb"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDbEnforcedEqualsLocal"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneDbHardZoningEnabled"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyProto"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyDestFileType"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyServerAddrType"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyServerAddr"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyDestFileName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyUserName"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyUserPassword"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyStartCopy"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyState"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneCopyRowStatus"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneZoneSetDistributeVsan"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneZoneSetDistributeResult"
      },
      {
        "module": "CISCO-ZS-MIB",
        "object": "zoneZoneSetDistributeFailReason"
      }
    ],
    "status": "current",
    "description": "A collection of objects for displaying and configuring Zone Membership and deleting the local zone server database."
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/CISCO-ZS-MIB",
      "Produced by pysmi-0.3.4 at Fri May 24 16:58:57 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "CISCO-ZS-MIB"
  }
}