{
  "imports": {
    "class": "imports",
    "ADSL-LINE-MIB": [
      "adslLineAlarmConfProfileName",
      "adslLineConfProfileName"
    ],
    "CISCO-SMI": [
      "ciscoMgmt"
    ],
    "CISCO-TC": [
      "Unsigned32"
    ],
    "IF-MIB": [
      "ifIndex",
      "InterfaceIndexOrZero"
    ],
    "SNMPv2-CONF": [
      "MODULE-COMPLIANCE",
      "OBJECT-GROUP",
      "NOTIFICATION-GROUP"
    ],
    "SNMPv2-SMI": [
      "iso",
      "Bits",
      "Counter32",
      "MibIdentifier",
      "Unsigned32",
      "OBJECT-TYPE",
      "IpAddress",
      "MODULE-IDENTITY",
      "Integer32",
      "Gauge32",
      "Counter64",
      "TimeTicks",
      "OBJECT-IDENTITY",
      "NOTIFICATION-TYPE"
    ],
    "SNMPv2-TC": [
      "DisplayString",
      "DateAndTime",
      "TruthValue",
      "TEXTUAL-CONVENTION"
    ]
  },
  "ciscoAdslDmtLineMIB": {
    "name": "ciscoAdslDmtLineMIB",
    "oid": "1.3.6.1.4.1.9.9.130",
    "class": "moduleidentity",
    "revisions": [
      {
        "revision": "2001-05-17 16:00",
        "description": "Added new table for AtucDmtBin and AturDmtBin information. Added two attributes to the profile: cAdslAtucDmtConfMinrateBlock and cAdslAtucDmtDualBitmapEnabled"
      },
      {
        "revision": "2000-08-22 00:00",
        "description": "Added new value for DmtCodewordSize to allow the setting of DmtCodewordSize to 1/2 symbols per codeword."
      },
      {
        "revision": "2000-05-19 00:00",
        "description": "Updated cAdslLineDmtConfOperatingMode object to support G.992.1, G.992.2 and T1.413 enumerations. Also added descriptions for the above."
      },
      {
        "revision": "1999-03-30 00:00",
        "description": "Initial version of this MIB module."
      }
    ],
    "lastupdated": "200105171600Z",
    "organization": "Cisco Systems, Inc.",
    "contactinfo": "Cisco Systems Customer Service Postal: 170 W Tasman Drive San Jose, CA 95134 Tel: +1 800 553-NETS E-mail: cs-dslam@cisco.com",
    "description": "This MIB module serves as an enterprise-specific extension of the ADSL-LINE-MIB. The structure of this MIB module shadows the structure of the ADSL-LINE-MIB, table for table. The tables defined by this MIB module contain managed objects that meet the following criteria: 1) A managed object represents an attribute or characteristic specific to DMT (Digital Multi-Tone) modems. 2) The ADSL-DMT-LINE-MIB does not already contain a managed object representing the same information as a managed object. Observe that entries contained by the tables in this MIB module do not augment the corresponding entries in the ADSL-LINE-MIB, as every modem represented by the ADSL-LINE-MIB is not necessarily a DMT modem. Also observe that entries contained by the tables in this MIB module do not augment the corresponding entries in the ADSL-DMT-LINE-MIB, as this assumes that the ADSL-DMT-LINE-MIB defines tables that correspond to every table defined by the ADSL-LINE-MIB. At this time, this assumption does not hold true. *** DEFINITIONS *** AGGREGATE DATA RATE Data rate transmitted by an ADSL system in any one direction. This includes both net data rates and overhead used by the system, including: - EOC - AOC (ADSL Overhead Control channel) - CRC (Cyclic Redundancy Check) check bytes - fixed indicator bits for OAM (Operatings, Administration, and Maintenance) - synchronization control bytes - capacity for bearer channel synchronization control BEARER CHANNEL A user data stream of a specific data rate that is transported transparently by an ADSL system over one of the simplex channels (i.e., AS0, AS1, AS2, or AS3) or one of the duplex channels (i.e., LS0, LS1, or LS2). BIN DMT line coding divides the frequency spectrum above the voice band of a line (i.e., 0-4 kHz) into 255 sub-carriers, each supporting 4.3125 kHz of bandwidth. A 'bin' refers to a single sub-carrier. DATA SYMBOL RATE The average symbol rate (after allowing for the overhead of the sync symbol) at which symbols carrying data are transmitted; that is, 4000 symbols/second. DOWNSTREAM The flow of data in the direction from the ATU-C to ATU-R. LINE RATE The total data rate supported by a line; that is, (sum of b(i) for all i) * 4 kbps. MARGIN (also referred to as 'SNR margin') The difference between the SNR of the received signal and the SNR required to provide a BER of 10E-7. NET DATA RATE The data rate that is available for user data in any one direction; for the downstream direction this is the sum of the simplex and duplex bearer channel rates. SPLITTER Filters that separate the high frequency signals (ADSL) from the voice band signals; (frequently called POTS splitters even though the voice band signals may comprise more than just POTS). SYMBOL The number of bits the transmitter is capable of multiplexing and modulating over all the bins in a single signalling interval. SYMBOL RATE The rate at which all symbols, including the sync symbol, are transmitted; that is, (69/68) * 4000 symbols/sec; contrasted with the data symbol rate. TOTAL DATA RATE The aggregate data rate (q.v.) plus Reed-Solomon FEC overhead. UPSTREAM The flow of data in the direction from the ATU-R to ATU-C. *** ABBREVIATIONS, ACRONYMS, AND SYMBOLS *** ADSL - Asymmetric Digital Subscriber Line. ATM - Asynchronous Transfer Mode. ATU-C - ADSL Transceiver Unit, Central Office end. ATU-R - ADSL Transceiver Unit, Remote terminal end. b(i) - the number of bits (i.e., constellation size) modulated on bin i. BER - Bit Error Ratio. DMT - Discrete MultiTone. DSL - Digital Subscriber Line. EOC - Embedded Operations Channel. FEC - Forward Error Correction. SNR - Signal-to-Noise Ratio. STM - Synchronous Transfer Mode."
  },
  "DmtOverheadFraming": {
    "name": "DmtOverheadFraming",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "structure0": 0,
          "structure1": 1,
          "structure2": 2,
          "structure3": 3
        }
      }
    },
    "status": "current",
    "description": "There exist two types of ADSL framing: full overhead and reduced overhead. Furthermore, there exist two versions of full overhead and two versions of reduced overhead. The table below defines the four resulting framing structures: 'structure0' Full overhead framing with asynchronous bit-to-modem timing (enabled synchronization control mechanism). 'structure1' Full overhead framing with synchronous bit-to-modem timing (disabled synchronization control mechanism). 'structure2' Reduced overhead framing with separate fast and sync bytes in fast and interleaved latency buffers respectively (64 kbps framing overhead). 'structure3' Reduced overhead framing with merged fast and sync byte, using either the fast or interleaved latency buffer (32 kbps framing overhead). During the training sequence, the ATU-C shall indicate the highest framing structure number that it supports. It is implied that if the ATU-C indicates it supports framing structure k, it also supports all framing structures 0 to k-1. If during the training sequence the ATU-R indicates a lower framing structure than that specified by the ATU-C, the ATU-C shall fall back to the framing structure number indicated by the ATU-R. Management requirements drive the determination of overhead, full or reduced. Full overhead provides more bandwidth to the EOC channel, thereby enabling higher polling rates. However, reduced overhead provides enough bandwidth to satisfy typical applications. If an ADSL line is supporting an ATM link, then a structure must be chosen that disables synchronization control. If an ADSL line is supporting an STM link, and the ADSL line interface has a clock tightly coupled to the stratum clock, then synchronization control is not necessary. If an ADSL line is supporting an STM link, and the ADSL line interface is driven by a clock that has no relationship with the stratum clock, then a struture that enables synchronization control is necessary.",
    "reference": "ANSI T1.413-1998 Issue 2, Network and Customer Installation Interfaces - Asymmetric Digital Subscriber Line (ADSL) Metallic Interfaces."
  },
  "DmtFecSize": {
    "name": "DmtFecSize",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 0
          },
          {
            "min": 2,
            "max": 2
          },
          {
            "min": 4,
            "max": 4
          },
          {
            "min": 6,
            "max": 6
          },
          {
            "min": 8,
            "max": 8
          },
          {
            "min": 10,
            "max": 10
          },
          {
            "min": 12,
            "max": 12
          },
          {
            "min": 14,
            "max": 14
          },
          {
            "min": 16,
            "max": 16
          }
        ]
      }
    },
    "status": "current",
    "description": "One of the three parameters that affects FEC operation; the number of FEC redundancy bytes per Reed-Solomon codeword. The codeword size also affects FEC operation. The interleave depth also affects FEC operation on an interleaved channel (see the ADSL-LINE-MIB, specifically adslAtucChanConfMaxInterleaveDelay and adslAturChanConfMaxInterleaveDelay).",
    "reference": "ANSI T1.413-1998 Issue 2, Network and Customer Installation Interfaces - Asymmetric Digital Subscriber Line (ADSL) Metallic Interfaces. draft-ietf-adslmib-adsllinemib-04, Definitions of Managed Objects for ADSL Lines."
  },
  "DmtCodewordSize": {
    "name": "DmtCodewordSize",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": -1,
            "max": -1
          },
          {
            "min": 1,
            "max": 1
          },
          {
            "min": 2,
            "max": 2
          },
          {
            "min": 4,
            "max": 4
          },
          {
            "min": 8,
            "max": 8
          },
          {
            "min": 16,
            "max": 16
          }
        ]
      }
    },
    "status": "current",
    "description": "One of the three parameters that affects FEC operation; the number of ADSL symbols per FEC codeword. The FEC size also affects FEC operation. The interleave depth also affects FEC operation on an interleaved channel (see the ADSL-LINE-MIB, specifically adslAtucChanConfMaxInterleaveDelay and adslAturChanConfMaxInterleaveDelay). The following constraints apply: - This value is always '1' when performing the FEC operation on a fast buffer. - When performing the FEC operation on an interleaved buffer, the specification does not require a codeword size greater than '1' when the interleave depth is set to '1'. - if DmtCodeWordSize is positive, it represents the actual number of symbols per codeword. If DmtCodeWordSize is negative, it represents the exponent value in a power of 2. For example, if DmtCodeWordSize is equal to -1, then the number of symbols per codeword would be equal to 2^^-1 = 1/2.",
    "reference": "ANSI T1.413-1998 Issue 2, Network and Customer Installation Interfaces - Asymmetric Digital Subscriber Line (ADSL) Metallic Interfaces. RFC 2662 - Definitions of Managed Objects for the ADSL Lines. G. Bathrick,. Ly. August 1999. "
  },
  "ciscoAdslDmtLineMIBObjects": {
    "name": "ciscoAdslDmtLineMIBObjects",
    "oid": "1.3.6.1.4.1.9.9.130.1",
    "class": "objectidentity"
  },
  "cAdslDmtLineTable": {
    "name": "cAdslDmtLineTable",
    "oid": "1.3.6.1.4.1.9.9.130.1.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table extends the adslLineTable and contains enterprise- specific common attributes describing both ends of ADSL lines supported by the system."
  },
  "cAdslDmtLineEntry": {
    "name": "cAdslDmtLineEntry",
    "oid": "1.3.6.1.4.1.9.9.130.1.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A set of enterprise-specific common attributes describing both ends of an ADSL line supported by the system. There exists an entry for each ifEntry with an ifType of adsl(94)."
  },
  "cAdslDmtLineOverheadFraming": {
    "name": "cAdslDmtLineOverheadFraming",
    "oid": "1.3.6.1.4.1.9.9.130.1.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DmtOverheadFraming",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "ANSI T1.413-1998 Issue 2, Network and Customer Installation Interfaces - Asymmetric Digital Subscriber Line (ADSL) Metallic Interfaces.",
    "status": "current",
    "description": "This object represents the negotiated overhead framing structure being used by the ATU-C and ATU-R."
  },
  "cAdslAtucDmtPhysTable": {
    "name": "cAdslAtucDmtPhysTable",
    "oid": "1.3.6.1.4.1.9.9.130.1.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table extends the adslAtucPhysTable and contains enterprise-specific physical layer parameters for ATU-C class devices supported by the system."
  },
  "cAdslAtucDmtPhysEntry": {
    "name": "cAdslAtucDmtPhysEntry",
    "oid": "1.3.6.1.4.1.9.9.130.1.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A set of enterprise-specific physical-layer parameters for an ATU-C class device supported by the system. There exists an entry for each ifEntry with an ifType of adsl(94)."
  },
  "cAdslAtucDmtState": {
    "name": "cAdslAtucDmtState",
    "oid": "1.3.6.1.4.1.9.9.130.1.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "standard": 1,
          "unknown": 2,
          "downloading": 3,
          "downloadFailed": 4,
          "testing": 5
        }
      }
    },
    "maxaccess": "read-only",
    "reference": "ADSL Forum Technical Specification TR-014, DMT Line Code Specific MIB.",
    "status": "current",
    "description": "The value of this object specifies the enterprise-specific specific status of the ATU-C. If the value of adslAtucDMTState is not 'other', then the value of this object is 'standard'. If the value of adslAtucDMTState is 'other', and the ATU-C is in an unrecognized state, then the value of this object is 'unknown'. If the value of adslAtucDMTState is 'other', and the ATU-C is not in an unrecognized state, then the value of this object specifies the enterprise-specific state of the ATU-C."
  },
  "cAdslAtucDmtChanTable": {
    "name": "cAdslAtucDmtChanTable",
    "oid": "1.3.6.1.4.1.9.9.130.1.4",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table extends the adslAtucChanTable and contains enterprise-specific physical layer parameters for the ATU-C channels supported by the system."
  },
  "cAdslAtucDmtChanEntry": {
    "name": "cAdslAtucDmtChanEntry",
    "oid": "1.3.6.1.4.1.9.9.130.1.4.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A set of enterprise-specific physical-layer parameters for an ATU-C channel supported by the system. There exists an entry for each ifEntry with an ifType of adslInterleave(124) or adslFast(125)."
  },
  "cAdslAtucDmtChanFecSize": {
    "name": "cAdslAtucDmtChanFecSize",
    "oid": "1.3.6.1.4.1.9.9.130.1.4.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DmtFecSize",
      "class": "type"
    },
    "units": "bytes",
    "maxaccess": "read-only",
    "reference": "ANSI T1.413-1998 Issue 2, Network and Customer Installation Interfaces - Asymmetric Digital Subscriber Line (ADSL) Metallic Interfaces.",
    "status": "current",
    "description": "This object specifies the number of FEC redundancy bytes the ATU-C appends to downstream on the corresponding channel. The ATU-C can fallback from the initial value specified for the corresponding channel (i.e., cAdslAtucDmtConfFastFecSize or cAdslAtucInterleaveFecSize) based on the aggregate data rate rate achieved during training."
  },
  "cAdslAtucDmtChanCodewordSize": {
    "name": "cAdslAtucDmtChanCodewordSize",
    "oid": "1.3.6.1.4.1.9.9.130.1.4.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DmtCodewordSize",
      "class": "type"
    },
    "units": "symbols",
    "maxaccess": "read-only",
    "reference": "ANSI T1.413-1998 Issue 2, Network and Customer Installation Interfaces - Asymmetric Digital Subscriber Line (ADSL) Metallic Interfaces.",
    "status": "current",
    "description": "This object specifies the actual number of symbols per codeword being used by the ATU-C for downstream messages. The ATU-C and ATU-R negotiate this value during the training sequence. A value of 0 indicates the automatic mode."
  },
  "cAdslAturDmtChanTable": {
    "name": "cAdslAturDmtChanTable",
    "oid": "1.3.6.1.4.1.9.9.130.1.5",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table extends the adslAturChanTable and contains enterprise-specific physical layer parameters for the ATU-R channels supported by the system."
  },
  "cAdslAturDmtChanEntry": {
    "name": "cAdslAturDmtChanEntry",
    "oid": "1.3.6.1.4.1.9.9.130.1.5.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A set of enterprise-specific physical-layer parameters for an ATU-R channel supported by the system. There exists an entry for each ifEntry with an ifType of adslInterleave(124) or adslFast(125)."
  },
  "cAdslAturDmtChanFecSize": {
    "name": "cAdslAturDmtChanFecSize",
    "oid": "1.3.6.1.4.1.9.9.130.1.5.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DmtFecSize",
      "class": "type"
    },
    "units": "bytes",
    "maxaccess": "read-only",
    "reference": "ANSI T1.413-1998 Issue 2, Network and Customer Installation Interfaces - Asymmetric Digital Subscriber Line (ADSL) Metallic Interfaces.",
    "status": "current",
    "description": "This object specifies the number of FEC redundancy bytes the ATU-R appends to upstream on the corresponding channel. The ATU-C can fallback from the initial value specified for the corresponding channel (i.e., cAdslAturDmtConfFastFecSize or cAdslAturInterleaveFecSize) based on the aggregate data rate achieved during training."
  },
  "cAdslAturDmtChanCodewordSize": {
    "name": "cAdslAturDmtChanCodewordSize",
    "oid": "1.3.6.1.4.1.9.9.130.1.5.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DmtCodewordSize",
      "class": "type"
    },
    "units": "symbols",
    "maxaccess": "read-only",
    "reference": "ANSI T1.413-1998 Issue 2, Network and Customer Installation Interfaces - Asymmetric Digital Subscriber Line (ADSL) Metallic Interfaces.",
    "status": "current",
    "description": "This object specifies the actual number of symbols per codeword being used by the ATU-R for upstream messages. The ATU-C and ATU-R negotiate this value during the training sequence."
  },
  "cAdslDmtLineConfProfileTable": {
    "name": "cAdslDmtLineConfProfileTable",
    "oid": "1.3.6.1.4.1.9.9.130.1.14",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table extends the adslLineConfProfileTable and contains enterprise-specific ADSL DMT line configuration information."
  },
  "cAdslDmtLineConfProfileEntry": {
    "name": "cAdslDmtLineConfProfileEntry",
    "oid": "1.3.6.1.4.1.9.9.130.1.14.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "ADSL-LINE-MIB",
        "object": "adslLineConfProfileName",
        "implied": 1
      }
    ],
    "status": "current",
    "description": "A configuration profile containing enterprise-specific ADSL DMT line configuration information."
  },
  "cAdslLineDmtConfOperatingMode": {
    "name": "cAdslLineDmtConfOperatingMode",
    "oid": "1.3.6.1.4.1.9.9.130.1.14.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "automatic": 1,
          "splitterless": 2,
          "g992Dot1": 3,
          "g992Dot2": 4,
          "t1Dot413": 5
        }
      }
    },
    "default": {
      "default": {
        "value": "automatic",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "reference": "ITU G.992.1, Asymmetric Digital Subscriber Line (ADSL) Transceiver. ITU G.992.2, Splitterless Asymmetric Digital Subscriber Line (ADSL) Transceiver. ANSI T1.413-1998 Issue 2, Network and Customer Installation Interfaces - Asymmetric Digital Subscriber Line (ADSL) Metallic Interfaces.",
    "status": "current",
    "description": "This object specifies the line operating mode being employed by the ADSL line. An ADSL line uses of one of two operating modes: - Automatic An ATU-C that employs this operating mode automatically detects the capabilities of the ATU-R and utilizes either a startup sequence specified by G.992.1, G.992.2, or T1.413-1998. This line operating mode is the default for an ADSL line. - Splitterless This operating mode should no longer be used. It is equivalent to the G.992.2 selection. Selecting this mode will automatically map to the G992.2 mode. It is appropriate in this case that both the ATU-C and ATU-R support 'heavy' capability but the ATU-C side wishes to force 'lite' operation. Selecting this mode will automatically convert to the G992.2 mode. - G992.1 This operating mode forces the used of the G994.1 startup sequence and compliance to G992.1 operation. - G992.2 This operating mode forces the use of the G994.1 startup sequence and compliance to G992.2 operation. It is appropriate in this case that both the ATU-C and ATU-R support 'heavy' capability but the ATU-C side wishes to force 'lite' operation. - T1.413 This operating mode forces the ATU-R to use the T1.413-1998 startup sequence."
  },
  "cAdslLineDmtConfTrainingMode": {
    "name": "cAdslLineDmtConfTrainingMode",
    "oid": "1.3.6.1.4.1.9.9.130.1.14.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "standard": 1,
          "fast": 2
        }
      }
    },
    "default": {
      "default": {
        "value": "standard",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "reference": "ITU G.992.1, Asymmetric Digital Subscriber Line (ADSL) Transceiver. ITU G.992.2, Splitterless Asymmetric Digital Subscriber Line (ADSL) Transceiver. ANSI T1.413-1998 Issue 2, Network and Customer Installation Interfaces - Asymmetric Digital Subscriber Line (ADSL) Metallic Interfaces.",
    "status": "current",
    "description": "This object specifies the mode employed by the ATU-C and ATU-R when training against each other. One of two training modes can be employed: - Standard An ATU-C initiates a training sequence using the method defined by G.992.1, G.992.2, or T1.413-1998. This training mode is the default for ADSL modems. - Fast An ATU-C initiates a vendor-specific training sequence that can possibly provide a shorter training sequence."
  },
  "cAdslAtucDmtConfFastFecSize": {
    "name": "cAdslAtucDmtConfFastFecSize",
    "oid": "1.3.6.1.4.1.9.9.130.1.14.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DmtFecSize",
      "class": "type"
    },
    "default": {
      "default": {
        "value": 16,
        "format": "decimal"
      }
    },
    "units": "bytes",
    "maxaccess": "read-create",
    "reference": "ANSI T1.413-1998 Issue 2, Network and Customer Installation Interfaces - Asymmetric Digital Subscriber Line (ADSL) Metallic Interfaces.",
    "status": "current",
    "description": "This object specifies the initial number of FEC redundancy bytes the ATU-C appends to downstream frames transmitted over the fast channel during the training sequence. The ATU-C can fallback from this value depending on the aggregate data rate achieved during training. It is desirable to choose a large FEC size, thereby increasing the chance of being able to correct errors in the data delivered by a frame. However, additional FEC redundancy bytes increases frame overhead, and thus frame latency."
  },
  "cAdslAtucDmtConfInterleaveFecSize": {
    "name": "cAdslAtucDmtConfInterleaveFecSize",
    "oid": "1.3.6.1.4.1.9.9.130.1.14.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DmtFecSize",
      "class": "type"
    },
    "default": {
      "default": {
        "value": 16,
        "format": "decimal"
      }
    },
    "units": "bytes",
    "maxaccess": "read-create",
    "reference": "ANSI T1.413-1998 Issue 2, Network and Customer Installation Interfaces - Asymmetric Digital Subscriber Line (ADSL) Metallic Interfaces.",
    "status": "current",
    "description": "This object specifies the initial number of FEC redundancy bytes the ATU-C appends to downstream frames transmitted over the interleaved channel during the training sequence. The ATU-C can fallback from this value depending on the aggregate data rate achieved during training. It is desirable to choose a large FEC size, thereby increasing the chance of being able to correct errors in the data delivered by a frame. However, additional FEC redundancy bytes increases frame overhead, and thus frame latency. The value of this object must be a integral multiple of the value of cAdslAtucDmtConfCodewordSize."
  },
  "cAdslAtucDmtConfCodewordSize": {
    "name": "cAdslAtucDmtConfCodewordSize",
    "oid": "1.3.6.1.4.1.9.9.130.1.14.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DmtCodewordSize",
      "class": "type"
    },
    "default": {
      "default": {
        "value": 16,
        "format": "decimal"
      }
    },
    "units": "symbols",
    "maxaccess": "read-create",
    "reference": "ANSI T1.413-1998 Issue 2, Network and Customer Installation Interfaces - Asymmetric Digital Subscriber Line (ADSL) Metallic Interfaces.",
    "status": "current",
    "description": "This object specifies the number of symbols per codeword being used by the ATU-C for downstream messages on an interleaved channel during the training sequence. The ATU-C can fallback from this value based on the aggregate data rate achieved during training. It is desirable to choose a large codeword size to minimize overhead. However, increasing the codeword size increases the possibility of not being able to correct errors in the data delivered by a frame."
  },
  "cAdslAtucDmtConfOverheadFraming": {
    "name": "cAdslAtucDmtConfOverheadFraming",
    "oid": "1.3.6.1.4.1.9.9.130.1.14.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DmtOverheadFraming",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "structure3",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "reference": "ANSI T1.413-1998 Issue 2, Network and Customer Installation Interfaces - Asymmetric Digital Subscriber Line (ADSL) Metallic Interfaces.",
    "status": "current",
    "description": "This object specifies the overhead framing structure which the ATU-C will request when establishing a link with the ATU-R. The value of 'structure0' is not valid."
  },
  "cAdslAtucDmtConfBitSwapEnabled": {
    "name": "cAdslAtucDmtConfBitSwapEnabled",
    "oid": "1.3.6.1.4.1.9.9.130.1.14.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "true",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "reference": "ANSI T1.413-1998 Issue 2, Network and Customer Installation Interfaces - Asymmetric Digital Subscriber Line (ADSL) Metallic Interfaces. RFC 2662 - Definitions of Managed Objects for the ADSL Lines. G. Bathrick,. Ly. August 1999. ",
    "status": "current",
    "description": "This object specifies whether the ATU-C performs bitswapping. Bitswapping attempts to maintain an acceptable margin for each bin; equalizing the margin across all bins through bit reallocation, thereby maximizing error performance. The ATU-C performs bitswapping by monitoring the margin measured for each bin by the transmitter: 1) If a bin's margin falls below 'target' and the difference, between the margin and 'target' exceeds 'thresh(f)', then the ATU-C marks the bin as a 'from' bin. 2) If a bin's margin exceeds 'target' and the difference between the margin and 'target' exceeds 'thresh(t)', then the ATU-C marks the bin as a 'to' bin. Where: 'target' = adslAtucConfTargetSnrMgn 'thresh(f)' = cAdslAtucDmtConfBitSwapFrom 'thresh(t)' = cAdslAtucDmtConfBitSwapTo The ATU-C attempts to equalize the margin across the bins by swapping bits out of bins marked 'from' into bins marked 'to'. When the ATU-C swaps a bit out of bin, it decreases its b(i). Thus, the bins constellation is smaller, which increases its margin. When the ATU-C swaps a bit into a bin, it increases its b(i). Thus, the bins constellation is larger, which decreases its margin. In addition, the ATU-R may optionally implement its own monitoring capability. The ATU-R uses this information to request the ATU-C to perform bitswapping. When this object is 'true', the ATU-C must be prepared to accept and properly handle bitswap requests from the ATU-R. While bitswapping has its obvious advantages, bitswapping can have undesirable side effects. It can introduce errors on lines prone to impulse noise. In this case, it may be desirable to disable bitswapping."
  },
  "cAdslAtucDmtConfBitSwapFrom": {
    "name": "cAdslAtucDmtConfBitSwapFrom",
    "oid": "1.3.6.1.4.1.9.9.130.1.14.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 9
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 3,
        "format": "decimal"
      }
    },
    "units": "dB",
    "maxaccess": "read-create",
    "reference": "ANSI T1.413-1998 Issue 2, Network and Customer Installation Interfaces - Asymmetric Digital Subscriber Line (ADSL) Metallic Interfaces. RFC 2662 - Definitions of Managed Objects for the ADSL Lines. G. Bathrick,. Ly. August 1999. ",
    "status": "current",
    "description": "Bitswapping attempts to maintain an acceptable margin for each bin; equalizing the margin across all bins through bit reallocation, thereby maximizing error performance. The ATU-C performs bitswapping by monitoring the margin measured for each bin by the transmitter. If a bin's margin falls below adslAtucConfTargetSnrMgn and the difference between the margin and adslAtucConfTargetSnrMgn exceeds the value of this object, then the ATU-C marks a bin as a 'from' bin. The ATU-C attempts to equalize the margin across the bins by swapping bits out of bins marked 'from' into bins marked 'to'. When the ATU-C swaps a bit out of bin, it decreases its b(i). Thus, the bins constellation is smaller. which increases its margin. When the ATU-C swaps a bit into a bin, it increases its b(i). Thus, the bins constellation is larger, which decreases its margin. If this value is too small, then the ATU-C may frequently toggle the bit allocation on bins, and if impulse noise is present, this can cause errors. If this value is too large, then the ATU-C may not identify an adequate number of bins that it can swap bits 'from', thereby decreasing the chances for the ATU-C to equalize the margin across all the bins. Unequalized margin across all the bins translates into poor error performance."
  },
  "cAdslAtucDmtConfBitSwapTo": {
    "name": "cAdslAtucDmtConfBitSwapTo",
    "oid": "1.3.6.1.4.1.9.9.130.1.14.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 9
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 3,
        "format": "decimal"
      }
    },
    "units": "dB",
    "maxaccess": "read-create",
    "reference": "ANSI T1.413-1998 Issue 2, Network and Customer Installation Interfaces - Asymmetric Digital Subscriber Line (ADSL) Metallic Interfaces. RFC 2662 - Definitions of Managed Objects for the ADSL Lines. G. Bathrick,. Ly. August 1999. ",
    "status": "current",
    "description": "Bitswapping attempts to maintain an acceptable margin for each bin; equalizing the margin across all bins through bit reallocation, thereby maximizing error performance. The ATU-C performs bitswapping by monitoring the margin measured for each bin by the transmitter. If a bin's margin exceeds adslAtucConfTargetSnrMgn and the difference between the margin and adslAtucConfTargetSnrMgn exceeds the value of this object, then the ATU-C marks a bin as a 'to' bin. The ATU-C attempts to equalize the margin across the bins by swapping bits out of bins marked 'from' into bins marked 'to'. When the ATU-C swaps a bit out of bin, it decreases its b(i). Thus, the bins constellation is smaller. which increases its margin. When the ATU-C swaps a bit into a bin, it increases its b(i). Thus, the bins constellation is larger, which decreases its margin. If this value is too small, then the ATU-C may frequently toggle the bit allocation on bins, and if impulse noise is present, this can cause errors. If this value is too large, then the ATU-C may not identify an adequate number of bins that it can swap bits 'to', thereby decreasing the chances for the ATU-C to equalize the margin across all the bins. Unequalized margin across all the bins translates into poor error performance."
  },
  "cAdslAturDmtConfFastFecSize": {
    "name": "cAdslAturDmtConfFastFecSize",
    "oid": "1.3.6.1.4.1.9.9.130.1.14.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DmtFecSize",
      "class": "type"
    },
    "default": {
      "default": {
        "value": 16,
        "format": "decimal"
      }
    },
    "units": "bytes",
    "maxaccess": "read-create",
    "reference": "ANSI T1.413-1998 Issue 2, Network and Customer Installation Interfaces - Asymmetric Digital Subscriber Line (ADSL) Metallic Interfaces.",
    "status": "current",
    "description": "This object specifies the initial number of FEC redundancy bytes the ATU-R appends to upstream frames transmitted over the fast channel during the training sequence. The ATU-C can force the ATU-R to fallback from this value depending on the aggregate data rate achieved during training. It is desirable to choose a large FEC size, thereby increasing the chance of being able to correct errors in the data delivered by a frame. However, additional FEC redundancy bytes increases frame overhead, and thus frame latency."
  },
  "cAdslAturDmtConfInterleaveFecSize": {
    "name": "cAdslAturDmtConfInterleaveFecSize",
    "oid": "1.3.6.1.4.1.9.9.130.1.14.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DmtFecSize",
      "class": "type"
    },
    "default": {
      "default": {
        "value": 16,
        "format": "decimal"
      }
    },
    "units": "bytes",
    "maxaccess": "read-create",
    "reference": "ANSI T1.413-1998 Issue 2, Network and Customer Installation Interfaces - Asymmetric Digital Subscriber Line (ADSL) Metallic Interfaces.",
    "status": "current",
    "description": "This object specifies the initial number of FEC redundancy bytes the ATU-R appends to upstream frames transmitted over the interleaved channel during the training sequence. The ATU-C can force the ATU-R to fallback from this value depending on the aggregate data rate achieved during training. It is desirable to choose a large FEC size, thereby increasing the chance of being able to correct errors in the data delivered by a frame. However, additional FEC redundancy bytes increases frame overhead, and thus frame latency. The value of this object must be a integral multiple of the value of cAdslAturDmtConfCodewordSize."
  },
  "cAdslAturDmtConfCodewordSize": {
    "name": "cAdslAturDmtConfCodewordSize",
    "oid": "1.3.6.1.4.1.9.9.130.1.14.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DmtCodewordSize",
      "class": "type"
    },
    "default": {
      "default": {
        "value": 16,
        "format": "decimal"
      }
    },
    "units": "symbols",
    "maxaccess": "read-create",
    "reference": "ANSI T1.413-1998 Issue 2, Network and Customer Installation Interfaces - Asymmetric Digital Subscriber Line (ADSL) Metallic Interfaces.",
    "status": "current",
    "description": "This object specifies the number of symbols per codeword being used by the ATU-R for upstream messages on an interleaved channel during the training sequence. The ATU-C can force the ATU-R to fallback from this value based on the aggregate data rate achieved during training. It is desirable to choose a large codeword size to minimize overhead. However, increasing the codeword size increases the possibility of not being able to correct errors in the data delivered by a frame."
  },
  "cAdslAtucDmtConfMinrateBlock": {
    "name": "cAdslAtucDmtConfMinrateBlock",
    "oid": "1.3.6.1.4.1.9.9.130.1.14.1.13",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object is used to implement min-rate blocking on DMT interfaces that support this option. "
  },
  "cAdslAtucDmtDualBitmapEnabled": {
    "name": "cAdslAtucDmtDualBitmapEnabled",
    "oid": "1.3.6.1.4.1.9.9.130.1.14.1.14",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object is used to implement dual bitmap tables for Annex C compliant DMT interfaces. The bin data for the DSL interface will appear in cAdslAturDmtBinTable and cAdslAtucDmtBinTable. "
  },
  "cAdslDmtLineAlarmConfProfileTable": {
    "name": "cAdslDmtLineAlarmConfProfileTable",
    "oid": "1.3.6.1.4.1.9.9.130.1.15",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table extends the adslLineAlarmConfProfileTable and contains enterprise-specific ADSL line configuration information pertaining to alarms."
  },
  "cAdslDmtLineAlarmConfProfileEntry": {
    "name": "cAdslDmtLineAlarmConfProfileEntry",
    "oid": "1.3.6.1.4.1.9.9.130.1.15.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "ADSL-LINE-MIB",
        "object": "adslLineAlarmConfProfileName",
        "implied": 1
      }
    ],
    "status": "current",
    "description": "A configuration profile containing enterprise-specific ADSL line configuration information pertaining to alarms"
  },
  "cAdslAtucDmtThreshRateFallback": {
    "name": "cAdslAtucDmtThreshRateFallback",
    "oid": "1.3.6.1.4.1.9.9.130.1.15.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type"
    },
    "maxaccess": "read-create",
    "reference": "RFC 2662 - Definitions of Managed Objects for the ADSL Lines. G. Bathrick,. Ly. August 1999. ",
    "status": "current",
    "description": "This object specifies a bit rate threshold. When the following condition is met, the agent generates an adslAtucRateChangeTrap: ( I + F ) < cAdslAtucDmtThreshRateFallback where I = adslAtucChanCurrTxRate for ATU-C's interleave channel F = adslAtucChanCurrTxRate for ATU-C's fast channel Setting this value to '0' prevents the agent from generating an adslAtucRateChangeTrap due to rate fallback."
  },
  "cAdslAturDmtThreshRateFallback": {
    "name": "cAdslAturDmtThreshRateFallback",
    "oid": "1.3.6.1.4.1.9.9.130.1.15.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type"
    },
    "maxaccess": "read-create",
    "reference": "RFC 2662 - Definitions of Managed Objects for the ADSL Lines. G. Bathrick,. Ly. August 1999. ",
    "status": "current",
    "description": "This object specifies a bit rate threshold. When the following condition is met, the agent generate an adslAturRateChangeTrap: ( I + F ) < cAdslAturDmtThreshRatefallback where I = adslAturChanCurrTxRate for ATU-R's interleave channel F = adslAturChanCurrTxRate for ATU-R's fast channel Setting this value to '0' prevents the agent from generating an adslAtucRateChangeTrap due to rate fallback."
  },
  "cAdslDmtBinIfNumber": {
    "name": "cAdslDmtBinIfNumber",
    "oid": "1.3.6.1.4.1.9.9.130.1.16",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "InterfaceIndexOrZero",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The cAdslDmtBinIfNumber is used to set the ifIndex for for which DMT bin information will be collected in cAdslAtucDmtBinTable and cAdslAturDmtBinTable. The request will be processed when cAdslDmtIfRqstStatus is set to pollNow (1). Setting this object will fail if the value of cAdslDmtIfRqstStatus is currently rqstInProgress (3). In addition, the interface must have an ifEntry with an ifType of adsl(94) and an adslLineCoding of dmt(2)."
  },
  "cAdslDmtBinIfRqstStatus": {
    "name": "cAdslDmtBinIfRqstStatus",
    "oid": "1.3.6.1.4.1.9.9.130.1.17",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "reset": -1,
          "pollNow": 1,
          "noIfConfigured": 2,
          "ifConfigured": 3,
          "rqstInProgess": 4,
          "lcDownForIf": 5,
          "ifUntrained": 6,
          "failure": 7,
          "success": 8
        }
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object initiates the polling and stores the status of the last DMT Bin request. This object can have the following values : reset (-1) : write this value to reset the the finite state machine (FSM) that controls the reading of bin information on a DMT interface. pollNow (1) : write this value to begin bin polling on an interface specified in cAdslDmtBinIfNumber. noIfConfigured(2) : status read when no valid interface is set in cAdslDmtBinIfNumber ifConfigured(3) : status read when a valid interface is set in cAdslDmtBinIfNumber rqstInProgress(4) : status returned until the data collection is complete on an interface. lcDownForIf (5) : status returned if the line card is down for the interface. ifUntrained (6) : status returned if the interface on the DSLAM is untrained. failure (7) : status returned when the request cannot be completed due to error. success (8) : status returned when bin data collection has been properly completed. Data collected on a status of success (8) will be available in cAdslAtucDmtBinTable and cAdslAturDmtBinTable. A read of this object can return any value between 2 and 8, while a write can only be set to the value of 1 or -1."
  },
  "cAdslDmtBinIfLstRqstUpldTime": {
    "name": "cAdslDmtBinIfLstRqstUpldTime",
    "oid": "1.3.6.1.4.1.9.9.130.1.18",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "DateAndTime",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "cAdslDmtBinIfLstRqstUpldTime stores the time and date when the last successful upload request was done. This field is used to determine the age of DMT Bin data in the cAdslAtucDmtBinTable and cAdslAturDmtBinTable."
  },
  "cAdslAtucDmtBinTable": {
    "name": "cAdslAtucDmtBinTable",
    "oid": "1.3.6.1.4.1.9.9.130.1.19",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains information on the 256 DMT bins in the downstream direction. Bins correspond to 4 kHz slots on a trained DSL line modem. The information stored in each bin includes bit counts per hertz of bandwidth and the transmitter gain in 0.01 dB increments."
  },
  "cAdslAtucDmtBinEntry": {
    "name": "cAdslAtucDmtBinEntry",
    "oid": "1.3.6.1.4.1.9.9.130.1.19.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAtucDmtBitmapIndex",
        "implied": 0
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAtucDmtBinIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A set of enterprise-specific parameters for a DMT DSL interface. After bin data has been collected successfully there will be at least 1 row entry for the interface indicated by cAdslAtucDmtBinIfIndex."
  },
  "cAdslAtucDmtBitmapIndex": {
    "name": "cAdslAtucDmtBitmapIndex",
    "oid": "1.3.6.1.4.1.9.9.130.1.19.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 5
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This index is used to step through all of the bin tables on a DSL interface."
  },
  "cAdslAtucDmtBinIndex": {
    "name": "cAdslAtucDmtBinIndex",
    "oid": "1.3.6.1.4.1.9.9.130.1.19.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 256
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A unique value, greater than zero, for each dmt bin on the interface specified in cAdslDmtBinIfNumber It is recommended that values be assigned contiguously starting from 1."
  },
  "cAdslAtucDmtBinBitAlloc": {
    "name": "cAdslAtucDmtBinBitAlloc",
    "oid": "1.3.6.1.4.1.9.9.130.1.19.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 15
          }
        ]
      }
    },
    "units": "bits/Hz",
    "maxaccess": "read-only",
    "status": "current",
    "description": "This stores the number of bits allotted per Hertz in this bin. For example, a value of 15 would indicate that this slot is tranmitting at a physical rate of 64kbits/sec."
  },
  "cAdslAtucDmtBinTxGain": {
    "name": "cAdslAtucDmtBinTxGain",
    "oid": "1.3.6.1.4.1.9.9.130.1.19.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 400
          }
        ]
      }
    },
    "units": "tenth dB",
    "maxaccess": "read-only",
    "status": "current",
    "description": "This field has the transmitter gain for this bin and is stored in 0.01 dB increments."
  },
  "cAdslAtucDmtBinNumber": {
    "name": "cAdslAtucDmtBinNumber",
    "oid": "1.3.6.1.4.1.9.9.130.1.19.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 255
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This field indicates the 4.3125 kHz band of downstream DSL line spectrum occupied by a bin. For example, a value of 3 would indicate the band from 12.9375 to 17.25 kHz of the spectrum."
  },
  "cAdslAturDmtBinTable": {
    "name": "cAdslAturDmtBinTable",
    "oid": "1.3.6.1.4.1.9.9.130.1.20",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains information for the 32 DMT bins in the upstream direction. A bin corresponds to a 4 kHz slots on a trained DSL line modem. The information stored in each bin includes bit counts per hertz and the transmitter gain in 0.01 dB increments."
  },
  "cAdslAturDmtBinEntry": {
    "name": "cAdslAturDmtBinEntry",
    "oid": "1.3.6.1.4.1.9.9.130.1.20.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAturDmtBitmapIndex",
        "implied": 0
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAturDmtBinIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A set of enterprise-specific parameters for a DMT DSL interface. After bin data has been collected successfully there will be at least 1 row entry for the interface indicated by cAdslAtucDmtBinIfIndex."
  },
  "cAdslAturDmtBitmapIndex": {
    "name": "cAdslAturDmtBitmapIndex",
    "oid": "1.3.6.1.4.1.9.9.130.1.20.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 5
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This index is used to step through all of the bin tables on a DSL interface."
  },
  "cAdslAturDmtBinIndex": {
    "name": "cAdslAturDmtBinIndex",
    "oid": "1.3.6.1.4.1.9.9.130.1.20.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 256
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A unique value, greater than zero, for each dmt bin on the interface specified in cAdslDmtBinIfNumber It is recommended that values be assigned contiguously starting from 1."
  },
  "cAdslAturDmtBinBitAlloc": {
    "name": "cAdslAturDmtBinBitAlloc",
    "oid": "1.3.6.1.4.1.9.9.130.1.20.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 15
          }
        ]
      }
    },
    "units": "bits/Hz",
    "maxaccess": "read-only",
    "status": "current",
    "description": "This stores the number of bits allotted per Hertz in this bin. For example, a value of 15 indicates that this slot is transmitting at a physical rate of 64 Kbits."
  },
  "cAdslAturDmtBinTxGain": {
    "name": "cAdslAturDmtBinTxGain",
    "oid": "1.3.6.1.4.1.9.9.130.1.20.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 400
          }
        ]
      }
    },
    "units": "hundredth dB",
    "maxaccess": "read-only",
    "status": "current",
    "description": "This field has the transmitter gain for this bin and is stored in 0.01 dB increments."
  },
  "cAdslAturDmtBinNumber": {
    "name": "cAdslAturDmtBinNumber",
    "oid": "1.3.6.1.4.1.9.9.130.1.20.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 255
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This field indicates the 4.3125 kHz band of upstream DSL line spectrum occupied by a bin. For example, a value of 3 would indicate the band from 12.9375 to 17.25 kHz of the spectrum."
  },
  "ciscoAdslDmtLineMIBNotificationsPrefix": {
    "name": "ciscoAdslDmtLineMIBNotificationsPrefix",
    "oid": "1.3.6.1.4.1.9.9.130.2",
    "class": "objectidentity"
  },
  "ciscoAdslDmtLineMIBNotifications": {
    "name": "ciscoAdslDmtLineMIBNotifications",
    "oid": "1.3.6.1.4.1.9.9.130.2.0",
    "class": "objectidentity"
  },
  "ciscoAdslDmtLineMIBConformance": {
    "name": "ciscoAdslDmtLineMIBConformance",
    "oid": "1.3.6.1.4.1.9.9.130.3",
    "class": "objectidentity"
  },
  "ciscoAdslDmtLineMIBCompliances": {
    "name": "ciscoAdslDmtLineMIBCompliances",
    "oid": "1.3.6.1.4.1.9.9.130.3.1",
    "class": "objectidentity"
  },
  "ciscoAdslDmtLineMIBGroups": {
    "name": "ciscoAdslDmtLineMIBGroups",
    "oid": "1.3.6.1.4.1.9.9.130.3.2",
    "class": "objectidentity"
  },
  "ciscoAdslDmtLineMIBCompliance": {
    "name": "ciscoAdslDmtLineMIBCompliance",
    "oid": "1.3.6.1.4.1.9.9.130.3.1.1",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "cAdslDmtLineGroup",
        "module": "CISCO-ADSL-DMT-LINE-MIB"
      },
      {
        "object": "cAdslAtucDmtPhysGroup",
        "module": "CISCO-ADSL-DMT-LINE-MIB"
      },
      {
        "object": "cAdslAtucDmtChanGroup",
        "module": "CISCO-ADSL-DMT-LINE-MIB"
      },
      {
        "object": "cAdslAturDmtChanGroup",
        "module": "CISCO-ADSL-DMT-LINE-MIB"
      },
      {
        "object": "cAdslDmtLineConfProfileGroup",
        "module": "CISCO-ADSL-DMT-LINE-MIB"
      },
      {
        "object": "cAdslDmtLineAlarmConfProfileGroup",
        "module": "CISCO-ADSL-DMT-LINE-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for entities that implement the CISCO-ADSL-DMT-LINE-MIB. Implementation of this MIB is mandatory for any platform that supports one or more ADSL DMT line interfaces.Replaced by ciscoAdslDmtLineMIBComplianceRev1"
  },
  "ciscoAdslDmtLineMIBComplianceRev1": {
    "name": "ciscoAdslDmtLineMIBComplianceRev1",
    "oid": "1.3.6.1.4.1.9.9.130.3.1.2",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "cAdslDmtLineGroup",
        "module": "CISCO-ADSL-DMT-LINE-MIB"
      },
      {
        "object": "cAdslAtucDmtPhysGroup",
        "module": "CISCO-ADSL-DMT-LINE-MIB"
      },
      {
        "object": "cAdslAtucDmtChanGroup",
        "module": "CISCO-ADSL-DMT-LINE-MIB"
      },
      {
        "object": "cAdslAturDmtChanGroup",
        "module": "CISCO-ADSL-DMT-LINE-MIB"
      },
      {
        "object": "cAdslDmtLineConfProfileGroupRev1",
        "module": "CISCO-ADSL-DMT-LINE-MIB"
      },
      {
        "object": "cAdslDmtLineAlarmConfProfileGroup",
        "module": "CISCO-ADSL-DMT-LINE-MIB"
      },
      {
        "object": "cAdslDmtBinIfGroup",
        "module": "CISCO-ADSL-DMT-LINE-MIB"
      },
      {
        "object": "cAdslAtucDmtBinDataGroup",
        "module": "CISCO-ADSL-DMT-LINE-MIB"
      },
      {
        "object": "cAdslAturDmtBinDataGroup",
        "module": "CISCO-ADSL-DMT-LINE-MIB"
      }
    ],
    "status": "current",
    "description": "The compliance statement for entities that implement the CISCO-ADSL-DMT-LINE-MIB. Implementation of this MIB is mandatory for any platform that supports one or more ADSL DMT line interfaces."
  },
  "cAdslDmtLineGroup": {
    "name": "cAdslDmtLineGroup",
    "oid": "1.3.6.1.4.1.9.9.130.3.2.1",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslDmtLineOverheadFraming"
      }
    ],
    "status": "current",
    "description": "A collection of managed objects defining the enterprise-specific attributes of an ADSL line supporting modems using the DMT line code."
  },
  "cAdslAtucDmtPhysGroup": {
    "name": "cAdslAtucDmtPhysGroup",
    "oid": "1.3.6.1.4.1.9.9.130.3.2.2",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAtucDmtState"
      }
    ],
    "status": "current",
    "description": "A collection of managed objects defining the enterprise-specific physical-layer parameters of an ATU-C using the DMT line code."
  },
  "cAdslAtucDmtChanGroup": {
    "name": "cAdslAtucDmtChanGroup",
    "oid": "1.3.6.1.4.1.9.9.130.3.2.3",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAtucDmtChanFecSize"
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAtucDmtChanCodewordSize"
      }
    ],
    "status": "current",
    "description": "A collection of managed objects defining the enterprise-specific channel parameters of an ATU-C using the DMT line code."
  },
  "cAdslAturDmtChanGroup": {
    "name": "cAdslAturDmtChanGroup",
    "oid": "1.3.6.1.4.1.9.9.130.3.2.4",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAturDmtChanFecSize"
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAturDmtChanCodewordSize"
      }
    ],
    "status": "current",
    "description": "A collection of managed objects defining the enterprise-specific channel parameters of an ATU-R using the DMT line code."
  },
  "cAdslDmtLineConfProfileGroup": {
    "name": "cAdslDmtLineConfProfileGroup",
    "oid": "1.3.6.1.4.1.9.9.130.3.2.5",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslLineDmtConfOperatingMode"
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslLineDmtConfTrainingMode"
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAtucDmtConfFastFecSize"
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAtucDmtConfInterleaveFecSize"
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAtucDmtConfCodewordSize"
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAtucDmtConfOverheadFraming"
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAtucDmtConfBitSwapEnabled"
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAtucDmtConfBitSwapFrom"
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAtucDmtConfBitSwapTo"
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAturDmtConfInterleaveFecSize"
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAturDmtConfFastFecSize"
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAturDmtConfCodewordSize"
      }
    ],
    "status": "deprecated",
    "description": "A collection of managed objects defining the enterprise-specific line configuration information associated with one or more ADSL ATU class devices implementing the DMT line code. Replaced by cAdslDmtLineConfProfileGroupRev1."
  },
  "cAdslDmtLineAlarmConfProfileGroup": {
    "name": "cAdslDmtLineAlarmConfProfileGroup",
    "oid": "1.3.6.1.4.1.9.9.130.3.2.6",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAtucDmtThreshRateFallback"
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAturDmtThreshRateFallback"
      }
    ],
    "status": "current",
    "description": "A collection of managed objects defining the enterprise-specific line alarm configuration information associated with one or more ATU class devices implementing the DMT line code."
  },
  "cAdslDmtBinIfGroup": {
    "name": "cAdslDmtBinIfGroup",
    "oid": "1.3.6.1.4.1.9.9.130.3.2.7",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslDmtBinIfNumber"
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslDmtBinIfRqstStatus"
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslDmtBinIfLstRqstUpldTime"
      }
    ],
    "status": "current",
    "description": "A collection of managed objects defining the enterprise-specific line interface information used to collect bin data from DMT interfaces."
  },
  "cAdslAtucDmtBinDataGroup": {
    "name": "cAdslAtucDmtBinDataGroup",
    "oid": "1.3.6.1.4.1.9.9.130.3.2.8",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAtucDmtBinBitAlloc"
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAtucDmtBinTxGain"
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAtucDmtBinNumber"
      }
    ],
    "status": "current",
    "description": "A collection of managed objects defining the enterprise-specific line BIN information associated with one or more ATUC class devices implementing the DMT line code."
  },
  "cAdslAturDmtBinDataGroup": {
    "name": "cAdslAturDmtBinDataGroup",
    "oid": "1.3.6.1.4.1.9.9.130.3.2.9",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAturDmtBinBitAlloc"
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAturDmtBinTxGain"
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAturDmtBinNumber"
      }
    ],
    "status": "current",
    "description": "A collection of managed objects defining the enterprise-specific line BIN information associated with a ATUR class device implementing the DMT line code."
  },
  "cAdslDmtLineConfProfileGroupRev1": {
    "name": "cAdslDmtLineConfProfileGroupRev1",
    "oid": "1.3.6.1.4.1.9.9.130.3.2.10",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslLineDmtConfOperatingMode"
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslLineDmtConfTrainingMode"
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAtucDmtConfFastFecSize"
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAtucDmtConfInterleaveFecSize"
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAtucDmtConfCodewordSize"
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAtucDmtConfOverheadFraming"
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAtucDmtConfBitSwapEnabled"
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAtucDmtConfBitSwapFrom"
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAtucDmtConfBitSwapTo"
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAturDmtConfInterleaveFecSize"
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAturDmtConfFastFecSize"
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAturDmtConfCodewordSize"
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAtucDmtConfMinrateBlock"
      },
      {
        "module": "CISCO-ADSL-DMT-LINE-MIB",
        "object": "cAdslAtucDmtDualBitmapEnabled"
      }
    ],
    "status": "current",
    "description": "A collection of managed objects defining the enterprise-specific line configuration information associated with one or more ADSL ATU class devices implementing the DMT line code."
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/CISCO-ADSL-DMT-LINE-MIB",
      "Produced by pysmi-0.3.4 at Fri May 24 16:54:05 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "CISCO-ADSL-DMT-LINE-MIB"
  }
}