{
  "imports": {
    "class": "imports",
    "CISCO-SMI": [
      "ciscoExperiment"
    ],
    "IF-MIB": [
      "ifIndex",
      "InterfaceIndex"
    ],
    "SNMPv2-CONF": [
      "OBJECT-GROUP",
      "NOTIFICATION-GROUP",
      "MODULE-COMPLIANCE"
    ],
    "SNMPv2-SMI": [
      "Gauge32",
      "TimeTicks",
      "Counter64",
      "MODULE-IDENTITY",
      "OBJECT-IDENTITY",
      "Unsigned32",
      "OBJECT-TYPE",
      "NOTIFICATION-TYPE",
      "IpAddress",
      "Counter32",
      "MibIdentifier",
      "Bits",
      "iso",
      "Integer32"
    ],
    "SNMPv2-TC": [
      "TimeStamp",
      "TEXTUAL-CONVENTION",
      "RowStatus",
      "DisplayString",
      "TruthValue"
    ]
  },
  "ciscoOpticalPatchMIB": {
    "name": "ciscoOpticalPatchMIB",
    "oid": "1.3.6.1.4.1.9.10.67",
    "class": "moduleidentity",
    "revisions": [
      {
        "revision": "2002-03-18 00:00",
        "description": "This revision adds support for patching one interface to two different interfaces in the receive and transmit directions. This revision deprecates the cOPatchInterfaceTable and replaces it with the new cOPatchIntfTable. This new table includes the cOPatchIntfDirection object along with ifIndex as part of the table index. The cOPatchIntfDirection object identifies whether this interface is patched to another interface within a network element in the receive, transmit or both directions. A new object cOPatchDirOnLowIf is added to the cOPatchTable in order to identify the patch direction relative to the interface with low ifIndex."
      },
      {
        "revision": "2001-09-05 00:00",
        "description": "Initial version of this MIB module."
      }
    ],
    "lastupdated": "200203180000Z",
    "organization": "Cisco Systems, Inc.",
    "contactinfo": "Cisco Systems Customer Service Postal: 170 W Tasman Drive San Jose, CA 95134 Tel: +1 800 553-NETS E-mail: cs-dwdm@cisco.com",
    "description": "This MIB module is used to configure and monitor the network element view of optical patches between two ports or fibers on the same network element. It is up to the user to keep the provisioned information that is reflected in this MIB module in sync with the actual patches present between ports or fibers on the network element. Provisioning of a patch does not cause a patch to be inserted; it only informs the network element that a patch has been, or is soon to be, added or removed."
  },
  "cOPatchMIBObjects": {
    "name": "cOPatchMIBObjects",
    "oid": "1.3.6.1.4.1.9.10.67.1",
    "class": "objectidentity"
  },
  "cOPatchInterfaceTable": {
    "name": "cOPatchInterfaceTable",
    "oid": "1.3.6.1.4.1.9.10.67.1.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "deprecated",
    "description": "This table lists all interfaces that are provisioned to indicate that they are patched to other interfaces on the same network element. The table is used to find patches that include a particular interface. This table is deprecated since it only includes bidirectional patches. The new cOPatchIntfTable includes both unidirectional patches (in the transmit or receive direction) and bidirectional patches."
  },
  "cOPatchInterfaceEntry": {
    "name": "cOPatchInterfaceEntry",
    "oid": "1.3.6.1.4.1.9.10.67.1.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      }
    ],
    "status": "deprecated",
    "description": "An entry is created only when an interface is provisioned to indicate that it is patched to another interface on the same network element (i.e. when the associated entry in the cOPatchTable has been created). An entry is deleted when the interface is removed from a patch, or when the patch is deleted from the cOPatchTable."
  },
  "cOPatchIdentifier": {
    "name": "cOPatchIdentifier",
    "oid": "1.3.6.1.4.1.9.10.67.1.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 2147483547
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The value of cOPatchIndex used in the cOPatchTable to identify a patch that includes this interface. The other interface included in that patch has an entry in this table with the same value of this object, in addition to the entry in the cOPatchTable with this value of cOPatchIndex."
  },
  "cOPatchIndexNext": {
    "name": "cOPatchIndexNext",
    "oid": "1.3.6.1.4.1.9.10.67.1.2",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 2147483647
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object contains an appropriate value to be used for cOPatchIndex when creating entries in the cOPatchTable. The value 0 indicates that no unassigned entries are available. To obtain the cOPatchIndex value for a new entry, the manager issues a management protocol retrieval operation to obtain the current value of this object. The agent will modify the value to the next unassigned index, when a new row is created in cOPatchTable with the current value of this object. After deletion of a row in cOPatchTable the agent will determine through its local policy when its index value will be made available for reuse."
  },
  "cOPatchLastChange": {
    "name": "cOPatchLastChange",
    "oid": "1.3.6.1.4.1.9.10.67.1.3",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TimeStamp",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The value of sysUpTime at the time of the last creation, deletion or modification of an entry in the cOPatchTable. If the cOPatchTable entries has been unchanged since the last re-initialization of the local network management subsystem, then this object contains a zero value."
  },
  "cOPatchEventType": {
    "name": "cOPatchEventType",
    "oid": "1.3.6.1.4.1.9.10.67.1.4",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "create": 1,
          "delete": 2,
          "modify": 3
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The event type of the patch. The use is as follows: create(1) The value of this object when cOPatchEvent is generated upon creation of a patch. delete(2) The value of this object when cOPatchEvent is generated upon deletion of a patch. modify(3) The value of this object when cOPatchEvent is generated upon modification of a patch."
  },
  "cOPatchTable": {
    "name": "cOPatchTable",
    "oid": "1.3.6.1.4.1.9.10.67.1.5",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains the network element view of optical patches between two interfaces on the same network element. It is up to the user to keep the provisioned information that is reflected in this table in sync with the actual patches present between interfaces on the network element. Provisioning of a patch in this table does not cause a patch to be inserted; it only informs the network element that a patch has been, or is soon to be, added or removed. Each entry in the table models a unidirectional or bidirectional patch between two interfaces on the same network element. When one interface is patched to two different interfaces, one in the receive direction and the other in the transmit direction, the interface will appear in two different entries in the table. The terms low and high are chosen to represent numerical ordering of the two interfaces associated with a patch. That is, the interface with the lower value of ifIndex is termed 'low', while the other interface associated with the patch is termed 'high'."
  },
  "cOPatchEntry": {
    "name": "cOPatchEntry",
    "oid": "1.3.6.1.4.1.9.10.67.1.5.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-OPTICAL-PATCH-MIB",
        "object": "cOPatchIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "This entry is used to model a unidirectional or bidirectional patch between two interfaces on the same network element. An entry is created when the network element is provisioned to indicate that two interfaces on the network element have been patched together using an optical patch cord. Prior to creating an entry in the table, the manager should obtain a unique value of cOPatchIndex by reading the cOPatchIndexNext object. When an entry in the table is created, the cOPatchIntfPatchId values in the corresponding cOPatchIntfTable rows are filled in by the agent."
  },
  "cOPatchIndex": {
    "name": "cOPatchIndex",
    "oid": "1.3.6.1.4.1.9.10.67.1.5.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 2147483647
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A unique value used to identify this patch. For each interface associated with this patch, the agent reports this patch index value in the cOPatchIntfPatchId object of the corresponding cOPatchIntfTable entries. When the value of this index is equal to the current value of cOPatchIndexNext, the agent will modify the value of cOPatchIndexNext to the next unassigned index."
  },
  "cOPatchLowIfIndex": {
    "name": "cOPatchLowIfIndex",
    "oid": "1.3.6.1.4.1.9.10.67.1.5.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InterfaceIndex",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The value of this object is equal to MIB II's ifIndex value of the interface for this patch. The term low implies that this interface has the numerically lower ifIndex value than the other interface identified in the same cOPatchEntry. The value of this object is specified during row creation, and can never be changed."
  },
  "cOPatchHighIfIndex": {
    "name": "cOPatchHighIfIndex",
    "oid": "1.3.6.1.4.1.9.10.67.1.5.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InterfaceIndex",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The value of this object is equal to MIB II's ifIndex value of the interface for this patch. The term high implies that this interface has the numerically higher ifIndex value than the other interface identified in the same cOPatchEntry. The value of this object is specified during row creation, and can never be changed."
  },
  "cOPatchType": {
    "name": "cOPatchType",
    "oid": "1.3.6.1.4.1.9.10.67.1.5.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "provisioned": 1,
          "automatic": 2,
          "other": 3
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The creation type of the patch. The use is as follows: provisioned(1) Provisioned by the user or by a management system using the Command Line Interface, SNMP, or other means of management access to the network element. automatic(2) Created automatically by the network element, without user or management intervention. In particular, this is used to represent fixed patches due to the presence of entities such as optical backplanes."
  },
  "cOPatchStatus": {
    "name": "cOPatchStatus",
    "oid": "1.3.6.1.4.1.9.10.67.1.5.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "noError": 1,
          "otherError": 2,
          "interfaceError": 3,
          "interfaceChannelError": 4
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the error status of the patch. The use is as follows: noError(1) This value indicates a patch with no error. otherError(2) This value indicates an unknown patch error. interfaceError(3) This value indicates one or both interfaces are of the wrong type for a patch or the two interfaces are not supposed to be patched together. interfaceChannelError(4) This value indicates the frequency channel of the two interfaces in this patch entry do not match."
  },
  "cOPatchCreationTime": {
    "name": "cOPatchCreationTime",
    "oid": "1.3.6.1.4.1.9.10.67.1.5.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TimeStamp",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The value of MIB II's sysUpTime object at the time this patch was created. If the current state was entered prior to the last re-initialization of the agent then this object contains a zero value."
  },
  "cOPatchRowStatus": {
    "name": "cOPatchRowStatus",
    "oid": "1.3.6.1.4.1.9.10.67.1.5.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status of this entry in the cOPatchTable. This object is used to create an entry indicating that two interfaces on the network element have been patched together, or to modify or delete an existing entry."
  },
  "cOPatchDirOnLowIf": {
    "name": "cOPatchDirOnLowIf",
    "oid": "1.3.6.1.4.1.9.10.67.1.5.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "lowIfDirReceive": 1,
          "lowIfDirTransmit": 2,
          "lowIfDirBoth": 3
        }
      }
    },
    "default": {
      "default": {
        "value": "lowIfDirBoth",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "In case of an optical interface where the transmitted and received signals travel on two different strands of fiber, it is possible that each fiber is patched to a different interface. This object identifies the patch direction for this entry relative to the interface with low ifIndex. The direction in which the interface with high ifIndex is patched can be deduced based on this object value. If the interface with low ifIndex is patched in the receive direction, the associated high interface has to be patched in the transmit direction and vice versa. If the low interface is patched in both directions, the same should hold true on the interface with high ifIndex. "
  },
  "cOPatchEventEnabled": {
    "name": "cOPatchEventEnabled",
    "oid": "1.3.6.1.4.1.9.10.67.1.6",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Notifications that a patch between two interfaces is created, modified or deleted are enabled if this value is set to 'true'."
  },
  "cOPatchIntfTable": {
    "name": "cOPatchIntfTable",
    "oid": "1.3.6.1.4.1.9.10.67.1.7",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table lists all interfaces that are provisioned to indicate that they are patched to other interfaces on the same network element. The table is used to find patches that include a particular interface. An interface can be patched to another interface in the receive direction, the transmit direction or both directions. The cOPatchIntfDirection object identifies the direction."
  },
  "cOPatchIntfEntry": {
    "name": "cOPatchIntfEntry",
    "oid": "1.3.6.1.4.1.9.10.67.1.7.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      },
      {
        "module": "CISCO-OPTICAL-PATCH-MIB",
        "object": "cOPatchIntfDirection",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry is created only when an interface is provisioned to indicate that it is patched to another interface on the same network element (i.e. when the associated entry in the cOPatchTable has been created). An entry is deleted when the interface is removed from a patch, or when the patch is deleted from the cOPatchTable."
  },
  "cOPatchIntfDirection": {
    "name": "cOPatchIntfDirection",
    "oid": "1.3.6.1.4.1.9.10.67.1.7.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "receive": 1,
          "transmit": 2,
          "both": 3
        }
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "In case of an optical interface where the transmitted and received signals travel on two different strands of fiber, it is possible that each fiber is patched to a different interface. For example, the transmit and receive fibers of this interface may have unidirectional connections to different optical amplifiers. This object indicates whether this entry describes a patch in the receive direction, the transmit direction or both directions. If both the transmit and receive fibers of this interface are patched to the same interface, then this object is set to 'both'. Individual entries for 'transmit' and 'receive' should not be created in this case."
  },
  "cOPatchIntfPatchId": {
    "name": "cOPatchIntfPatchId",
    "oid": "1.3.6.1.4.1.9.10.67.1.7.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 2147483547
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The value of cOPatchIndex used in the cOPatchTable to identify a patch that includes this interface. The other interface included in that patch has an entry in this table with the same value of this object, in addition to the entry in the cOPatchTable with this value of cOPatchIndex."
  },
  "cOPatchMIBNotifications": {
    "name": "cOPatchMIBNotifications",
    "oid": "1.3.6.1.4.1.9.10.67.2",
    "class": "objectidentity"
  },
  "cOPatchEvent": {
    "name": "cOPatchEvent",
    "oid": "1.3.6.1.4.1.9.10.67.2.1",
    "class": "notificationtype",
    "objects": [
      {
        "module": "CISCO-OPTICAL-PATCH-MIB",
        "object": "cOPatchLowIfIndex"
      },
      {
        "module": "CISCO-OPTICAL-PATCH-MIB",
        "object": "cOPatchHighIfIndex"
      },
      {
        "module": "CISCO-OPTICAL-PATCH-MIB",
        "object": "cOPatchType"
      },
      {
        "module": "CISCO-OPTICAL-PATCH-MIB",
        "object": "cOPatchStatus"
      },
      {
        "module": "CISCO-OPTICAL-PATCH-MIB",
        "object": "cOPatchEventType"
      }
    ],
    "status": "current",
    "description": "This notification is generated when ever a patch is created, modified or deleted."
  },
  "cOPatchMIBConformance": {
    "name": "cOPatchMIBConformance",
    "oid": "1.3.6.1.4.1.9.10.67.3",
    "class": "objectidentity"
  },
  "cOPatchMIBCompliances": {
    "name": "cOPatchMIBCompliances",
    "oid": "1.3.6.1.4.1.9.10.67.3.1",
    "class": "objectidentity"
  },
  "cOPatchMIBGroups": {
    "name": "cOPatchMIBGroups",
    "oid": "1.3.6.1.4.1.9.10.67.3.2",
    "class": "objectidentity"
  },
  "cOPatchMIBCompliance": {
    "name": "cOPatchMIBCompliance",
    "oid": "1.3.6.1.4.1.9.10.67.3.1.1",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "cOPatchInterfaceGroup",
        "module": "CISCO-OPTICAL-PATCH-MIB"
      },
      {
        "object": "cOPatchGroup",
        "module": "CISCO-OPTICAL-PATCH-MIB"
      },
      {
        "object": "cOPatchNotifyGroup",
        "module": "CISCO-OPTICAL-PATCH-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for entities which implement the Cisco Patch MIB"
  },
  "cOPatchMIBCompliance1": {
    "name": "cOPatchMIBCompliance1",
    "oid": "1.3.6.1.4.1.9.10.67.3.1.2",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "cOPatchIntfGroup",
        "module": "CISCO-OPTICAL-PATCH-MIB"
      },
      {
        "object": "cOPatchGroup1",
        "module": "CISCO-OPTICAL-PATCH-MIB"
      },
      {
        "object": "cOPatchNotifyGroup",
        "module": "CISCO-OPTICAL-PATCH-MIB"
      }
    ],
    "status": "current",
    "description": "The compliance statement for entities which implement the Cisco Patch MIB"
  },
  "cOPatchInterfaceGroup": {
    "name": "cOPatchInterfaceGroup",
    "oid": "1.3.6.1.4.1.9.10.67.3.2.1",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-OPTICAL-PATCH-MIB",
        "object": "cOPatchIdentifier"
      }
    ],
    "status": "deprecated",
    "description": "Object needed to implement Interfaces with Patches."
  },
  "cOPatchGroup": {
    "name": "cOPatchGroup",
    "oid": "1.3.6.1.4.1.9.10.67.3.2.2",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-OPTICAL-PATCH-MIB",
        "object": "cOPatchIndexNext"
      },
      {
        "module": "CISCO-OPTICAL-PATCH-MIB",
        "object": "cOPatchLastChange"
      },
      {
        "module": "CISCO-OPTICAL-PATCH-MIB",
        "object": "cOPatchEventType"
      },
      {
        "module": "CISCO-OPTICAL-PATCH-MIB",
        "object": "cOPatchEventEnabled"
      },
      {
        "module": "CISCO-OPTICAL-PATCH-MIB",
        "object": "cOPatchLowIfIndex"
      },
      {
        "module": "CISCO-OPTICAL-PATCH-MIB",
        "object": "cOPatchHighIfIndex"
      },
      {
        "module": "CISCO-OPTICAL-PATCH-MIB",
        "object": "cOPatchType"
      },
      {
        "module": "CISCO-OPTICAL-PATCH-MIB",
        "object": "cOPatchStatus"
      },
      {
        "module": "CISCO-OPTICAL-PATCH-MIB",
        "object": "cOPatchCreationTime"
      },
      {
        "module": "CISCO-OPTICAL-PATCH-MIB",
        "object": "cOPatchRowStatus"
      }
    ],
    "status": "deprecated",
    "description": "Collection of objects needed to implement Patches."
  },
  "cOPatchNotifyGroup": {
    "name": "cOPatchNotifyGroup",
    "oid": "1.3.6.1.4.1.9.10.67.3.2.3",
    "class": "notificationgroup",
    "objects": [
      {
        "module": "CISCO-OPTICAL-PATCH-MIB",
        "object": "cOPatchEvent"
      }
    ],
    "status": "current",
    "description": "Patch error notifications."
  },
  "cOPatchIntfGroup": {
    "name": "cOPatchIntfGroup",
    "oid": "1.3.6.1.4.1.9.10.67.3.2.4",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-OPTICAL-PATCH-MIB",
        "object": "cOPatchIntfPatchId"
      }
    ],
    "status": "current",
    "description": "Object needed to implement Interfaces with Patches."
  },
  "cOPatchGroup1": {
    "name": "cOPatchGroup1",
    "oid": "1.3.6.1.4.1.9.10.67.3.2.5",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-OPTICAL-PATCH-MIB",
        "object": "cOPatchIndexNext"
      },
      {
        "module": "CISCO-OPTICAL-PATCH-MIB",
        "object": "cOPatchLastChange"
      },
      {
        "module": "CISCO-OPTICAL-PATCH-MIB",
        "object": "cOPatchEventType"
      },
      {
        "module": "CISCO-OPTICAL-PATCH-MIB",
        "object": "cOPatchEventEnabled"
      },
      {
        "module": "CISCO-OPTICAL-PATCH-MIB",
        "object": "cOPatchLowIfIndex"
      },
      {
        "module": "CISCO-OPTICAL-PATCH-MIB",
        "object": "cOPatchHighIfIndex"
      },
      {
        "module": "CISCO-OPTICAL-PATCH-MIB",
        "object": "cOPatchType"
      },
      {
        "module": "CISCO-OPTICAL-PATCH-MIB",
        "object": "cOPatchStatus"
      },
      {
        "module": "CISCO-OPTICAL-PATCH-MIB",
        "object": "cOPatchCreationTime"
      },
      {
        "module": "CISCO-OPTICAL-PATCH-MIB",
        "object": "cOPatchRowStatus"
      },
      {
        "module": "CISCO-OPTICAL-PATCH-MIB",
        "object": "cOPatchDirOnLowIf"
      }
    ],
    "status": "current",
    "description": "Collection of objects needed to implement Patches in transmit, receive or both directions."
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/CISCO-OPTICAL-PATCH-MIB",
      "Produced by pysmi-0.3.4 at Fri May 24 17:13:13 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "CISCO-OPTICAL-PATCH-MIB"
  }
}