{
  "imports": {
    "class": "imports",
    "CISCO-SMI": [
      "ciscoDomains"
    ],
    "SNMPv2-CONF": [
      "MODULE-COMPLIANCE",
      "NOTIFICATION-GROUP"
    ],
    "SNMPv2-SMI": [
      "NOTIFICATION-TYPE",
      "IpAddress",
      "OBJECT-TYPE",
      "Bits",
      "Counter64",
      "MibIdentifier",
      "iso",
      "Unsigned32",
      "Counter32",
      "TimeTicks",
      "Integer32",
      "MODULE-IDENTITY",
      "Gauge32",
      "OBJECT-IDENTITY"
    ],
    "SNMPv2-TC": [
      "TEXTUAL-CONVENTION",
      "DisplayString"
    ]
  },
  "ciscoTransportMappings": {
    "name": "ciscoTransportMappings",
    "oid": "1.3.6.1.4.1.9.19.1",
    "class": "moduleidentity",
    "revisions": [
      {
        "revision": "2001-08-23 16:00",
        "description": "Added Cisco Networking Services (CNS) Transport domain and identifier."
      },
      {
        "revision": "2000-06-21 16:00",
        "description": "Initial version of this MIB module."
      }
    ],
    "lastupdated": "200108231600Z",
    "organization": "Cisco Systems, Inc.",
    "contactinfo": " Cisco Systems Customer Service Postal: 170 W. Tasman Drive San Jose, CA 95134 USA Tel: +1 800 553-NETS E-mail: cs-snmp@cisco.com",
    "description": "Extension of SNMPv2-TM MIB"
  },
  "snmpUDPVPNDomain": {
    "name": "snmpUDPVPNDomain",
    "oid": "1.3.6.1.4.1.9.19.1.1",
    "class": "objectidentity",
    "status": "current",
    "description": "This transport domain is used to specify that particular SNMP messages are to be sent/received over a particular Virtual Private Network (VPN), implemented using MPLS (Multiprotocol Label Switching). The corresponding transport address is of type SnmpUDPVPNAddress. A VPN is defined as a set of sites with a common community of interest. Sites within an MPLS-based VPN often have private addresses which aren't accessible from outside of the VPN, and may be duplicates of private addresses used in other VPNs. To uniquely identify such a private address, it must be associated with a particular VPN routing/forwarding instance, also known as a VRF (VPN Routing and Forwarding table).",
    "reference": "RFC 2547: BGP/MPLS VPNs"
  },
  "SnmpUDPVPNAddress": {
    "name": "SnmpUDPVPNAddress",
    "class": "textualconvention",
    "type": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 7,
            "max": 38
          }
        ]
      }
    },
    "displayhint": "1d.1d.1d.1d/2d/32a",
    "status": "current",
    "description": "Represents a UDP VPN address: octets contents encoding 1-4 IP-address network-byte order 5-6 UDP-port network-byte order 7..38 VRF name string of (up to 32) octets IP address and port numbers should be represented in binary format. String must contain printable characters."
  },
  "snmpAAL5Domain": {
    "name": "snmpAAL5Domain",
    "oid": "1.3.6.1.4.1.9.19.1.2",
    "class": "objectidentity",
    "status": "current",
    "description": "This transport domain is used to specify that particular SNMP messages are to be sent/received over AAL5 transport. The corresponding transport address is of type SnmpAAL5VCIdentifier. An ATM VCC referenced by a SnmpAAL5VCIdentifier must be used only for SNMP packets, and not for any other kind of packets. Care must be taken with the use of this domain because its associated transport address, SnmpAAL5VCIdentifier, contains identifiers which only have local and temporal uniqueness: ifIndex, VPI, VCI. Use of this transport mapping is not recommended, except in circumstances where an IP address is not available and thus a mapping over UDP, such as snmpUDPDomain, can not be used."
  },
  "SnmpAAL5VCIdentifier": {
    "name": "SnmpAAL5VCIdentifier",
    "class": "textualconvention",
    "type": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 12,
            "max": 12
          }
        ]
      }
    },
    "displayhint": "4d/4d/4d",
    "status": "current",
    "description": "Represents a AAL5 VCC: octets contents encoding 1-4 ifIndex network_byte order 5-8 vpi network-byte order 9-12 vci network-byte order ifIndex, vpi and vci should be represented in binary format. ifIndex specifies the value of the ifIndex object associated with the interface supporting the VCC. vpi specifies the value of the VPI (Virtual Path Identifier) associated with the VCC. vci specifies the value of the VCI (Virtual Channel Identifier) associated with the VCC."
  },
  "snmpCNSDomain": {
    "name": "snmpCNSDomain",
    "oid": "1.3.6.1.4.1.9.19.1.3",
    "class": "objectidentity",
    "status": "current",
    "description": "This transport domain is used for transporting SNMP messages over the CNS Event Service. The corresponding transport addresses are of type SnmpCNSIdentifier. CNS Event service is an event based transport mechanism. Events are published by producers on particular subjects. Consumers listening for these subjects receive the events. Point to point communication is provided on the CNS Event Service by the use of Name Space Mapper Service that uses the device-id, appended at the end of the subject, to locate a specific target. An Event Agent subject used by a SnmpCNSIdentifier must be used only for SNMP events, and not for any other kind of events. Use of this transport mapping is not recommended, except in circumstances where an IP address is not available and thus a mapping over UDP, such as snmpUDPDomain, can not be used."
  },
  "SnmpCNSIdentifier": {
    "name": "SnmpCNSIdentifier",
    "class": "textualconvention",
    "type": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 19,
            "max": 274
          }
        ]
      }
    },
    "displayhint": "19a.255a",
    "status": "current",
    "description": "Represents the address that identifies targets in the CNS Event Service Transport mapping. octets contents encoding 1-19 service-field string of (19) octets 20-274 device-id string of (upto 255) octets service-field specifies the type of service (request, response or notifications) and has a fixed length of 19 octets. It also serves the purpose of distinguishing SNMP Message events from other CNS Events. device-id uniquely identifies devices subscribed to the CNS Event Service Bus. device-id may be same as the hostname for the device. The device-id must be separated from the service-field by a '.'. If the device-id is omitted, SnmpCNSIdentifier would contain just the fixed-length (19 octets) service-field. Thus target addresses are CNS Event subjects of the form: <service-field>.<device-id>"
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/CISCO-TM",
      "Produced by pysmi-0.3.4 at Fri May 24 17:19:15 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "CISCO-TM"
  }
}