{
  "imports": {
    "class": "imports",
    "CISCO-SMI": [
      "ciscoMgmt"
    ],
    "INET-ADDRESS-MIB": [
      "InetAddressType",
      "InetAddress"
    ],
    "SNMPv2-CONF": [
      "MODULE-COMPLIANCE",
      "OBJECT-GROUP",
      "NOTIFICATION-GROUP"
    ],
    "SNMPv2-SMI": [
      "Counter32",
      "TimeTicks",
      "NOTIFICATION-TYPE",
      "Gauge32",
      "Integer32",
      "Unsigned32",
      "Counter64",
      "iso",
      "MODULE-IDENTITY",
      "MibIdentifier",
      "Bits",
      "IpAddress",
      "OBJECT-IDENTITY",
      "OBJECT-TYPE"
    ],
    "SNMPv2-TC": [
      "TEXTUAL-CONVENTION",
      "DisplayString"
    ]
  },
  "ciscoAppNavMIB": {
    "name": "ciscoAppNavMIB",
    "oid": "1.3.6.1.4.1.9.9.791",
    "class": "moduleidentity",
    "revisions": [
      {
        "revision": "2012-06-07 00:00",
        "description": "Added zombie and inactive states to CAppNavCMStates."
      },
      {
        "revision": "2012-05-22 00:00",
        "description": "Added cAppNavServContextJoinState in cAppNavServContextTable and modified CAppNavServContextOpStates."
      },
      {
        "revision": "2012-04-10 00:00",
        "description": "There was a typo error in the name of the compliance object ciscoAppNavClusterStatisticsMIBCompliance. This object is now renamed as ciscoAppNavMIBCompliance."
      },
      {
        "revision": "2012-03-26 00:00",
        "description": "Initial version of this MIB"
      }
    ],
    "lastupdated": "201206070000Z",
    "organization": "Cisco Systems, Inc.",
    "contactinfo": "Cisco Systems Customer Service Postal: 170 W Tasman Drive San Jose, CA 95134 USA Tel: +1 800 553-NETS E-mail: cs-waas@cisco.com",
    "description": "This MIB module defines SNMP management objects describing the AppNav technology. A device, which implements the AppNav technology, is known as the AppNav controller. The AppNav controller intelligently navigates application traffic to a group of devices, which offer services to the application traffic. A device, which offers services to the application traffic is known as service node. As an example, the WAN optimization service uses the AppNav technology, where the AppNav controller intercepts applications traffic and redirects it to service nodes, which offer the WAN optimization service. A deployment may use more than one AppNav controllers and service nodes to provide high availability and scalability. In such deployments, AppNav controllers and service nodes together form a cluster, which is known as an AppNav cluster. Definitions of various entities related to the AppNav technology is as follows: AppNav controller: It is a device that intercepts application traffic and navigates (redirects) it to service nodes. Service node: It is a device that offers services to the traffic navigated (redirected) to it by the AppNav controller. AppNav controller group: An AppNav controller group is a group of one or more AppNav controllers. The AppNav controllers in the AppNav controller group communicate with each other regarding the connections being redirected by them, so that they redirect traffic to the right service node, irrespective of which AppNav controller receives packets for a given connection. For example, if particular connection is served by the service node A then that connection should always be served by the service node A until client or server terminates it. This mechanism is needed in the asymmetric network topologies, where packets may take different paths for forward and return journey. Service node group: A service node group is a group of one or more service nodes. The AppNav controller intercepts and redirects application traffic to service nodes in a service node group. The service nodes update their load status to the AppNav controllers, so that they can do intelligent load distribution among the available service nodes. AppNav Cluster: An AppNav controller group and a service node group together form a cluster, which is known as an AppNav cluster. An AppNav cluster is also known as a service context."
  },
  "CAppNavServContextJoinStates": {
    "name": "CAppNavServContextJoinStates",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "unknown": 1,
          "notConfigured": 2,
          "started": 3,
          "aborted": 4,
          "completed": 5
        }
      }
    },
    "status": "current",
    "description": "Represents various join states of the service context: unknown : This state indicates an internal error. notConfigured : This state indicates that the service context was enabled without the graceful option. started : This state indicates that the service context was enabled with the graceful option and the AppNav controller is currently in the Joining state. aborted : This state indicates that the service context was disabled while the AppNav controller was going through the joining process. completed : This state indicates that the service context was enabled with the graceful option and the AppNav controller completed the joining process."
  },
  "CAppNavCMStates": {
    "name": "CAppNavCMStates",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "dead": 1,
          "alive": 2,
          "excluded": 3,
          "partial": 4,
          "na": 5,
          "zombie": 6,
          "inactive": 7
        }
      }
    },
    "status": "current",
    "description": "Represents the cluster membership states of AppNav controllers and service nodes. dead : This state indicates that contact to the given AppNav controller or service node from the AppNav cluster is lost. alive : This state indicates that the given AppNav controller or service node is in contact of the AppNav cluster. excluded : This state indicates that given AppNav controller/service node is not a part of the AppNav cluster. partial : This state indicates that the given AppNav controller/service node is partially part of the AppNav cluster. na : This state indicates that the given AppNav controller/service node has no status information available when service context is in the admin disabled state. zombie : This state indicates that the given AppNav controller is removed from config but is still alive. inactive : This state indicates that the given AppNav controller is added to config but is inactive because of zombies."
  },
  "CAppNavIRStates": {
    "name": "CAppNavIRStates",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "ready": 1,
          "notReady": 2,
          "na": 3
        }
      }
    },
    "status": "current",
    "description": "Represents the interception readiness states of the AppNav controller. The interception readiness state indicates whether AppNav controller is ready to intercept application traffic or not. ready : This state indicates that the AppNav controller is ready to do interception. notReady : This state indicates that the AppNav controller is not ready to do interception. na : This state indicates that this state is not applicable to the AppNav controller."
  },
  "CAppNavServContextOpStates": {
    "name": "CAppNavServContextOpStates",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "initializing": 1,
          "converging": 2,
          "internalError": 3,
          "degraded": 4,
          "operational": 5,
          "adminDisabled": 6,
          "initializingJoining": 7,
          "convergingJoining": 8,
          "operationalJoining": 9,
          "degradedJoining": 10
        }
      }
    },
    "status": "current",
    "description": "Represents various operational states of the service context: initializing : This state indicates that the service context is in the initialization state. converging : This state indicates that the service context is in the converging state. This state is acquired when the AppNav controller detects the presence of a new AppNav controller or a service node, or loss of liveliness with any AppNav controller or service node in the service context, and is waiting to re-converge. internalError : This state indicates that service context is in the internal error state. This state is acquired when the AppNav controller fails to re-converge upon any change in service context. In this state, traffic redirection is stopped for new connections and existing connections are redirected on the best effort basis. degraded : This state indicates that the service context is in the degraded state. This state is acquired when no single fully connected subset of configured AppNav controllers and service nodes found. In this state, traffic redirection is turned off for new connections. operational : This state indicates that the service context is in the operational state. adminDisabled : This state indicates that the service context is disabled by an admin. initializingJoining : This state indicates that the service context is in the initializing joining state. This state is acquired when the AppNav controller is in the initializing state of joining process. convergingJoining : This state indicates that the service context is in the converging joining state. This state is acquired when the AppNav controller detects the presence of a new AppNav controller or a service node, or loss of liveliness with any AppNav controller or service node in the service context, and is waiting to re-converge. operationalJoining : This state indicates that the service context is stuck in joining state because of cluster view is full but either the number of non-joining AppNav controllers in the view is 1 or the set of Service Nodes seen by this AppNav controllers is smaller than the set of Service Nodes seen by the existing cluster. degradedJoining : This state indicates that the service context is stuck in joining state because the cluster view is degraded when this AppNav controller is part of the cluster."
  },
  "ciscoAppNavMIBObjects": {
    "name": "ciscoAppNavMIBObjects",
    "oid": "1.3.6.1.4.1.9.9.791.0",
    "class": "objectidentity"
  },
  "ciscoAppNavMIBConform": {
    "name": "ciscoAppNavMIBConform",
    "oid": "1.3.6.1.4.1.9.9.791.1",
    "class": "objectidentity"
  },
  "ciscoAppNavMIBCompliances": {
    "name": "ciscoAppNavMIBCompliances",
    "oid": "1.3.6.1.4.1.9.9.791.1.1",
    "class": "objectidentity"
  },
  "cAppNavServContext": {
    "name": "cAppNavServContext",
    "oid": "1.3.6.1.4.1.9.9.791.0.1",
    "class": "objectidentity"
  },
  "cAppNavACG": {
    "name": "cAppNavACG",
    "oid": "1.3.6.1.4.1.9.9.791.0.2",
    "class": "objectidentity"
  },
  "cAppNavSNG": {
    "name": "cAppNavSNG",
    "oid": "1.3.6.1.4.1.9.9.791.0.3",
    "class": "objectidentity"
  },
  "cAppNavAC": {
    "name": "cAppNavAC",
    "oid": "1.3.6.1.4.1.9.9.791.0.4",
    "class": "objectidentity"
  },
  "cAppNavSN": {
    "name": "cAppNavSN",
    "oid": "1.3.6.1.4.1.9.9.791.0.5",
    "class": "objectidentity"
  },
  "cAppNavServContextTable": {
    "name": "cAppNavServContextTable",
    "oid": "1.3.6.1.4.1.9.9.791.0.1.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table lists the objects, which gives information related to the service contexts configured on the AppNav controller."
  },
  "cAppNavServContextEntry": {
    "name": "cAppNavServContextEntry",
    "oid": "1.3.6.1.4.1.9.9.791.0.1.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-APPNAV-MIB",
        "object": "cAppNavServContextIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry describing the objects, which gives information related to a service context. The AppNav controller creates a new entry, when a new service context gets configured through the management interface. The AppNav controller deletes an entry for a given service context when it is removed from the configuration through the management interface."
  },
  "cAppNavServContextIndex": {
    "name": "cAppNavServContextIndex",
    "oid": "1.3.6.1.4.1.9.9.791.0.1.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 4294967295
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This object indicates an index of the cAppNavServiceContextTable. It is an arbitrary unsigned integer value that uniquely identifies an entry in cAppNavServiceContextTable. The value for each entry must remain constant at least from one re-initialization of the entity's network management system to the next re-initialization."
  },
  "cAppNavServContextName": {
    "name": "cAppNavServContextName",
    "oid": "1.3.6.1.4.1.9.9.791.0.1.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the name of the service context."
  },
  "cAppNavServContextCurrOpState": {
    "name": "cAppNavServContextCurrOpState",
    "oid": "1.3.6.1.4.1.9.9.791.0.1.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CAppNavServContextOpStates",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the current operational state of the service context."
  },
  "cAppNavServContextLastOpState": {
    "name": "cAppNavServContextLastOpState",
    "oid": "1.3.6.1.4.1.9.9.791.0.1.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CAppNavServContextOpStates",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the last operational state of the service context."
  },
  "cAppNavServContextIRState": {
    "name": "cAppNavServContextIRState",
    "oid": "1.3.6.1.4.1.9.9.791.0.1.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CAppNavIRStates",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the Interception Readiness(IR) state of the service context."
  },
  "cAppNavServContextJoinState": {
    "name": "cAppNavServContextJoinState",
    "oid": "1.3.6.1.4.1.9.9.791.0.1.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CAppNavServContextJoinStates",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the join state of the service context."
  },
  "cAppNavACGTable": {
    "name": "cAppNavACGTable",
    "oid": "1.3.6.1.4.1.9.9.791.0.2.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table lists the objects, which gives information related to the AppNav controller group configured on the AppNav controller."
  },
  "cAppNavACGEntry": {
    "name": "cAppNavACGEntry",
    "oid": "1.3.6.1.4.1.9.9.791.0.2.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-APPNAV-MIB",
        "object": "cAppNavACGIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry describing the objects, which gives information related to the AppNav controller group configured on the AppNav controller. The AppNav controller creates a new entry when a new AppNav controller group gets configured on the AppNav controller through the management interface. The AppNav controller deletes an entry for a given AppNav controller group, when it is removed from the configuration through the management interface."
  },
  "cAppNavACGIndex": {
    "name": "cAppNavACGIndex",
    "oid": "1.3.6.1.4.1.9.9.791.0.2.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 4294967295
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This object indicates an index of the cAppNavACGTable. It is an arbitrary unsigned integer value that uniquely identifies an entry in cAppNavACGTable. The value for each entry must remain constant at least from one re-initialization of the entity's network management system to the next re-initialization."
  },
  "cAppNavACGName": {
    "name": "cAppNavACGName",
    "oid": "1.3.6.1.4.1.9.9.791.0.2.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the name of the AppNav controller group."
  },
  "cAppNavACGServContextName": {
    "name": "cAppNavACGServContextName",
    "oid": "1.3.6.1.4.1.9.9.791.0.2.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 96
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the service context to which AppNav controller belongs."
  },
  "cAppNavSNGTable": {
    "name": "cAppNavSNGTable",
    "oid": "1.3.6.1.4.1.9.9.791.0.3.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table lists the objects, which gives information related to the service node group configured on the AppNav controller."
  },
  "cAppNavSNGEntry": {
    "name": "cAppNavSNGEntry",
    "oid": "1.3.6.1.4.1.9.9.791.0.3.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-APPNAV-MIB",
        "object": "cAppNavSNGIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry desribing the objects, which gives information regarding the service node groups configured on the AppNav controller. An AppNav controller creates a new entry, when a new service node group gets configured on the system through the management interface. The AppNav controller deletes an entry for a given service node group, when it is removed from the configuration through the management interface."
  },
  "cAppNavSNGIndex": {
    "name": "cAppNavSNGIndex",
    "oid": "1.3.6.1.4.1.9.9.791.0.3.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 4294967295
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This object specifies an index of the cAppNavSNGTable. It is an arbitrary unsigned integer value that uniquely identifies an entry in cAppNavSNGTable. The value for each entry must remain constant at least from one re-initialization of the entity's network management system to the next re-initialization."
  },
  "cAppNavSNGName": {
    "name": "cAppNavSNGName",
    "oid": "1.3.6.1.4.1.9.9.791.0.3.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the name of service node group."
  },
  "cAppNavSNGServContextName": {
    "name": "cAppNavSNGServContextName",
    "oid": "1.3.6.1.4.1.9.9.791.0.3.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the name of the service context to which given service node group belongs."
  },
  "cAppNavACTable": {
    "name": "cAppNavACTable",
    "oid": "1.3.6.1.4.1.9.9.791.0.4.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table lists the objects, which give information related to the AppNav controllers configured on the AppNav controller to assign them to the service context."
  },
  "cAppNavACEntry": {
    "name": "cAppNavACEntry",
    "oid": "1.3.6.1.4.1.9.9.791.0.4.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-APPNAV-MIB",
        "object": "cAppNavACIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry describing the objects, which gives information related to the AppNav controllers configured on the AppNav controller to assign them to the service context. An AppNav controller creates a new entry, when a new AppNav controller gets configured on the AppNav controller through the management interface. The AppNav controller deletes an entry for a given AppNav controller, when it is removed from the configuration through the management interface."
  },
  "cAppNavACIndex": {
    "name": "cAppNavACIndex",
    "oid": "1.3.6.1.4.1.9.9.791.0.4.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 4294967295
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This object indicates an index of the cAppNavACTable. It is an arbitrary unsigned integer value that uniquely identifies an entry in cAppNavACTable. The value for each entry must remain constant at least from one re-initialization of the entity's network management system to the next re-initialization."
  },
  "cAppNavACIpAddrType": {
    "name": "cAppNavACIpAddrType",
    "oid": "1.3.6.1.4.1.9.9.791.0.4.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressType",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the address type of the cAppNavACIpAddr. The cAppNavACEntries are only valid for address type of IPv4 and IPv6."
  },
  "cAppNavACIpAddr": {
    "name": "cAppNavACIpAddr",
    "oid": "1.3.6.1.4.1.9.9.791.0.4.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the IP address of the AppNav controller."
  },
  "cAppNavACServContextName": {
    "name": "cAppNavACServContextName",
    "oid": "1.3.6.1.4.1.9.9.791.0.4.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the name of the service context to which given AppNav controller belongs."
  },
  "cAppNavACACGName": {
    "name": "cAppNavACACGName",
    "oid": "1.3.6.1.4.1.9.9.791.0.4.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the name of the AppNav controller group to which given AppNav controller belongs."
  },
  "cAppNavACCurrentCMState": {
    "name": "cAppNavACCurrentCMState",
    "oid": "1.3.6.1.4.1.9.9.791.0.4.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CAppNavCMStates",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the current cluster membership state of the given AppNav controller."
  },
  "cAppNavSNTable": {
    "name": "cAppNavSNTable",
    "oid": "1.3.6.1.4.1.9.9.791.0.5.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table lists the objects, which gives information related to the service nodes configured on the AppNav controller to assign them to the service context."
  },
  "cAppNavSNEntry": {
    "name": "cAppNavSNEntry",
    "oid": "1.3.6.1.4.1.9.9.791.0.5.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-APPNAV-MIB",
        "object": "cAppNavSNIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry describing the objects, which gives information related to the service nodes configured on the AppNav controller to assign them to the service context. An AppNav controller creates a new entry, when a new service node gets configured on the system through the management interface. An AppNav controller deletes an entry for a given service node, when it is removed from the configuration through the management interface."
  },
  "cAppNavSNIndex": {
    "name": "cAppNavSNIndex",
    "oid": "1.3.6.1.4.1.9.9.791.0.5.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 4294967295
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This object indicates an index of the cAppNavSNTable. It is an arbitrary unsigned integer value that uniquely identifies an entry in cAppNavSNTable. The value for each entry must remain constant at least from one re-initialization of the entity's network management system to the next re-initialization."
  },
  "cAppNavSNIpAddrType": {
    "name": "cAppNavSNIpAddrType",
    "oid": "1.3.6.1.4.1.9.9.791.0.5.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressType",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the address type of cacSnIpAddr. cacSNEntries are only valid for address type of IPv4 and IPv6."
  },
  "cAppNavSNIpAddr": {
    "name": "cAppNavSNIpAddr",
    "oid": "1.3.6.1.4.1.9.9.791.0.5.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the IP address of the given service node."
  },
  "cAppNavSNServContextName": {
    "name": "cAppNavSNServContextName",
    "oid": "1.3.6.1.4.1.9.9.791.0.5.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the name of the service context to which given service node belongs."
  },
  "cAppNavSNSNGName": {
    "name": "cAppNavSNSNGName",
    "oid": "1.3.6.1.4.1.9.9.791.0.5.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the name of the service node group to which given service node belongs."
  },
  "cAppNavSNCurrentCMState": {
    "name": "cAppNavSNCurrentCMState",
    "oid": "1.3.6.1.4.1.9.9.791.0.5.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CAppNavCMStates",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicats the current cluster membership state of the given service node."
  },
  "ciscoAppNavMIBGroups": {
    "name": "ciscoAppNavMIBGroups",
    "oid": "1.3.6.1.4.1.9.9.791.1.2",
    "class": "objectidentity"
  },
  "ciscoAppNavMIBCompliance": {
    "name": "ciscoAppNavMIBCompliance",
    "oid": "1.3.6.1.4.1.9.9.791.1.1.1",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "cAppNavServiceContextGroup",
        "module": "CISCO-APPNAV-MIB"
      },
      {
        "object": "cAppNavACGGroup",
        "module": "CISCO-APPNAV-MIB"
      },
      {
        "object": "cAppNavSNGGroup",
        "module": "CISCO-APPNAV-MIB"
      },
      {
        "object": "cAppNavACGroup",
        "module": "CISCO-APPNAV-MIB"
      },
      {
        "object": "cAppNavSNGroup",
        "module": "CISCO-APPNAV-MIB"
      }
    ],
    "status": "deprecated",
    "description": "This is a default module-compliance containing default object groups."
  },
  "ciscoAppNavMIBComplianceRev1": {
    "name": "ciscoAppNavMIBComplianceRev1",
    "oid": "1.3.6.1.4.1.9.9.791.1.1.2",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "cAppNavServiceContextGroup",
        "module": "CISCO-APPNAV-MIB"
      },
      {
        "object": "cAppNavACGGroup",
        "module": "CISCO-APPNAV-MIB"
      },
      {
        "object": "cAppNavSNGGroup",
        "module": "CISCO-APPNAV-MIB"
      },
      {
        "object": "cAppNavACGroup",
        "module": "CISCO-APPNAV-MIB"
      },
      {
        "object": "cAppNavSNGroup",
        "module": "CISCO-APPNAV-MIB"
      },
      {
        "object": "cAppNavServiceContextGroupRev1",
        "module": "CISCO-APPNAV-MIB"
      }
    ],
    "status": "current",
    "description": "This is a default module-compliance containing default object groups. This compliance deprecated ciscoAppNavMIBCompliance."
  },
  "cAppNavServiceContextGroup": {
    "name": "cAppNavServiceContextGroup",
    "oid": "1.3.6.1.4.1.9.9.791.1.2.1",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-APPNAV-MIB",
        "object": "cAppNavServContextCurrOpState"
      },
      {
        "module": "CISCO-APPNAV-MIB",
        "object": "cAppNavServContextLastOpState"
      },
      {
        "module": "CISCO-APPNAV-MIB",
        "object": "cAppNavServContextIRState"
      },
      {
        "module": "CISCO-APPNAV-MIB",
        "object": "cAppNavServContextName"
      }
    ],
    "status": "current",
    "description": "This group includes objects which gives information for service context configured on the AppNav controller."
  },
  "cAppNavACGGroup": {
    "name": "cAppNavACGGroup",
    "oid": "1.3.6.1.4.1.9.9.791.1.2.2",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-APPNAV-MIB",
        "object": "cAppNavACGServContextName"
      },
      {
        "module": "CISCO-APPNAV-MIB",
        "object": "cAppNavACGName"
      }
    ],
    "status": "current",
    "description": "This group includes objects, which give information related to AppNav controller group configured on the AppNav controller."
  },
  "cAppNavSNGGroup": {
    "name": "cAppNavSNGGroup",
    "oid": "1.3.6.1.4.1.9.9.791.1.2.3",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-APPNAV-MIB",
        "object": "cAppNavSNGServContextName"
      },
      {
        "module": "CISCO-APPNAV-MIB",
        "object": "cAppNavSNGName"
      }
    ],
    "status": "current",
    "description": "This group includes objects, which gives information related to the service node group configured on the AppNav controller."
  },
  "cAppNavACGroup": {
    "name": "cAppNavACGroup",
    "oid": "1.3.6.1.4.1.9.9.791.1.2.4",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-APPNAV-MIB",
        "object": "cAppNavACServContextName"
      },
      {
        "module": "CISCO-APPNAV-MIB",
        "object": "cAppNavACACGName"
      },
      {
        "module": "CISCO-APPNAV-MIB",
        "object": "cAppNavACCurrentCMState"
      },
      {
        "module": "CISCO-APPNAV-MIB",
        "object": "cAppNavACIpAddrType"
      },
      {
        "module": "CISCO-APPNAV-MIB",
        "object": "cAppNavACIpAddr"
      }
    ],
    "status": "current",
    "description": "This group includes objects, which gives information related to AppNav controllers configured on the AppNav controller to assign them to the AppNav cluster."
  },
  "cAppNavSNGroup": {
    "name": "cAppNavSNGroup",
    "oid": "1.3.6.1.4.1.9.9.791.1.2.5",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-APPNAV-MIB",
        "object": "cAppNavSNServContextName"
      },
      {
        "module": "CISCO-APPNAV-MIB",
        "object": "cAppNavSNSNGName"
      },
      {
        "module": "CISCO-APPNAV-MIB",
        "object": "cAppNavSNCurrentCMState"
      },
      {
        "module": "CISCO-APPNAV-MIB",
        "object": "cAppNavSNIpAddrType"
      },
      {
        "module": "CISCO-APPNAV-MIB",
        "object": "cAppNavSNIpAddr"
      }
    ],
    "status": "current",
    "description": "This group contains objects, which gives information related to service node configured on AppNav controller to assign them to the AppNav cluster."
  },
  "cAppNavServiceContextGroupRev1": {
    "name": "cAppNavServiceContextGroupRev1",
    "oid": "1.3.6.1.4.1.9.9.791.1.2.6",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-APPNAV-MIB",
        "object": "cAppNavServContextJoinState"
      }
    ],
    "status": "current",
    "description": "This group includes objects which gives information for service context configured on the AppNav controller."
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/CISCO-APPNAV-MIB",
      "Produced by pysmi-0.3.4 at Fri May 24 16:54:15 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "CISCO-APPNAV-MIB"
  }
}