{
  "imports": {
    "class": "imports",
    "CISCO-SMI": [
      "ciscoExperiment"
    ],
    "IF-MIB": [
      "ifIndex"
    ],
    "SNMPv2-CONF": [
      "OBJECT-GROUP",
      "MODULE-COMPLIANCE",
      "NOTIFICATION-GROUP"
    ],
    "SNMPv2-SMI": [
      "Integer32",
      "NOTIFICATION-TYPE",
      "TimeTicks",
      "MODULE-IDENTITY",
      "MibIdentifier",
      "iso",
      "OBJECT-IDENTITY",
      "IpAddress",
      "Bits",
      "OBJECT-TYPE",
      "Counter64",
      "Counter32",
      "Gauge32",
      "Unsigned32"
    ],
    "SNMPv2-TC": [
      "DisplayString",
      "TEXTUAL-CONVENTION"
    ]
  },
  "ciscoOpticalIfExtnMIB": {
    "name": "ciscoOpticalIfExtnMIB",
    "oid": "1.3.6.1.4.1.9.10.66",
    "class": "moduleidentity",
    "revisions": [
      {
        "revision": "2004-11-19 00:00",
        "description": "This revision adds 'sonetPhy' and 'multiRate' enumeration to coIfTypeExtn object. "
      },
      {
        "revision": "2003-12-29 00:00",
        "description": "This revision adds 'twoGigabitPhy' enumeration to coIfTypeExtn object. "
      },
      {
        "revision": "2002-05-23 00:00",
        "description": "This revision adds a new table coIfXcvrTable to control transceivers (lasers and optical receivers) at optoelectronic interfaces. It also defines three new code points, ethernetPhy, esconPhy and gigabitPhy for the coIfTypeExtn object. "
      },
      {
        "revision": "2001-04-20 00:00",
        "description": "Initial version of this MIB."
      }
    ],
    "lastupdated": "200411190000Z",
    "organization": "Cisco Systems, Inc.",
    "contactinfo": "Cisco Systems Customer Service Postal: 170 W Tasman Drive San Jose, CA 95134 USA Tel: +1 800 553-NETS E-mail: cs-dwdm@cisco.com",
    "description": "A MIB module containing extensions to the IF-MIB for optical interfaces."
  },
  "coIfExtnMIBObjects": {
    "name": "coIfExtnMIBObjects",
    "oid": "1.3.6.1.4.1.9.10.66.1",
    "class": "objectidentity"
  },
  "coIfTypeExtnGroup": {
    "name": "coIfTypeExtnGroup",
    "oid": "1.3.6.1.4.1.9.10.66.1.1",
    "class": "objectidentity"
  },
  "coIfWavelengthGroup": {
    "name": "coIfWavelengthGroup",
    "oid": "1.3.6.1.4.1.9.10.66.1.2",
    "class": "objectidentity"
  },
  "coIfDwdmChannelGroup": {
    "name": "coIfDwdmChannelGroup",
    "oid": "1.3.6.1.4.1.9.10.66.1.3",
    "class": "objectidentity"
  },
  "coIfXcvrGroup": {
    "name": "coIfXcvrGroup",
    "oid": "1.3.6.1.4.1.9.10.66.1.4",
    "class": "objectidentity"
  },
  "CoDwdmFrequency": {
    "name": "CoDwdmFrequency",
    "class": "textualconvention",
    "type": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 1000000
          }
        ]
      }
    },
    "status": "current",
    "description": "The nominal central frequency of one channel in a DWDM system, in GHz."
  },
  "CoDwdmFrequencyOrZero": {
    "name": "CoDwdmFrequencyOrZero",
    "class": "textualconvention",
    "type": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 1000000
          }
        ]
      }
    },
    "status": "current",
    "description": "The nominal central frequency of one channel in a DWDM system, in GHz, or zero. The value zero either indicates that the frequency is unknown, or indicates that this channel is uncolored."
  },
  "coIfTypeExtnTable": {
    "name": "coIfTypeExtnTable",
    "oid": "1.3.6.1.4.1.9.10.66.1.1.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains extensions to the ifType object defined in the IF-MIB for optical interfaces."
  },
  "coIfTypeExtnEntry": {
    "name": "coIfTypeExtnEntry",
    "oid": "1.3.6.1.4.1.9.10.66.1.1.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry contains extensions to the ifType object defined in the IF-MIB for one optical interface."
  },
  "coIfTypeExtn": {
    "name": "coIfTypeExtn",
    "oid": "1.3.6.1.4.1.9.10.66.1.1.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "opticalTransponder": 1,
          "wdmTransport": 2,
          "wdmChannel": 3,
          "wdmChannelGroup": 4,
          "wavelengthTransport": 5,
          "ethernetPhy": 6,
          "esconPhy": 7,
          "gigabitPhy": 8,
          "twoGigabitPhy": 9,
          "sonetPhy": 10,
          "multiRate": 11
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the type of an optical interface, when the type is not specified in the ifType object in the IF-MIB, i.e., when the ifType object is set to 'other'. The value 'opticalTransponder' represents an optoelectronic interface that relays signals of various physical layer protocols. The interface may be capable of pulse shaping and retiming. The interface may be capable of monitoring various physical layer protocols. The interface may emit signals that are colored (e.g. one channel in a DWDM system) or uncolored (i.e., for single channel interfaces). The value 'wdmTransport' indicates an optical interface that carries multiple wavelengths. The value 'wdmChannel' indicates an interface sub-layer above 'wdmTransport' representing a single wavelength. The value 'wdmChannelGroup' indicates an interface sub-layer above 'wdmTransport' representing a wavelength division multiplexed group of wavelengths. The value 'wavelengthTransport' indicates an optical interface that carries a single wavelength. The value 'ethernetPhy' indicates an interface that implements the physical layer of the Ethernet protocol. The value 'esconPhy' indicates an interface that implements the physical layer of ESCON. The value 'gigabitPhy' indicates an interface that supports the physical layers of both Gigabit Ethernet and Fibre Channel. The value 'twoGigabitPhy' indicates an interface that supports the physical layer of 1x and 2x Fibre Channel. The value 'sonetPhy' indicates an interface that carries the trunk side traffic of eight port multirate muxponder The value 'multiRate' indicates an interface that supports client protocols of eight port multirate muxponder ."
  },
  "coIfWavelengthTable": {
    "name": "coIfWavelengthTable",
    "oid": "1.3.6.1.4.1.9.10.66.1.2.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains wavelength information for optical interfaces."
  },
  "coIfWavelengthEntry": {
    "name": "coIfWavelengthEntry",
    "oid": "1.3.6.1.4.1.9.10.66.1.2.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry contains wavelength information for one optical interface."
  },
  "coIfDwdmFrequency": {
    "name": "coIfDwdmFrequency",
    "oid": "1.3.6.1.4.1.9.10.66.1.2.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CoDwdmFrequency",
      "class": "type"
    },
    "units": "GHz",
    "maxaccess": "read-write",
    "status": "current",
    "description": "The nominal central frequency associated with this interface, in GHz. This object is instantiated for interfaces with coIfTypeExtn value of 'wdmChannel' and 'wavelengthTransport'. This object may also be instantiated for optoelectronic interfaces that originate or terminate DWDM wavelengths, including some of the interfaces with coIfTypeExtn value of 'opticalTransponder'."
  },
  "coIfDwdmChannelGroupTable": {
    "name": "coIfDwdmChannelGroupTable",
    "oid": "1.3.6.1.4.1.9.10.66.1.3.3",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains information about interfaces representing groups of DWDM channels. This includes interfaces with coIfTypeExtn value of 'wdmChannelGroup'."
  },
  "coIfDwdmChannelGroupEntry": {
    "name": "coIfDwdmChannelGroupEntry",
    "oid": "1.3.6.1.4.1.9.10.66.1.3.3.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry contains information about one interface that represents a group of DWDM channels. The group can be described as a specified set of DWDM frequencies, or as the group of all DWDM frequencies except for those in a specified set. If a frequency is included in a DWDM channel group, this does not necessarily indicate that there is a signal present at that frequency. It indicates that if a signal is present at that frequency, then that signal is included in this DWDM channel group."
  },
  "coIfDwdmChannelGroupMinFrequency": {
    "name": "coIfDwdmChannelGroupMinFrequency",
    "oid": "1.3.6.1.4.1.9.10.66.1.3.3.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CoDwdmFrequency",
      "class": "type"
    },
    "units": "GHz",
    "maxaccess": "read-write",
    "status": "current",
    "description": "The lowest frequency represented in the bitmap specified in coIfDwdmChannelGroupBitmap, i.e., the frequency represented by bit 0 of octet 1 of coIfDwdmChannelGroupBitmap."
  },
  "coIfDwdmChannelGroupSpacing": {
    "name": "coIfDwdmChannelGroupSpacing",
    "oid": "1.3.6.1.4.1.9.10.66.1.3.3.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 1000
          }
        ]
      }
    },
    "units": "GHz",
    "maxaccess": "read-write",
    "status": "current",
    "description": "The difference in frequency between successive bits in coIfDwdmChannelGroupBitmap. This is typically the frequency difference between adjacent channels in the DWDM system."
  },
  "coIfDwdmChannelGroupBitmapLogic": {
    "name": "coIfDwdmChannelGroupBitmapLogic",
    "oid": "1.3.6.1.4.1.9.10.66.1.3.3.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "carried": 1,
          "blocked": 2
        }
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object indicates whether coIfDwdmChannelGroupBitmap identifies channels included in the channel group, or whether it identifies channels excluded from the channel group. When the value of this object is 'carried', then the channel group is composed only of those channels for which the value of the corresponding bit in coIfDwdmChannelBitmap is one. When the value of this object is 'blocked', then the channel group is composed of all channels except those for which the value of the corresponding bit in coIfDwdmChannelBitmap is one. Channels that are not identified in coIfDwdmChannelBitmap are included in the channel group."
  },
  "coIfDwdmChannelGroupBitmap": {
    "name": "coIfDwdmChannelGroupBitmap",
    "oid": "1.3.6.1.4.1.9.10.66.1.3.3.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 32
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The DWDM channel bitmap that indicates those channels that are included or excluded (depending on the value of coIfDwdmChannelBitmapLogic) from the DWDM channel group. If a frequency is included in a DWDM channel group, this does not necessarily indicate that there is a signal present at that frequency. It indicates that if a signal is present at that frequency, then that signal is included in this DWDM channel group. Bit zero of octet one corresponds to the lowest channel (representing the frequency identified by coIfDwdmChannelGroupMinFrequency), bit one of octet one corresponds to the lowest plus one channel (representing the frequency obtained by adding the values of coIfDwdmChannelGroupMinFrequency and coIfDwdmChannelGroupSpacing), and so on. When the value of coIfDwdmChannelBitmapLogic is 'carried', then channels included in the channel group will have the corresponding bit set to one in the bitmap. Bits that are set to zero represent channels that are excluded from the channel group. Channels that are not represented in the bitmap are also excluded from the channel group. When the value of coIfDwdmChannelBitmapLogic is 'blocked', then channels excluded from the channel group will have the corresponding bit set to one in the bitmap. Bits that are set to zero represent channels that are included in the channel group. Channels that are not represented in the bitmap are also included in the channel group."
  },
  "coIfXcvrTable": {
    "name": "coIfXcvrTable",
    "oid": "1.3.6.1.4.1.9.10.66.1.4.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains objects to control transceivers (lasers and optical receivers) at optoelectronic interfaces."
  },
  "coIfXcvrEntry": {
    "name": "coIfXcvrEntry",
    "oid": "1.3.6.1.4.1.9.10.66.1.4.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry contains objects for control of a transceiver at an optoelectronic interface."
  },
  "coIfXcvrLaserAdminStatus": {
    "name": "coIfXcvrLaserAdminStatus",
    "oid": "1.3.6.1.4.1.9.10.66.1.4.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "up": 1,
          "down": 2
        }
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The desired state of the laser on this interface. This object differs from ifAdminStatus in the IF-MIB, since in some cases setting ifAdminStatus to 'down' causes an alarm indication to be transmitted, rather than shutting down the laser. When this object is set to 'down', ifOperStatus in the IF-MIB goes to the 'down' state, and the laser is shut down. In order to administratively enable an interface, both ifAdminStatus in the IF-MIB and this object must be set to 'up'."
  },
  "coIfXcvrLaserOperStatus": {
    "name": "coIfXcvrLaserOperStatus",
    "oid": "1.3.6.1.4.1.9.10.66.1.4.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "transmitting": 1,
          "degraded": 2,
          "down": 3,
          "lscDown": 4,
          "flcDown": 5,
          "unknown": 6
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the current operational status of the laser on this interface. 'transmitting': The laser is on. 'degraded': The laser is on, but there is a fault that causes it to transmit in a degraded manner. 'down': The laser is shut down, either because of error conditions or because it has been administratively disabled. This state indicates that the laser is shut down due to conditions other than Laser Safety Control or Forward Laser Control. 'lscDown': The laser is shut down due to Laser Safety Control (LSC) mechanisms such as Automatic Laser Shutdown (ALS), i.e., due to a fault in the receive direction at this interface. 'flcDown': The laser is shut down due to Forward Laser Control, i.e., due to a fault on the cross-connected interface. 'unknown': The operational status of the laser cannot be determined. If the value of coIfXcvrLaserAdminStatus is 'down', then this object also indicates 'down'. If coIfXcvrLaserAdminStatus is set to 'up', then the value of this object should change to 'transmitting' if the laser is functioning properly."
  },
  "coIfXcvrMinLaserFrequency": {
    "name": "coIfXcvrMinLaserFrequency",
    "oid": "1.3.6.1.4.1.9.10.66.1.4.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CoDwdmFrequencyOrZero",
      "class": "type"
    },
    "units": "GHz",
    "maxaccess": "read-write",
    "status": "current",
    "description": "The lowest frequency represented in the bitmap specified in coIfXcvrLaserFrequencyBitmap, i.e., the frequency represented by bit 0 of octet 1 of coIfXcvrLaserFrequencyBitmap. A value of zero signifies that the laser on this interface is uncolored and that coIfXcvrLaserFrequencyBitmap does not apply."
  },
  "coIfXcvrLaserFrequencySpacing": {
    "name": "coIfXcvrLaserFrequencySpacing",
    "oid": "1.3.6.1.4.1.9.10.66.1.4.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 1000
          }
        ]
      }
    },
    "units": "GHz",
    "maxaccess": "read-write",
    "status": "current",
    "description": "The difference in frequency between successive bits in coIfXcvrLaserFrequencyBitmap. This is typically the frequency difference between adjacent channels in the DWDM system."
  },
  "coIfXcvrLaserFrequencyBitmap": {
    "name": "coIfXcvrLaserFrequencyBitmap",
    "oid": "1.3.6.1.4.1.9.10.66.1.4.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 32
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This bitmap indicates the DWDM channel frequencies supported by the tunable laser on this interface. Bit zero of octet one corresponds to the lowest channel (representing the frequency identified by coIfXcvrMinLaserFrequency), bit one of octet one corresponds to the lowest plus one channel (representing the frequency obtained by adding the values of coIfXcvrMinLaserFrequency and coIfXcvrMinLaserFrequencySpacing), and so on. The frequencies supported by the tunable laser have the corresponding bit set to one in the bitmap. Bits that are set to zero represent frequencies that are not supported by the tunable laser. The frequencies that are not represented in the bitmap are also not supported by the tunable laser."
  },
  "coIfXcvrForwardLaserControl": {
    "name": "coIfXcvrForwardLaserControl",
    "oid": "1.3.6.1.4.1.9.10.66.1.4.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "enable": 1,
          "disable": 2
        }
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object is used to enable or disable Forward Laser Control (FLC) on this interface. If Forward Laser Control is enabled, the laser is automatically shut down when the receive direction of the cross-connected interface is in an alarm condition."
  },
  "coIfXcvrLaserSafetyControl": {
    "name": "coIfXcvrLaserSafetyControl",
    "oid": "1.3.6.1.4.1.9.10.66.1.4.1.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "enable": 1,
          "disable": 2
        }
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object is used to enable or disable Laser Safety Control (LSC) mechanisms such as Automatic Laser Shutdown (ALS) on this interface. Laser Safety Control mechanisms are used to automatically shutdown the output power of laser transmitters when potentially hazardous conditions such as fiber breaks or unplugged optical connectors are detected."
  },
  "coIfXcvrLSCProtocol": {
    "name": "coIfXcvrLSCProtocol",
    "oid": "1.3.6.1.4.1.9.10.66.1.4.1.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "proprietary": 1,
          "g664": 2
        }
      }
    },
    "maxaccess": "read-write",
    "reference": "ITU-T Recommendation G.664, Optical safety procedures and requirements for optical transport systems, June 1999",
    "status": "current",
    "description": "This object identifies the Laser Safety Control protocol that is applied when coIfXcvrLaserSafetyControl is set to 'enable'. 'proprietary': Indicates that the Laser Safety Control protocol is proprietary. 'g664': Indicates the Automatic Laser Shutdown (ALS) protocol specified in ITU-T Recommendation G.664."
  },
  "coIfXcvrLSCRestartMode": {
    "name": "coIfXcvrLSCRestartMode",
    "oid": "1.3.6.1.4.1.9.10.66.1.4.1.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "automaticRestart": 1,
          "manualRestart": 2
        }
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object selects the mechanism used to restore transmission after the fiber has been repaired or reconnected. 'automaticRestart': This mode selects automatic restart of the laser by periodically transmitting restart pulses. The period between restart pulse transmissions is specified by coIfXcvrLSCPulseReptitionTime. 'manualRestart': This mode selects manual restart of the laser. After the fiber has been repaired or reconnected, the coIfXcvrLSCManualRestart object should be used to trigger transmission of a restart pulse."
  },
  "coIfXcvrLSCManualRestart": {
    "name": "coIfXcvrLSCManualRestart",
    "oid": "1.3.6.1.4.1.9.10.66.1.4.1.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "noop": 1,
          "restart": 2,
          "restartForTest": 3
        }
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object initiates laser activation when the laser is shut down due to Laser Safety Control. When the value is set to 'restart', transmission of a restart pulse of length coIfXcvrLSCPulseLength is triggered. When this object is set to 'restartForTest', transmission of a restart pulse of length coIfXcvrLSCTestPulseLength is triggered. Before setting this object to 'restartForTest', specific care must be taken to assure connectivity to avoid exposure to hazardous optical levels. When the value is set to 'noop', no operation is performed. When read, the value 'noop' is returned. Manual restart can only be activated when the value of coIfXcvrLaserOperStatus is 'lscDown'."
  },
  "coIfXcvrLSCPulseLength": {
    "name": "coIfXcvrLSCPulseLength",
    "oid": "1.3.6.1.4.1.9.10.66.1.4.1.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 100,
            "max": 20000
          }
        ]
      }
    },
    "units": "milliseconds",
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object specifies the length of restart pulses used to restore transmission when a Laser Safety Control protocol is activated."
  },
  "coIfXcvrLSCTestPulseLength": {
    "name": "coIfXcvrLSCTestPulseLength",
    "oid": "1.3.6.1.4.1.9.10.66.1.4.1.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 300
          }
        ]
      }
    },
    "units": "seconds",
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object specifies the length of test restart pulses that are transmitted when coIfXcvrLSCManualRestart is set to 'restartForTest'."
  },
  "coIfXcvrLSCPulseRepetitionTime": {
    "name": "coIfXcvrLSCPulseRepetitionTime",
    "oid": "1.3.6.1.4.1.9.10.66.1.4.1.1.13",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 300
          }
        ]
      }
    },
    "units": "seconds",
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object specifies the delay interval between transmissions of restart pulses, when coIfXcvrLSCRestartMode is set to 'automaticRestart' and coIfXcvrLaserOperStatus indicates 'lscDown'."
  },
  "coIfExtnMIBConformance": {
    "name": "coIfExtnMIBConformance",
    "oid": "1.3.6.1.4.1.9.10.66.3",
    "class": "objectidentity"
  },
  "coIfExtnMIBCompliances": {
    "name": "coIfExtnMIBCompliances",
    "oid": "1.3.6.1.4.1.9.10.66.3.1",
    "class": "objectidentity"
  },
  "coIfExtnMIBGroups": {
    "name": "coIfExtnMIBGroups",
    "oid": "1.3.6.1.4.1.9.10.66.3.2",
    "class": "objectidentity"
  },
  "coIfExtnMIBCompliance": {
    "name": "coIfExtnMIBCompliance",
    "oid": "1.3.6.1.4.1.9.10.66.3.1.1",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "coIfWavelengthMIBGroup",
        "module": "CISCO-OPTICAL-IF-EXTN-MIB"
      },
      {
        "object": "coIfTypeExtnMIBGroup",
        "module": "CISCO-OPTICAL-IF-EXTN-MIB"
      },
      {
        "object": "coIfDwdmChannelGroupMIBGroup",
        "module": "CISCO-OPTICAL-IF-EXTN-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for the Cisco Optical Interface Extensions MIB."
  },
  "coIfExtnMIBCompliance2": {
    "name": "coIfExtnMIBCompliance2",
    "oid": "1.3.6.1.4.1.9.10.66.3.1.2",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "coIfWavelengthMIBGroup",
        "module": "CISCO-OPTICAL-IF-EXTN-MIB"
      },
      {
        "object": "coIfTypeExtnMIBGroup",
        "module": "CISCO-OPTICAL-IF-EXTN-MIB"
      },
      {
        "object": "coIfDwdmChannelGroupMIBGroup",
        "module": "CISCO-OPTICAL-IF-EXTN-MIB"
      },
      {
        "object": "coIfXcvrBaseMIBGroup",
        "module": "CISCO-OPTICAL-IF-EXTN-MIB"
      },
      {
        "object": "coIfXcvrTunableLaserMIBGroup",
        "module": "CISCO-OPTICAL-IF-EXTN-MIB"
      },
      {
        "object": "coIfXcvrLSCMIBGroup",
        "module": "CISCO-OPTICAL-IF-EXTN-MIB"
      }
    ],
    "status": "current",
    "description": "The compliance statement for the Cisco Optical Interface Extensions MIB."
  },
  "coIfTypeExtnMIBGroup": {
    "name": "coIfTypeExtnMIBGroup",
    "oid": "1.3.6.1.4.1.9.10.66.3.2.1",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-OPTICAL-IF-EXTN-MIB",
        "object": "coIfTypeExtn"
      }
    ],
    "status": "current",
    "description": "A collection of managed objects providing extensions to the interface type information found in the IF-MIB."
  },
  "coIfWavelengthMIBGroup": {
    "name": "coIfWavelengthMIBGroup",
    "oid": "1.3.6.1.4.1.9.10.66.3.2.2",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-OPTICAL-IF-EXTN-MIB",
        "object": "coIfDwdmFrequency"
      }
    ],
    "status": "current",
    "description": "A collection of managed objects providing information about the wavelength or frequency of optical interfaces."
  },
  "coIfDwdmChannelGroupMIBGroup": {
    "name": "coIfDwdmChannelGroupMIBGroup",
    "oid": "1.3.6.1.4.1.9.10.66.3.2.3",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-OPTICAL-IF-EXTN-MIB",
        "object": "coIfDwdmChannelGroupMinFrequency"
      },
      {
        "module": "CISCO-OPTICAL-IF-EXTN-MIB",
        "object": "coIfDwdmChannelGroupSpacing"
      },
      {
        "module": "CISCO-OPTICAL-IF-EXTN-MIB",
        "object": "coIfDwdmChannelGroupBitmapLogic"
      },
      {
        "module": "CISCO-OPTICAL-IF-EXTN-MIB",
        "object": "coIfDwdmChannelGroupBitmap"
      }
    ],
    "status": "current",
    "description": "A collection of managed objects providing information about DWDM channel groups."
  },
  "coIfXcvrBaseMIBGroup": {
    "name": "coIfXcvrBaseMIBGroup",
    "oid": "1.3.6.1.4.1.9.10.66.3.2.4",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-OPTICAL-IF-EXTN-MIB",
        "object": "coIfXcvrLaserAdminStatus"
      },
      {
        "module": "CISCO-OPTICAL-IF-EXTN-MIB",
        "object": "coIfXcvrLaserOperStatus"
      },
      {
        "module": "CISCO-OPTICAL-IF-EXTN-MIB",
        "object": "coIfXcvrForwardLaserControl"
      }
    ],
    "status": "current",
    "description": "A collection of managed objects for control of transceivers (lasers and optical receivers) at optoelectronic interfaces."
  },
  "coIfXcvrTunableLaserMIBGroup": {
    "name": "coIfXcvrTunableLaserMIBGroup",
    "oid": "1.3.6.1.4.1.9.10.66.3.2.5",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-OPTICAL-IF-EXTN-MIB",
        "object": "coIfXcvrMinLaserFrequency"
      },
      {
        "module": "CISCO-OPTICAL-IF-EXTN-MIB",
        "object": "coIfXcvrLaserFrequencySpacing"
      },
      {
        "module": "CISCO-OPTICAL-IF-EXTN-MIB",
        "object": "coIfXcvrLaserFrequencyBitmap"
      }
    ],
    "status": "current",
    "description": "A collection of managed objects providing information about tunable lasers."
  },
  "coIfXcvrLSCMIBGroup": {
    "name": "coIfXcvrLSCMIBGroup",
    "oid": "1.3.6.1.4.1.9.10.66.3.2.6",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-OPTICAL-IF-EXTN-MIB",
        "object": "coIfXcvrLaserSafetyControl"
      },
      {
        "module": "CISCO-OPTICAL-IF-EXTN-MIB",
        "object": "coIfXcvrLSCProtocol"
      },
      {
        "module": "CISCO-OPTICAL-IF-EXTN-MIB",
        "object": "coIfXcvrLSCRestartMode"
      },
      {
        "module": "CISCO-OPTICAL-IF-EXTN-MIB",
        "object": "coIfXcvrLSCManualRestart"
      },
      {
        "module": "CISCO-OPTICAL-IF-EXTN-MIB",
        "object": "coIfXcvrLSCPulseLength"
      },
      {
        "module": "CISCO-OPTICAL-IF-EXTN-MIB",
        "object": "coIfXcvrLSCTestPulseLength"
      },
      {
        "module": "CISCO-OPTICAL-IF-EXTN-MIB",
        "object": "coIfXcvrLSCPulseRepetitionTime"
      }
    ],
    "status": "current",
    "description": "A collection of managed objects for Laser Safety Control (LSC) mechanisms such as Automatic Laser Shutdown (ALS)."
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/CISCO-OPTICAL-IF-EXTN-MIB",
      "Produced by pysmi-0.3.4 at Fri May 24 17:13:05 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "CISCO-OPTICAL-IF-EXTN-MIB"
  }
}