{
  "imports": {
    "class": "imports",
    "CISCO-RTTMON-MIB": [
      "rttMonLpdGrpStatsEntry",
      "rttMonStatsCollectEntry",
      "rttMonEchoAdminEntry",
      "rttMonCtrlAdminEntry",
      "rttMonEchoPathAdminEntry",
      "rttMonHistoryCollectionEntry"
    ],
    "CISCO-SMI": [
      "ciscoMgmt"
    ],
    "DIFFSERV-DSCP-TC": [
      "DscpOrAny"
    ],
    "INET-ADDRESS-MIB": [
      "InetAddressType",
      "InetAddress"
    ],
    "IPV6-FLOW-LABEL-MIB": [
      "IPv6FlowLabelOrAny"
    ],
    "SNMPv2-CONF": [
      "OBJECT-GROUP",
      "MODULE-COMPLIANCE",
      "NOTIFICATION-GROUP"
    ],
    "SNMPv2-SMI": [
      "TimeTicks",
      "Gauge32",
      "Counter32",
      "iso",
      "Integer32",
      "OBJECT-TYPE",
      "Counter64",
      "NOTIFICATION-TYPE",
      "MibIdentifier",
      "IpAddress",
      "Unsigned32",
      "OBJECT-IDENTITY",
      "Bits",
      "MODULE-IDENTITY"
    ],
    "SNMPv2-TC": [
      "TEXTUAL-CONVENTION",
      "DisplayString"
    ]
  },
  "ciscoRttMonIPExtMIB": {
    "name": "ciscoRttMonIPExtMIB",
    "oid": "1.3.6.1.4.1.9.9.572",
    "class": "moduleidentity",
    "revisions": [
      {
        "revision": "2006-08-02 00:00",
        "description": "Initial version of this MIB module."
      }
    ],
    "lastupdated": "200608020000Z",
    "organization": "Cisco Systems, Inc.",
    "contactinfo": "Cisco Systems, Inc. Customer Service Postal: 170 W Tasman Drive San Jose, CA 95134 Tel: +1 800 553 NETS Email: cs-ipsla@cisco.com",
    "description": "This MIB contains extensions to tables in CISCO-RTTMON-MIB to support IP-layer extensions, specifically IPv6 addresses and other information related to IPv6 and other IP information"
  },
  "crttMonIPExtObjects": {
    "name": "crttMonIPExtObjects",
    "oid": "1.3.6.1.4.1.9.9.572.1",
    "class": "objectidentity"
  },
  "ciscoRttMonIPExtMibConformance": {
    "name": "ciscoRttMonIPExtMibConformance",
    "oid": "1.3.6.1.4.1.9.9.572.2",
    "class": "objectidentity"
  },
  "ciscoRttMonIPExtMibCompliances": {
    "name": "ciscoRttMonIPExtMibCompliances",
    "oid": "1.3.6.1.4.1.9.9.572.2.1",
    "class": "objectidentity"
  },
  "ciscoRttMonIPExtMibGroups": {
    "name": "ciscoRttMonIPExtMibGroups",
    "oid": "1.3.6.1.4.1.9.9.572.2.2",
    "class": "objectidentity"
  },
  "crttMonIPEchoAdminTable": {
    "name": "crttMonIPEchoAdminTable",
    "oid": "1.3.6.1.4.1.9.9.572.1.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "An extension of the rttMonEchoAdminTable, defined in the CISCO-RTTMON-MIB, which provides the additional capability of recording the addresses as IPv6 addresses, plus other IPv6 and IP layer extension information"
  },
  "crttMonIPEchoAdminEntry": {
    "name": "crttMonIPEchoAdminEntry",
    "oid": "1.3.6.1.4.1.9.9.572.1.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "augmention": {
      "name": "crttMonIPEchoAdminEntry",
      "module": "CISCO-RTTMON-IP-EXT-MIB",
      "object": "rttMonEchoAdminEntry"
    },
    "status": "current",
    "description": "A list of additional objects needed for IPv6 addresses."
  },
  "crttMonIPEchoAdminTargetAddrType": {
    "name": "crttMonIPEchoAdminTargetAddrType",
    "oid": "1.3.6.1.4.1.9.9.572.1.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressType",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "unknown",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "An enumerated value which specifies the address type of the target. This object must be used along with the crttMonIPEchoAdminTargetAddress object as it identifies the address family of the address specified by that object. If the value of crttMonIPEchoAdminTargetAddress is a zero-length string (e.g., because an IPv4 address is specified by rttMonEchoAdminTargetAddress), this object contains the value 'unknown'."
  },
  "crttMonIPEchoAdminTargetAddress": {
    "name": "crttMonIPEchoAdminTargetAddress",
    "oid": "1.3.6.1.4.1.9.9.572.1.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "A string which specifies the address of the target. This object, in conjunction with the crttMonIPEchoAdminTargetAddrType object, may be used to specify either an IPv6 or an IPv4 address and is an alternative to the rttMonEchoAdminTargetAddress object, which may only specify an IPv4 address. In case the target is a V4 IP address then both crttMonIPEchoAdminTargetAddrType/ crttMonIPEchoAdminTargetAddress AND rttMonEchoAdminTargetAddress may be used to specify it so long as both try to specify the same V4 IP address. Alternatively only one of rttMonEchoAdminTargetAddress OR crttMonIPEchoAdminTargetAddrType/ crttMonIPEchoAdminTargetAddress may be used to specify the V4 IP address, in which case the other may either not be instantiated or contain a zero length string. In case the the target is a V6 IP address then only crttMonIPEchoAdminTargetAddrType/ crttMonIPEchoAdminTargetAddress must be used and rttMonEchoAdminTargetAddress may not be instantiated or may have a zero length string."
  },
  "crttMonIPEchoAdminSourceAddrType": {
    "name": "crttMonIPEchoAdminSourceAddrType",
    "oid": "1.3.6.1.4.1.9.9.572.1.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressType",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "unknown",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "An enumerated value which specifies the address type of the source. This object must be used along with the crttMonIPEchoAdminSourceAddress object as it identifies the address family of the address specified by that object. If the value of crttMonIPEchoAdminSourceAddress is a zero-length string (e.g., because an IPv4 address is specified by rttMonEchoAdminSourceAddress), this object contains the value 'unknown'."
  },
  "crttMonIPEchoAdminSourceAddress": {
    "name": "crttMonIPEchoAdminSourceAddress",
    "oid": "1.3.6.1.4.1.9.9.572.1.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "A string which specifies the address of the target. This object, together with the crttMonIPEchoAdminSourceAddrType object, may be used to specify either an IPv6 or an IPv4 address and is an alternative to the rttMonEchoAdminSourceAddress object, which may only specify an IPv4 address. In case the target is a V4 IP address then both crttMonIPEchoAdminSourceAddrType/ crttMonIPEchoAdminSourceAddress AND rttMonEchoAdminSourceAddress may be used to specify it so long as both try to specify the same V4 IP address. Alternatively only one of rttMonEchoAdminSourceAddress OR crttMonIPEchoAdminSourceAddrType/ crttMonIPEchoAdminSourceAddress may be used to specify the V4 IP address, in which case the other may either not be instantiated or contain a zero length string. In case the the target is a V6 IP address then only crttMonIPEchoAdminSourceAddrType/ crttMonIPEchoAdminSourceAddress must be used and rttMonEchoAdminSourceAddress may not be instantiated or may have a zero length string."
  },
  "crttMonIPEchoAdminNameServerAddrType": {
    "name": "crttMonIPEchoAdminNameServerAddrType",
    "oid": "1.3.6.1.4.1.9.9.572.1.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressType",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "unknown",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "An enumerated value which specifies the address type of the target. This object must be used along with the crttMonIPEchoAdminNameServerAddress object as it identifies the address family of the address specified by that object. If the value of crttMonIPEchoAdminNameServerAddress is a zero-length string (e.g., because an IPv4 address is specified by rttMonEchoAdminNameServer), this object contains the value 'unknown'."
  },
  "crttMonIPEchoAdminNameServerAddress": {
    "name": "crttMonIPEchoAdminNameServerAddress",
    "oid": "1.3.6.1.4.1.9.9.572.1.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "A string which specifies the address of the target. This object, together with the crttMonIPEchoAdminNameServerAddrType object, may be used to specify either an IPv6 or an IPv4 address and is an alternative to the rttMonEchoAdminNameServer object, which can only specify an IPv4. In case the target is a V4 IP address then both crttMonIPEchoAdminNameServerAddrType/ crttMonIPEchoAdminNameServerAddress AND rttMonEchoAdminNameServer may be used to specify it so long as both try to specify the same V4 IP address. Alternatively only one of rttMonEchoAdminNameServer OR crttMonIPEchoAdminNameServerAddrType/ crttMonIPEchoAdminNameServerAddress may be used to specify the V4 IP address, in which case the other may either not be instantiated or contain a zero length string. In case the the target is a V6 IP address then only crttMonIPEchoAdminNameServerAddrType/ crttMonIPEchoAdminNameServerAddress must be used and rttMonEchoAdminNameServer may not be instantiated or may have a zero length string."
  },
  "crttMonIPEchoAdminLSPSelAddrType": {
    "name": "crttMonIPEchoAdminLSPSelAddrType",
    "oid": "1.3.6.1.4.1.9.9.572.1.1.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressType",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "unknown",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "An enumerated value which specifies the address type of the target. This object must be used along with the crttMonIPEchoAdminLSPSelAddress object as it identifies the address family of the address specified by that object. If the value of crttMonIPEchoAdminLSPSelAddress is a zero-length string (e.g., because an IPv4 address is specified by rttMonEchoAdminLSPSelector), this object contains the value 'unknown'."
  },
  "crttMonIPEchoAdminLSPSelAddress": {
    "name": "crttMonIPEchoAdminLSPSelAddress",
    "oid": "1.3.6.1.4.1.9.9.572.1.1.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "A string which specifies the address of the LSP Selector. This object, in conjunction with the crttMonIPEchoAdminLSPSelAddrType object, may be used to specify either an IPv6 or an IPv4 address and is an alternative to the rttMonEchoAdminLSPSelector object, which can only specify an IPv4 address.In case the target is a V4 IP address then both crttMonIPEchoAdminLSPSelAddrType/ crttMonIPEchoAdminLSPSelAddress AND rttMonEchoAdminLSPSelector may be used to specify it so long as both try to specify the same V4 IP address. Alternatively only one of rttMonEchoAdminLSPSelector OR crttMonIPEchoAdminLSPSelAddrType/ crttMonIPEchoAdminLSPSelAddress may be used to specify the V4 IP address, in which case the other may either not be instantiated or contain a zero length string. In case the the target is a V6 IP address then only crttMonIPEchoAdminLSPSelAddrType/ crttMonIPEchoAdminLSPSelAddress must be used and rttMonEchoAdminLSPSelector may not be instantiated or may have a zero length string."
  },
  "crttMonIPEchoAdminDscp": {
    "name": "crttMonIPEchoAdminDscp",
    "oid": "1.3.6.1.4.1.9.9.572.1.1.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DscpOrAny",
      "class": "type"
    },
    "default": {
      "default": {
        "value": -1,
        "format": "decimal"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The DSCP value (either an IPv4 TOS octet or an IPv6 Traffic Class octet) to be set in outgoing packets."
  },
  "crttMonIPEchoAdminFlowLabel": {
    "name": "crttMonIPEchoAdminFlowLabel",
    "oid": "1.3.6.1.4.1.9.9.572.1.1.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "IPv6FlowLabelOrAny",
      "class": "type"
    },
    "maxaccess": "read-write",
    "reference": "Section 6 of RFC 2460",
    "status": "current",
    "description": "The Flow Label in an IPv6 packet header."
  },
  "crttMonIPLatestRttOperTable": {
    "name": "crttMonIPLatestRttOperTable",
    "oid": "1.3.6.1.4.1.9.9.572.1.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "An extension of the rttMonLatestRttOperTable, defined in the CISCO-RTTMON-MIB, which provides the additional capability of specifying IPv6 addresses."
  },
  "crttMonIPLatestRttOperEntry": {
    "name": "crttMonIPLatestRttOperEntry",
    "oid": "1.3.6.1.4.1.9.9.572.1.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "augmention": {
      "name": "crttMonIPLatestRttOperEntry",
      "module": "CISCO-RTTMON-IP-EXT-MIB",
      "object": "rttMonCtrlAdminEntry"
    },
    "status": "current",
    "description": "A list of objects required to support IPv6 addresses. "
  },
  "crttMonIPLatestRttOperAddressType": {
    "name": "crttMonIPLatestRttOperAddressType",
    "oid": "1.3.6.1.4.1.9.9.572.1.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressType",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "unknown",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "An enumerated value which specifies the address type of the target. This object must be used along with the crttMonIPLatestRttOperAddress object as it identifies the address family of the address specified by that object. If the value of crttMonIPLatestRttOperAddress is a zero-length string (e.g., because an IPv4 address is specified by rttMonLatestRttOperAddress), this object contains the value 'unknown'."
  },
  "crttMonIPLatestRttOperAddress": {
    "name": "crttMonIPLatestRttOperAddress",
    "oid": "1.3.6.1.4.1.9.9.572.1.2.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "A string which specifies the address of the target. This object, together with the crttMonIPLatestRttOperAddressType object, may be used to specify either an IPv6 or an IPv4 address and is an alternative to the rttMonLatestRttOperAddress object, which can only specify an IPv4 address. In case the target is a V4 IP address then both crttMonIPLatestRttOperAddressType/ crttMonIPLatestRttOperAddress AND rttMonLatestRttOperAddress may be used to specify it so long as both try to specify the same V4 IP address. Alternatively only one of rttMonLatestRttOperAddress OR crttMonIPLatestRttOperAddressType/ crttMonIPLatestRttOperAddress may be used to specify the V4 IP address, in which case the other may either not be instantiated or contain a zero length string. In case the the target is a V6 IP address then only crttMonIPLatestRttOperAddressType/ crttMonIPLatestRttOperAddress must be used and rttMonLatestRttOperAddress may not be instantiated or may have a zero length string."
  },
  "crttMonIPEchoPathAdminTable": {
    "name": "crttMonIPEchoPathAdminTable",
    "oid": "1.3.6.1.4.1.9.9.572.1.3",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "An extension of the rttMonEchoPathAdminTable, defined in the CISCO-RTTMON-MIB, which provides the additional capability of recording the hops as IPv6 addresses."
  },
  "crttMonIPEchoPathAdminEntry": {
    "name": "crttMonIPEchoPathAdminEntry",
    "oid": "1.3.6.1.4.1.9.9.572.1.3.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "augmention": {
      "name": "crttMonIPEchoPathAdminEntry",
      "module": "CISCO-RTTMON-IP-EXT-MIB",
      "object": "rttMonEchoPathAdminEntry"
    },
    "status": "current",
    "description": "A list of additional objects needed for IPv6 addresses."
  },
  "crttMonIPEchoPathAdminHopAddrType": {
    "name": "crttMonIPEchoPathAdminHopAddrType",
    "oid": "1.3.6.1.4.1.9.9.572.1.3.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressType",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "unknown",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "An enumerated value which specifies the address type of the hop. This object must be used along with the crttMonIPEchoPathAdminHopAddress object as it identifies the address family of the address specified by that object. If the value of crttMonIPEchoPathAdminHopAddress is a zero-length string (e.g., because an IPv4 address is specified by rttMonEchoPathAdminHopAddress), this object contains the value 'unknown'."
  },
  "crttMonIPEchoPathAdminHopAddress": {
    "name": "crttMonIPEchoPathAdminHopAddress",
    "oid": "1.3.6.1.4.1.9.9.572.1.3.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "A string which specifies the address of the hop. This object, together with the crttMonIPEchoPathAdminHopAddrType object, may be used to specify either an IPv6 or an IPv4 address and is an alternative to the rttMonEchoPathAdminHopAddress object, which can only specify an IPv4 address. In case the target is a V4 IP address then both crttMonIPEchoPathAdminHopAddrType/ crttMonIPEchoPathAdminHopAddress AND rttMonEchoPathAdminHopAddress may be used to specify it so long as both try to specify the same V4 IP address. Alternatively only one of rttMonEchoPathAdminHopAddress OR crttMonIPEchoPathAdminHopAddrType/ crttMonIPEchoPathAdminHopAddress may be used to specify the V4 IP address, in which case the other may either not be instantiated or contain a zero length string. In case the the target is a V6 IP address then only crttMonIPEchoPathAdminHopAddrType/ crttMonIPEchoPathAdminHopAddress must be used and rttMonEchoPathAdminHopAddress may not be instantiated or may have a zero length string."
  },
  "crttMonIPStatsCollectTable": {
    "name": "crttMonIPStatsCollectTable",
    "oid": "1.3.6.1.4.1.9.9.572.1.4",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "An extension of the rttMonStatsCollectTable, defined in the CISCO-RTTMON-MIB, which provides the additional capability of specifying the collection address as an IPv6 address."
  },
  "crttMonIPStatsCollectEntry": {
    "name": "crttMonIPStatsCollectEntry",
    "oid": "1.3.6.1.4.1.9.9.572.1.4.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "augmention": {
      "name": "crttMonIPStatsCollectEntry",
      "module": "CISCO-RTTMON-IP-EXT-MIB",
      "object": "rttMonStatsCollectEntry"
    },
    "status": "current",
    "description": "A list of additional objects needed for IPv6 addresses."
  },
  "crttMonIPStatsCollectAddressType": {
    "name": "crttMonIPStatsCollectAddressType",
    "oid": "1.3.6.1.4.1.9.9.572.1.4.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressType",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "unknown",
        "format": "enum"
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "An enumerated value which specifies the address type of the target. This object must be used along with the crttMonIPStatsCollectAddress object as it identifies the address family of the address specified by that object. If the value of crttMonIPStatsCollectAddress is a zero-length string (e.g., because an IPv4 address is specified by rttMonStatsCollectAddress), this object contains the value 'unknown'."
  },
  "crttMonIPStatsCollectAddress": {
    "name": "crttMonIPStatsCollectAddress",
    "oid": "1.3.6.1.4.1.9.9.572.1.4.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A string which specifies the address of the collection target. This object, in conjunction with the crttMonIPStatsCollectAddressType object, may be used to specify either an IPv6 or an IPv4 address and is an alternative to the rttMonStatsCollectAddress object, which can only specify an IPv4 address. In case the target is a V4 IP address then both crttMonIPStatsCollectAddressType/ crttMonIPStatsCollectAddress AND rttMonStatsCollectAddress may be used to specify it so long as both try to specify the same V4 IP address. Alternatively only one of rttMonStatsCollectAddress OR crttMonIPStatsCollectAddressType/ crttMonIPStatsCollectAddress may be used to specify the V4 IP address, in which case the other may either not be instantiated or contain a zero length string. In case the the target is a V6 IP address then only crttMonIPStatsCollectAddressType/ crttMonIPStatsCollectAddress must be used and rttMonStatsCollectAddress may not be instantiated or may have a zero length string."
  },
  "crttMonIPLpdGrpStatsTable": {
    "name": "crttMonIPLpdGrpStatsTable",
    "oid": "1.3.6.1.4.1.9.9.572.1.5",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "An extension of the rttMonLpdGrpStatsTable, defined in the CISCO-RTTMON-MIB, which provides the additional capability of specifying the target PE address as an IPv6 address."
  },
  "crttMonIPLpdGrpStatsEntry": {
    "name": "crttMonIPLpdGrpStatsEntry",
    "oid": "1.3.6.1.4.1.9.9.572.1.5.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "augmention": {
      "name": "crttMonIPLpdGrpStatsEntry",
      "module": "CISCO-RTTMON-IP-EXT-MIB",
      "object": "rttMonLpdGrpStatsEntry"
    },
    "status": "current",
    "description": "A list of additional objects needed for IPv6 addresses."
  },
  "crttMonIPLpdGrpStatsTargetPEAddrType": {
    "name": "crttMonIPLpdGrpStatsTargetPEAddrType",
    "oid": "1.3.6.1.4.1.9.9.572.1.5.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressType",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "unknown",
        "format": "enum"
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "An enumerated value which specifies the address type of the target. This object must be used along with the crttMonIPLpdGrpStatsTargetPEAddr object as it identifies the address family of the address specified by that object. If the value of crttMonIPLpdGrpStatsTargetPEAddr is a zero-length string (e.g., because an IPv4 address is specified by rttMonLpdGrpStatsTargetPE), this object contains the value 'unknown'."
  },
  "crttMonIPLpdGrpStatsTargetPEAddr": {
    "name": "crttMonIPLpdGrpStatsTargetPEAddr",
    "oid": "1.3.6.1.4.1.9.9.572.1.5.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A string which specifies the address of the target PE. This object, in conjunction with the crttMonIPLpdGrpStatsTargetPEAddrType object, may be used to specify either an IPv6 or an IPv4 address and is an alternative to the rttMonLpdGrpStatsTargetPE object, which can only specify an IPv4 address. In case the target is a V4 IP address then both crttMonIPLpdGrpStatsTargetPEAddrType/ crttMonIPLpdGrpStatsTargetPEAddr AND rttMonLpdGrpStatsTargetPE may be used to specify it so long as both try to specify the same V4 IP address. Alternatively only one of rttMonLpdGrpStatsTargetPE OR crttMonIPLpdGrpStatsTargetPEAddrType/ crttMonIPLpdGrpStatsTargetPEAddr may be used to specify the V4 IP address, in which case the other may either not be instantiated or contain a zero length string. In case the the target is a V6 IP address then only crttMonIPLpdGrpStatsTargetPEAddrType/ crttMonIPLpdGrpStatsTargetPEAddr must be used and rttMonLpdGrpStatsTargetPE may not be instantiated or may have a zero length string."
  },
  "crttMonIPHistoryCollectionTable": {
    "name": "crttMonIPHistoryCollectionTable",
    "oid": "1.3.6.1.4.1.9.9.572.1.6",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "An extension of the rttMonHistoryCollectionTable, defined in the CISCO-RTTMON-MIB, which provides the additional capability of specifying the target address as an IPv6 address."
  },
  "crttMonIPHistoryCollectionEntry": {
    "name": "crttMonIPHistoryCollectionEntry",
    "oid": "1.3.6.1.4.1.9.9.572.1.6.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "augmention": {
      "name": "crttMonIPHistoryCollectionEntry",
      "module": "CISCO-RTTMON-IP-EXT-MIB",
      "object": "rttMonHistoryCollectionEntry"
    },
    "status": "current",
    "description": "A list of additional objects needed for IPv6 addresses."
  },
  "crttMonIPHistoryCollectionAddrType": {
    "name": "crttMonIPHistoryCollectionAddrType",
    "oid": "1.3.6.1.4.1.9.9.572.1.6.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressType",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "unknown",
        "format": "enum"
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "An enumerated value which specifies the address type of the target. This object must be used along with the crttMonIPHistoryCollectionAddress object as it identifies the address family of the address specified by that object. If the value of crttMonIPHistoryCollectionAddress is a zero-length string (e.g., because an IPv4 address is specified by rttMonHistoryCollectionAddress), this object contains the value 'unknown'."
  },
  "crttMonIPHistoryCollectionAddress": {
    "name": "crttMonIPHistoryCollectionAddress",
    "oid": "1.3.6.1.4.1.9.9.572.1.6.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A string which specifies the address of the target. This object, in conjunction with the crttMonIPHistoryCollectionAddrType object, may be used to specify either an IPv6 or an IPv4 address and is an alternative to the rttMonHistoryCollectionAddress object, which can only specify an IPv4 address. In case the target is a V4 IP address then both crttMonIPHistoryCollectionAddrType/ crttMonIPHistoryCollectionAddress AND rttMonHistoryCollectionAddress may be used to specify it so long as both try to specify the same V4 IP address. Alternatively only one of rttMonHistoryCollectionAddress OR crttMonIPHistoryCollectionAddrType/ crttMonIPHistoryCollectionAddress may be used to specify the V4 IP address, in which case the other may either not be instantiated or contain a zero length string. In case the the target is a V6 IP address then only crttMonIPHistoryCollectionAddrType/ crttMonIPHistoryCollectionAddress must be used and rttMonHistoryCollectionAddress may not be instantiated or may have a zero length string."
  },
  "ciscoRttMonIPExtMibComplianceRev1": {
    "name": "ciscoRttMonIPExtMibComplianceRev1",
    "oid": "1.3.6.1.4.1.9.9.572.2.1.1",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "ciscoIPExtCtrlGroupRev1",
        "module": "CISCO-RTTMON-IP-EXT-MIB"
      }
    ],
    "status": "current",
    "description": "The compliance statement for new MIB extensions for supporting IPv6 addresses and other IP-layer extensions"
  },
  "ciscoIPExtCtrlGroupRev1": {
    "name": "ciscoIPExtCtrlGroupRev1",
    "oid": "1.3.6.1.4.1.9.9.572.2.2.1",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-RTTMON-IP-EXT-MIB",
        "object": "crttMonIPEchoAdminTargetAddrType"
      },
      {
        "module": "CISCO-RTTMON-IP-EXT-MIB",
        "object": "crttMonIPEchoAdminTargetAddress"
      },
      {
        "module": "CISCO-RTTMON-IP-EXT-MIB",
        "object": "crttMonIPEchoAdminSourceAddrType"
      },
      {
        "module": "CISCO-RTTMON-IP-EXT-MIB",
        "object": "crttMonIPEchoAdminSourceAddress"
      },
      {
        "module": "CISCO-RTTMON-IP-EXT-MIB",
        "object": "crttMonIPEchoAdminNameServerAddrType"
      },
      {
        "module": "CISCO-RTTMON-IP-EXT-MIB",
        "object": "crttMonIPEchoAdminNameServerAddress"
      },
      {
        "module": "CISCO-RTTMON-IP-EXT-MIB",
        "object": "crttMonIPEchoAdminLSPSelAddrType"
      },
      {
        "module": "CISCO-RTTMON-IP-EXT-MIB",
        "object": "crttMonIPEchoAdminLSPSelAddress"
      },
      {
        "module": "CISCO-RTTMON-IP-EXT-MIB",
        "object": "crttMonIPEchoAdminDscp"
      },
      {
        "module": "CISCO-RTTMON-IP-EXT-MIB",
        "object": "crttMonIPEchoAdminFlowLabel"
      },
      {
        "module": "CISCO-RTTMON-IP-EXT-MIB",
        "object": "crttMonIPLatestRttOperAddressType"
      },
      {
        "module": "CISCO-RTTMON-IP-EXT-MIB",
        "object": "crttMonIPLatestRttOperAddress"
      },
      {
        "module": "CISCO-RTTMON-IP-EXT-MIB",
        "object": "crttMonIPEchoPathAdminHopAddrType"
      },
      {
        "module": "CISCO-RTTMON-IP-EXT-MIB",
        "object": "crttMonIPEchoPathAdminHopAddress"
      },
      {
        "module": "CISCO-RTTMON-IP-EXT-MIB",
        "object": "crttMonIPStatsCollectAddressType"
      },
      {
        "module": "CISCO-RTTMON-IP-EXT-MIB",
        "object": "crttMonIPStatsCollectAddress"
      },
      {
        "module": "CISCO-RTTMON-IP-EXT-MIB",
        "object": "crttMonIPLpdGrpStatsTargetPEAddrType"
      },
      {
        "module": "CISCO-RTTMON-IP-EXT-MIB",
        "object": "crttMonIPLpdGrpStatsTargetPEAddr"
      },
      {
        "module": "CISCO-RTTMON-IP-EXT-MIB",
        "object": "crttMonIPHistoryCollectionAddrType"
      },
      {
        "module": "CISCO-RTTMON-IP-EXT-MIB",
        "object": "crttMonIPHistoryCollectionAddress"
      }
    ],
    "status": "current",
    "description": "A collection of objects that were added to enhance the functionality of the RTT application to support other IP layer extensions like IPv6, specifically IPv6 addresses and other information."
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/CISCO-RTTMON-IP-EXT-MIB",
      "Produced by pysmi-0.3.4 at Fri May 24 17:15:48 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "CISCO-RTTMON-IP-EXT-MIB"
  }
}