{
  "imports": {
    "class": "imports",
    "CISCO-GTP-MIB": [
      "cGtpPathPort",
      "cGtpPathAddressType",
      "cGtpPathAddress"
    ],
    "CISCO-SMI": [
      "ciscoMgmt"
    ],
    "CISCO-TC": [
      "CiscoInetAddressMask",
      "CiscoAlarmSeverity"
    ],
    "IF-MIB": [
      "InterfaceIndexOrZero",
      "ifIndex"
    ],
    "INET-ADDRESS-MIB": [
      "InetAddressDNS",
      "InetAddress",
      "InetAddressType",
      "InetAddressPrefixLength"
    ],
    "SNMP-FRAMEWORK-MIB": [
      "SnmpAdminString"
    ],
    "SNMPv2-CONF": [
      "NOTIFICATION-GROUP",
      "MODULE-COMPLIANCE",
      "OBJECT-GROUP"
    ],
    "SNMPv2-SMI": [
      "NOTIFICATION-TYPE",
      "MibIdentifier",
      "TimeTicks",
      "Counter64",
      "Gauge32",
      "OBJECT-TYPE",
      "Unsigned32",
      "OBJECT-IDENTITY",
      "Bits",
      "MODULE-IDENTITY",
      "Integer32",
      "Counter32",
      "iso",
      "IpAddress"
    ],
    "SNMPv2-TC": [
      "RowStatus",
      "TruthValue",
      "DisplayString",
      "TimeStamp",
      "TEXTUAL-CONVENTION"
    ]
  },
  "cGgsnMIB": {
    "name": "cGgsnMIB",
    "oid": "1.3.6.1.4.1.9.9.240",
    "class": "moduleidentity",
    "revisions": [
      {
        "revision": "2012-05-04 00:00",
        "description": "Modified description for cGgsnSentSigMessages and cGgsnReceivedSigMessages."
      },
      {
        "revision": "2012-01-11 00:00",
        "description": "Modified description for cGgsnSlbVserAddrType."
      },
      {
        "revision": "2011-03-21 00:00",
        "description": "Added the following objects to cGgsnIpDupProtectTable cGgsnMsExcludeRangeStartIpv6Prefixlen, cGgsnMsExcludeRangeEndIpv6Prefixlen. Added the following objects to cGgsnPlmnIpAddrRangeTable cGgsnPlmnAddrRangeFirstIpv6Prefixlen, cGgsnPlmnAddrRangeLastIpv6Prefixlen. Modified the description of the following objects cGgsnMsExcludeRangeStartIpType, cGgsnMsExcludeRangeEndIpType, cGgsnPlmnAddrRangeIpAddrType, cGgsnIpDupProtectRowStatus and cGgsnPlmnAddrRangeRowStatus. Added a OBJECT-GROUP cGgsnConfigurationsGroupSup1. Deprecated the compliance group cGgsnMIBComplianceRev9 and added a new compliance group cGgsnMIBComplianceRev10."
      },
      {
        "revision": "2011-03-01 00:00",
        "description": "Modified description for cGgsnSlbVserNextHopAddrType and cGgsnDefaultAggregIpAddrType."
      },
      {
        "revision": "2010-03-23 00:00",
        "description": "Added the 'release100' enumeration to cGgsnVersion."
      },
      {
        "revision": "2010-02-19 00:00",
        "description": "Added new table cGgsnGtpEncapsuTable. Added OBJECT-GROUP cGgsnStatusGroupR90. Added MODULE-COMPLIANCE cGgsnMIBComplianceRev9, which deprecates cGgsnMIBComplianceRev8."
      },
      {
        "revision": "2008-11-03 00:00",
        "description": "Added the 'release90' enumeration to cGgsnVersion."
      },
      {
        "revision": "2008-02-04 00:00",
        "description": "Deprecated cGgsnCompliance3GppGgsn. Added a Enumerated value to cGgsnVersion."
      },
      {
        "revision": "2006-10-05 00:00",
        "description": "+ Added cGgsnTotalCreatedIpv6Pdps, cGgsnTotalDeletedIpv6Pdps, cGgsnTotalRejectedIpv6Pdps, cGgsnSentIpv6SigMessages, cGgsnReceivedIpv6SigMessages, cGgsnSentIpv6PDUs, cGgsnReceivedIpv6PDUs, cGgsnSentIpv6PDUOctets, cGgsnReceivedIpv6PDUOctets, to cGgsnStatistics. + Added cGgsnActivatedIpv6Gtpv0Pdp, cGgsnActivatedIpv6Gtpv1Pdp, cGgsnActivatedIpv6Ms to cGgsnStatus. - Deprecated cGgsnCreateReqV1UpdExistPdp. - Deprecated all the objects of cGgsnPdpsRejStatistics. + Added cGgsnVersionNotSupportedMsgs, cGgsnUnkownGtpMsgs, cGgsnTooShortMsgs, cGgsnMandIeMissingMsgs, cGgsnMandIeIncorrectMsgs, cGgsnOptIeInvalidMsgs, cGgsnIeUnknownMsgs, cGgsnIeOutOfOrderMsgs, cGgsnIeUnexpectedMsgs, cGgsnIeDuplicatedMsgs, cGgsnOptIeIncorrectMsgs, cGgsnPdpWithoutTftExistsPdps to cGgsnStatistics. - Deprecated cGgsnPdfTable and all the table objects. - Deprecated cGgsnPdfNotifEnabled, cGgsnPdfServerAddrType,cGgsnPdfServerAddr, cGgsnPdfStateUpNotif, cGgsnPdfStateDownNotif."
      },
      {
        "revision": "2006-03-30 09:00",
        "description": "- Deprecated cGgsnSlbNotif. + Added cGgsnSlbNotifyCacFailure and cGgsnSlbNotifySessionDeletion to cGgsnConfigurations."
      },
      {
        "revision": "2005-08-24 18:00",
        "description": "Added cGgsnSlbCacFailures, cGgsnSlbSessionFailures, cGgsnRedundancyStatistics to cGgsnStatistics. + Added cGgsnSlbVserverTable, cGgsnSlbVserverEntry, cGgsnSlbVserAddrType, cGgsnSlbVserAddress to cGgsnConfigurations. + Added cGgsnPrepaidPDPs, cGgsnPostpaidPDPs to cGgsnStatus. + Added cGgsnNotifPdpMsisdn to cGgsnNotifInfo."
      },
      {
        "revision": "2005-01-04 18:00",
        "description": "Added cGgsnConfigVersion to cGgsnStatus."
      },
      {
        "revision": "2004-11-23 01:00",
        "description": "- Deprecated cGgsnNotification + Added cGgsnGlobalErrorNotif, cGgsnAccessPointNameNotif, cGgsnPacketDataProtocolNotif. + Added cGgsnNotifAccessPointName, cGgsnNotifPdpImsi, cGgsnGlobalErrorTypes, cGgsnAccessPointErrorTypes, cGgsnPacketDataProtoErrorTypes to cGgsnNotifInfo. - Deprecated cGgsnNotifEnabled + Added cGgsnServiceNotifEnabled, cGgsnMemoryNotifEnabled, cGgsnPdfNotifEnabled, cGgsnGlobalErrorNotifEnabled, cGgsnAccessPointNotifEnabled, cGgsnPdpNotifEnabled to cGgsnNotifMgmt"
      },
      {
        "revision": "2004-02-23 01:00",
        "description": "+ Added cGgsnInServiceNotif, cGgsnMaintenanceNotif, cGgsnMemThresholdReachedNotif, cGgsnMemThresholdClearedNotif, cGgsnPdfStateUpNotif, cGgsnPdfStateDownNotif to cGgsnNotifications. + Added cGgsnPdfTable, cGgsnPcscfTable, cGgsnMemoryThreshold, cGgsnServiceMode, cGgsnPlmnTable, cGgsnSessionTimeout, cGgsnThruputIntervalOne, cGgsnThruputIntervalTwo, cGgsnCompliance3GppGgsn, cGgsnCreateReqV1UpdExistPdp, cGgsnRadAttrSessTimeout, cGgsnDownlinkVerifyMsDisable to cGgsnConfigurations. + Added cGgsnVersionNotSupportedRejPdps, cGgsnUnkownMessageRejPdps, cGgsnMsgTooShortRejPdps, cGgsnMandIeMissingRejPdps, cGgsnMandIeIncorrectRejPdps, cGgsnOptIeInvalidRejPdps, cGgsnIeUnknownRejPdps, cGgsnIeOutOfOrderRejPdps, cGgsnIeUnexpectedRejPdps, cGgsnIeDuplicatedRejPdps, cGgsnOptIeIncorrectRejPdps, cGgsnPdpWithoutTftExistsRejPdps to cGgsnPdpsRejStatistics. + Added cGgsnSgsnStatTable to cGgsnStatistics. + Added cGgsnHCSentGPDUOctets and deprecated cGgsnSentGPDUOctets. + Added cGgsnHCReceivedGPDUOctets and deprecated cGgsnReceivedGPDUOctets. + Added cGgsnServiceModeStatus to cGgsnStatus. + Added cGgsnPdfServerAddrType, cGgsnPdfServerAddr to cGgsnNotifInfo."
      },
      {
        "revision": "2003-12-31 01:00",
        "description": "+ Added cGgsnPlmnIpAddrRangeTable to cGgsnConfigurations. + Added cGgsnTftSemanticErrorPdps, cGgsnTftSyntacticErrorPdps, cGgsnPktFilterSemanticErrorPdps, cGgsnPktFilterSyntacticErrorPdps to cGgsnStatistics. + Added cGgsnActiveGtpVersion0Pdps, cGgsnActiveGtpVersion1Pdps, cGgsnGtpEncapInterface to cGgsnStatus."
      },
      {
        "revision": "2001-12-08 15:00",
        "description": "Initial version of this MIB module."
      }
    ],
    "lastupdated": "201205040000Z",
    "organization": "Cisco Systems, Inc.",
    "contactinfo": "Cisco Systems Customer Service Postal: 170 W Tasman Drive San Jose, CA 95134 USA Tel: +1 800 553-NETS E-mail: cs-gprs@cisco.com",
    "description": "This MIB module manages the Gateway GPRS Support Node (GGSN) devices. A GGSN device provides interworking with external packet-data network of a particular GPRS service provider. It provides a combination of IP routing and GPRS specific functionality to support mobile users. GTP version1 is introduced in UMTS release 99 and Cisco GGSN will support both GTP version 1 (GTP v1) and version zero (GTP v0) simultaneously. GTP v1 supports multiple PDP contexts sharing one IP address. TFTs are introduced to achieve this. Each TFT is associated with a PDP context and there may exist one PDP context without TFT amongst all PDP contexts sharing the same IP address. Each TFT has one to eight packet filters each assigned with a precedence index. These packet filters are evaluated one at a time against the packet header information in sequence of their precedence index. A match is claimed if all the filters are matched and the PDP context that the TFT belongs to will be selected, else the checks are performed against the filters of another PDP context. If the packet header doesn't contain any TFT packet filter information, then the PDP context without the TFT is selected for further processing. Note on notifications: When an alarm occurs on the device, if the alarm's severity is higher than the severity filter threshold, a notification is generated by the device; and if cGgsnNotifEnabled is 'true', then the device's SNMP-engine configuration will be searched to determine where to send the notification. Acronyms and terms: APN Access Point Name CSG Content Service Gateway CDR Charging Data Record DCCA Diameter Credit Control Application ETSI European Telecommunications Standards Institute GGSN Gateway GPRS Support Node GPRS General Packet Radio Service GSM Global System for Mobile communication GTP GPRS Tunneling Protocol G-PDU GTP PDU IE Information Element MS Mobile Station MSISDN Mobile Station ISDN number PDP Packet Data Protocol PDU Protocol Data Unit PLMN Public Land Mobile Network SGSN Serving GPRS support Node SLB Server Load Balancing TFT Traffic Flow Template T-PDU the payload of G-PDU UMTS Universal Mobile Telecommunications System IMS IP Multimedia Subsystem COPS Common Open Policy Service protocol PEP Policy Enforcement Point PDF Policy Decision Function P-CSCF Proxy Call Session Control Function PLMN Public Land Mobile Network QS Quota Server UE User Equipment REFERENCE [1] GSM 03.60: Digital cellular telecommunications system (Phase 2+); General Packet Radio Service (GPRS); Service description; Stage 2. V7.1.0 [2] GSM 09.60: Digital cellular telecommunication system (Phase 2+); General Packet Radio Service (GPRS); GPRS Tunnelling Protocol (GTP) across Gn and Gp Interface. V7.3.0 [3] 3GPP; Technical Specification Group Services and System Aspects; QoS Concept and Architecture. 3G TS 23.107 v3.2.0. [4] 3GPP; Technical Specification Group Core Network; General Packet Radio Service(GPRS); GPRS Tunnelling Protocol (GTP) across Gn and Gp Interface (Release 1999). 3G TS 29.060 v3.5.0. [5] 3GPP: Technical Specification Group Core Network; Policy control over Go interface (Release 5). 3GPP TS 29.207 V5.2.0"
  },
  "cGgsnMIBObjects": {
    "name": "cGgsnMIBObjects",
    "oid": "1.3.6.1.4.1.9.9.240.1",
    "class": "objectidentity"
  },
  "cGgsnStatistics": {
    "name": "cGgsnStatistics",
    "oid": "1.3.6.1.4.1.9.9.240.1.1",
    "class": "objectidentity"
  },
  "cGgsnNotifMgmt": {
    "name": "cGgsnNotifMgmt",
    "oid": "1.3.6.1.4.1.9.9.240.1.2",
    "class": "objectidentity"
  },
  "cGgsnConfigurations": {
    "name": "cGgsnConfigurations",
    "oid": "1.3.6.1.4.1.9.9.240.1.3",
    "class": "objectidentity"
  },
  "cGgsnStatus": {
    "name": "cGgsnStatus",
    "oid": "1.3.6.1.4.1.9.9.240.1.4",
    "class": "objectidentity"
  },
  "cGgsnNotifInfo": {
    "name": "cGgsnNotifInfo",
    "oid": "1.3.6.1.4.1.9.9.240.1.5",
    "class": "objectidentity"
  },
  "cGgsnSentSigMessages": {
    "name": "cGgsnSentSigMessages",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of GTPv0 and GTPv1 signalling messages sent. Trigger Condition: This counter is updated whenever a GTPv0 and GTPv1 signalling messages is sent out, including retries."
  },
  "cGgsnReceivedSigMessages": {
    "name": "cGgsnReceivedSigMessages",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.2",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of GTPv0 and GTPv1 signalling messages received. Trigger Condition: This counter is updated whenever a GTPv0 and GTPv1 signalling message is received."
  },
  "cGgsnUnexpectedSigMessages": {
    "name": "cGgsnUnexpectedSigMessages",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.3",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of unexpected GTP signalling messages received. Trigger Condition: This counter is updated whenever an unexpected Signalling message is received. Condition includes, a) A Response message for which there is no corresponding outstanding Request. b) A GTP control plane message a GSN is not expected to handle (such as a PDU Notification Request received by a GGSN). c) Charging messages in GTP path and vice-versa. d) LFN bit not being set when CG path uses short-header and vice-versa."
  },
  "cGgsnSentGPDUs": {
    "name": "cGgsnSentGPDUs",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.4",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of G-PDU messages sent. Trigger Condition: This counter is updated whenever a G-PDU is sent out by the GGSN."
  },
  "cGgsnReceivedGPDUs": {
    "name": "cGgsnReceivedGPDUs",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.5",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of G-PDU messages received. Trigger Condition: This counter is incremented for each G-PDU received."
  },
  "cGgsnSentGPDUOctets": {
    "name": "cGgsnSentGPDUOctets",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.6",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "bytes",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The number of total bytes sent in G-PDU messages. Trigger Condition: This counter is updated whenever a G-PDU is sent out by the GGSN."
  },
  "cGgsnReceivedGPDUOctets": {
    "name": "cGgsnReceivedGPDUOctets",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.7",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "bytes",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The number of total bytes received in G-PDU messages. Trigger Condition: This counter is incremented for each G-PDU received."
  },
  "cGgsnUnexpectedGPDUs": {
    "name": "cGgsnUnexpectedGPDUs",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.8",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of unexpected G-PDU messages, for example, non existent PDP contexts and ACL denial. Trigger Condition: This counter is updated whenever an unexpected G-PDU message is received. Conditions include, a) G-PDU for a non existent PDP. b) ACL denial."
  },
  "cGgsnActivationRejectedPdps": {
    "name": "cGgsnActivationRejectedPdps",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.9",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of PDP contexts that the activation request was rejected. Trigger Condition: This counter is updated when a PDP activation request is rejected. The cause for rejection can be a) Resource limitations like max PDP limit is reached, Out of memory. b) Config restrictions like trying to create NIPDP on an APN on which the same is disabled, c) Creating secondary contexts on PPP/PPP-Regen PDPs."
  },
  "cGgsnOutOfResourcePdps": {
    "name": "cGgsnOutOfResourcePdps",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.10",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of PDP contexts that the activation request rejected due to the GGSN running out of resources for transmitting GTP packets. Examples: - Out of memory; - The number of PDPs on GGSN reached limit; - all dynamic PDP address are occupied; Trigger Condition: a) Out of memory. b) Number of PDPs on GGSN reached limit. c) Number of of PPP-regen PDPs reaches max limit. d) All dynamic PDP address are occupied. e) Incorrect configs for create pdp req. f) Qos negotiation fails. g) Create PDP req received for non-transparent APN but no radius server is present for authorization. h) Attempt to create a PDP with IP address that is already in use. i) Attempt to create a PPP-Regen PDP but the vtemplate for PPP-regen is not properly configured or VPDN configs are not proper. j) Number of pending signalling messages that needs to be processed by the GGSN is beyond the max limit(100)."
  },
  "cGgsnParserErrorMessages": {
    "name": "cGgsnParserErrorMessages",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.11",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of GTP messages received with wrong value. It includes the following cases: - mandatory and optional information element in the GTP packet is duplicated, missing, unknown, incorrect or out of order. - the GTP message is too short to hold the GTP header for the supported version. - the GTP messages running an unsupported version of GTP. - Unknown GTP message type. Trigger Condition: This counter is triggered when a signalling message is received with parsing related errors such as missing/unknown/invalid/unexpected/duplicate mandatory/optional IE's in the messages."
  },
  "cGgsnTotalCreatedPdps": {
    "name": "cGgsnTotalCreatedPdps",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.12",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object represents the total number of PDP contexts created. Trigger Condition: This counter is updated whenever a PDP context is created. This includes static, dynamic, IP, PPP, network init PDPs."
  },
  "cGgsnTotalDeletedPdps": {
    "name": "cGgsnTotalDeletedPdps",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.13",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object represents the total number of PDP contexts deleted. Trigger Condition: This counter is updated whenever a PDP context is deleted. This includes static, dynamic, IP, PPP, network init PDPs."
  },
  "cGgsnTotalNetworkInitPdps": {
    "name": "cGgsnTotalNetworkInitPdps",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.14",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object represents the total number of PDP contexts activated by the GGSN that were initiated by the PDN. Trigger Condition: This counter will be updated on successful creation of network initiated PDP."
  },
  "cGgsnTotalPppPdpsCreated": {
    "name": "cGgsnTotalPppPdpsCreated",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.15",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object represents the total number of PPP PDP contexts created. Trigger Condition: This counter is updated whenever a PPP PDP context is created."
  },
  "cGgsnTotalPppPdpsDeleted": {
    "name": "cGgsnTotalPppPdpsDeleted",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.16",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object represents the total number of PPP PDP contexts deleted. Trigger Condition: This counter is updated whenever a PPP PDP context is deleted."
  },
  "cGgsnOutOfResourcePppRegenPdps": {
    "name": "cGgsnOutOfResourcePppRegenPdps",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.17",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object represents the total number of create PDP context and delete PDP context requests rejected due to unavailable resource on the GGSN for PPP regeneration. Trigger Condition: a) Out of memory. b) Number of PPP-regen PDPs reaches max limit. c) All dynamic PDP address are occupied. d) Attempt to create a PPP-Regen PDP but the vtemplate for PPP-regen is not properly configured or VPDN configs are not proper."
  },
  "cGgsnDroppedPppRegenPdps": {
    "name": "cGgsnDroppedPppRegenPdps",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.18",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object represents the total number of create PDP context and delete PDP context requests that were dropped due to the threshold limit being reached for maximum number of PPP regeneration sessions allowed on the GGSN. Trigger Condition: This counter is updated when a new PPP regen PDP activation request is received by GGSN and max allowed PPP Regen session is reached."
  },
  "cGgsnTftSemanticErrorPdps": {
    "name": "cGgsnTftSemanticErrorPdps",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.19",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "3GPP; Technical Specification Group Core Network; General Packet Radio Service(GPRS); GPRS Tunnelling Protocol (GTP) across Gn and Gp Interface (Release 1999). 3G TS 29.060 v3.5.0.",
    "status": "current",
    "description": "This object represents the total number of received PDP context messages that had TFTs with semantic errors. Trigger Condition: This counter is triggered by the create, update PDP context request message."
  },
  "cGgsnTftSyntacticErrorPdps": {
    "name": "cGgsnTftSyntacticErrorPdps",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.20",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "3GPP; Technical Specification Group Core Network; General Packet Radio Service(GPRS); GPRS Tunnelling Protocol (GTP) across Gn and Gp Interface (Release 1999). 3G TS 29.060 v3.5.0.",
    "status": "current",
    "description": "This object represents the total number of received PDP context messages that had TFTs with syntactic errors. Trigger Condition: This counter is triggered by the create, update PDP context request message."
  },
  "cGgsnPktFilterSemanticErrorPdps": {
    "name": "cGgsnPktFilterSemanticErrorPdps",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.21",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "3GPP; Technical Specification Group Core Network; General Packet Radio Service(GPRS); GPRS Tunnelling Protocol (GTP) across Gn and Gp Interface (Release 1999). 3G TS 29.060 v3.5.0.",
    "status": "current",
    "description": "This object represents the total number of received PDP context messages that had packet filters with semantic errors. Trigger Condition: This counter is triggered by the create, update PDP context request message."
  },
  "cGgsnPktFilterSyntacticErrorPdps": {
    "name": "cGgsnPktFilterSyntacticErrorPdps",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.22",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "3GPP; Technical Specification Group Core Network; General Packet Radio Service(GPRS); GPRS Tunnelling Protocol (GTP) across Gn and Gp Interface (Release 1999). 3G TS 29.060 v3.5.0.",
    "status": "current",
    "description": "This object represents the total number of received PDP context messages that had packet filters with syntactic errors. Trigger Condition: This counter is triggered by the create, update PDP context request message."
  },
  "cGgsnHCSentGPDUOctets": {
    "name": "cGgsnHCSentGPDUOctets",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.23",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "bytes",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of total bytes sent in G-PDU messages. Trigger Condition: This counter is updated whenever a G-PDU is sent out by the GGSN."
  },
  "cGgsnHCReceivedGPDUOctets": {
    "name": "cGgsnHCReceivedGPDUOctets",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.24",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "bytes",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of total bytes received in G-PDU messages. Trigger Condition: This counter is incremented for each G-PDU received."
  },
  "cGgsnPdpsRejStatistics": {
    "name": "cGgsnPdpsRejStatistics",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.25",
    "class": "objectidentity"
  },
  "cGgsnVersionNotSupportedRejPdps": {
    "name": "cGgsnVersionNotSupportedRejPdps",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.25.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The number of PDP contexts that were rejected due to the cause of Version Not Supported. Trigger Condition: This counter is triggered by create/update PDP / PPP PDP context request message. This object is deprecated by cGgsnVersionNotSupportedMsgs."
  },
  "cGgsnUnkownMessageRejPdps": {
    "name": "cGgsnUnkownMessageRejPdps",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.25.2",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The number of PDP contexts that were rejected due to the cause of Unknown Message. Trigger Condition: This counter is triggered by create/update PDP / PPP PDP context request message. This object is deprecated by cGgsnUnkownGtpMsgs."
  },
  "cGgsnMsgTooShortRejPdps": {
    "name": "cGgsnMsgTooShortRejPdps",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.25.3",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The number of PDP contexts that were rejected due to the cause of Message Too Short. Trigger Condition: This counter is triggered by create/update PDP / PPP PDP context request message. This object is deprecated by cGgsnTooShortMsgs."
  },
  "cGgsnMandIeMissingRejPdps": {
    "name": "cGgsnMandIeMissingRejPdps",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.25.4",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The number of PDP contexts that were rejected due to the cause of Mandatory IE Missing. Trigger Condition: This counter is triggered by create/update PDP / PPP PDP context request message. This object is deprecated by cGgsnMandIeMissingMsgs."
  },
  "cGgsnMandIeIncorrectRejPdps": {
    "name": "cGgsnMandIeIncorrectRejPdps",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.25.5",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The number of PDP contexts that were rejected due to the cause of Mandatory IE Incorrect. Trigger Condition: This counter is triggered by create/update PDP / PPP PDP context request message. This object is deprecated by cGgsnMandIeIncorrectMsgs."
  },
  "cGgsnOptIeInvalidRejPdps": {
    "name": "cGgsnOptIeInvalidRejPdps",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.25.6",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The number of PDP contexts that rejected due to the cause of Optional IE Invalid. Trigger Condition: This counter is triggered by create/update PDP / PPP PDP context request message. This object is deprecated by cGgsnOptIeInvalidMsgs."
  },
  "cGgsnIeUnknownRejPdps": {
    "name": "cGgsnIeUnknownRejPdps",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.25.7",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The number of PDP contexts that rejected due to the cause of IE Unknown. Trigger Condition: This counter is triggered by create/update PDP / PPP PDP context request message. This object is deprecated by cGgsnIeUnknownMsgs."
  },
  "cGgsnIeOutOfOrderRejPdps": {
    "name": "cGgsnIeOutOfOrderRejPdps",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.25.8",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The number of PDP contexts that rejected due to the cause of IE Out of Order. Trigger Condition: This counter is triggered by create/update PDP / PPP PDP context request message. This object is deprecated by cGgsnIeOutOfOrderMsgs."
  },
  "cGgsnIeUnexpectedRejPdps": {
    "name": "cGgsnIeUnexpectedRejPdps",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.25.9",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The number of PDP contexts that rejected due to the cause of IE Unexpected. Trigger Condition: This counter is triggered by create/update PDP / PPP PDP context request message. This object is deprecated by cGgsnIeUnexpectedMsgs."
  },
  "cGgsnIeDuplicatedRejPdps": {
    "name": "cGgsnIeDuplicatedRejPdps",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.25.10",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The number of PDP contexts that rejected due to the cause of IE Duplicated. Trigger Condition: This counter is triggered by create/update PDP / PPP PDP context request message. This object is deprecated by cGgsnIeDuplicatedMsgs."
  },
  "cGgsnOptIeIncorrectRejPdps": {
    "name": "cGgsnOptIeIncorrectRejPdps",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.25.11",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The number of PDP contexts that rejected due to the cause of Optional IE Incorrect. Trigger Condition: This counter is triggered by create/update PDP / PPP PDP context request message. This object is deprecated by cGgsnOptIeIncorrectMsgs."
  },
  "cGgsnPdpWithoutTftExistsRejPdps": {
    "name": "cGgsnPdpWithoutTftExistsRejPdps",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.25.12",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The number of PDP contexts that are rejected due to the cause of PDP context without TFT already exists. Trigger Condition: This counter is triggered by create/update PDP / PPP PDP context request message. This object is deprecated by cGgsnPdpWithoutTftExistsPdps."
  },
  "cGgsnSgsnStatTable": {
    "name": "cGgsnSgsnStatTable",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.26",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table has the statistics of the interface (Gi, Gn, Gp) upstream and downstream traffic per SGSN for a configurable duration set in cGgsnThruputIntervalOne and cGgsnThruputIntervalTwo. Creation of row(s) will happen when there is a valid value set to cGgsnThruputIntervalOne or cGgsnThruputIntervalTwo and when a PATH is established. Deletion of row(s) will happen when either the PATH gets removed or the throughput intervals(cGgsnThruputIntervalOne, cGgsnThruputIntervalTwo) is unset."
  },
  "cGgsnSgsnStatEntry": {
    "name": "cGgsnSgsnStatEntry",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.26.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-GTP-MIB",
        "object": "cGtpPathAddressType",
        "implied": 0
      },
      {
        "module": "CISCO-GTP-MIB",
        "object": "cGtpPathAddress",
        "implied": 0
      },
      {
        "module": "CISCO-GTP-MIB",
        "object": "cGtpPathPort",
        "implied": 0
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSgsnThruPutInterval",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry in this table."
  },
  "cGgsnSgsnThruPutInterval": {
    "name": "cGgsnSgsnThruPutInterval",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.26.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 65535
          }
        ]
      }
    },
    "units": "minutes",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This object should be one of the values set in the objects cGgsnThruputIntervalOne or cGgsnThruputIntervalTwo except for value '0', which means the throughput collection is disabled."
  },
  "cGgsnSgsnThruPutLastCollected": {
    "name": "cGgsnSgsnThruPutLastCollected",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.26.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 65535
          }
        ]
      }
    },
    "units": "minutes",
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object represents the delta value between the time when this data is collected and the time it is been retrieved."
  },
  "cGgsnSgsnUpStreamPktCnt": {
    "name": "cGgsnSgsnUpStreamPktCnt",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.26.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object represents the total number of upstream packets sent on this SGSN data path. Data flow from MS to PDN is considered to be upstream traffic. When the throughput intervals (cGgsnThruputIntervalOne or cGgsnThruputIntervalTwo) is set to some valid value this object is set to '0' (meaning, a fresh throughput collection is started). Until the first expiry of the throughput interval , this object will be '0'. On further periodic expiry, the throughput upstream packet count per SGSN is collected and updated to this object"
  },
  "cGgsnSgsnUpStreamByteCnt": {
    "name": "cGgsnSgsnUpStreamByteCnt",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.26.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "units": "bytes",
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object represents the total number of upstream bytes sent on this SGSN data path. Data flow from MS to PDN is considered to be upstream traffic. When the throughput intervals (cGgsnThruputIntervalOne or cGgsnThruputIntervalTwo) is set to some valid value this object is set to '0' (meaning, a fresh throughput collection is started). Until the first expiry of the throughput interval , this object will be '0'. On further periodic expiry, the throughput upstream byte count per SGSN is collected and updated to this object"
  },
  "cGgsnSgsnDownStreamPktCnt": {
    "name": "cGgsnSgsnDownStreamPktCnt",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.26.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object represents the total number of downstream packets sent on this SGSN data path. Data flow from PDN to MS is considered to be downstream traffic. When the throughput interval (cGgsnThruputIntervalOne or cGgsnThruputIntervalTwo) is set to some valid value, this object is set to '0' (meaning, a fresh throughput collection is started). Until the first expiry of the throughput interval , this object will be '0'. On further periodic expiry, the throughput downstream packet count per SGSN is collected and updated to this object."
  },
  "cGgsnSgsnDownStreamByteCnt": {
    "name": "cGgsnSgsnDownStreamByteCnt",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.26.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "units": "bytes",
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object represents the total number of downstream bytes sent on this SGSN data path. Data flow from PDN to MS is considered to be downstream traffic. When the throughput interval (cGgsnThruputIntervalOne or cGgsnThruputIntervalTwo) is set to some valid value, this object is set to '0' (meaning, a fresh throughput collection is started). Until the first expiry of the throughput interval , this object will be '0'. On further periodic expiry, the throughput downstream byte count per SGSN is collected and updated to this object."
  },
  "cGgsnRedundancyStatistics": {
    "name": "cGgsnRedundancyStatistics",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.27",
    "class": "objectidentity"
  },
  "cGgsnTotalMessages": {
    "name": "cGgsnTotalMessages",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.27.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This counter will maintain the count of total number of messages of all kind. Trigger Condition: The counter is increamented whenever a redundancy message is sent."
  },
  "cGgsnContextSetupMessages": {
    "name": "cGgsnContextSetupMessages",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.27.2",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The PDP context is check pointed to standby only after it goes to active. This object is a counter, which maintains the total count of PDP context setup messages. Trigger Condition: This counter is updated whenever a PDP context setup message is check pointed to standby."
  },
  "cGgsnContextModifyMessages": {
    "name": "cGgsnContextModifyMessages",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.27.3",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "For modify or update PDP context, the categories get affected and new quota is assigned to them. This new info must be check pointed to the standby. This object maintains the total number of context modify messages which are check pointed to standby. Trigger Condition: This counter is incremented whenever a context modify message is check pointed to standby."
  },
  "cGgsnContextRemoveMessages": {
    "name": "cGgsnContextRemoveMessages",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.27.4",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "When the PDP context is deleted, deletion event is check pointed to the standby, so that the corresponding backup context deleted as well. This object will maintain the total number of context removed messages which are check pointed to standby. Trigger Condition: The counter is incremented for every context remove message, which is check pointed."
  },
  "cGgsnPathSetupMessages": {
    "name": "cGgsnPathSetupMessages",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.27.5",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Messages (of any kind PDP create/delete etc)indicate the presence of other GSN. Path is setup between the GSNs when they transmit the messages. This object contains the number of path setup messages between SGSN and GGSN. Trigger Condition: This counter is updated for every path setup messages sent."
  },
  "cGgsnPathModifyMessages": {
    "name": "cGgsnPathModifyMessages",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.27.6",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object will contain the total number of path Modify messages. The IE recovery count is used to indicate restart of other GSN. Any change related to path or GSN will be check pointed to standby. Trigger Condition: This counter is incremented for every change related to path."
  },
  "cGgsnPathRemoveMessages": {
    "name": "cGgsnPathRemoveMessages",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.27.7",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object will keep track of all the messages which are responsible for path removal between the GSNs. As long as context remain established, the path between the GSNs is alive. In an instant where the last context is released and the echo timer is not enabled, the path timer is started within which the PDP context is expected to keep the path live, when the timer expires, path is Removed. Trigger Condition: This timer is triggered when the path between the GSNs is removed."
  },
  "cGgsnCGFReadyMessages": {
    "name": "cGgsnCGFReadyMessages",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.27.8",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The charging information are sent from GGSN to charging gateway. GTP' protocol is used between them. This object will consists of total number of CGF ready messages. Trigger Condition: The counter is incremented when CGF ready message is check pointed to standby."
  },
  "cGgsnCGFModifyMessages": {
    "name": "cGgsnCGFModifyMessages",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.27.9",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Significant information related to change in state of CGF must be check pointed to GGSN. This object indicates the total number of CGF modify messages recieved. Trigger condition: This counter is triggered when there is a change in CGF state."
  },
  "cGgsnCGFRemoveMessages": {
    "name": "cGgsnCGFRemoveMessages",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.27.10",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object maintains the count for all the messages responsible for CGF removal Trigger Condition: This counter is triggered when context is deleted."
  },
  "cGgsnInternalStateMsgs": {
    "name": "cGgsnInternalStateMsgs",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.27.11",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The GGSN certain information which are sent out to other GSN's (SGSN) and CGF. On failover these information must be consistent. Information like, IE recovery count sent to the other GSN's for path management, local record sequence number and charging ID etc. Trigger Condition: The counter is incremented for each of these kind of messages."
  },
  "cGgsnSlbCacFailures": {
    "name": "cGgsnSlbCacFailures",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.28",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object will keep track of number of CAC Failure notifications sent to SLB. Trigger Condition: The counter is incremented whenever GGSN sends CAC failure notification to SLB."
  },
  "cGgsnSlbSessionFailures": {
    "name": "cGgsnSlbSessionFailures",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.29",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object will keep track of number of Session failure notifications sent to SLB. Trigger Condition: The counter is incremented whenever GGSN sends Session failure notification to SLB."
  },
  "cGgsnTotalCreatedIpv6Pdps": {
    "name": "cGgsnTotalCreatedIpv6Pdps",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.30",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "PDPs",
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object represents the total number of successfully created ipv6 PDP contexts. Trigger Condition: The counter is incremented whenever a ipv6 PDP context is created. This includes static, dynamic, IP PDPs."
  },
  "cGgsnTotalDeletedIpv6Pdps": {
    "name": "cGgsnTotalDeletedIpv6Pdps",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.31",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "PDPs",
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object represents the total number of ipv6 PDP contexts deleted. Trigger Condition: The counter is incremented whenever a ipv6 PDP context is deleted. This includes static, dynamic, IP, PPP PDPs."
  },
  "cGgsnTotalRejectedIpv6Pdps": {
    "name": "cGgsnTotalRejectedIpv6Pdps",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.32",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "PDPs",
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object represents the total number of rejected ipv6 PDP context activation requests. Trigger Condition: The counter is incremented when a ipv6 PDP activation request is rejected."
  },
  "cGgsnSentIpv6SigMessages": {
    "name": "cGgsnSentIpv6SigMessages",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.33",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "messages",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The total number of GTP signalling messages related to the IPv6 PDP sent by GGSN. Trigger Condition: The counter is incremented whenever a GTP signalling message for IPv6 PDP is sent out, including retries."
  },
  "cGgsnReceivedIpv6SigMessages": {
    "name": "cGgsnReceivedIpv6SigMessages",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.34",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "messages",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The total number of GTP signalling messages related to the IPv6 PDP received by GGSN. Trigger Condition: The counter is incremented whenever a GTP signalling message for IPv6 PDP is received."
  },
  "cGgsnSentIpv6PDUs": {
    "name": "cGgsnSentIpv6PDUs",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.35",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of ipv6 data packets sent by GGSN. Trigger Condition: The counter is incremented whenever a G-PDU is sent out by the GGSN."
  },
  "cGgsnReceivedIpv6PDUs": {
    "name": "cGgsnReceivedIpv6PDUs",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.36",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of ipv6 data packets receivd by GGSN. Trigger Condition: This counter is incremented for each G-PDU received."
  },
  "cGgsnSentIpv6PDUOctets": {
    "name": "cGgsnSentIpv6PDUOctets",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.37",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "bytes",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of ipv6 data bytes sent, in PDU messages, by GGSN. Trigger Condition: The counter is incremented whenever a G-PDU is sent out by the GGSN."
  },
  "cGgsnReceivedIpv6PDUOctets": {
    "name": "cGgsnReceivedIpv6PDUOctets",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.38",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter64",
      "class": "type"
    },
    "units": "bytes",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of ipv6 data bytes received, in PDU messages, by GGSN. Trigger Condition: The counter is incremented for each G-PDU received."
  },
  "cGgsnVersionNotSupportedMsgs": {
    "name": "cGgsnVersionNotSupportedMsgs",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.39",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "messages",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of GTP messages received from devices running an unsupported version of the GTP."
  },
  "cGgsnUnkownGtpMsgs": {
    "name": "cGgsnUnkownGtpMsgs",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.40",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "messages",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of unknown GTP messages received."
  },
  "cGgsnTooShortMsgs": {
    "name": "cGgsnTooShortMsgs",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.41",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "messages",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of GTP messages received that are too short to hold the GTP header for the supported GTP version."
  },
  "cGgsnMandIeMissingMsgs": {
    "name": "cGgsnMandIeMissingMsgs",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.42",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "messages",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of GTP messages received with a missing mandatory information element."
  },
  "cGgsnMandIeIncorrectMsgs": {
    "name": "cGgsnMandIeIncorrectMsgs",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.43",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "messages",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of GTP messages received with an incorrect mandatory information element, for example, with an information element that has an incorrect length."
  },
  "cGgsnOptIeInvalidMsgs": {
    "name": "cGgsnOptIeInvalidMsgs",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.44",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "messages",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of GTP messages received with an information element that contains a value that is not within the defined range for that IE. GTP messages with invalid optional IEs are processed as if the IE was not present."
  },
  "cGgsnIeUnknownMsgs": {
    "name": "cGgsnIeUnknownMsgs",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.45",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "messages",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of GTP messages received with an information element of an unknown type."
  },
  "cGgsnIeOutOfOrderMsgs": {
    "name": "cGgsnIeOutOfOrderMsgs",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.46",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "messages",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of GTP messages received with an information element out of order."
  },
  "cGgsnIeUnexpectedMsgs": {
    "name": "cGgsnIeUnexpectedMsgs",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.47",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "messages",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of GTP messages received with an information element that is not expected in the GTP message, but is defined in GTP. GTP messages with unexpected IEs are processed as if the IE was not present."
  },
  "cGgsnIeDuplicatedMsgs": {
    "name": "cGgsnIeDuplicatedMsgs",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.48",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "messages",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of GTP messages received with a duplicated information element."
  },
  "cGgsnOptIeIncorrectMsgs": {
    "name": "cGgsnOptIeIncorrectMsgs",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.49",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "messages",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of GTP messages received with an optional IE that is incorrect, which prevents the GGSN from processing the GTP message correctly."
  },
  "cGgsnPdpWithoutTftExistsPdps": {
    "name": "cGgsnPdpWithoutTftExistsPdps",
    "oid": "1.3.6.1.4.1.9.9.240.1.1.50",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of create PDP context requests received without traffic flow template information element."
  },
  "cGgsnNotifEnabled": {
    "name": "cGgsnNotifEnabled",
    "oid": "1.3.6.1.4.1.9.9.240.1.2.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "deprecated",
    "description": "Indicates whether cGgsnNotification notification will be sent when a notification is generated by the device. - 'true', it will enable the device to send a notification, as well as logging the notification to the cGgsnHistNotifTable. - 'false', it will prevent the device from sending out a notification, but it will still log the notification into cGgsnHistNotifTable."
  },
  "cGgsnNotifLeastSeverLevel": {
    "name": "cGgsnNotifLeastSeverLevel",
    "oid": "1.3.6.1.4.1.9.9.240.1.2.2",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "CiscoAlarmSeverity",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "info",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Indicates the least severity level of the cGgsnNotification notifications to be generated by the device. Thus, notifications are not generated for alarms with a severity level less urgent than the value of this object. This object cannot be set to cleared(1) or indeterminate(2)."
  },
  "cGgsnGeneratedNotifs": {
    "name": "cGgsnGeneratedNotifs",
    "oid": "1.3.6.1.4.1.9.9.240.1.2.3",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "notifications",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of cGgsnNotification notifications that have been generated since sysUpTime."
  },
  "cGgsnIgnoredAlarms": {
    "name": "cGgsnIgnoredAlarms",
    "oid": "1.3.6.1.4.1.9.9.240.1.2.4",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "notifications",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of alarms which are less severe than cGgsnNotifLeastSeverLevel since sysUpTime, and thus, for which no notification was generated."
  },
  "cGgsnHistNotifMaxLength": {
    "name": "cGgsnHistNotifMaxLength",
    "oid": "1.3.6.1.4.1.9.9.240.1.2.5",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 2147483647
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 100,
        "format": "decimal"
      }
    },
    "units": "entries",
    "maxaccess": "read-write",
    "status": "current",
    "description": "The maximum number of entries to be retained in the cGgsnHistNotifTable. When the table is full, the oldest entries are removed to make space for new entries."
  },
  "cGgsnHistNotifLatestIndex": {
    "name": "cGgsnHistNotifLatestIndex",
    "oid": "1.3.6.1.4.1.9.9.240.1.2.6",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 4294967295
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The value of cGgsnHistNotifIndex for the most recently created entry in cGgsnHistNotifTable."
  },
  "cGgsnHistNotifTable": {
    "name": "cGgsnHistNotifTable",
    "oid": "1.3.6.1.4.1.9.9.240.1.2.7",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A history table of the most recent cGgsnNotification notifications generated by this device. If a new cGgsnNotification notification is generated when the number of entries is equal to cGgsnHistNotifMaxLength, then the oldest entry is deleted and replaced with an entry for the latest notification."
  },
  "cGgsnHistNotifEntry": {
    "name": "cGgsnHistNotifEntry",
    "oid": "1.3.6.1.4.1.9.9.240.1.2.7.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Detailed information concerning a particular notification that previously generated from this device."
  },
  "cGgsnHistNotifIndex": {
    "name": "cGgsnHistNotifIndex",
    "oid": "1.3.6.1.4.1.9.9.240.1.2.7.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 4294967295
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A monotonically increasing integer for the sole purpose of indexing notifications. When it reaches the maximum value, it wraps the value back to 1."
  },
  "cGgsnHistNotifType": {
    "name": "cGgsnHistNotifType",
    "oid": "1.3.6.1.4.1.9.9.240.1.2.7.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "ggsnServiceUp": 1,
          "ggsnServiceDown": 2,
          "mapSgsnUp": 3,
          "mapSgsnDown": 4,
          "noResource": 5,
          "noRADIUS": 6,
          "noDHCPServer": 7,
          "ipAllocationFail": 8,
          "authenticationFail": 9,
          "apnUnreachable": 10
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the type of notification."
  },
  "cGgsnHistNotifSeverity": {
    "name": "cGgsnHistNotifSeverity",
    "oid": "1.3.6.1.4.1.9.9.240.1.2.7.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CiscoAlarmSeverity",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the severity level of the notification. This object cannot be set to cleared(1) or indeterminate(2)."
  },
  "cGgsnHistNotifTimestamp": {
    "name": "cGgsnHistNotifTimestamp",
    "oid": "1.3.6.1.4.1.9.9.240.1.2.7.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TimeStamp",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the value of sysUpTime when this notification was generated."
  },
  "cGgsnHistNotifGgsnIpAddrType": {
    "name": "cGgsnHistNotifGgsnIpAddrType",
    "oid": "1.3.6.1.4.1.9.9.240.1.2.7.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressType",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the type of Internet address by which cGgsnHistNotifGgsnIpAddr is reachable."
  },
  "cGgsnHistNotifGgsnIpAddr": {
    "name": "cGgsnHistNotifGgsnIpAddr",
    "oid": "1.3.6.1.4.1.9.9.240.1.2.7.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The object indicates the IP address that uniquely identifies the device which generated the notification."
  },
  "cGgsnHistNotifInfo": {
    "name": "cGgsnHistNotifInfo",
    "oid": "1.3.6.1.4.1.9.9.240.1.2.7.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 64
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A textual description of cGgsnHistNotifType, which potentially contains additional information (more than just the type of alarm). If the text of the message exceeds 64 bytes, the message will be truncated to 63 bytes and a '*' character will be appended to indicate the message has been truncated."
  },
  "cGgsnServiceNotifEnabled": {
    "name": "cGgsnServiceNotifEnabled",
    "oid": "1.3.6.1.4.1.9.9.240.1.2.8",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Indicates whether cGgsnInServiceNotif notification and cGgsnMaintenanceNotif notification will be sent when a notification is generated by the device. - 'true', it will enable the device to send a notification. - 'false', it will prevent the device from sending out a notification."
  },
  "cGgsnMemoryNotifEnabled": {
    "name": "cGgsnMemoryNotifEnabled",
    "oid": "1.3.6.1.4.1.9.9.240.1.2.9",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Indicates whether cGgsnMemThresholdReachedNotif notification and cGgsnMemThresholdClearedNotif notification will be sent when a notification is generated by the device. - 'true', it will enable the device to send a notification. - 'false', it will prevent the device from sending out a notification."
  },
  "cGgsnPdfNotifEnabled": {
    "name": "cGgsnPdfNotifEnabled",
    "oid": "1.3.6.1.4.1.9.9.240.1.2.10",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "deprecated",
    "description": "Indicates whether cGgsnPdfStateUpNotif notification and cGgsnPdfStateDownNotiff notification will be sent when a notification is generated by the device. - 'true', it will enable the device to send a notification. - 'false', it will prevent the device from sending out a notification."
  },
  "cGgsnGlobalErrorNotifEnabled": {
    "name": "cGgsnGlobalErrorNotifEnabled",
    "oid": "1.3.6.1.4.1.9.9.240.1.2.11",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Indicates whether cGgsnGlobalErrorNotif notification will be sent when a notification is generated by the device. - 'true', it will enable the device to send a notification. - 'false', it will prevent the device from sending out a notification."
  },
  "cGgsnAccessPointNotifEnabled": {
    "name": "cGgsnAccessPointNotifEnabled",
    "oid": "1.3.6.1.4.1.9.9.240.1.2.12",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Indicates whether cGgsnAccessPointNameNotif notification will be sent when a notification is generated by the device. - 'true', it will enable the device to send a notification. - 'false', it will prevent the device from sending out a notification."
  },
  "cGgsnPdpNotifEnabled": {
    "name": "cGgsnPdpNotifEnabled",
    "oid": "1.3.6.1.4.1.9.9.240.1.2.13",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Indicates whether cGgsnPacketDataProtocolNotif notification will be sent when a notification is generated by the device. - 'true', it will enable the device to send a notification. - 'false', it will prevent the device from sending out a notification."
  },
  "cGgsnDefaultIpAllocationMethod": {
    "name": "cGgsnDefaultIpAllocationMethod",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "disable": 1,
          "dhcp": 2,
          "radius": 3
        }
      }
    },
    "default": {
      "default": {
        "value": "disable",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Specifies the default method by which the GGSN obtains address leases for mobile user sessions. - 'disable', which indicates that dynamic address allocation is disabled. - 'dhcp', which indicates that the DHCP server will be used. - 'radius', which indicates that the radius server will be used."
  },
  "cGgsnIdlePdpPurgeTimer": {
    "name": "cGgsnIdlePdpPurgeTimer",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.2",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 255
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 72,
        "format": "decimal"
      }
    },
    "units": "hours",
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object specifies the time that the GGSN waits before purging idle PDP contexts. A value '0' will disable the purge timer."
  },
  "cGgsnIpDupProtectTable": {
    "name": "cGgsnIpDupProtectTable",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.3",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains the range of IP address used in the GPRS PLMN. These IP addresses are used to avoid IP address duplication in GPRS network. IP address duplication occurs when a MS uses an IP address which is already used in the PLMN. The IP addresses configured inside GPRS network should be in these ranges and MS IP address should not be in this range."
  },
  "cGgsnIpDupProtectEntry": {
    "name": "cGgsnIpDupProtectEntry",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.3.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnMsExcludeRangeStartIpType",
        "implied": 0
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnMsExcludeRangeStartIp",
        "implied": 0
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnMsExcludeRangeEndIpType",
        "implied": 0
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnMsExcludeRangeEndIp",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Entry containing the start and end IP address in the address range. An Entry with start IP > end IP is not allowed. No new entry will be accepted if that would cause any IP address(es) to be represented by more than one row in this table."
  },
  "cGgsnMsExcludeRangeStartIpType": {
    "name": "cGgsnMsExcludeRangeStartIpType",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.3.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressType",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The type of Internet address by which cGgsnMsExcludeRangeStartIp is reachable. The value of this object should be same as cGgsnMsExcludeRangeEndIpType."
  },
  "cGgsnMsExcludeRangeStartIp": {
    "name": "cGgsnMsExcludeRangeStartIp",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.3.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 4,
            "max": 20
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Starting IP address in the address range."
  },
  "cGgsnMsExcludeRangeEndIpType": {
    "name": "cGgsnMsExcludeRangeEndIpType",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.3.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressType",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The type of Internet address by which cGgsnMsExcludeRangeEndIp is reachable. The value of this object should be same as cGgsnMsExcludeRangeStartIpType."
  },
  "cGgsnMsExcludeRangeEndIp": {
    "name": "cGgsnMsExcludeRangeEndIp",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.3.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 4,
            "max": 20
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Ending IP address in the address range."
  },
  "cGgsnIpDupProtectRowStatus": {
    "name": "cGgsnIpDupProtectRowStatus",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.3.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object is used to create a new row or delete an existing row in this table. To create a row, set this object to 'createAndGo' and the objects cGgsnMsExcludeRangeStartIpv6Prefixlen and cGgsnMsExcludeRangeEndIpv6Prefixlen should be set to valid values. To delete a row, set this object to 'destroy'."
  },
  "cGgsnMsExcludeRangeStartIpv6Prefixlen": {
    "name": "cGgsnMsExcludeRangeStartIpv6Prefixlen",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.3.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressPrefixLength",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object represents the IPv6 prefix length supplied for the cGgsnMsExcludeRangeStartIp.The value of this object will be zero when cGgsnMsExcludeRangeStartIpType is IPv4."
  },
  "cGgsnMsExcludeRangeEndIpv6Prefixlen": {
    "name": "cGgsnMsExcludeRangeEndIpv6Prefixlen",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.3.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressPrefixLength",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object represents the IPv6 prefix length supplied for the cGgsnMsExcludeRangeEndIp.The value of this object will be zero when cGgsnMsExcludeRangeEndIpType is IPv4."
  },
  "cGgsnDefaultAggregTable": {
    "name": "cGgsnDefaultAggregTable",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.4",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains the list of default aggregate routes configured on the GGSN. GGSN uses a static host route to forward user data packets for each PDP context received from Gi interface to Gn interface. Using the aggregate route (address range), the total number of static routes implemented in the GGSN for PDP requests can be greatly reduced."
  },
  "cGgsnDefaultAggregEntry": {
    "name": "cGgsnDefaultAggregEntry",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.4.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnDefaultAggregIpAddrType",
        "implied": 0
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnDefaultAggregIpAddr",
        "implied": 0
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnDefaultAggregIpMask",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An Entry contains the IP network prefix which is used to combine the routes of PDP requests for the same network as a single route on the GGSN."
  },
  "cGgsnDefaultAggregIpAddrType": {
    "name": "cGgsnDefaultAggregIpAddrType",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.4.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressType",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This object specifies the type of Internet address denoted by cGgsnDefaultAggregIpAddr."
  },
  "cGgsnDefaultAggregIpAddr": {
    "name": "cGgsnDefaultAggregIpAddr",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.4.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 4,
            "max": 20
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This object specifies the IP address whose network prefix is going to be defined by cGgsnDefaultAggregIpMask."
  },
  "cGgsnDefaultAggregIpMask": {
    "name": "cGgsnDefaultAggregIpMask",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.4.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CiscoInetAddressMask",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This object specifies the net-mask pertaining to cGgsnDefaultAggregIpAddr."
  },
  "cGgsnDefaultAggregRowStatus": {
    "name": "cGgsnDefaultAggregRowStatus",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.4.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object is used to create a new row or delete an existing row in this table. To create a row, set this object to 'createAndGo'. To delete a row, set this object to 'destroy'. The values 'createAndWait' and 'notInService' are not supported."
  },
  "cGgsnDefaultAaaAuthServerGroup": {
    "name": "cGgsnDefaultAaaAuthServerGroup",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.5",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object specifies the AAA radius server group that is used for authentication by all APN's on this GGSN."
  },
  "cGgsnDefaultAaaAccServerGroup": {
    "name": "cGgsnDefaultAaaAccServerGroup",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.6",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object specifies the AAA radius server group that is used for accounting by all APN's on this GGSN."
  },
  "cGgsnPppVirtualTemplate": {
    "name": "cGgsnPppVirtualTemplate",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.7",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "InterfaceIndexOrZero",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object represents the virtual template interface used by PPP Type PDP's."
  },
  "cGgsnPppRegenVirtualTemplate": {
    "name": "cGgsnPppRegenVirtualTemplate",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.8",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "InterfaceIndexOrZero",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object represents the virtual template interface used for PPP Regeneration by the APN's on which PPP Regeneration is configured. The value zero indicates that no interface is specified."
  },
  "cGgsnPlmnIpAddrRangeTable": {
    "name": "cGgsnPlmnIpAddrRangeTable",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.9",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains the range of IP addresses that belong to the PLMN nodes in a GPRS network. This range does not include address of various entities like RADIUS, DHCP, DNS servers, etc., which are not part of PLMN."
  },
  "cGgsnPlmnIpAddrRangeEntry": {
    "name": "cGgsnPlmnIpAddrRangeEntry",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.9.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPlmnAddrRangeIpAddrType",
        "implied": 0
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPlmnAddrRangeFirstIp",
        "implied": 0
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPlmnAddrRangeLastIp",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Entry containing the first and last IP address in the address range. An Entry with first-IP > last-IP is not allowed. No new entry will be accepted if that would cause any IP address(es) to be represented by more than one row in this table."
  },
  "cGgsnPlmnAddrRangeIpAddrType": {
    "name": "cGgsnPlmnAddrRangeIpAddrType",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.9.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressType",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The address type for cGgsnPlmnAddrRangeFirstIp and cGgsnPlmnAddrRangeLastIp addresses."
  },
  "cGgsnPlmnAddrRangeFirstIp": {
    "name": "cGgsnPlmnAddrRangeFirstIp",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.9.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 4,
            "max": 20
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "First IP address in the address range."
  },
  "cGgsnPlmnAddrRangeLastIp": {
    "name": "cGgsnPlmnAddrRangeLastIp",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.9.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 4,
            "max": 20
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Last IP address in the address range."
  },
  "cGgsnPlmnAddrRangeRowStatus": {
    "name": "cGgsnPlmnAddrRangeRowStatus",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.9.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object is used to create a new row or delete an existing row in this table. To create a row, set this object to 'createAndGo' and the objects cGgsnPlmnAddrRangeFirstIpv6Prefixlen and cGgsnPlmnAddrRangeLastIpv6Prefixlen should be set to valid values. To delete a row, set this object to 'destroy'. To modify a row, the row needs to be deleted and created fresh with new values."
  },
  "cGgsnPlmnAddrRangeUsage": {
    "name": "cGgsnPlmnAddrRangeUsage",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.9.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "security": 1,
          "sgsn": 2
        }
      }
    },
    "default": {
      "default": {
        "value": "security",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object specifies how the address range will be used by the GGSN. When set to 'security', the address range is used for GGSN security feature i.e. any TPDU with destination address that falls in this address range will be discarded. When set to 'sgsn', the address range denotes the sgsn address range in the local PLMN which can be used to check roaming MS."
  },
  "cGgsnPlmnAddrRangeFirstIpv6Prefixlen": {
    "name": "cGgsnPlmnAddrRangeFirstIpv6Prefixlen",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.9.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressPrefixLength",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object represents the IPv6 prefix length supplied for the cGgsnPlmnAddrRangeFirstIp .The value of this object will be zero when cGgsnPlmnAddrRangeFirstIpType is IPv4."
  },
  "cGgsnPlmnAddrRangeLastIpv6Prefixlen": {
    "name": "cGgsnPlmnAddrRangeLastIpv6Prefixlen",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.9.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressPrefixLength",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object represents the IPv6 prefix length supplied for the cGgsnPlmnAddrRangeLastIp .The value of this object will be zero when cGgsnPlmnAddrRangeLastIpType is IPv4."
  },
  "cGgsnImsConfigurations": {
    "name": "cGgsnImsConfigurations",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.10",
    "class": "objectidentity"
  },
  "cGgsnPdfTable": {
    "name": "cGgsnPdfTable",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.10.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "deprecated",
    "description": "This table contains the details of PDF server that the GGSN supports. The table elements describes their properties. PDF's are the server's to which the client GGSN makes the TCP connection using the COPS protocol over the Go interface. GGSN can have connections with multiple PDF's."
  },
  "cGgsnPdfEntry": {
    "name": "cGgsnPdfEntry",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.10.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPdfGroupName",
        "implied": 0
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPdfDomainName",
        "implied": 0
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPdfIpAddressType",
        "implied": 0
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPdfIpAddress",
        "implied": 0
      }
    ],
    "status": "deprecated",
    "description": "Entry containing the PDF servers details (name and IP address) and also how the GGSN should communicate with PDF, like timeout when there is no response, number of retries."
  },
  "cGgsnPdfGroupName": {
    "name": "cGgsnPdfGroupName",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.10.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 100
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "deprecated",
    "description": "This object specifies the PDF group name. Currently this group name is just an identity to this group."
  },
  "cGgsnPdfDomainName": {
    "name": "cGgsnPdfDomainName",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.10.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressDNS",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 100
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "deprecated",
    "description": "This is a Fully Qualified Domain Name (FQDN), which has to be configured along with the IP address of the PDF. There will be no name resolving for the FQDN, it will be used as it is."
  },
  "cGgsnPdfIpAddressType": {
    "name": "cGgsnPdfIpAddressType",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.10.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressType",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "deprecated",
    "description": "This object specifies the type of IP address of the PDF server."
  },
  "cGgsnPdfIpAddress": {
    "name": "cGgsnPdfIpAddress",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.10.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "deprecated",
    "description": "This object specifies the IP address of the PDF server. The type of the address is specified by the object cGgsnPdfIpAddressType."
  },
  "cGgsnPdfRowStatus": {
    "name": "cGgsnPdfRowStatus",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.10.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "deprecated",
    "description": "This object is used to create a new row or delete an existing row in this table. To create a row, set this object to 'createAndGo(4)'. To delete a row, set this object to 'destroy(6)'."
  },
  "cGgsnPdfReconnectTimeOut": {
    "name": "cGgsnPdfReconnectTimeOut",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.10.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 60
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 1,
        "format": "decimal"
      }
    },
    "units": "minutes",
    "maxaccess": "read-create",
    "status": "deprecated",
    "description": "Whenever a connection outage is detected (by keepalive mechanism etc.) by GGSN to the PDF server. The GGSN waits for the interval configured in this object. Once this timer is expired, another attempt is made for connection establishment."
  },
  "cGgsnPdfReconnectRetries": {
    "name": "cGgsnPdfReconnectRetries",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.10.1.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 10
          },
          {
            "min": 65535,
            "max": 65535
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 65535,
        "format": "decimal"
      }
    },
    "maxaccess": "read-create",
    "status": "deprecated",
    "description": "This is the number of attempts for connection establishment after the timeout value set in cGgsnPdfReconnectTimeOut. After the configured number of retries, all the COPS sessions (and associated PDP contexts) are cleared. The value '65535' which is default, will be infinite retries."
  },
  "cGgsnPdfReconExpPdpDelete": {
    "name": "cGgsnPdfReconExpPdpDelete",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.10.1.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "deprecated",
    "description": "This objects defines the handling of the PDP context in the connection loss scenario. When this object is set to true, then on connection loss, the PDP delete will be initiated."
  },
  "cGgsnPdfReqRetryTimeOut": {
    "name": "cGgsnPdfReqRetryTimeOut",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.10.1.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 60
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 1,
        "format": "decimal"
      }
    },
    "units": "seconds",
    "maxaccess": "read-create",
    "status": "deprecated",
    "description": "For each COPS REQ sent to PDF, GGSN will start a request retry timer with this value. If DEC is not received within the timeout, the REQ is resent for cGgsnPdfReqRetries times."
  },
  "cGgsnPdfReqRetries": {
    "name": "cGgsnPdfReqRetries",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.10.1.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 10
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 3,
        "format": "decimal"
      }
    },
    "maxaccess": "read-create",
    "status": "deprecated",
    "description": "This is the number of retries which has to be sent for the COPS REQ being sent. If DEC is not received even after sending the COPS REQ for configured number of retries, the PDP context activation/modification (which had triggered this REQ) is rejected."
  },
  "cGgsnPcscfTable": {
    "name": "cGgsnPcscfTable",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.10.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains the entries of P-CSCF groups with the addresses configured. One or more IP address can be configured per group name. This group in turn will be mapped to the APN. P-CSCF is a network element providing session management services. When the UE request the GGSN for P-CSCF address through activate PDP Request, these addresses will be returned to the UE in the order which they are configured."
  },
  "cGgsnPcscfEntry": {
    "name": "cGgsnPcscfEntry",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.10.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPcscfGroupName",
        "implied": 0
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPcscfIpAddressType",
        "implied": 0
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPcscfIpAddress",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry is created when the user configures the group name and an IP address is set."
  },
  "cGgsnPcscfGroupName": {
    "name": "cGgsnPcscfGroupName",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.10.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 100
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This group name is the identifier for the P-CSCF addresses configured."
  },
  "cGgsnPcscfIpAddressType": {
    "name": "cGgsnPcscfIpAddressType",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.10.2.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressType",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This object specifies the type of the P-CSCF IP address."
  },
  "cGgsnPcscfIpAddress": {
    "name": "cGgsnPcscfIpAddress",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.10.2.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This object specifies the IP address of the P-CSCF. The type of this address is specified by the object cGgsnPcscfIpAddressType."
  },
  "cGgsnPcscfRowStatus": {
    "name": "cGgsnPcscfRowStatus",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.10.2.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object is used to create a new row or delete an existing row in this table. To create a row, set this object to 'createAndGo(4)'. To delete a row, set this object to 'destroy(6)'."
  },
  "cGgsnMemoryThreshold": {
    "name": "cGgsnMemoryThreshold",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.11",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 1024
          }
        ]
      }
    },
    "units": "98304Bytes",
    "maxaccess": "read-write",
    "status": "current",
    "description": "GGSN memory overload protection is a mechanism to prevent GGSN from completely running out of memory when GGSN is running near its capacity or in some failure scenarios like CG down. A protection mechanism was put into place where charging triggers would be ignored, PDP create would be rejected, PDP update request will delete PDP, once the available memory on the GGSN drops below a configured threshold. Charging triggers occurs due to certain criteria's like volume limit, time limit. When one of the conditions is met , the CDR's are closed and will be updated to the charging gateway."
  },
  "cGgsnServiceMode": {
    "name": "cGgsnServiceMode",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.12",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "inService": 1,
          "maintenance": 2
        }
      }
    },
    "default": {
      "default": {
        "value": "inService",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "GGSN supports this GPRS service mode for maintenance purposes. Two modes are supported in GGSN, operational and maintenance mode. 'inService' mode represents nominal operation, and there will be no change in the way the GGSN operates. 'maintenance' mode imposes restrictions, such as some of the configurations allowed by the GGSN, and no new PDPs will be accepted. 'maintenance' mode can be useful to make some changes to the configuration of the GGSN without affecting the existing PDPs. 'maintenance' mode gloablly applies to the GGSN, which means the whole box will be put in maintenance mode. There also exists APN level maintenance mode, which is defined in CISCO-GPRS_ACC-PT-MIB, and charging maintenance mode which is defined in CISCO-GPRS-CHARGING-MIB, which is out of scope of this MIB. Internally GGSN maintains three states (inService, maintenance and outOfService ), which can be viewed with cGgsnServiceModeStatus. The SNMP entity generates notification when switching modes. It uses the cGgsnInServiceNotif and cGgsnMaintenanceNotif for this purpose."
  },
  "cGgsnPlmnTable": {
    "name": "cGgsnPlmnTable",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.13",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Mobile Country Code (MCC) and Mobile Network Code (MNC) together identify a GPRS PLMN of an operator. PLMN Ids other than home PLMNs are considered as foreign. There will be some situations where some foreign PLMNs has to be treated as trusted PLMNs. This table contains the list of PLMNs, there can be one home PLMN entry and multiple trusted PLMN entry."
  },
  "cGgsnPlmnEntry": {
    "name": "cGgsnPlmnEntry",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.13.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPlmnMcc",
        "implied": 0
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPlmnMnc",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Entry containing list of home PLMN Ids and the Trusted PLMN Ids."
  },
  "cGgsnPlmnMcc": {
    "name": "cGgsnPlmnMcc",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.13.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 3,
            "max": 3
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "reference": "Digital cellular telecommunications system (Phase 2+); Numbering, addressing and identification (GSM 03.03 version 7.3.0 Release 1998) Available SMG only",
    "status": "current",
    "description": "The Mobile Country Code (MCC) is part of the PLMN Id."
  },
  "cGgsnPlmnMnc": {
    "name": "cGgsnPlmnMnc",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.13.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 2,
            "max": 3
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "reference": "Digital cellular telecommunications system (Phase 2+); Numbering, addressing and identification (GSM 03.03 version 7.3.0 Release 1998) Available SMG only",
    "status": "current",
    "description": "The Mobile Network Code (MNC) is part of the PLMN Id."
  },
  "cGgsnPlmnRowStatus": {
    "name": "cGgsnPlmnRowStatus",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.13.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object is used to create a new row or delete an existing row in this table. To create a row, set this object to 'createAndGo'. To delete a row, set this object to 'destroy'. To modify a row, the row needs to be deleted and created fresh with new values."
  },
  "cGgsnPlmnScope": {
    "name": "cGgsnPlmnScope",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.13.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "home": 1,
          "trusted": 2
        }
      }
    },
    "default": {
      "default": {
        "value": "home",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object specifies whether the PLMN is home or trusted. Only one PLMN entry can be home"
  },
  "cGgsnSessionTimeout": {
    "name": "cGgsnSessionTimeout",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.14",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 0
          },
          {
            "min": 30,
            "max": 4294967
          }
        ]
      }
    },
    "units": "seconds",
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object specifies the PDP context timeout value. The PDP context will be terminated after this timer expiry. The value present in this will have meaning when the object cGgsnRadAttrSessTimeout is set to 'true' and if the attribute#27 not received from the AAA."
  },
  "cGgsnThruputIntervalOne": {
    "name": "cGgsnThruputIntervalOne",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.15",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 65535
          }
        ]
      }
    },
    "units": "minutes",
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object and cGgsnThruputIntervalTwo specifies the interval at which the data throughput needs to be collected per APN/SGSN. Once this object is set to some valid value, the data throughput collections gets started for per configured APN and per PATH created. The data throughput collection is updated periodically (each expiry of configured throughput interval) to the corresponding objects (cGgsnSgsnStatTable for per SGSN and cgprsAccPtThruputStatsTable for per APN). When this object is set to '0', the collection for this interval get stopped and the data related to this interval is deleted from the tables (cGgsnSgsnStatTable and cgprsAccPtThruputStatsTable). INCONSISTENT value SNMP error will happen when trying to set cGgsnThruputIntervalOne and cGgsnThruputIntervalTwo with same value expect '0'. Setting the same value to the same object will reset the value / collection status for that interval."
  },
  "cGgsnThruputIntervalTwo": {
    "name": "cGgsnThruputIntervalTwo",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.16",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 65535
          }
        ]
      }
    },
    "units": "minutes",
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object specifies the time interval TWO for collecting the throughput per APN/SGSN. This object is same as cGgsnThruputIntervalOne. It's just an option for a second throughput collection for a different throughput interval time. The value 0 means the timer TWO will be disabled. INCONSISTENT value SNMP error will happen when trying to set cGgsnThruputIntervalOne and cGgsnThruputIntervalTwo with same value expect '0'. Setting the same value to the same object will reset the value / collection status for that interval."
  },
  "cGgsnCompliance3GppGgsn": {
    "name": "cGgsnCompliance3GppGgsn",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.17",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "default": 0,
          "release40": 1
        }
      }
    },
    "default": {
      "default": {
        "value": "default",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "reference": "3GPP TS 29.060 v3.15.0/v4.6.0/v5.4.0",
    "status": "deprecated",
    "description": "This object specifies the compliance level for the particular GGSN version present in cGgsnVersion. This object can be used to set back the compliance level to the previous GGSN version. When set to 'default', the compliance level for that GGSN version indicated by the object cGgsnVersion will be considered. Currently, when the cGgsnVersion is holding a value of 'release50', the compliance level can be set back to 'release40'. This object is deprecated as the standard GGSN 8.0 release deprecated this configuration."
  },
  "cGgsnCreateReqV1UpdExistPdp": {
    "name": "cGgsnCreateReqV1UpdExistPdp",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.18",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "reference": "3GPP TS 29.060 v3.15.0/v4.6.0/v5.4.0",
    "status": "deprecated",
    "description": "This object is used for backward compatibility due to to implementation of CR 311. CR 311: The SGSN shall not send a Create PDP Context Request for an already active context. If a new Create PDP Context Request is incoming on TEID 0 for an already active PDP context, this Create PDP Context Request must be considered related to a new session. The existing PDP context shall be torn down locally, and the associated PDP contexts deleted locally, before the new session is created. If a new Create PDP Context Request is incoming on a TEID which is different from 0 and this TEID is already allocated to one or more activated PDP contexts, and the NSAPI IE value in this message matches the NSAPI value of an active PDP context, the GGSN shall send back a Create PDP Context Response with a rejection cause code. It is implementation dependent deciding whether to teardown or keep the existing PDP context. 'false' - The changes due to CR 311 will be applicable. 'true' - The changes due to CR 311 will not be taken into account. This object has no meaning when the object cGgsnCompliance3GppGgsn holds a value of 'release40'. This object is deprecated as the standerd GGSN release 5.2 deprecated this configuration."
  },
  "cGgsnRadAttrSessTimeout": {
    "name": "cGgsnRadAttrSessTimeout",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.19",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object is used for enabling the session timeout feature on the global (router) level set using cGgsnSessionTimeout, APN level (cgprsAccPtAbsoluteSessionTimer, which is defined in CISCO-GPRS-ACC-PT-MIB and is outside the scope of this MIB) and also parse the RADIUS attribute #27 present in the access-accept request. 'true' - Session timeout is enabled. 'false' - Session timeout is disabled."
  },
  "cGgsnDownlinkVerifyMsDisable": {
    "name": "cGgsnDownlinkVerifyMsDisable",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.20",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object enables the feature which will allow the GGSN to route IP packets beyond MS. This works only if a static route is added in GGSN to the node beyond the MS. On enabling this feature, GGSN will route the packets in both process switch path and cef switch path. This is supported only for IP PDP type. This feature has some limitations: - This is not scalable, since the operator has to add static route to all the node beyond the MS. - Only works for MS having static address. - In case of GTPv1 the MS has to select TFT's so as to allow traffic flow in the downlink direction. - IP address assignment/Radius for the devices behind the MS needs to be done within the scope of that network; the GGSN will not provide this facility in anyway for the hosts behind the MS. - In case for MWAM and Cat6500/7600 environment, the static route should be added only on that particular GGSN on the MWAM from where the MS is reachable. 'true' - Routing beyond MS is enabled. 'false' - Routing beyond MS is disabled."
  },
  "cGgsnSlbMode": {
    "name": "cGgsnSlbMode",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.21",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "directed": 1,
          "dispatched": 2
        }
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "GTP SLB can operate in two modes-dispatched and directed. - 'dispatched' mode: It forwards the create request without changing the destination IP address (vserver address) and the create response comes from the same (vserver) address. - 'directed' mode: It changes the destination IP address to that of GGSN's VT and the create response comes from the GGSN VT."
  },
  "cGgsnSlbNotif": {
    "name": "cGgsnSlbNotif",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.22",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "cacFailure": 1,
          "sessionDeletion": 2
        }
      }
    },
    "maxaccess": "read-write",
    "status": "deprecated",
    "description": "This object is used to enable or disable the GGSN behavior of sending CAC failure notification to SLB, or session failure notification to SLB. If this object is set to cacFailure(1), then this object is required to enable the feature in the dispatched mode of operation of SLB. If this object is set to sessionDeletion(2), then GGSN will send delete notification message to SLB when the last PDP associated with a IMSI is deleted. This object is deprecated by cGgsnSlbNotifyCacFailure and cGgsnSlbNotifySessionDeletion."
  },
  "cGgsnSlbVserverTable": {
    "name": "cGgsnSlbVserverTable",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.23",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table includes the different virtual servers (IP address of virtual servers) and the elements gives the interface to reach these servers. The table is indexed on the vserver address. The table objects can be modified, when the RowStatus (cGgsnSlbVserRowStatus) is active."
  },
  "cGgsnSlbVserverEntry": {
    "name": "cGgsnSlbVserverEntry",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.23.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSlbVserAddrType",
        "implied": 0
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSlbVserAddress",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Entry contains the Virtual server details(IP address type, IP address)and next hop address and VRF name."
  },
  "cGgsnSlbVserAddrType": {
    "name": "cGgsnSlbVserAddrType",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.23.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressType",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This object specifies the address type of the vserver."
  },
  "cGgsnSlbVserAddress": {
    "name": "cGgsnSlbVserAddress",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.23.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 4,
            "max": 20
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This object specifies the address of GTP vservers. It is required only in directed mode. If SLB is running in directed mode and this object is not configured, then the feature remains disabled. If SLB is running in the dispatched mode, the vserver that forwarded the create request is known to the GGSN and thus it is possible to send the notification directly to the vserver."
  },
  "cGgsnSlbVserNextHopAddrType": {
    "name": "cGgsnSlbVserNextHopAddrType",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.23.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressType",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "ipv4",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object specifies the IP address type to reach the virtual server."
  },
  "cGgsnSlbVserNextHopAddress": {
    "name": "cGgsnSlbVserNextHopAddress",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.23.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 4,
            "max": 20
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object specifies the IP address to reach the vserver."
  },
  "cGgsnSlbVserVrfName": {
    "name": "cGgsnSlbVserVrfName",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.23.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object specifies the VRF name on an interface on GGSN connected to SLB, to reach the vserver."
  },
  "cGgsnSlbVserRowStatus": {
    "name": "cGgsnSlbVserRowStatus",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.23.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object will create new row into the table or deletes the existing one. To create a row, set this object to 'createAndGo(4)'. To delete a row, set this object to 'destroy(6)'."
  },
  "cGgsnSlbNotifyCacFailure": {
    "name": "cGgsnSlbNotifyCacFailure",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.24",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object is used to enable or disable the GGSN behavior of sending CAC failure notification to SLB. CAC fails on GGSN if either the maximum number of PDPs reaches limit or there is not enough bandwidth for the traffic class for the APN. If this object is set to 'true', GGSN sends the notification to all the SLB vservers when UMTS CAC fails."
  },
  "cGgsnSlbNotifySessionDeletion": {
    "name": "cGgsnSlbNotifySessionDeletion",
    "oid": "1.3.6.1.4.1.9.9.240.1.3.25",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object is used to enable or disable the GGSN behavior of sending session deletion notification to SLB. If this object is set to 'true', GGSN sends delete notification message to SLB when the last PDP associated with a IMSI is deleted."
  },
  "cGgsnVersion": {
    "name": "cGgsnVersion",
    "oid": "1.3.6.1.4.1.9.9.240.1.4.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "release14": 1,
          "release30": 2,
          "release40": 3,
          "release31": 4,
          "release50": 5,
          "release60": 6,
          "release70": 7,
          "release80": 8,
          "release90": 9,
          "release100": 10
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object specifies the which release of GPRS image is currently running on the GGSN."
  },
  "cGgsnActiveNetworkInitPdps": {
    "name": "cGgsnActiveNetworkInitPdps",
    "oid": "1.3.6.1.4.1.9.9.240.1.4.2",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object represents the number of network initiated PDP contexts that are currently active. Trigger Condition: This counter is incremented / decremented by the create/delete PDP context request message respectively."
  },
  "cGgsnActivePppPdps": {
    "name": "cGgsnActivePppPdps",
    "oid": "1.3.6.1.4.1.9.9.240.1.4.3",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object represents the number of PPP PDP contexts that are currently active. Trigger Condition: This counter is incremented / decremented by the create/delete PPP PDP context request message respectively."
  },
  "cGgsnActivePppRegenPdps": {
    "name": "cGgsnActivePppRegenPdps",
    "oid": "1.3.6.1.4.1.9.9.240.1.4.4",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object represents the number of PPP-Regen PDP contexts that are currently active. Trigger Condition: This counter is incremented / decremented by the create/delete PPP Regeneration PDP context request message respectively."
  },
  "cGgsnPendingPppRegenPdps": {
    "name": "cGgsnPendingPppRegenPdps",
    "oid": "1.3.6.1.4.1.9.9.240.1.4.5",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object represents the current number of pending PPP regeneration sessions. Trigger Condition: This counter is triggered by the create PPP Regeneration PDP context request message."
  },
  "cGgsnActiveGtpVersion0Pdps": {
    "name": "cGgsnActiveGtpVersion0Pdps",
    "oid": "1.3.6.1.4.1.9.9.240.1.4.6",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object represents the current number of active GTP v0 PDP contexts. Trigger Condition: This counter is incremented / decremented by the create/delete PDP context request message respectively."
  },
  "cGgsnActiveGtpVersion1Pdps": {
    "name": "cGgsnActiveGtpVersion1Pdps",
    "oid": "1.3.6.1.4.1.9.9.240.1.4.7",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object represents the current number of active GTP v1 PDP contexts. Trigger Condition: This counter is incremented / decremented by the create/delete PDP context request message respectively."
  },
  "cGgsnGtpEncapInterface": {
    "name": "cGgsnGtpEncapInterface",
    "oid": "1.3.6.1.4.1.9.9.240.1.4.8",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "InterfaceIndexOrZero",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object represents the ifIndex of the interface on which gtp encapsulation is configured. Only one interface can be configured with gtp encapsulation on the GGSN. A zero value indicates that no interface is configured with gtp encapsulation."
  },
  "cGgsnServiceModeStatus": {
    "name": "cGgsnServiceModeStatus",
    "oid": "1.3.6.1.4.1.9.9.240.1.4.9",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "inService": 1,
          "maintenance": 2,
          "outOfServiceInProgress": 3,
          "outOfService": 4
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object represents the internal service mode which GGSN maintains. The service switching is done with object cGgsnServiceMode."
  },
  "cGgsnConfigVersion": {
    "name": "cGgsnConfigVersion",
    "oid": "1.3.6.1.4.1.9.9.240.1.4.10",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object specifies the config version of GPRS image. The value of this object will be of the form Version.Release.Maintenence. This object provides information on the ability of the devices to support configuration operations."
  },
  "cGgsnPrepaidPDPs": {
    "name": "cGgsnPrepaidPDPs",
    "oid": "1.3.6.1.4.1.9.9.240.1.4.11",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object specifies the number of prepaid PDPs created since the last clearance of statistics (GPRS service aware statistics)."
  },
  "cGgsnPostpaidPDPs": {
    "name": "cGgsnPostpaidPDPs",
    "oid": "1.3.6.1.4.1.9.9.240.1.4.12",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object specifies the current number of postpaid PDPs, created since the last clearance of statistics (GPRS service aware statistics)."
  },
  "cGgsnActivatedIpv6Gtpv0Pdp": {
    "name": "cGgsnActivatedIpv6Gtpv0Pdp",
    "oid": "1.3.6.1.4.1.9.9.240.1.4.13",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "units": "PDPs",
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object represents the current number of active GTP v0 ipv6 PDP contexts. Trigger Condition: This counter is incremented by the create PDP context request and decremented by the delete PDP context request message."
  },
  "cGgsnActivatedIpv6Gtpv1Pdp": {
    "name": "cGgsnActivatedIpv6Gtpv1Pdp",
    "oid": "1.3.6.1.4.1.9.9.240.1.4.14",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "units": "PDPs",
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object represents the current number of active GTP v1 ipv6 PDP contexts. Trigger Condition: This counter is incremented by the create PDP context request and decremented by the delete PDP context request message."
  },
  "cGgsnActivatedIpv6Ms": {
    "name": "cGgsnActivatedIpv6Ms",
    "oid": "1.3.6.1.4.1.9.9.240.1.4.15",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "units": "PDPs",
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object represents the current number of MS with active IPv6 PDPs."
  },
  "cGgsnGtpEncapsuTable": {
    "name": "cGgsnGtpEncapsuTable",
    "oid": "1.3.6.1.4.1.9.9.240.1.4.16",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains information about ifIndex of the interfaces on which gtp encapsulation is configured."
  },
  "cGgsnGtpEncapsuEntry": {
    "name": "cGgsnGtpEncapsuEntry",
    "oid": "1.3.6.1.4.1.9.9.240.1.4.16.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "The cGgsnGtpEncapsuEntry represents the ifIndex of the interface on which gtp encapsulation is configured. Only one interface can be configured with gtp encapsulation on the GGSN. Entry in the table created whenever interface is configured with gtp encapsulation, Entry is deleted whenever unconfiguring the gtp encapsulation from the interface."
  },
  "cGgsnGtpEncapsuInterface": {
    "name": "cGgsnGtpEncapsuInterface",
    "oid": "1.3.6.1.4.1.9.9.240.1.4.16.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InterfaceIndexOrZero",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object represents the ifIndex of the interface on which gtp encapsulation is configured. Only one interface can be configured with gtp encapsulation on the GGSN. A zero value indicates that no interface is configured with gtp encapsulation."
  },
  "cGgsnPdfServerAddrType": {
    "name": "cGgsnPdfServerAddrType",
    "oid": "1.3.6.1.4.1.9.9.240.1.5.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressType",
      "class": "type"
    },
    "maxaccess": "accessible-for-notify",
    "status": "deprecated",
    "description": "This object specifies the type of IP address of the PDF server."
  },
  "cGgsnPdfServerAddr": {
    "name": "cGgsnPdfServerAddr",
    "oid": "1.3.6.1.4.1.9.9.240.1.5.2",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type"
    },
    "maxaccess": "accessible-for-notify",
    "status": "deprecated",
    "description": "This object specifies the IP address of the PDF server. The type of this address is specified by the object cGgsnPdfServerAddrType."
  },
  "cGgsnNotifAccessPointName": {
    "name": "cGgsnNotifAccessPointName",
    "oid": "1.3.6.1.4.1.9.9.240.1.5.3",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 100
          }
        ]
      }
    },
    "maxaccess": "accessible-for-notify",
    "status": "current",
    "description": "This object specifies the Access Point Name and is used specify the name in the cGgsnAccessPointNameNotif notification."
  },
  "cGgsnNotifPdpImsi": {
    "name": "cGgsnNotifPdpImsi",
    "oid": "1.3.6.1.4.1.9.9.240.1.5.4",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 8
          }
        ]
      }
    },
    "maxaccess": "accessible-for-notify",
    "status": "current",
    "description": "This object specifies the International Mobile Subscriber Identity (IMSI) of the user for whom the notification is generated. This object is used to specify IMSI of the user in the cGgsnPacketDataProtocolNotif notification."
  },
  "cGgsnGlobalErrorTypes": {
    "name": "cGgsnGlobalErrorTypes",
    "oid": "1.3.6.1.4.1.9.9.240.1.5.5",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "ggsnServiceUp": 1,
          "ggsnServiceDown": 2,
          "mapSgsnUp": 3,
          "mapSgsnDown": 4,
          "noDHCPServer": 5
        }
      }
    },
    "maxaccess": "accessible-for-notify",
    "status": "current",
    "description": "This object indicates the types of global errors as follows. 'ggsnServiceUp' - GGSN service has started 'ggsnServiceDown' - GGSN service is shutdown 'mapSgsnUp' - MAP-SGSN service has started 'mapSgsnDown' - MAP-SGSN service is shutdown 'noDHCPServer' -- DHCP server is not configured"
  },
  "cGgsnAccessPointErrorTypes": {
    "name": "cGgsnAccessPointErrorTypes",
    "oid": "1.3.6.1.4.1.9.9.240.1.5.6",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "noRadius": 1,
          "ipAllocationFail": 2,
          "apnUnreachable": 3
        }
      }
    },
    "maxaccess": "accessible-for-notify",
    "status": "current",
    "description": "This object indicates the types access point errors as follows. 'noRadius' - RADIUS Server is not configured. 'ipAllocationFail' - Unable to allocate IP address. 'apnUnreachable' - Unable to reach access point."
  },
  "cGgsnPacketDataProtoErrorTypes": {
    "name": "cGgsnPacketDataProtoErrorTypes",
    "oid": "1.3.6.1.4.1.9.9.240.1.5.7",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "noResource": 1,
          "authenticationFail": 2,
          "ccrInitFail": 3,
          "quotaPushFail": 4
        }
      }
    },
    "maxaccess": "accessible-for-notify",
    "status": "current",
    "description": "This object indicates the types of Packet Data Protocol errors as follows. 'noResource' - Mobile Station initiated PDP count reaches the specified limit or Network initiated PDP count reaches the specified limit. 'authenticationFail' - Authentication failed. 'ccrInitFail' - CCR(initial)is sent to diameter server, and Tx timer expires before getting CCA (initial) response. The action on the PDP context creation is determined by the configured failure handling, as specified in cGgsnSADccaCcfh object in CISCO-GGSN-SERVICE-AWARE-MIB. 'quotaPushFail' - Quota Push failed, when the path between CSG-QS is down or when CSG sends a negative Response for quota push request."
  },
  "cGgsnNotifPdpMsisdn": {
    "name": "cGgsnNotifPdpMsisdn",
    "oid": "1.3.6.1.4.1.9.9.240.1.5.8",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type"
    },
    "maxaccess": "accessible-for-notify",
    "status": "current",
    "description": "This object specifies the Mobile Subscriber ISDN (MSISDN) value of the user for whom the notification is generated. This object is used to specify MSISDN of the user in the cGgsnPacketDataProtocolNotif notification."
  },
  "cGgsnNotifPrefix": {
    "name": "cGgsnNotifPrefix",
    "oid": "1.3.6.1.4.1.9.9.240.2",
    "class": "objectidentity"
  },
  "cGgsnNotifications": {
    "name": "cGgsnNotifications",
    "oid": "1.3.6.1.4.1.9.9.240.2.0",
    "class": "objectidentity"
  },
  "cGgsnNotification": {
    "name": "cGgsnNotification",
    "oid": "1.3.6.1.4.1.9.9.240.2.0.1",
    "class": "notificationtype",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifType"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifSeverity"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifTimestamp"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifGgsnIpAddrType"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifGgsnIpAddr"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifInfo"
      }
    ],
    "status": "deprecated",
    "description": "This notification indicates the occurrence of a GGSN related alarm. If and when additional useful information is available for specific types of alarms, then that information may be appended to the end of the notification in additional varbinds."
  },
  "cGgsnInServiceNotif": {
    "name": "cGgsnInServiceNotif",
    "oid": "1.3.6.1.4.1.9.9.240.2.0.2",
    "class": "notificationtype",
    "status": "current",
    "description": "A notification of this type is generated when GGSN is placed in inService mode which is specified by cGgsnServiceModeStatus."
  },
  "cGgsnMaintenanceNotif": {
    "name": "cGgsnMaintenanceNotif",
    "oid": "1.3.6.1.4.1.9.9.240.2.0.3",
    "class": "notificationtype",
    "status": "current",
    "description": "A notification of this type is generated when GGSN is placed in maintenance mode which is specified by cGgsnServiceModeStatus."
  },
  "cGgsnMemThresholdReachedNotif": {
    "name": "cGgsnMemThresholdReachedNotif",
    "oid": "1.3.6.1.4.1.9.9.240.2.0.4",
    "class": "notificationtype",
    "status": "current",
    "description": "A notification of this type is generated when GGSN reaches the memory threshold value specified by cGgsnMemoryThreshold."
  },
  "cGgsnMemThresholdClearedNotif": {
    "name": "cGgsnMemThresholdClearedNotif",
    "oid": "1.3.6.1.4.1.9.9.240.2.0.5",
    "class": "notificationtype",
    "status": "current",
    "description": "A notification of this type is generated when GGSN retains the memory and falls below threshold value speficied by cGgsnMemoryThreshold."
  },
  "cGgsnPdfStateUpNotif": {
    "name": "cGgsnPdfStateUpNotif",
    "oid": "1.3.6.1.4.1.9.9.240.2.0.6",
    "class": "notificationtype",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPdfServerAddrType"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPdfServerAddr"
      }
    ],
    "status": "deprecated",
    "description": "A notification of this type is generated when PDF connection comes UP."
  },
  "cGgsnPdfStateDownNotif": {
    "name": "cGgsnPdfStateDownNotif",
    "oid": "1.3.6.1.4.1.9.9.240.2.0.7",
    "class": "notificationtype",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPdfServerAddrType"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPdfServerAddr"
      }
    ],
    "status": "deprecated",
    "description": "A notification of this type is generated when PDF connection goes DOWN."
  },
  "cGgsnGlobalErrorNotif": {
    "name": "cGgsnGlobalErrorNotif",
    "oid": "1.3.6.1.4.1.9.9.240.2.0.8",
    "class": "notificationtype",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnGlobalErrorTypes"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifSeverity"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifTimestamp"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifGgsnIpAddrType"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifGgsnIpAddr"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifInfo"
      }
    ],
    "status": "current",
    "description": "This notification indicates the occurrence of a GGSN related alarm."
  },
  "cGgsnAccessPointNameNotif": {
    "name": "cGgsnAccessPointNameNotif",
    "oid": "1.3.6.1.4.1.9.9.240.2.0.9",
    "class": "notificationtype",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnAccessPointErrorTypes"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifSeverity"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifTimestamp"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifGgsnIpAddrType"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifGgsnIpAddr"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifInfo"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnNotifAccessPointName"
      }
    ],
    "status": "current",
    "description": "This notification indicates the occurrence of a APN related alarm."
  },
  "cGgsnPacketDataProtocolNotif": {
    "name": "cGgsnPacketDataProtocolNotif",
    "oid": "1.3.6.1.4.1.9.9.240.2.0.10",
    "class": "notificationtype",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPacketDataProtoErrorTypes"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifSeverity"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifTimestamp"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifGgsnIpAddrType"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifGgsnIpAddr"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifInfo"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnNotifPdpImsi"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnNotifPdpMsisdn"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnNotifAccessPointName"
      }
    ],
    "status": "current",
    "description": "This notification indicates the occurrence of a User related alarm."
  },
  "cGgsnMIBConformances": {
    "name": "cGgsnMIBConformances",
    "oid": "1.3.6.1.4.1.9.9.240.3",
    "class": "objectidentity"
  },
  "cGgsnMIBCompliances": {
    "name": "cGgsnMIBCompliances",
    "oid": "1.3.6.1.4.1.9.9.240.3.1",
    "class": "objectidentity"
  },
  "cGgsnMIBGroups": {
    "name": "cGgsnMIBGroups",
    "oid": "1.3.6.1.4.1.9.9.240.3.2",
    "class": "objectidentity"
  },
  "cGgsnMIBCompliance": {
    "name": "cGgsnMIBCompliance",
    "oid": "1.3.6.1.4.1.9.9.240.3.1.1",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "cGgsnStatisticsGroup",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifMgmtGroup",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnConfigurationsGroup",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifGroup",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatusGroup",
        "module": "CISCO-GGSN-MIB"
      }
    ],
    "status": "obsolete",
    "description": "The compliance statements for entities which implement the CISCO GGSN MIB. This is deprecated by cGgsnMIBComplianceRev1."
  },
  "cGgsnMIBComplianceRev1": {
    "name": "cGgsnMIBComplianceRev1",
    "oid": "1.3.6.1.4.1.9.9.240.3.1.2",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "cGgsnStatisticsGroup",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifMgmtGroup",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnConfigurationsGroupRev1",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifGroup",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatusGroup",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnUmtsGroup",
        "module": "CISCO-GGSN-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statements for entities which implement the CISCO GGSN MIB. This is deprecated by cGgsnMIBComplianceRev2"
  },
  "cGgsnMIBComplianceRev2": {
    "name": "cGgsnMIBComplianceRev2",
    "oid": "1.3.6.1.4.1.9.9.240.3.1.3",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "cGgsnStatisticsGroupRev1",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifMgmtGroup",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnConfigurationsGroupRev2",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifGroupRev1",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatusGroupRev1",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifInfoGroup",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnUmtsGroup",
        "module": "CISCO-GGSN-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statements for entities which implement the CISCO GGSN MIB."
  },
  "cGgsnMIBComplianceRev3": {
    "name": "cGgsnMIBComplianceRev3",
    "oid": "1.3.6.1.4.1.9.9.240.3.1.4",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "cGgsnStatisticsGroupRev1",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifMgmtGroupRev1",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnConfigurationsGroupRev2",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifGroupRev2",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatusGroupRev1",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifInfoGroupRev1",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnUmtsGroup",
        "module": "CISCO-GGSN-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statements for entities which implement the CISCO GGSN MIB. This is deprecated by cGgsnMIBComplianceRev4."
  },
  "cGgsnMIBComplianceRev4": {
    "name": "cGgsnMIBComplianceRev4",
    "oid": "1.3.6.1.4.1.9.9.240.3.1.5",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "cGgsnStatisticsGroupRev1",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifMgmtGroupRev1",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnConfigurationsGroupRev2",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifGroupRev2",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatusGroupRev1",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifInfoGroupRev1",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatusGroupConfigVer",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnUmtsGroup",
        "module": "CISCO-GGSN-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statements for entities which implement the CISCO GGSN MIB. This is deprecated by cGgsnMIBComplianceRev5."
  },
  "cGgsnMIBComplianceRev5": {
    "name": "cGgsnMIBComplianceRev5",
    "oid": "1.3.6.1.4.1.9.9.240.3.1.6",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "cGgsnStatisticsGroupRev1",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifMgmtGroupRev1",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnConfigurationsGroupRev2",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifGroupRev2",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatusGroupRev1",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifInfoGroupRev1",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatusGroupConfigVer",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnConfigurationsGroupR60",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatisticsGroupR60",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatusGroupR60",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifInfoGroupR60",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnUmtsGroup",
        "module": "CISCO-GGSN-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statements for entities which implement the CISCO GGSN MIB. This is deprecated by cGgsnMIBComplianceRev6."
  },
  "cGgsnMIBComplianceRev6": {
    "name": "cGgsnMIBComplianceRev6",
    "oid": "1.3.6.1.4.1.9.9.240.3.1.7",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "cGgsnStatisticsGroupRev1",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifMgmtGroupRev1",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnConfigurationsGroupRev2",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifGroupRev2",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatusGroupRev1",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifInfoGroupRev1",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatusGroupConfigVer",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatisticsGroupR60",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatusGroupR60",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnConfigurationsGroupR60Rev1",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnUmtsGroup",
        "module": "CISCO-GGSN-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statements for entities which implement the CISCO GGSN MIB."
  },
  "cGgsnMIBComplianceRev7": {
    "name": "cGgsnMIBComplianceRev7",
    "oid": "1.3.6.1.4.1.9.9.240.3.1.8",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "cGgsnStatisticsGroupRev2",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifMgmtGroupRev2",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnConfigurationsGroupRev3",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifGroupRev3",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatusGroupRev1",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifInfoGroupRev2",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatusGroupConfigVer",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatisticsGroupR60",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatusGroupR60",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifInfoGroupR60",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnConfigurationsGroupR60Rev1",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatusGroupR70",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnUmtsGroup",
        "module": "CISCO-GGSN-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statements for entities which implement the CISCO GGSN MIB. This is deprecated by cGgsnMIBComplianceRev8."
  },
  "cGgsnMIBComplianceRev8": {
    "name": "cGgsnMIBComplianceRev8",
    "oid": "1.3.6.1.4.1.9.9.240.3.1.9",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "cGgsnStatisticsGroupRev2",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifMgmtGroupRev2",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnConfigurationsGroupRev4",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifGroupRev3",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatusGroupRev1",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifInfoGroupRev2",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatusGroupConfigVer",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatisticsGroupR60",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatusGroupR60",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifInfoGroupR60",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnConfigurationsGroupR60Rev1",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatusGroupR70",
        "module": "CISCO-GGSN-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statements for entities which implement the CISCO GGSN MIB.This is deprecated by cGgsnMIBComplianceRev9."
  },
  "cGgsnMIBComplianceRev9": {
    "name": "cGgsnMIBComplianceRev9",
    "oid": "1.3.6.1.4.1.9.9.240.3.1.10",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "cGgsnStatisticsGroupRev2",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifMgmtGroupRev2",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnConfigurationsGroupRev4",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifGroupRev3",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatusGroupRev1",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifInfoGroupRev2",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatusGroupConfigVer",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatisticsGroupR60",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatusGroupR60",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifInfoGroupR60",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnConfigurationsGroupR60Rev1",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatusGroupR70",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatusGroupR90",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnUmtsGroup",
        "module": "CISCO-GGSN-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statements for entities which implement the CISCO GGSN MIB.This is deprecated by cGgsnMIBComplianceRev10."
  },
  "cGgsnMIBComplianceRev10": {
    "name": "cGgsnMIBComplianceRev10",
    "oid": "1.3.6.1.4.1.9.9.240.3.1.11",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "cGgsnStatisticsGroupRev2",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifMgmtGroupRev2",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnConfigurationsGroupRev4",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifGroupRev3",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatusGroupRev1",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifInfoGroupRev2",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatusGroupConfigVer",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatisticsGroupR60",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatusGroupR60",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnNotifInfoGroupR60",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnConfigurationsGroupR60Rev1",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatusGroupR70",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnStatusGroupR90",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnConfigurationsGroupSup1",
        "module": "CISCO-GGSN-MIB"
      },
      {
        "object": "cGgsnUmtsGroup",
        "module": "CISCO-GGSN-MIB"
      }
    ],
    "status": "current",
    "description": "The compliance statements for entities which implement the CISCO GGSN MIB."
  },
  "cGgsnStatisticsGroup": {
    "name": "cGgsnStatisticsGroup",
    "oid": "1.3.6.1.4.1.9.9.240.3.2.1",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSentSigMessages"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnReceivedSigMessages"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnUnexpectedSigMessages"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSentGPDUs"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnReceivedGPDUs"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSentGPDUOctets"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnReceivedGPDUOctets"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnUnexpectedGPDUs"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnActivationRejectedPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnOutOfResourcePdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnParserErrorMessages"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnTotalCreatedPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnTotalDeletedPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnTotalNetworkInitPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnTotalPppPdpsCreated"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnTotalPppPdpsDeleted"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnOutOfResourcePppRegenPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnDroppedPppRegenPdps"
      }
    ],
    "status": "deprecated",
    "description": "A collection of statistics on GGSN."
  },
  "cGgsnNotifMgmtGroup": {
    "name": "cGgsnNotifMgmtGroup",
    "oid": "1.3.6.1.4.1.9.9.240.3.2.2",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnNotifEnabled"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnNotifLeastSeverLevel"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnGeneratedNotifs"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnIgnoredAlarms"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifMaxLength"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifLatestIndex"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifType"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifSeverity"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifTimestamp"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifGgsnIpAddrType"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifGgsnIpAddr"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifInfo"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects related with notification management on GGSN."
  },
  "cGgsnConfigurationsGroup": {
    "name": "cGgsnConfigurationsGroup",
    "oid": "1.3.6.1.4.1.9.9.240.3.2.3",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnDefaultIpAllocationMethod"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnIdlePdpPurgeTimer"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnIpDupProtectRowStatus"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnDefaultAggregRowStatus"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnDefaultAaaAuthServerGroup"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnDefaultAaaAccServerGroup"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPppVirtualTemplate"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPppRegenVirtualTemplate"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects related with configurations on GGSN. This is deprecated by cGgsnConfigurationsGroupRev1."
  },
  "cGgsnNotifGroup": {
    "name": "cGgsnNotifGroup",
    "oid": "1.3.6.1.4.1.9.9.240.3.2.4",
    "class": "notificationgroup",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnNotification"
      }
    ],
    "status": "deprecated",
    "description": "A collection of notifications."
  },
  "cGgsnStatusGroup": {
    "name": "cGgsnStatusGroup",
    "oid": "1.3.6.1.4.1.9.9.240.3.2.5",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnVersion"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnActiveNetworkInitPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnActivePppPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnActivePppRegenPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPendingPppRegenPdps"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects representing status on GGSN."
  },
  "cGgsnConfigurationsGroupRev1": {
    "name": "cGgsnConfigurationsGroupRev1",
    "oid": "1.3.6.1.4.1.9.9.240.3.2.6",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnDefaultIpAllocationMethod"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnIdlePdpPurgeTimer"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnIpDupProtectRowStatus"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnDefaultAggregRowStatus"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnDefaultAaaAuthServerGroup"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnDefaultAaaAccServerGroup"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPppVirtualTemplate"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPppRegenVirtualTemplate"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPlmnAddrRangeRowStatus"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects related with configurations on GGSN."
  },
  "cGgsnUmtsGroup": {
    "name": "cGgsnUmtsGroup",
    "oid": "1.3.6.1.4.1.9.9.240.3.2.7",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnTftSemanticErrorPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnTftSyntacticErrorPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPktFilterSemanticErrorPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPktFilterSyntacticErrorPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPlmnAddrRangeUsage"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnActiveGtpVersion0Pdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnActiveGtpVersion1Pdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnGtpEncapInterface"
      }
    ],
    "status": "current",
    "description": "A collection of objects pertaining to GTP v1."
  },
  "cGgsnStatisticsGroupRev1": {
    "name": "cGgsnStatisticsGroupRev1",
    "oid": "1.3.6.1.4.1.9.9.240.3.2.8",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSentSigMessages"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnReceivedSigMessages"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnUnexpectedSigMessages"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSentGPDUs"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnReceivedGPDUs"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnUnexpectedGPDUs"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnActivationRejectedPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnOutOfResourcePdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnParserErrorMessages"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnTotalCreatedPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnTotalDeletedPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnTotalNetworkInitPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnTotalPppPdpsCreated"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnTotalPppPdpsDeleted"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnOutOfResourcePppRegenPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnDroppedPppRegenPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHCSentGPDUOctets"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHCReceivedGPDUOctets"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnVersionNotSupportedRejPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnUnkownMessageRejPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnMsgTooShortRejPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnMandIeMissingRejPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnMandIeIncorrectRejPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnOptIeInvalidRejPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnIeUnknownRejPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnIeOutOfOrderRejPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnIeUnexpectedRejPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnIeDuplicatedRejPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnOptIeIncorrectRejPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPdpWithoutTftExistsRejPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSgsnThruPutLastCollected"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSgsnUpStreamPktCnt"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSgsnUpStreamByteCnt"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSgsnDownStreamPktCnt"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSgsnDownStreamByteCnt"
      }
    ],
    "status": "deprecated",
    "description": "A collection of statistics on GGSN. This group is deprecated by cGgsnStatisticsGroupRev2."
  },
  "cGgsnNotifGroupRev1": {
    "name": "cGgsnNotifGroupRev1",
    "oid": "1.3.6.1.4.1.9.9.240.3.2.9",
    "class": "notificationgroup",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnNotification"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnInServiceNotif"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnMaintenanceNotif"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnMemThresholdReachedNotif"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnMemThresholdClearedNotif"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPdfStateUpNotif"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPdfStateDownNotif"
      }
    ],
    "status": "deprecated",
    "description": "A collection of notifications."
  },
  "cGgsnConfigurationsGroupRev2": {
    "name": "cGgsnConfigurationsGroupRev2",
    "oid": "1.3.6.1.4.1.9.9.240.3.2.10",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnDefaultIpAllocationMethod"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnIdlePdpPurgeTimer"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnIpDupProtectRowStatus"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnDefaultAggregRowStatus"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnDefaultAaaAuthServerGroup"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnDefaultAaaAccServerGroup"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPppVirtualTemplate"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPppRegenVirtualTemplate"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPlmnAddrRangeRowStatus"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPdfRowStatus"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPdfReconnectTimeOut"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPdfReconnectRetries"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPdfReconExpPdpDelete"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPdfReqRetryTimeOut"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPdfReqRetries"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPcscfRowStatus"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnMemoryThreshold"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnServiceMode"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPlmnRowStatus"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPlmnScope"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSessionTimeout"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnThruputIntervalOne"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnThruputIntervalTwo"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnCompliance3GppGgsn"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnCreateReqV1UpdExistPdp"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnRadAttrSessTimeout"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnDownlinkVerifyMsDisable"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects related with configurations on GGSN. This object group is superceded by cGgsnConfigurationsGroupRev3."
  },
  "cGgsnStatusGroupRev1": {
    "name": "cGgsnStatusGroupRev1",
    "oid": "1.3.6.1.4.1.9.9.240.3.2.11",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnVersion"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnActiveNetworkInitPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnActivePppPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnActivePppRegenPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPendingPppRegenPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnServiceModeStatus"
      }
    ],
    "status": "current",
    "description": "A collection of objects representing status on GGSN."
  },
  "cGgsnNotifInfoGroup": {
    "name": "cGgsnNotifInfoGroup",
    "oid": "1.3.6.1.4.1.9.9.240.3.2.12",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPdfServerAddrType"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPdfServerAddr"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects representing Notif Info on GGSN."
  },
  "cGgsnNotifGroupRev2": {
    "name": "cGgsnNotifGroupRev2",
    "oid": "1.3.6.1.4.1.9.9.240.3.2.13",
    "class": "notificationgroup",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnInServiceNotif"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnMaintenanceNotif"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnMemThresholdReachedNotif"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnMemThresholdClearedNotif"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPdfStateUpNotif"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPdfStateDownNotif"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnGlobalErrorNotif"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnAccessPointNameNotif"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPacketDataProtocolNotif"
      }
    ],
    "status": "deprecated",
    "description": "A collection of notifications. This object group is superceded by cGgsnNotifGroupRev3."
  },
  "cGgsnNotifInfoGroupRev1": {
    "name": "cGgsnNotifInfoGroupRev1",
    "oid": "1.3.6.1.4.1.9.9.240.3.2.14",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPdfServerAddrType"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPdfServerAddr"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnNotifAccessPointName"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnNotifPdpImsi"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnGlobalErrorTypes"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnAccessPointErrorTypes"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPacketDataProtoErrorTypes"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects representing Notif Info on GGSN. This object group is superceded by cGgsnNotifInfoGroupRev2."
  },
  "cGgsnNotifMgmtGroupRev1": {
    "name": "cGgsnNotifMgmtGroupRev1",
    "oid": "1.3.6.1.4.1.9.9.240.3.2.15",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnNotifLeastSeverLevel"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnGeneratedNotifs"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnIgnoredAlarms"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifMaxLength"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifLatestIndex"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifType"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifSeverity"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifTimestamp"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifGgsnIpAddrType"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifGgsnIpAddr"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifInfo"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnServiceNotifEnabled"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnMemoryNotifEnabled"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPdfNotifEnabled"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnGlobalErrorNotifEnabled"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnAccessPointNotifEnabled"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPdpNotifEnabled"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects related with notification management on GGSN. This object group is superceded by cGgsnNotifMgmtGroupRev2."
  },
  "cGgsnStatusGroupConfigVer": {
    "name": "cGgsnStatusGroupConfigVer",
    "oid": "1.3.6.1.4.1.9.9.240.3.2.16",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnConfigVersion"
      }
    ],
    "status": "current",
    "description": "A collection of objects representing config version of GGSN."
  },
  "cGgsnConfigurationsGroupR60": {
    "name": "cGgsnConfigurationsGroupR60",
    "oid": "1.3.6.1.4.1.9.9.240.3.2.17",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSlbMode"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSlbNotif"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSlbVserRowStatus"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSlbVserNextHopAddrType"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSlbVserNextHopAddress"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSlbVserVrfName"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects representing configurations on GGSN. This group is deprecated by cGgsnConfigurationsGroupR60Rev1."
  },
  "cGgsnStatisticsGroupR60": {
    "name": "cGgsnStatisticsGroupR60",
    "oid": "1.3.6.1.4.1.9.9.240.3.2.18",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnTotalMessages"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnContextSetupMessages"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnContextModifyMessages"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnContextRemoveMessages"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPathSetupMessages"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPathModifyMessages"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPathRemoveMessages"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnCGFReadyMessages"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnCGFModifyMessages"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnCGFRemoveMessages"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnInternalStateMsgs"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSlbCacFailures"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSlbSessionFailures"
      }
    ],
    "status": "current",
    "description": "A collection of objects related with statistics."
  },
  "cGgsnStatusGroupR60": {
    "name": "cGgsnStatusGroupR60",
    "oid": "1.3.6.1.4.1.9.9.240.3.2.19",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPrepaidPDPs"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPostpaidPDPs"
      }
    ],
    "status": "current",
    "description": "A collection of objects related to gtp status."
  },
  "cGgsnNotifInfoGroupR60": {
    "name": "cGgsnNotifInfoGroupR60",
    "oid": "1.3.6.1.4.1.9.9.240.3.2.20",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnNotifPdpMsisdn"
      }
    ],
    "status": "current",
    "description": "A collection of objects representing the Notif info on GGSN."
  },
  "cGgsnConfigurationsGroupR60Rev1": {
    "name": "cGgsnConfigurationsGroupR60Rev1",
    "oid": "1.3.6.1.4.1.9.9.240.3.2.21",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSlbMode"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSlbVserRowStatus"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSlbVserNextHopAddrType"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSlbVserNextHopAddress"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSlbVserVrfName"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSlbNotifyCacFailure"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSlbNotifySessionDeletion"
      }
    ],
    "status": "current",
    "description": "A collection of objects representing configurations on GGSN."
  },
  "cGgsnStatisticsGroupRev2": {
    "name": "cGgsnStatisticsGroupRev2",
    "oid": "1.3.6.1.4.1.9.9.240.3.2.22",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSentSigMessages"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnReceivedSigMessages"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnUnexpectedSigMessages"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSentGPDUs"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnReceivedGPDUs"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnUnexpectedGPDUs"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnActivationRejectedPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnOutOfResourcePdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnParserErrorMessages"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnTotalCreatedPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnTotalDeletedPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnTotalNetworkInitPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnTotalPppPdpsCreated"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnTotalPppPdpsDeleted"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnOutOfResourcePppRegenPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnDroppedPppRegenPdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHCSentGPDUOctets"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHCReceivedGPDUOctets"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSgsnThruPutLastCollected"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSgsnUpStreamPktCnt"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSgsnUpStreamByteCnt"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSgsnDownStreamPktCnt"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSgsnDownStreamByteCnt"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnTotalCreatedIpv6Pdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnTotalDeletedIpv6Pdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnTotalRejectedIpv6Pdps"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSentIpv6SigMessages"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnReceivedIpv6SigMessages"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSentIpv6PDUs"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnReceivedIpv6PDUs"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSentIpv6PDUOctets"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnReceivedIpv6PDUOctets"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnVersionNotSupportedMsgs"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnUnkownGtpMsgs"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnTooShortMsgs"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnMandIeMissingMsgs"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnMandIeIncorrectMsgs"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnOptIeInvalidMsgs"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnIeUnknownMsgs"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnIeOutOfOrderMsgs"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnIeUnexpectedMsgs"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnIeDuplicatedMsgs"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnOptIeIncorrectMsgs"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPdpWithoutTftExistsPdps"
      }
    ],
    "status": "current",
    "description": "A collection of objects related with statistics."
  },
  "cGgsnStatusGroupR70": {
    "name": "cGgsnStatusGroupR70",
    "oid": "1.3.6.1.4.1.9.9.240.3.2.23",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnActivatedIpv6Gtpv0Pdp"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnActivatedIpv6Gtpv1Pdp"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnActivatedIpv6Ms"
      }
    ],
    "status": "current",
    "description": "A collection of objects related with status."
  },
  "cGgsnConfigurationsGroupRev3": {
    "name": "cGgsnConfigurationsGroupRev3",
    "oid": "1.3.6.1.4.1.9.9.240.3.2.24",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnDefaultIpAllocationMethod"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnIdlePdpPurgeTimer"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnIpDupProtectRowStatus"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnDefaultAggregRowStatus"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnDefaultAaaAuthServerGroup"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnDefaultAaaAccServerGroup"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPppVirtualTemplate"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPppRegenVirtualTemplate"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPlmnAddrRangeRowStatus"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPcscfRowStatus"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnMemoryThreshold"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnServiceMode"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPlmnRowStatus"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPlmnScope"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSessionTimeout"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnThruputIntervalOne"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnThruputIntervalTwo"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnCompliance3GppGgsn"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnRadAttrSessTimeout"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnDownlinkVerifyMsDisable"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects related with configurations on GGSN. This is deprecated by cGgsnConfigurationsGroupRev4."
  },
  "cGgsnNotifMgmtGroupRev2": {
    "name": "cGgsnNotifMgmtGroupRev2",
    "oid": "1.3.6.1.4.1.9.9.240.3.2.25",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnNotifLeastSeverLevel"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnGeneratedNotifs"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnIgnoredAlarms"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifMaxLength"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifLatestIndex"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifType"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifSeverity"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifTimestamp"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifGgsnIpAddrType"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifGgsnIpAddr"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnHistNotifInfo"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnServiceNotifEnabled"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnMemoryNotifEnabled"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnGlobalErrorNotifEnabled"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnAccessPointNotifEnabled"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPdpNotifEnabled"
      }
    ],
    "status": "current",
    "description": "A collection of objects related with notification management on GGSN."
  },
  "cGgsnNotifGroupRev3": {
    "name": "cGgsnNotifGroupRev3",
    "oid": "1.3.6.1.4.1.9.9.240.3.2.26",
    "class": "notificationgroup",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnInServiceNotif"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnMaintenanceNotif"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnMemThresholdReachedNotif"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnMemThresholdClearedNotif"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnGlobalErrorNotif"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnAccessPointNameNotif"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPacketDataProtocolNotif"
      }
    ],
    "status": "current",
    "description": "A collection of notifications."
  },
  "cGgsnNotifInfoGroupRev2": {
    "name": "cGgsnNotifInfoGroupRev2",
    "oid": "1.3.6.1.4.1.9.9.240.3.2.27",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnNotifAccessPointName"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnNotifPdpImsi"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnGlobalErrorTypes"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnAccessPointErrorTypes"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPacketDataProtoErrorTypes"
      }
    ],
    "status": "current",
    "description": "A collection of objects representing Notif Info on GGSN."
  },
  "cGgsnConfigurationsGroupRev4": {
    "name": "cGgsnConfigurationsGroupRev4",
    "oid": "1.3.6.1.4.1.9.9.240.3.2.28",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnDefaultIpAllocationMethod"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnIdlePdpPurgeTimer"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnIpDupProtectRowStatus"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnDefaultAggregRowStatus"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnDefaultAaaAuthServerGroup"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnDefaultAaaAccServerGroup"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPppVirtualTemplate"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPppRegenVirtualTemplate"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPlmnAddrRangeRowStatus"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPcscfRowStatus"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnMemoryThreshold"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnServiceMode"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPlmnRowStatus"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPlmnScope"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnSessionTimeout"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnThruputIntervalOne"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnThruputIntervalTwo"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnRadAttrSessTimeout"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnDownlinkVerifyMsDisable"
      }
    ],
    "status": "current",
    "description": "A collection of objects related with configurations on GGSN."
  },
  "cGgsnStatusGroupR90": {
    "name": "cGgsnStatusGroupR90",
    "oid": "1.3.6.1.4.1.9.9.240.3.2.29",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnGtpEncapsuInterface"
      }
    ],
    "status": "current",
    "description": "A collection of objects which maintains the mapping between CGSN interfaces and gtp encapsulated interfaces."
  },
  "cGgsnConfigurationsGroupSup1": {
    "name": "cGgsnConfigurationsGroupSup1",
    "oid": "1.3.6.1.4.1.9.9.240.3.2.30",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnMsExcludeRangeStartIpv6Prefixlen"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnMsExcludeRangeEndIpv6Prefixlen"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPlmnAddrRangeFirstIpv6Prefixlen"
      },
      {
        "module": "CISCO-GGSN-MIB",
        "object": "cGgsnPlmnAddrRangeLastIpv6Prefixlen"
      }
    ],
    "status": "current",
    "description": "This group is supplementary to cGgsnConfigurationsGroupRev4."
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/CISCO-GGSN-MIB",
      "Produced by pysmi-0.3.4 at Fri May 24 17:03:33 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "CISCO-GGSN-MIB"
  }
}