{
  "imports": {
    "class": "imports",
    "CISCO-SMI": [
      "ciscoMgmt"
    ],
    "CISCO-TC": [
      "Cisco2KVlanList"
    ],
    "IF-MIB": [
      "ifIndex",
      "InterfaceIndex",
      "InterfaceIndexOrZero"
    ],
    "INET-ADDRESS-MIB": [
      "InetAddressType",
      "InetAddress"
    ],
    "RMON-MIB": [
      "OwnerString"
    ],
    "SNMP-FRAMEWORK-MIB": [
      "SnmpAdminString"
    ],
    "SNMPv2-CONF": [
      "OBJECT-GROUP",
      "NOTIFICATION-GROUP",
      "MODULE-COMPLIANCE"
    ],
    "SNMPv2-SMI": [
      "OBJECT-IDENTITY",
      "IpAddress",
      "NOTIFICATION-TYPE",
      "Counter32",
      "MibIdentifier",
      "MODULE-IDENTITY",
      "Gauge32",
      "Unsigned32",
      "OBJECT-TYPE",
      "TimeTicks",
      "Integer32",
      "Bits",
      "Counter64",
      "iso"
    ],
    "SNMPv2-TC": [
      "TEXTUAL-CONVENTION",
      "RowStatus",
      "TestAndIncr",
      "DisplayString",
      "TruthValue",
      "TimeStamp",
      "DateAndTime"
    ]
  },
  "ciscoVtpMIB": {
    "name": "ciscoVtpMIB",
    "oid": "1.3.6.1.4.1.9.9.46",
    "class": "moduleidentity",
    "revisions": [
      {
        "revision": "2013-10-14 00:00",
        "description": "Added following OBJECT-GROUP - vtpSourceInterfaceGroup - vtpConfigFileGroup - vtpVlanLocalShutdownGroup - vtpLocalUpdaterGroup - vtpDeviceIdGroup Added new compliance - vtpMIBCompliance16."
      },
      {
        "revision": "2010-05-12 00:00",
        "description": "Added vlanTrunkPortActiveVlansGroup. Updated the description of vtpServerDisabled."
      },
      {
        "revision": "2009-12-03 00:00",
        "description": "Added vtpTrunkPruningGroup3 and vtpConfigNotificationsGroup8. Modified the description of vtpNotificationsEnabled and managementDomainPruningState."
      },
      {
        "revision": "2008-03-07 00:00",
        "description": "Added vlanStatsGroup. Deprecated vtpConfigNotificationsGroup5 and replaced it with vtpConfigNotificationsGroup6 and vtpConfigNotificationsGroup7."
      },
      {
        "revision": "2007-10-04 00:00",
        "description": "Correct the descriptions of the object vtpConfigDigestErrors and the tables vtpVlanTable and vtpInternalVlanTable."
      },
      {
        "revision": "2006-02-17 00:00",
        "description": "Removed the OwnerString TEXTUAL-CONVENTION and imported the same from RMON-MIB."
      },
      {
        "revision": "2004-02-11 00:00",
        "description": "Added 'dynamicGvrp(4)' for the TC VlanTypeExt."
      },
      {
        "revision": "2003-11-21 00:00",
        "description": "Add vtpInternalVlanGrp to configure internal VLANs' allocation policy and show the owner application names."
      },
      {
        "revision": "2003-08-08 00:00",
        "description": "Split vtpConfigNotificationsGroup into two groups: vtpConfigNotificationsGroupRev1 and vtpConfigNotificationsGroup5. Write a new compliance statement to list vtpConfigNotificationsGroupRev1 in instead of vtpConfigNotificationsGroup in the MANDATORY-GROUPS."
      },
      {
        "revision": "2003-07-11 00:00",
        "description": "Modify the description of the TC VlanIndex."
      },
      {
        "revision": "2003-04-16 00:00",
        "description": "Add support for VTP version 3 features. -- Add enumerators and modify the 'DESCRIPTION' of 6 existing objects: vtpVersion, managementDomainLocalMode, managementDomainConfigRevNumber, managementDomainLastUpdater, managementDomainLastChange, managementDomainVersionInUse. -- Add 3 new groups: vtpAuthGroup, vtpDiscoverGroup, vtpDatabaseGroup."
      },
      {
        "revision": "2002-04-10 00:00",
        "description": "-- Add 4 new notifications/traps vtpLocalModeChanged, vtpVersionInUseChanged, vtpVlanCreated and vtpVlanDeleted. -- Add 2 new objects vtpVlanCreatedNotifEnabled and vtpVlanDeletedNotifEnabled to control the generation of vtpVlanCreated and vtpVlanDeleted. -- Use vtpNotificationsEnabled to control the generation of vtpLocalModeChanged and vtpVersionInUseChanged by grouping them in a new group vtpConfigNotificationsGroup2. -- Deprecate the object vlanTrunkPortsDot1qTag and its related group."
      },
      {
        "revision": "2002-02-28 00:00",
        "description": "Deprecate the object, vlanTrunkPortDot1qTunnel."
      },
      {
        "revision": "2001-08-03 00:00",
        "description": "Add a new off(4) mode to managementDomainLocalMode."
      },
      {
        "revision": "2001-02-26 00:00",
        "description": "Deprecate read-only object vtpVlanEditTypeExt and add a new read-create object vtpVlanEditTypeExt2. Enable Notification groups."
      },
      {
        "revision": "2001-02-12 00:00",
        "description": "Added Remote SPAN (RSPAN) VLAN feature, VLAN management features without supporting VTP protocol and a new object to handle one-VLAN-editing."
      },
      {
        "revision": "2000-09-19 00:00",
        "description": "Added the mapping from VLAN ID to its corresponding ifIndex"
      },
      {
        "revision": "2000-04-10 00:00",
        "description": "Added 4k VLAN editing and Dot1qTunnel support"
      },
      {
        "revision": "2000-01-06 00:00",
        "description": "Added 4k VLAN support"
      },
      {
        "revision": "1999-02-25 11:30",
        "description": "Added import of NOTIFICATION-GROUP"
      },
      {
        "revision": "1999-01-05 11:30",
        "description": "Added support for encapsulation type notApplicable"
      },
      {
        "revision": "1998-05-19 11:30",
        "description": "Added support for encapsulation type negotiation"
      },
      {
        "revision": "1997-08-08 11:38",
        "description": "Added Backup CRF object"
      },
      {
        "revision": "1997-05-09 11:30",
        "description": "Added ARE and STE hop counts."
      },
      {
        "revision": "1997-02-24 11:15",
        "description": "Added support for turning on VTP for Trunk cards."
      },
      {
        "revision": "1997-01-27 17:30",
        "description": "Added support for version 2 features."
      },
      {
        "revision": "1996-09-16 12:30",
        "description": "Updated the Token-Ring support."
      },
      {
        "revision": "1996-07-17 12:30",
        "description": "Updated to include objects in support of VTP pruning."
      },
      {
        "revision": "1996-01-18 18:20",
        "description": "Initial version of this MIB module."
      }
    ],
    "lastupdated": "201310140000Z",
    "organization": "Cisco Systems, Inc.",
    "contactinfo": "Cisco Systems Customer Service Postal: 170 W Tasman Drive San Jose, CA 95134 USA Tel: +1 800 553-NETS E-mail: cs-wbu@cisco.com, cs-lan-switch-snmp@cisco.com",
    "description": "The MIB module for entities implementing the VTP protocol and Vlan management."
  },
  "vtpMIBObjects": {
    "name": "vtpMIBObjects",
    "oid": "1.3.6.1.4.1.9.9.46.1",
    "class": "objectidentity"
  },
  "VlanIndex": {
    "name": "VlanIndex",
    "class": "textualconvention",
    "type": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 4095
          }
        ]
      }
    },
    "status": "current",
    "description": "The VLAN-id of a VLAN on ISL or 802.1q trunks. Modification of default parameters is allowed. Implementations are allowed to restrict the range of VLANs. For entities support up to 1024 VLANS. VLANs above 1000 are reserved for default VLANs and future use. Modification of default parameters is allowed. Creation or deletion of VLANs above 1000 is not allowed. For a new object which needs the vlan-id of a VLAN as its SYNTAX, it is suggested to import VlanIndex from Q-BRIDGE-MIB instead of importing this TC here in CISCO-VTP-MIB."
  },
  "ManagementDomainIndex": {
    "name": "ManagementDomainIndex",
    "class": "textualconvention",
    "type": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 255
          }
        ]
      }
    },
    "status": "current",
    "description": "An arbitrary integer-value to uniquely identify a management domain on the local system."
  },
  "VlanType": {
    "name": "VlanType",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "ethernet": 1,
          "fddi": 2,
          "tokenRing": 3,
          "fddiNet": 4,
          "trNet": 5,
          "deprecated": 6
        }
      }
    },
    "status": "current",
    "description": "The type of a VLAN. Note that the 'ethernet' type, is used for any ethernet or 802.3 VLAN, including an ATM Ethernet ELAN; and the 'tokenRing' ('trCrf') type is used for each VLAN representing a single logical 802.5 ring including an ATM Token-Ring ELAN. The 'trCrf' type is used for token ring VLANs made up of (at most) one transparently bridged LAN segment. The 'trBrf' type is used for VLANs which represent the scope of many 'trCrf' VLANs all connected together via source route bridging. The token ring 'trBrf' can be said to represent the bridged broadcast domain."
  },
  "VlanTypeExt": {
    "name": "VlanTypeExt",
    "class": "textualconvention",
    "type": {
      "type": "Bits",
      "class": "type",
      "bits": {
        "vtpmanageable": 0,
        "internal": 1,
        "reserved": 2,
        "rspan": 3,
        "dynamicGvrp": 4
      }
    },
    "status": "current",
    "description": "The additional type information of VLAN. vtpmanageable(0) An user defined VLAN which is manageable through VTP protocol. The value of this bit cannot be changed. internal(1) An internal VLAN created by the device. Internal VLANs cannot be created or deleted. The value of this bit cannot be changed. reserved(2) A VLAN reserved by the device. Reserved VLANs cannot be created or deleted. The value of this bit cannot be changed. rspan(3) A VLAN created to exclusively carry the traffic for a Remote Switched Port Analyzer (RSPAN). This bit can only be set or cleared during the VLAN creation. Once the VLAN is created, the value of this bit cannot be modified. dynamicGvrp(4) A VLAN dynamically created by GVRP (GARP VLAN Registration Protocol) propagation. The value of this bit cannot be changed.",
    "reference": "RFC2674."
  },
  "vtpStatus": {
    "name": "vtpStatus",
    "oid": "1.3.6.1.4.1.9.9.46.1.1",
    "class": "objectidentity"
  },
  "vtpVersion": {
    "name": "vtpVersion",
    "oid": "1.3.6.1.4.1.9.9.46.1.1.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "one": 1,
          "two": 2,
          "none": 3,
          "three": 4
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The version of VTP in use on the local system. A device will report its version capability and not any particular version in use on the device. If the device does not support vtp, the version is none(3)."
  },
  "vtpMaxVlanStorage": {
    "name": "vtpMaxVlanStorage",
    "oid": "1.3.6.1.4.1.9.9.46.1.1.2",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": -1,
            "max": 1023
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "An estimate of the maximum number of VLANs about which the local system can recover complete VTP information after a reboot. If the number of defined VLANs is greater than this value, then the system can not act as a VTP Server. For a device which has no means to calculate the estimated number, this value is -1."
  },
  "vtpNotificationsEnabled": {
    "name": "vtpNotificationsEnabled",
    "oid": "1.3.6.1.4.1.9.9.46.1.1.3",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "An indication of whether the notifications/traps defined by the vtpConfigNotificationsGroup, vtpConfigNotificationsGroup2, and vtpConfigNotificationsGroup8 are enabled."
  },
  "vtpVlanCreatedNotifEnabled": {
    "name": "vtpVlanCreatedNotifEnabled",
    "oid": "1.3.6.1.4.1.9.9.46.1.1.4",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "An indication of whether the notification should be generated when a VLAN is created. If the value of this object is 'true' then the vtpVlanCreated notification will be generated. If the value of this object is 'false' then the vtpVlanCreated notification will not be generated."
  },
  "vtpVlanDeletedNotifEnabled": {
    "name": "vtpVlanDeletedNotifEnabled",
    "oid": "1.3.6.1.4.1.9.9.46.1.1.5",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "An indication of whether the notification should be generated when a VLAN is deleted. If the value of this object is 'true' then the vtpVlanDeleted notification will be generated. If the value of this object is 'false' then the vtpVlanDeleted notification will not be generated."
  },
  "vlanManagementDomains": {
    "name": "vlanManagementDomains",
    "oid": "1.3.6.1.4.1.9.9.46.1.2",
    "class": "objectidentity"
  },
  "managementDomainTable": {
    "name": "managementDomainTable",
    "oid": "1.3.6.1.4.1.9.9.46.1.2.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The table containing information on the management domains in which the local system is participating. Devices which support only one management domain will support just one row in this table, and will not let it be deleted nor let other rows be created. Devices which support multiple management domains will allow rows to be created and deleted, but will not allow the last row to be deleted. If the device does not support VTP, the table is read-only."
  },
  "managementDomainEntry": {
    "name": "managementDomainEntry",
    "oid": "1.3.6.1.4.1.9.9.46.1.2.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "managementDomainIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Information about the status of one management domain."
  },
  "managementDomainIndex": {
    "name": "managementDomainIndex",
    "oid": "1.3.6.1.4.1.9.9.46.1.2.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ManagementDomainIndex",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "An arbitrary value to uniquely identify the management domain on the local system."
  },
  "managementDomainName": {
    "name": "managementDomainName",
    "oid": "1.3.6.1.4.1.9.9.46.1.2.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 32
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The management name of a domain in which the local system is participating. The zero-length name corresponds to the 'no management-domain' state which is the initial value at installation-time if not configured otherwise. Note that the zero-length name does not correspond to an operational management domain, and a device does not send VTP advertisements while in the 'no management-domain' state. A device leaves the 'no management-domain' state when it obtains a management-domain name, either through configuration or through inheriting the management-domain name from a received VTP advertisement. When the value of an existing instance of this object is modified by network management, the local system should re- initialize its VLAN information (for the given management domain) as if it had just been configured with a management domain name at installation time."
  },
  "managementDomainLocalMode": {
    "name": "managementDomainLocalMode",
    "oid": "1.3.6.1.4.1.9.9.46.1.2.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "client": 1,
          "server": 2,
          "transparent": 3,
          "off": 4
        }
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The local VTP mode in this management domain when managementDomainVersionInUse is version1(1) or version2(2). If managementDomainVersionInUse is version3(4), this object has the same value with vtpDatabaseLocalMode of VLAN database type. - 'client' indicates that the local system is acting as a VTP client. - 'server' indicates that the local system is acting as a VTP server. - 'transparent' indicates that the local system does not generate or listen to VTP messages, but forwards messages. This mode can also be set by the device itself when the amount of VLAN information is too large for it to hold in DRAM. - 'off' indicates that the local system does not generate, listen to or forward any VTP messages."
  },
  "managementDomainConfigRevNumber": {
    "name": "managementDomainConfigRevNumber",
    "oid": "1.3.6.1.4.1.9.9.46.1.2.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The current Configuration Revision Number as known by the local device for this management domain when managementDomainVersionInUse is version1(1) or version2(2). If managementDomainVersionInUse is version3(4), this object has the same value with vtpDatabaseRevisionNumber of VLAN database type. This value is updated (if necessary) whenever a VTP advertisement is received or generated. When in the 'no management-domain' state, this value is 0."
  },
  "managementDomainLastUpdater": {
    "name": "managementDomainLastUpdater",
    "oid": "1.3.6.1.4.1.9.9.46.1.2.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "IpAddress",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The IP-address (or one of them) of the VTP Server which last updated the Configuration Revision Number, as indicated in the most recently received VTP advertisement for this management domain, when managementDomainVersionInUse is version1(1) or version2(2). If managementDomainVersionInUse is version3(4), this object has the value of 0.0.0.0. Before an advertisement has been received, this value is 0.0.0.0."
  },
  "managementDomainLastChange": {
    "name": "managementDomainLastChange",
    "oid": "1.3.6.1.4.1.9.9.46.1.2.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DateAndTime",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The time at which the Configuration Revision Number was (last) increased to its current value, as indicated in the most recently received VTP advertisement for this management domain when managementDomainVersionInUse is not version3(4) or in the most recently received VTP VLAN database advertisement for this management domain when managementDomainVersionInUse is version3(4). The value 0x0000010100000000 indicates that the device which last increased the Configuration Revision Number had no idea of the date/time, or that no advertisement has been received."
  },
  "managementDomainRowStatus": {
    "name": "managementDomainRowStatus",
    "oid": "1.3.6.1.4.1.9.9.46.1.2.1.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status of this conceptual row."
  },
  "managementDomainTftpServer": {
    "name": "managementDomainTftpServer",
    "oid": "1.3.6.1.4.1.9.9.46.1.2.1.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "IpAddress",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The IP address of a TFTP Server in/from which VTP VLAN information for this management domain is to be stored/retrieved. If the information is being locally stored in NVRAM, this object should take the value 0.0.0.0."
  },
  "managementDomainTftpPathname": {
    "name": "managementDomainTftpPathname",
    "oid": "1.3.6.1.4.1.9.9.46.1.2.1.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The complete pathname of the file at the TFTP Server identified by the value of managementDomainTftpServer in/from which VTP VLAN information for this management domain is to be stored/retrieved. If the value of corresponding instance of managementDomainTftpServer is 0.0.0.0, the value of this object is ignored."
  },
  "managementDomainPruningState": {
    "name": "managementDomainPruningState",
    "oid": "1.3.6.1.4.1.9.9.46.1.2.1.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "enabled": 1,
          "disabled": 2
        }
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "An indication of whether VTP pruning is enabled or disabled in this managament domain. This object can only be modified, either when the corresponding instance value of managementDomainVersionInUse is 'version1' or 'version2' and the corresponding instance value of managementDomainLocalMode is 'server', or when the corresponding instance value of managementDomainVersionInUse is 'version3' and the corresponding instance value of managementDomainLocalMode is 'server' or 'client'."
  },
  "managementDomainVersionInUse": {
    "name": "managementDomainVersionInUse",
    "oid": "1.3.6.1.4.1.9.9.46.1.2.1.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "version1": 1,
          "version2": 2,
          "none": 3,
          "version3": 4
        }
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The current version of the VTP that is in use by the designated management domain. This object can be set to none(3) only when vtpVersion is none(3)."
  },
  "managementDomainPruningStateOper": {
    "name": "managementDomainPruningStateOper",
    "oid": "1.3.6.1.4.1.9.9.46.1.2.1.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "enabled": 1,
          "disabled": 2
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Indicates whether VTP pruning is operationally enabled or disabled in this managament domain."
  },
  "managementDomainAdminSrcIf": {
    "name": "managementDomainAdminSrcIf",
    "oid": "1.3.6.1.4.1.9.9.46.1.2.1.1.13",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The object specifies the interface to be used as the preferred source interface for the VTP IP updater address. A zero length value indicates that a source interface is not specified."
  },
  "managementDomainSourceOnlyMode": {
    "name": "managementDomainSourceOnlyMode",
    "oid": "1.3.6.1.4.1.9.9.46.1.2.1.1.14",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The object specifies whether to use only the IP address of managementDomainAdminSrcIf as the VTP IP updater address. 'true' indicates to only use the IP address of managementDomainAdminSrcIf as the VTP IP updater address. 'false' indicates to use the IP address of managementDomainAdminSrcIf as the VTP IP updater address if managementDomainAdminSrcIf is configured with an IP address. Otherwise, the first available IP address of the system will be used."
  },
  "managementDomainOperSrcIf": {
    "name": "managementDomainOperSrcIf",
    "oid": "1.3.6.1.4.1.9.9.46.1.2.1.1.15",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The object indicates the interface used as the preferred source interface for the VTP IP updater address. A zero length string indicates that a source interface is not available."
  },
  "managementDomainConfigFile": {
    "name": "managementDomainConfigFile",
    "oid": "1.3.6.1.4.1.9.9.46.1.2.1.1.16",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The object specifies the file name where VTP configuration is stored in the format of <filename> or <devices>:[<filename>]. <device> can be (but not limited to): flash, bootflash, slot0, slot1, disk0."
  },
  "managementDomainLocalUpdaterType": {
    "name": "managementDomainLocalUpdaterType",
    "oid": "1.3.6.1.4.1.9.9.46.1.2.1.1.17",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressType",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The object indicates the type of the Internet address of the preferred source interface for the VTP IP updater. The value of this object is 'unknown' if managementDomainVersionInUse is 'version3' or managementDomainLocalMode is not 'server'."
  },
  "managementDomainLocalUpdater": {
    "name": "managementDomainLocalUpdater",
    "oid": "1.3.6.1.4.1.9.9.46.1.2.1.1.18",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The object indicates the Internet address of the preferred source interface for the VTP IP updater."
  },
  "managementDomainDeviceID": {
    "name": "managementDomainDeviceID",
    "oid": "1.3.6.1.4.1.9.9.46.1.2.1.1.19",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The object indicates a value that uniquely identifies this device within a VTP Domain. The value of this object is zero length string if managementDomainVersionInUse is not 'version3'."
  },
  "vlanInfo": {
    "name": "vlanInfo",
    "oid": "1.3.6.1.4.1.9.9.46.1.3",
    "class": "objectidentity"
  },
  "vtpVlanTable": {
    "name": "vtpVlanTable",
    "oid": "1.3.6.1.4.1.9.9.46.1.3.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains information on the VLANs which currently exist."
  },
  "vtpVlanEntry": {
    "name": "vtpVlanEntry",
    "oid": "1.3.6.1.4.1.9.9.46.1.3.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "managementDomainIndex",
        "implied": 0
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Information about one current VLAN. The managementDomainIndex value in the INDEX clause indicates which management domain the VLAN is in."
  },
  "vtpVlanIndex": {
    "name": "vtpVlanIndex",
    "oid": "1.3.6.1.4.1.9.9.46.1.3.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "VlanIndex",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The VLAN-id of this VLAN on ISL or 802.1q trunks."
  },
  "vtpVlanState": {
    "name": "vtpVlanState",
    "oid": "1.3.6.1.4.1.9.9.46.1.3.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "operational": 1,
          "suspended": 2,
          "mtuTooBigForDevice": 3,
          "mtuTooBigForTrunk": 4
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The state of this VLAN. The state 'mtuTooBigForDevice' indicates that this device cannot participate in this VLAN because the VLAN's MTU is larger than the device can support. The state 'mtuTooBigForTrunk' indicates that while this VLAN's MTU is supported by this device, it is too large for one or more of the device's trunk ports."
  },
  "vtpVlanType": {
    "name": "vtpVlanType",
    "oid": "1.3.6.1.4.1.9.9.46.1.3.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "VlanType",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The type of this VLAN."
  },
  "vtpVlanName": {
    "name": "vtpVlanName",
    "oid": "1.3.6.1.4.1.9.9.46.1.3.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 32
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The name of this VLAN. This name is used as the ELAN-name for an ATM LAN-Emulation segment of this VLAN."
  },
  "vtpVlanMtu": {
    "name": "vtpVlanMtu",
    "oid": "1.3.6.1.4.1.9.9.46.1.3.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1500,
            "max": 18190
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The MTU size on this VLAN, defined as the size of largest MAC-layer (information field portion of the) data frame which can be transmitted on the VLAN."
  },
  "vtpVlanDot10Said": {
    "name": "vtpVlanDot10Said",
    "oid": "1.3.6.1.4.1.9.9.46.1.3.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 4,
            "max": 4
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The value of the 802.10 SAID field for this VLAN."
  },
  "vtpVlanRingNumber": {
    "name": "vtpVlanRingNumber",
    "oid": "1.3.6.1.4.1.9.9.46.1.3.1.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 4095
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The ring number of this VLAN. This object is only instantiated when the value of the corresponding instance of vtpVlanType has a value of 'fddi' or 'tokenRing' and Source Routing is in use on this VLAN."
  },
  "vtpVlanBridgeNumber": {
    "name": "vtpVlanBridgeNumber",
    "oid": "1.3.6.1.4.1.9.9.46.1.3.1.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 15
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The bridge number of the VTP-capable switches for this VLAN. This object is only instantiated for VLANs that are involved with emulating token ring segments."
  },
  "vtpVlanStpType": {
    "name": "vtpVlanStpType",
    "oid": "1.3.6.1.4.1.9.9.46.1.3.1.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "ieee": 1,
          "ibm": 2,
          "hybrid": 3
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The type of the Spanning Tree Protocol (STP) running on this VLAN. This object is only instanciated when the value of the corresponding instance of vtpVlanType has a value of 'fddiNet' or 'trNet'. The value returned by this object depends upon the value of the corresponding instance of vtpVlanEditStpType. - 'ieee' indicates IEEE STP is running exclusively. - 'ibm' indicates IBM STP is running exclusively. - 'hybrid' indicates a STP that allows a combination of IEEE and IBM is running. The 'hybrid' STP type results from tokenRing/fddi VLANs that are children of this trNet/fddiNet parent VLAN being configured in a combination of SRT and SRB vtpVlanBridgeTypes while the instance of vtpVlanEditStpType that corresponds to this object is set to 'auto'."
  },
  "vtpVlanParentVlan": {
    "name": "vtpVlanParentVlan",
    "oid": "1.3.6.1.4.1.9.9.46.1.3.1.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "VlanIndex",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The parent VLAN for this VLAN. This object is only instantiated when the value of the corresponding instance of vtpVlanType has a value of 'fddi' or 'tokenRing' and Source Routing is in use on this VLAN. The parent VLAN must have a vtpVlanType value of fddiNet(4) or trNet(5), respectively."
  },
  "vtpVlanTranslationalVlan1": {
    "name": "vtpVlanTranslationalVlan1",
    "oid": "1.3.6.1.4.1.9.9.46.1.3.1.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "VlanIndex",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A VLAN to which this VLAN is being translational-bridged. If this value and the corresponding instance of vtpVlanTranslationalVlan2 are both zero, then this VLAN is not being translational-bridged."
  },
  "vtpVlanTranslationalVlan2": {
    "name": "vtpVlanTranslationalVlan2",
    "oid": "1.3.6.1.4.1.9.9.46.1.3.1.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "VlanIndex",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Another VLAN, i.e., other than that indicated by vtpVlanTranslationalVlan1, to which this VLAN is being translational-bridged. If this value and the corresponding instance of vtpVlanTranslationalVlan1 are both zero, then this VLAN is not being translational-bridged."
  },
  "vtpVlanBridgeType": {
    "name": "vtpVlanBridgeType",
    "oid": "1.3.6.1.4.1.9.9.46.1.3.1.1.13",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "srt": 1,
          "srb": 2
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The type of the Source Route bridging mode in use on this VLAN. This object is only instantiated when the value of the corresponding instance of vtpVlanType has a value of fddi(2) or tokenRing(3) and Source Routing is in use on this VLAN."
  },
  "vtpVlanAreHopCount": {
    "name": "vtpVlanAreHopCount",
    "oid": "1.3.6.1.4.1.9.9.46.1.3.1.1.14",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 13
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The maximum number of bridge hops allowed in All Routes Explorer frames on this VLAN. This object is only instantiated when the value of the corresponding instance of vtpVlanType has a value of fddi(2) or tokenRing(3) and Source Routing is in use on this VLAN."
  },
  "vtpVlanSteHopCount": {
    "name": "vtpVlanSteHopCount",
    "oid": "1.3.6.1.4.1.9.9.46.1.3.1.1.15",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 13
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The maximum number of bridge hops allowed in Spanning Tree Explorer frames on this VLAN. This object is only instantiated when the value of the corresponding instance of vtpVlanType has a value of fddi(2) or tokenRing(3) and Source Routing is in use on this VLAN."
  },
  "vtpVlanIsCRFBackup": {
    "name": "vtpVlanIsCRFBackup",
    "oid": "1.3.6.1.4.1.9.9.46.1.3.1.1.16",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "True if this VLAN is of type trCrf and also is acting as a backup trCrf for the ISL distributed BRF"
  },
  "vtpVlanTypeExt": {
    "name": "vtpVlanTypeExt",
    "oid": "1.3.6.1.4.1.9.9.46.1.3.1.1.17",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "VlanTypeExt",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The additional type information of this VLAN."
  },
  "vtpVlanIfIndex": {
    "name": "vtpVlanIfIndex",
    "oid": "1.3.6.1.4.1.9.9.46.1.3.1.1.18",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InterfaceIndexOrZero",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The value of the ifIndex corresponding to this VLAN ID. If the VLAN ID does not have its corresponding interface, this object has the value of zero."
  },
  "internalVlanInfo": {
    "name": "internalVlanInfo",
    "oid": "1.3.6.1.4.1.9.9.46.1.3.2",
    "class": "objectidentity"
  },
  "vtpInternalVlanAllocPolicy": {
    "name": "vtpInternalVlanAllocPolicy",
    "oid": "1.3.6.1.4.1.9.9.46.1.3.2.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "ascending": 1,
          "descending": 2
        }
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The internal VLAN allocation policy. 'ascending' - internal VLANs are allocated starting from a lowwer VLAN ID and upwards. 'descending' - internal VLANs are allocated starting from a higher VLAN ID and downwards."
  },
  "vtpInternalVlanTable": {
    "name": "vtpInternalVlanTable",
    "oid": "1.3.6.1.4.1.9.9.46.1.3.2.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A vtpInternalVlanTable entry contains information on an existing internal VLAN. It is internally created by the device for a specific application program and hence owned by the application. It cannot be modified or deleted by (local or network) management."
  },
  "vtpInternalVlanEntry": {
    "name": "vtpInternalVlanEntry",
    "oid": "1.3.6.1.4.1.9.9.46.1.3.2.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "managementDomainIndex",
        "implied": 0
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Information about one current internal VLAN."
  },
  "vtpInternalVlanOwner": {
    "name": "vtpInternalVlanOwner",
    "oid": "1.3.6.1.4.1.9.9.46.1.3.2.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The program name of the internal VLAN's owner application. This internal VLAN is allocated by the device specifically for this application and no one else could create, modify or delete this VLAN."
  },
  "vlanEdit": {
    "name": "vlanEdit",
    "oid": "1.3.6.1.4.1.9.9.46.1.4",
    "class": "objectidentity"
  },
  "vtpEditControlTable": {
    "name": "vtpEditControlTable",
    "oid": "1.3.6.1.4.1.9.9.46.1.4.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table provides the means to control the editing of the VLANs for a particular management domain. Each and every entry in this table augments its corresponding entry in the managementDomainTable; thus, an entry in this table is created/deleted only as a by-product of creating/deleting an entry in the managementDomainTable."
  },
  "vtpEditControlEntry": {
    "name": "vtpEditControlEntry",
    "oid": "1.3.6.1.4.1.9.9.46.1.4.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "augmention": {
      "name": "vtpEditControlEntry",
      "module": "CISCO-VTP-MIB",
      "object": "managementDomainEntry"
    },
    "status": "current",
    "description": "Control information for editing the VLANs in one management domain."
  },
  "vtpVlanEditOperation": {
    "name": "vtpVlanEditOperation",
    "oid": "1.3.6.1.4.1.9.9.46.1.4.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "none": 1,
          "copy": 2,
          "apply": 3,
          "release": 4,
          "restartTimer": 5
        }
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object always has the value 'none' when read. When written, each value causes the appropriate action: 'copy' - causes the creation of rows in the vtpVlanEditTable exactly corresponding to the current global VLAN information for this management domain. If the Edit Buffer (for this management domain) is not currently empty, a copy operation fails. A successful copy operation starts the deadman-timer. 'apply' - first performs a consistent check on the the modified information contained in the Edit Buffer, and if consistent, then tries to instanciate the modified information as the new global VLAN information. Note that an empty Edit Buffer (for the management domain) would always result in an inconsistency since the default VLANs are required to be present. 'release' - flushes the Edit Buffer (for this management domain), clears the Owner information, and aborts the deadman-timer. A release is generated automatically if the deadman-timer ever expires. 'restartTimer' - restarts the deadman-timer. 'none' - no operation is performed."
  },
  "vtpVlanApplyStatus": {
    "name": "vtpVlanApplyStatus",
    "oid": "1.3.6.1.4.1.9.9.46.1.4.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "inProgress": 1,
          "succeeded": 2,
          "configNumberError": 3,
          "inconsistentEdit": 4,
          "tooBig": 5,
          "localNVStoreFail": 6,
          "remoteNVStoreFail": 7,
          "editBufferEmpty": 8,
          "someOtherError": 9,
          "notPrimaryServer": 10
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The current status of an 'apply' operation to instanciate the Edit Buffer as the new global VLAN information (for this management domain). If no apply is currently active, the status represented is that of the most recently completed apply. The possible values are: inProgress - 'apply' operation in progress; succeeded - the 'apply' was successful (this value is also used when no apply has been invoked since the last time the local system restarted); configNumberError - the apply failed because the value of vtpVlanEditConfigRevNumber was less or equal to the value of current value of managementDomainConfigRevNumber; inconsistentEdit - the apply failed because the modified information was not self-consistent; tooBig - the apply failed because the modified information was too large to fit in this VTP Server's non-volatile storage location; localNVStoreFail - the apply failed in trying to store the new information in a local non-volatile storage location; remoteNVStoreFail - the apply failed in trying to store the new information in a remote non-volatile storage location; editBufferEmpty - the apply failed because the Edit Buffer was empty (for this management domain). someOtherError - the apply failed for some other reason (e.g., insufficient memory). notPrimaryServer - the apply failed because the local device is not a VTP primary server for VLAN database type when managementDomainVersionInUse is version3(4)."
  },
  "vtpVlanEditBufferOwner": {
    "name": "vtpVlanEditBufferOwner",
    "oid": "1.3.6.1.4.1.9.9.46.1.4.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OwnerString",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The management station which is currently using the Edit Buffer for this management domain. When the Edit Buffer for a management domain is not currently in use, the value of this object is the zero-length string. Note that it is also the zero-length string if a manager fails to set this object when invoking a copy operation."
  },
  "vtpVlanEditConfigRevNumber": {
    "name": "vtpVlanEditConfigRevNumber",
    "oid": "1.3.6.1.4.1.9.9.46.1.4.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The Configuration Revision Number to be used for the next apply operation. This value is initialized (by the agent) on a copy operation to be one greater than the value of managementDomainConfigRevNumber. On an apply, if the number is less or equal to the value of managementDomainConfigRevNumber, then the apply fails. The value can be modified (increased) by network management before an apply to ensure that an apply does not fail for this reason. This object is used to allow management control over whether a configuration revision received via a VTP advertisement after a copy operation but before the succeeding apply operation is lost by being overwritten by the (local) edit operation. By default, the apply operation will fail in this situation. By increasing this object's value after the copy but before the apply, management can control whether the apply is to succeed (with the update via VTP advertisement being lost)."
  },
  "vtpVlanEditModifiedVlan": {
    "name": "vtpVlanEditModifiedVlan",
    "oid": "1.3.6.1.4.1.9.9.46.1.4.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "VlanIndex",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The VLAN-id of the modified VLAN in the Edit Buffer. If the object has the value of zero, any VLAN can be edited. If the value of the object is not zero, only this VLAN can be edited. The object's value is reset to zero after a successful 'apply' operation or a 'release' operation. This object is only supported for devices which allow only one VLAN editing for each 'apply' operation. For devices which allow multiple VLAN editing for each 'apply' operation, this object is not supported."
  },
  "vtpVlanEditTable": {
    "name": "vtpVlanEditTable",
    "oid": "1.3.6.1.4.1.9.9.46.1.4.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The table which contains the information in the Edit Buffers, one Edit Buffer per management domain. The information for a particular management domain is initialized, by a 'copy' operation, to be the current global VLAN information for that management domain. After initialization, editing can be performed to add VLANs, delete VLANs, or modify their global parameters. The information as modified through editing is local to this Edit Buffer. An apply operation using the vtpVlanEditOperation object is necessary to instanciate the modified information as the new global VLAN information for that management domain. To use the Edit Buffer, a manager acts as follows: 1. ensures the Edit Buffer for a management domain is empty, i.e., there are no rows in this table for this management domain. 2. issues a SNMP set operation which sets vtpVlanEditOperation to 'copy', and vtpVlanEditBufferOwner to its own identifier (e.g., its own IP address). 3. if this set operation is successful, proceeds to edit the information in the vtpVlanEditTable. 4. if and when the edited information is to be instantiated, issues a SNMP set operation which sets vtpVlanEditOperation to 'apply'. 5. issues retrieval requests to obtain the value of vtpVlanApplyStatus, until the result of the apply is determined. 6. releases the Edit Buffer by issuing a SNMP set operation which sets vtpVlanEditOperation to 'release'. Note that the information contained in this table is not saved across agent reboots."
  },
  "vtpVlanEditEntry": {
    "name": "vtpVlanEditEntry",
    "oid": "1.3.6.1.4.1.9.9.46.1.4.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "managementDomainIndex",
        "implied": 0
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanEditIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Information about one VLAN in the Edit Buffer for a particular management domain."
  },
  "vtpVlanEditIndex": {
    "name": "vtpVlanEditIndex",
    "oid": "1.3.6.1.4.1.9.9.46.1.4.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "VlanIndex",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The VLAN-id which this VLAN would have on ISL or 802.1q trunks."
  },
  "vtpVlanEditState": {
    "name": "vtpVlanEditState",
    "oid": "1.3.6.1.4.1.9.9.46.1.4.2.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "operational": 1,
          "suspended": 2
        }
      }
    },
    "default": {
      "default": {
        "value": "operational",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The state which this VLAN would have."
  },
  "vtpVlanEditType": {
    "name": "vtpVlanEditType",
    "oid": "1.3.6.1.4.1.9.9.46.1.4.2.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "VlanType",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "ethernet",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The type which this VLAN would have. An implementation may restrict access to this object."
  },
  "vtpVlanEditName": {
    "name": "vtpVlanEditName",
    "oid": "1.3.6.1.4.1.9.9.46.1.4.2.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 32
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The name which this VLAN would have. This name would be used as the ELAN-name for an ATM LAN-Emulation segment of this VLAN. An implementation may restrict access to this object."
  },
  "vtpVlanEditMtu": {
    "name": "vtpVlanEditMtu",
    "oid": "1.3.6.1.4.1.9.9.46.1.4.2.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1500,
            "max": 18190
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 1500,
        "format": "decimal"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The MTU size which this VLAN would have, defined as the size of largest MAC-layer (information field portion of the) data frame which can be transmitted on the VLAN. An implementation may restrict access to this object."
  },
  "vtpVlanEditDot10Said": {
    "name": "vtpVlanEditDot10Said",
    "oid": "1.3.6.1.4.1.9.9.46.1.4.2.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 4,
            "max": 4
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The value of the 802.10 SAID field which would be used for this VLAN. An implementation may restrict access to this object."
  },
  "vtpVlanEditRingNumber": {
    "name": "vtpVlanEditRingNumber",
    "oid": "1.3.6.1.4.1.9.9.46.1.4.2.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 4095
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The ring number which would be used for this VLAN. This object is only instantiated when the value of the corresponding instance of vtpVlanEditType has a value of 'fddi' or 'tokenRing' and Source Routing is in use on this VLAN."
  },
  "vtpVlanEditBridgeNumber": {
    "name": "vtpVlanEditBridgeNumber",
    "oid": "1.3.6.1.4.1.9.9.46.1.4.2.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 15
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The bridge number of the VTP-capable switches which would be used for this VLAN. This object is only instantiated when the value of the corresponding instance of vtpVlanEditType has a value of fddiNet(4) or trNet(5)."
  },
  "vtpVlanEditStpType": {
    "name": "vtpVlanEditStpType",
    "oid": "1.3.6.1.4.1.9.9.46.1.4.2.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "ieee": 1,
          "ibm": 2,
          "auto": 3
        }
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The type of the Spanning Tree Protocol which would be running on this VLAN. This object is only instantiated when the value of the corresponding instance of vtpVlanEditType has a value of fddiNet(4) or trNet(5). If 'ieee' is selected, the STP that runs will be IEEE. If 'ibm' is selected, the STP that runs will be IBM. If 'auto' is selected, the STP that runs will be dependant on the values of vtpVlanEditBridgeType for all children tokenRing/fddi type VLANs. This will result in a 'hybrid' STP (see vtpVlanStpType)."
  },
  "vtpVlanEditParentVlan": {
    "name": "vtpVlanEditParentVlan",
    "oid": "1.3.6.1.4.1.9.9.46.1.4.2.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "VlanIndex",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The VLAN index of the VLAN which would be the parent for this VLAN. This object is only instantiated when the value of the corresponding instance of vtpVlanEditType has a value of 'fddi' or 'tokenRing' and Source Routing is in use on this VLAN. The parent VLAN must have a vtpVlanEditType value of fddiNet(4) or trNet(5), respectively."
  },
  "vtpVlanEditRowStatus": {
    "name": "vtpVlanEditRowStatus",
    "oid": "1.3.6.1.4.1.9.9.46.1.4.2.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status of this row. Any and all columnar objects in an existing row can be modified irrespective of the status of the row. A row is not qualified for activation until instances of at least its vtpVlanEditType, vtpVlanEditName and vtpVlanEditDot10Said columns have appropriate values. The management station should endeavor to make all rows consistent in the table before 'apply'ing the buffer. An inconsistent entry in the table will cause the entire buffer to be rejected with the vtpVlanApplyStatus object set to the appropriate error value."
  },
  "vtpVlanEditTranslationalVlan1": {
    "name": "vtpVlanEditTranslationalVlan1",
    "oid": "1.3.6.1.4.1.9.9.46.1.4.2.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "VlanIndex",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "A VLAN to which this VLAN would be translational-bridged. If this value and the corresponding instance of vtpVlanTranslationalVlan2 are both zero, then this VLAN would not be translational-bridged. An implementation may restrict access to this object."
  },
  "vtpVlanEditTranslationalVlan2": {
    "name": "vtpVlanEditTranslationalVlan2",
    "oid": "1.3.6.1.4.1.9.9.46.1.4.2.1.13",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "VlanIndex",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Another VLAN, i.e., other than that indicated by vtpVlanEditTranslationalVlan1, to which this VLAN would be translational-bridged. If this value and the corresponding instance of vtpVlanTranslationalVlan1 are both zero, then this VLAN would not be translational-bridged. An implementation may restrict access to this object."
  },
  "vtpVlanEditBridgeType": {
    "name": "vtpVlanEditBridgeType",
    "oid": "1.3.6.1.4.1.9.9.46.1.4.2.1.14",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "srt": 1,
          "srb": 2
        }
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The type of Source Route bridging mode which would be in use on this VLAN. This object is only instantiated when the value of the corresponding instance of vtpVlanEditType has a value of fddi(2) or tokenRing(3) and Source Routing is in use on this VLAN."
  },
  "vtpVlanEditAreHopCount": {
    "name": "vtpVlanEditAreHopCount",
    "oid": "1.3.6.1.4.1.9.9.46.1.4.2.1.15",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 13
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The maximum number of bridge hops allowed in All Routes Explorer frames on this VLAN. This object is only instantiated when the value of the corresponding instance of vtpVlanType has a value of fddi(2) or tokenRing(3) and Source Routing is in use on this VLAN."
  },
  "vtpVlanEditSteHopCount": {
    "name": "vtpVlanEditSteHopCount",
    "oid": "1.3.6.1.4.1.9.9.46.1.4.2.1.16",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 13
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The maximum number of bridge hops allowed in Spanning Tree Explorer frames on this VLAN. This object is only instantiated when the value of the corresponding instance of vtpVlanType has a value of fddi(2) or tokenRing(3) and Source Routing is in use on this VLAN."
  },
  "vtpVlanEditIsCRFBackup": {
    "name": "vtpVlanEditIsCRFBackup",
    "oid": "1.3.6.1.4.1.9.9.46.1.4.2.1.17",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "True if this VLAN is of type trCrf and also is acting as a backup trCrf for the ISL distributed BRF. This object is only instantiated when the value of the corresponding instance of vtpVlanEditType has a value of tokenRing(3)."
  },
  "vtpVlanEditTypeExt": {
    "name": "vtpVlanEditTypeExt",
    "oid": "1.3.6.1.4.1.9.9.46.1.4.2.1.18",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "VlanTypeExt",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The additional type information of this VLAN. vtpVlanEditTypeExt object is superseded by vtpVlanEditTypeExt2."
  },
  "vtpVlanEditTypeExt2": {
    "name": "vtpVlanEditTypeExt2",
    "oid": "1.3.6.1.4.1.9.9.46.1.4.2.1.19",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "VlanTypeExt",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The additional type information of this VLAN. The VlanTypeExt TC specifies which bits may be written by a management application. The agent should provide a default value."
  },
  "vtpVlanLocalShutdownTable": {
    "name": "vtpVlanLocalShutdownTable",
    "oid": "1.3.6.1.4.1.9.9.46.1.4.3",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Ths table contains the VLAN local shutdown information within management domain."
  },
  "vtpVlanLocalShutdownEntry": {
    "name": "vtpVlanLocalShutdownEntry",
    "oid": "1.3.6.1.4.1.9.9.46.1.4.3.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "managementDomainIndex",
        "implied": 0
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry containing VLAN local shutdown information for a particular VLAN in the management domain. An entry is created if a VLAN which supports local shutdown has been created. An entry is deleted if a VLAN which supports local shutdown has been removed."
  },
  "vtpVlanLocalShutdown": {
    "name": "vtpVlanLocalShutdown",
    "oid": "1.3.6.1.4.1.9.9.46.1.4.3.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "up": 1,
          "down": 2
        }
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The object specifies the VLAN local shutdown state."
  },
  "vtpStats": {
    "name": "vtpStats",
    "oid": "1.3.6.1.4.1.9.9.46.1.5",
    "class": "objectidentity"
  },
  "vtpStatsTable": {
    "name": "vtpStatsTable",
    "oid": "1.3.6.1.4.1.9.9.46.1.5.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table of VTP statistics."
  },
  "vtpStatsEntry": {
    "name": "vtpStatsEntry",
    "oid": "1.3.6.1.4.1.9.9.46.1.5.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "augmention": {
      "name": "vtpStatsEntry",
      "module": "CISCO-VTP-MIB",
      "object": "managementDomainEntry"
    },
    "status": "current",
    "description": "VTP statistics for one management domain."
  },
  "vtpInSummaryAdverts": {
    "name": "vtpInSummaryAdverts",
    "oid": "1.3.6.1.4.1.9.9.46.1.5.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The total number of VTP Summary Adverts received for this management domain."
  },
  "vtpInSubsetAdverts": {
    "name": "vtpInSubsetAdverts",
    "oid": "1.3.6.1.4.1.9.9.46.1.5.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The total number of VTP Subset Adverts received for this management domain."
  },
  "vtpInAdvertRequests": {
    "name": "vtpInAdvertRequests",
    "oid": "1.3.6.1.4.1.9.9.46.1.5.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The total number of VTP Advert Requests received for this management domain."
  },
  "vtpOutSummaryAdverts": {
    "name": "vtpOutSummaryAdverts",
    "oid": "1.3.6.1.4.1.9.9.46.1.5.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The total number of VTP Summary Adverts sent for this management domain."
  },
  "vtpOutSubsetAdverts": {
    "name": "vtpOutSubsetAdverts",
    "oid": "1.3.6.1.4.1.9.9.46.1.5.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The total number of VTP Subset Adverts sent for this management domain."
  },
  "vtpOutAdvertRequests": {
    "name": "vtpOutAdvertRequests",
    "oid": "1.3.6.1.4.1.9.9.46.1.5.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The total number of VTP Advert Requests sent for this management domain."
  },
  "vtpConfigRevNumberErrors": {
    "name": "vtpConfigRevNumberErrors",
    "oid": "1.3.6.1.4.1.9.9.46.1.5.1.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of occurrences of configuration revision number errors for this management domain. A configuration revision number error occurs when a device receives a VTP advertisement for which: - the advertisement's Configuration Revision Number is the same as the current locally-held value, and - the advertisement's digest value is different from the current locally-held value."
  },
  "vtpConfigDigestErrors": {
    "name": "vtpConfigDigestErrors",
    "oid": "1.3.6.1.4.1.9.9.46.1.5.1.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of occurrences of configuration digest errors for this management domain. A configuration digest error occurs when a device receives a VTP advertisement for which: - the advertisement's Configuration Revision Number is greater than the current locally-held value, and - the advertisement's digest value computed by the receiving device does not match the checksum in the summary advertisement that was received earlier. This can happen, for example, if there is a mismatch in VTP passwords between the VTP devices."
  },
  "vlanTrunkPorts": {
    "name": "vlanTrunkPorts",
    "oid": "1.3.6.1.4.1.9.9.46.1.6",
    "class": "objectidentity"
  },
  "vlanTrunkPortTable": {
    "name": "vlanTrunkPortTable",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The table containing information on the local system's VLAN trunk ports."
  },
  "vlanTrunkPortEntry": {
    "name": "vlanTrunkPortEntry",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortIfIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Information about one trunk port."
  },
  "vlanTrunkPortIfIndex": {
    "name": "vlanTrunkPortIfIndex",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InterfaceIndex",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The value of ifIndex for the interface corresponding to this trunk port."
  },
  "vlanTrunkPortManagementDomain": {
    "name": "vlanTrunkPortManagementDomain",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ManagementDomainIndex",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The value of managementDomainIndex for the management domain on this trunk port. Devices which support only one management domain will support this object read-only."
  },
  "vlanTrunkPortEncapsulationType": {
    "name": "vlanTrunkPortEncapsulationType",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "isl": 1,
          "dot10": 2,
          "lane": 3,
          "dot1Q": 4,
          "negotiate": 5
        }
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The type of VLAN encapsulation desired to be used on this trunk port. It is either a particular type, or 'negotiate' meaning whatever type results from the negotiation. negotiate(5) is not allowed if the port does not support negotiation or if its vlanTrunkPortDynamicState is set to on(1) or onNoNegotiate(5). Whether writing to this object in order to modify the encapsulation is supported is both device and interface specific."
  },
  "vlanTrunkPortVlansEnabled": {
    "name": "vlanTrunkPortVlansEnabled",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 128,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "A string of octets containing one bit per VLAN in the management domain on this trunk port. The first octet corresponds to VLANs with VlanIndex values of 0 through 7; the second octet to VLANs 8 through 15; etc. The most significant bit of each octet corresponds to the lowest value VlanIndex in that octet. If the bit corresponding to a VLAN is set to '1', then the local system is enabled for sending and receiving frames on that VLAN; if the bit is set to '0', then the system is disabled from sending and receiving frames on that VLAN. To avoid conflicts between overlapping partial updates by multiple managers, i.e., updates which modify only a portion of an instance of this object (e.g., enable/disable a single VLAN on the trunk port), any SNMP Set operation accessing an instance of this object should also write the value of vlanTrunkPortSetSerialNo."
  },
  "vlanTrunkPortNativeVlan": {
    "name": "vlanTrunkPortNativeVlan",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "VlanIndex",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The VlanIndex of the VLAN which is represented by native frames on this trunk port. For trunk ports not supporting the sending and receiving of native frames, this value should be set to zero."
  },
  "vlanTrunkPortRowStatus": {
    "name": "vlanTrunkPortRowStatus",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status of this row. In some circumstances, the creation of a row in this table is needed to enable the appropriate trunking/tagging protocol on the port, to enable the use of VTP on the port, and to assign the port to the appropriate management domain. In other circumstances, rows in this table will be created as a by-product of other operations."
  },
  "vlanTrunkPortInJoins": {
    "name": "vlanTrunkPortInJoins",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.1.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of VTP Join messages received on this trunk port."
  },
  "vlanTrunkPortOutJoins": {
    "name": "vlanTrunkPortOutJoins",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.1.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of VTP Join messages sent on this trunk port."
  },
  "vlanTrunkPortOldAdverts": {
    "name": "vlanTrunkPortOldAdverts",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.1.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of VTP Advertisement messages which indicated the sender does not support VLAN-pruning received on this trunk port."
  },
  "vlanTrunkPortVlansPruningEligible": {
    "name": "vlanTrunkPortVlansPruningEligible",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.1.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 128,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "A string of octets containing one bit per VLAN in the management domain on this trunk port. The first octet corresponds to VLANs with VlanIndex values of 0 through 7; the second octet to VLANs 8 through 15; etc. The most significant bit of each octet corresponds to the lowest value VlanIndex in that octet. If the bit corresponding to a VLAN is set to '1', then the local system is permitted to prune that VLAN on this trunk port; if the bit is set to '0', then the system must not prune that VLAN on this trunk port. To avoid conflicts between overlapping partial updates by multiple managers, i.e., updates which modify only a portion of an instance of this object (e.g., enable/disable a single VLAN on the trunk port), any SNMP Set operation accessing an instance of this object should also write the value of vlanTrunkPortSetSerialNo."
  },
  "vlanTrunkPortVlansXmitJoined": {
    "name": "vlanTrunkPortVlansXmitJoined",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.1.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 128,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A string of octets containing one bit per VLAN in the management domain on this trunk port. The first octet corresponds to VLANs with VlanIndex values of 0 through 7; the second octet to VLANs 8 through 15; etc. The most significant bit of each octet corresponds to the lowest value VlanIndex in that octet. If the bit corresponding to a VLAN is set to '1', then this VLAN is presently being forwarded on this trunk port, i.e., it is not pruned; if the bit is set to '0', then this VLAN is presently not being forwarded on this trunk port, either because it is pruned or for some other reason."
  },
  "vlanTrunkPortVlansRcvJoined": {
    "name": "vlanTrunkPortVlansRcvJoined",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.1.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 128,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A string of octets containing one bit per VLAN in the management domain on this trunk port. The first octet corresponds to VLANs with VlanIndex values of 0 through 7; the second octet to VLANs 8 through 15; etc. The most significant bit of each octet corresponds to the lowest value VlanIndex in that octet. If the bit corresponding to a VLAN is set to '1', then the local switch is currently sending joins for this VLAN on this trunk port, i.e., it is asking to receive frames for this VLAN; if the bit is set to '0', then the local switch is not currently sending joins for this VLAN on this trunk port."
  },
  "vlanTrunkPortDynamicState": {
    "name": "vlanTrunkPortDynamicState",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.1.1.13",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "on": 1,
          "off": 2,
          "desirable": 3,
          "auto": 4,
          "onNoNegotiate": 5
        }
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "For devices that allows dynamic determination of whether a link between two switches should be a trunk or not, this object allows the operator to mandate the behavior of that dynamic mechanism. on(1) dictates that the interface will always be a trunk. This is the value for static entries (those that show no dynamic behavior). If the negotiation is supported on this port, negotiation will take place with the far end to attempt to bring the far end into trunking state. off(2) allows an operator to specify that the specified interface is never to be trunk, regardless of any dynamic mechanisms to the contrary. This value is useful for overriding the default behavior of some switches. If the negotiation is supported on this port, negotiation will take place with the far end to attempt on the link to bring the far end into non-trunking state. desirable(3) is used to indicate that it is desirable for the interface to become a trunk. The device will initiate any negotiation necessary to become a trunk but will not become a trunk unless it receives confirmation from the far end on the link. auto(4) is used to indicate that the interface is capable and willing to become a trunk but will not initiate trunking negotiations. The far end on the link are required to either start negotiations or start sending encapsulated packets, on which event the specified interface will become a trunk. onNoNegotiate(5) is used to indicate that the interface is permanently set to be a trunk, and no negotiation takes place with the far end on the link to ensure consistent operation. This is similar to on(1) except no negotiation takes place with the far end. If the port does not support negotiation or its vlanTrunkPortEncapsulationType is set to negotiate(5), onNoNegotiate(5) is not allowed. Devices that do no support dynamic determination (for just a particular interface, encapsulation or for the whole device) need only support the 'on', and 'off' values."
  },
  "vlanTrunkPortDynamicStatus": {
    "name": "vlanTrunkPortDynamicStatus",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.1.1.14",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "trunking": 1,
          "notTrunking": 2
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Indicates whether the specified interface is either acting as a trunk or not. This is a result of the vlanTrunkPortDynamicState and the ifOperStatus of the trunk port itself."
  },
  "vlanTrunkPortVtpEnabled": {
    "name": "vlanTrunkPortVtpEnabled",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.1.1.15",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Some trunk interface modules allow VTP to be enabled/disabled seperately from that of the central device. In such a case this object provides management a way to remotely enable VTP on that module. If a module does not support a seperate VTP enabled state then this object shall always return 'true' and will accept no other value during a SET operation."
  },
  "vlanTrunkPortEncapsulationOperType": {
    "name": "vlanTrunkPortEncapsulationOperType",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.1.1.16",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "isl": 1,
          "dot10": 2,
          "lane": 3,
          "dot1Q": 4,
          "negotiating": 5,
          "notApplicable": 6
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The type of VLAN encapsulation in use on this trunk port. For intefaces with vlanTrunkPortDynamicStatus of notTrunking(2) the vlanTrunkPortEncapsulationOperType shall be notApplicable(6)."
  },
  "vlanTrunkPortVlansEnabled2k": {
    "name": "vlanTrunkPortVlansEnabled2k",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.1.1.17",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "A string of octets containing one bit per VLAN for VLANS with VlanIndex values of 1024 through 2047 in the management domain on this trunk port. The first octet corresponds to VLANs with VlanIndex values of 1024 through 1031; the second octet to VLANs 1032 through 1039; etc. The most significant bit of each octet corresponds to the lowest value VlanIndex in that octet. If the bit corresponding to a VLAN is set to '1', then the local system is enabled for sending and receiving frames on that VLAN; if the bit is set to '0', then the system is disabled from sending and receiving frames on that VLAN. The default value is zero length string. To avoid conflicts between overlapping partial updates by multiple managers, i.e., updates which modify only a portion of an instance of this object (e.g., enable/disable a single VLAN on the trunk port), any SNMP Set operation accessing an instance of this object should also write the value of vlanTrunkPortSetSerialNo."
  },
  "vlanTrunkPortVlansEnabled3k": {
    "name": "vlanTrunkPortVlansEnabled3k",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.1.1.18",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "A string of octets containing one bit per VLAN for VLANS with VlanIndex values of 2048 through 3071 in the management domain on this trunk port. The first octet corresponds to VLANs with VlanIndex values of 2048 through 2055; the second octet to VLANs 2056 through 2063; etc. The most significant bit of each octet corresponds to the lowest value VlanIndex in that octet. If the bit corresponding to a VLAN is set to '1', then the local system is enabled for sending and receiving frames on that VLAN; if the bit is set to '0', then the system is disabled from sending and receiving frames on that VLAN. The default value is zero length string. To avoid conflicts between overlapping partial updates by multiple managers, i.e., updates which modify only a portion of an instance of this object (e.g., enable/disable a single VLAN on the trunk port), any SNMP Set operation accessing an instance of this object should also write the value of vlanTrunkPortSetSerialNo."
  },
  "vlanTrunkPortVlansEnabled4k": {
    "name": "vlanTrunkPortVlansEnabled4k",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.1.1.19",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "A string of octets containing one bit per VLAN for VLANS with VlanIndex values of 3072 through 4095 in the management domain on this trunk port. The first octet corresponds to VLANs with VlanIndex values of 3072 through 3079; the second octet to VLANs 3080 through 3087; etc. The most significant bit of each octet corresponds to the lowest value VlanIndex in that octet. If the bit corresponding to a VLAN is set to '1', then the local system is enabled for sending and receiving frames on that VLAN; if the bit is set to '0', then the system is disabled from sending and receiving frames on that VLAN. The default value is zero length string. To avoid conflicts between overlapping partial updates by multiple managers, i.e., updates which modify only a portion of an instance of this object (e.g., enable/disable a single VLAN on the trunk port), any SNMP Set operation accessing an instance of this object should also write the value of vlanTrunkPortSetSerialNo."
  },
  "vtpVlansPruningEligible2k": {
    "name": "vtpVlansPruningEligible2k",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.1.1.20",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "A string of octets containing one bit per VLAN for VLANS with VlanIndex values of 1024 through 2047 in the management domain on this trunk port. The first octet corresponds to VLANs with VlanIndex values of 1024 through 1031; the second octet to VLANs 1032 through 1039; etc. The most significant bit of each octet corresponds to the lowest value VlanIndex in that octet. If the bit corresponding to a VLAN is set to '1', then the local system is permitted to prune that VLAN on this trunk port; if the bit is set to '0', then the system must not prune that VLAN on this trunk port. The default value is zero length string. To avoid conflicts between overlapping partial updates by multiple managers, i.e., updates which modify only a portion of an instance of this object (e.g., enable/disable a single VLAN on the trunk port), any SNMP Set operation accessing an instance of this object should also write the value of vlanTrunkPortSetSerialNo."
  },
  "vtpVlansPruningEligible3k": {
    "name": "vtpVlansPruningEligible3k",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.1.1.21",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "A string of octets containing one bit per VLAN for VLANS with VlanIndex values of 2048 through 3071 in the management domain on this trunk port. The first octet corresponds to VLANs with VlanIndex values of 2048 through 2055; the second octet to VLANs 2056 through 2063; etc. The most significant bit of each octet corresponds to the lowest value VlanIndex in that octet. If the bit corresponding to a VLAN is set to '1', then the local system is permitted to prune that VLAN on this trunk port; if the bit is set to '0', then the system must not prune that VLAN on this trunk port. The default value is zero length string. To avoid conflicts between overlapping partial updates by multiple managers, i.e., updates which modify only a portion of an instance of this object (e.g., enable/disable a single VLAN on the trunk port), any SNMP Set operation accessing an instance of this object should also write the value of vlanTrunkPortSetSerialNo."
  },
  "vtpVlansPruningEligible4k": {
    "name": "vtpVlansPruningEligible4k",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.1.1.22",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "A string of octets containing one bit per VLAN for VLANS with VlanIndex values of 3072 through 4095 in the management domain on this trunk port. The first octet corresponds to VLANs with VlanIndex values of 3072 through 3079; the second octet to VLANs 3080 through 3087; etc. The most significant bit of each octet corresponds to the lowest value VlanIndex in that octet. If the bit corresponding to a VLAN is set to '1', then the local system is permitted to prune that VLAN on this trunk port; if the bit is set to '0', then the system must not prune that VLAN on this trunk port. The default value is zero length string. To avoid conflicts between overlapping partial updates by multiple managers, i.e., updates which modify only a portion of an instance of this object (e.g., enable/disable a single VLAN on the trunk port), any SNMP Set operation accessing an instance of this object should also write the value of vlanTrunkPortSetSerialNo."
  },
  "vlanTrunkPortVlansXmitJoined2k": {
    "name": "vlanTrunkPortVlansXmitJoined2k",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.1.1.23",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A string of octets containing one bit per VLAN for VLANS with VlanIndex values of 1024 through 2047 in the management domain on this trunk port. The first octet corresponds to VLANs with VlanIndex values of 1024 through 1031; the second octet to VLANs 1032 through 1039; etc. The most significant bit of each octet corresponds to the lowest value VlanIndex in that octet. If the bit corresponding to a VLAN is set to '1', then this VLAN is presently being forwarded on this trunk port, i.e., it is not pruned; if the bit is set to '0', then this VLAN is presently not being forwarded on this trunk port, either because it is pruned or for some other reason."
  },
  "vlanTrunkPortVlansXmitJoined3k": {
    "name": "vlanTrunkPortVlansXmitJoined3k",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.1.1.24",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A string of octets containing one bit per VLAN for VLANS with VlanIndex values of 2048 through 3071 in the management domain on this trunk port. The first octet corresponds to VLANs with VlanIndex values of 2048 through 2055; the second octet to VLANs 2056 through 2063; etc. The most significant bit of each octet corresponds to the lowest value VlanIndex in that octet. If the bit corresponding to a VLAN is set to '1', then this VLAN is presently being forwarded on this trunk port, i.e., it is not pruned; if the bit is set to '0', then this VLAN is presently not being forwarded on this trunk port, either because it is pruned or for some other reason."
  },
  "vlanTrunkPortVlansXmitJoined4k": {
    "name": "vlanTrunkPortVlansXmitJoined4k",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.1.1.25",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A string of octets containing one bit per VLAN for VLANS with VlanIndex values of 3072 through 4095 in the management domain on this trunk port. The first octet corresponds to VLANs with VlanIndex values of 3072 through 3079; the second octet to VLANs 3080 through 3087; etc. The most significant bit of each octet corresponds to the lowest value VlanIndex in that octet. If the bit corresponding to a VLAN is set to '1', then this VLAN is presently being forwarded on this trunk port, i.e., it is not pruned; if the bit is set to '0', then this VLAN is presently not being forwarded on this trunk port, either because it is pruned or for some other reason."
  },
  "vlanTrunkPortVlansRcvJoined2k": {
    "name": "vlanTrunkPortVlansRcvJoined2k",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.1.1.26",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A string of octets containing one bit per VLAN for VLANS with VlanIndex values of 1024 through 2047 in the management domain on this trunk port. The first octet corresponds to VLANs with VlanIndex values of 1024 through 1031; the second octet to VLANs 1032 through 1039; etc. The most significant bit of each octet corresponds to the lowest value VlanIndex in that octet. If the bit corresponding to a VLAN is set to '1', then the local switch is currently sending joins for this VLAN on this trunk port, i.e., it is asking to receive frames for this VLAN; if the bit is set to '0', then the local switch is not currently sending joins for this VLAN on this trunk port."
  },
  "vlanTrunkPortVlansRcvJoined3k": {
    "name": "vlanTrunkPortVlansRcvJoined3k",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.1.1.27",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A string of octets containing one bit per VLAN for VLANS with VlanIndex values of 2048 through 3071 in the management domain on this trunk port. The first octet corresponds to VLANs with VlanIndex values of 2048 through 2055; the second octet to VLANs 2056 through 2063; etc. The most significant bit of each octet corresponds to the lowest value VlanIndex in that octet. If the bit corresponding to a VLAN is set to '1', then the local switch is currently sending joins for this VLAN on this trunk port, i.e., it is asking to receive frames for this VLAN; if the bit is set to '0', then the local switch is not currently sending joins for this VLAN on this trunk port."
  },
  "vlanTrunkPortVlansRcvJoined4k": {
    "name": "vlanTrunkPortVlansRcvJoined4k",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.1.1.28",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A string of octets containing one bit per VLAN for VLANS with VlanIndex values of 3072 through 4095 in the management domain on this trunk port. The first octet corresponds to VLANs with VlanIndex values of 3072 through 3079; the second octet to VLANs 3080 through 3087; etc. The most significant bit of each octet corresponds to the lowest value VlanIndex in that octet. If the bit corresponding to a VLAN is set to '1', then the local switch is currently sending joins for this VLAN on this trunk port, i.e., it is asking to receive frames for this VLAN; if the bit is set to '0', then the local switch is not currently sending joins for this VLAN on this trunk port."
  },
  "vlanTrunkPortDot1qTunnel": {
    "name": "vlanTrunkPortDot1qTunnel",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.1.1.29",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "trunk": 1,
          "access": 2,
          "disabled": 3
        }
      }
    },
    "default": {
      "default": {
        "value": "disabled",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "deprecated",
    "description": "Indicates dot1qtunnel mode of the port. If the portDot1qTunnel is set to 'trunk' mode, the port's vlanTrunkPortDynamicState will be changed to 'onNoNegotiate' and the vlanTrunkPortEncapsulationType will be set to 'dot1Q'. These values cannot be changed unless dot1q tunnel is disabled on this port. If the portDot1qTunnel mode is set to 'access' mode, the port's vlanTrunkPortDynamicState will be set to 'off'.And the value of vlanTrunkPortDynamicState cannot be changed unless dot1q tunnel is disabled on this port. 1Q packets received on this access port will remain. Setting the port to dot1q tunnel 'disabled' mode causes the dot1q tunnel feature to be disabled on this port. This object can't be set to 'trunk' or 'access' mode, when vlanTrunkPortsDot1qTag object is set to 'false'. This object has been deprecated and is replaced by the object 'cltcDot1qTunnelMode' in the CISCO-L2-TUNNEL-CONFIG-MIB"
  },
  "vlanTrunkPortVlansActiveFirst2k": {
    "name": "vlanTrunkPortVlansActiveFirst2k",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.1.1.30",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Cisco2KVlanList",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A string of octets containing one bit per VLAN with VlanIndex values of 0 through 2047. If the bit corresponding to a VLAN is set to 1, it indicates that vlan is allowed and active in management domain. If the bit corresponding to a VLAN is set to 0, it indicates that vlan is not allowed or not active in management domain."
  },
  "vlanTrunkPortVlansActiveSecond2k": {
    "name": "vlanTrunkPortVlansActiveSecond2k",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.1.1.31",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Cisco2KVlanList",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A string of octets containing one bit per VLAN with VlanIndex values of 2048 through 4095. If the bit corresponding to a VLAN is set to 1, it indicates that vlan is allowed and active in management domain. If the bit corresponding to a VLAN is set to 0, it indicates that vlan is not allowed or not active in management domain."
  },
  "vlanTrunkPortSetSerialNo": {
    "name": "vlanTrunkPortSetSerialNo",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.2",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TestAndIncr",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "An advisory lock used to allow several cooperating SNMPv2 managers to coordinate their use of the SNMPv2 set operation acting upon any instance of vlanTrunkPortVlansEnabled."
  },
  "vlanTrunkPortsDot1qTag": {
    "name": "vlanTrunkPortsDot1qTag",
    "oid": "1.3.6.1.4.1.9.9.46.1.6.3",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "deprecated",
    "description": "An indication of whether the tagging on all VLANs including native VLAN for all 802.1q trunks is enabled. If this object has a value of true(1) then all VLANs including native VLAN are tagged. If the value is false(2) then all VLANs excluding native VLAN are tagged. This object has been deprecated and is replaced by the object 'cltcDot1qAllTaggedEnabled' in the CISCO-L2-TUNNEL-CONFIG-MIB"
  },
  "vtpDiscover": {
    "name": "vtpDiscover",
    "oid": "1.3.6.1.4.1.9.9.46.1.7",
    "class": "objectidentity"
  },
  "vtpDiscoverTable": {
    "name": "vtpDiscoverTable",
    "oid": "1.3.6.1.4.1.9.9.46.1.7.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains information related to the discovery of the VTP members in the designated management domain. This table is not instantiated when managementDomainVersionInUse is version1(1), version2(3) or none(3)."
  },
  "vtpDiscoverEntry": {
    "name": "vtpDiscoverEntry",
    "oid": "1.3.6.1.4.1.9.9.46.1.7.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "managementDomainIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Information related to the discovery of the VTP members in one management domain."
  },
  "vtpDiscoverAction": {
    "name": "vtpDiscoverAction",
    "oid": "1.3.6.1.4.1.9.9.46.1.7.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "discover": 1,
          "noOperation": 2,
          "purgeResult": 3
        }
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "When this object is set to discover(1), all the entries in vtpDiscoverResultTable for the corresponding management domain will be removed and the local device will begin to discover all VTP members in the management domain. Upon the successful completion of discovery, the discovered result will be stored in the vtpDiscoverResultTable. If vtpDiscoverStatus is inProgress(1), setting vtpDiscoverAction to discover(1) will fail. When this object is set to purgeResult(3), all the entries of vtpDiscoverResultTable for the corresponding management domain will be removed from vtpDiscoverResultTable. When this object is set to noOperation(2), no action will be taken. When read, this object always returns noOperation(2)."
  },
  "vtpDiscoverStatus": {
    "name": "vtpDiscoverStatus",
    "oid": "1.3.6.1.4.1.9.9.46.1.7.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "inProgress": 1,
          "succeeded": 2,
          "resourceUnavailable": 3,
          "someOtherError": 4
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The current status of VTP discovery. inProgress - a discovery is in progress; succeeded - the discovery was completed successfully (this value is also used when no discover has been invoked since the last time the local system restarted); resourceUnavailable - the discovery failed because the required allocation of a resource is presently unavailable. someOtherError - 'the discovery failed due to a reason no listed."
  },
  "vtpLastDiscoverTime": {
    "name": "vtpLastDiscoverTime",
    "oid": "1.3.6.1.4.1.9.9.46.1.7.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TimeStamp",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The value of sysUpTime at which the last discovery was completed. A value of zero indicates that no discovery has been invoked since last time the local system restarted."
  },
  "vtpDiscoverResultTable": {
    "name": "vtpDiscoverResultTable",
    "oid": "1.3.6.1.4.1.9.9.46.1.7.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The table containing information of discovered VTP members in the management domain in which the local system is participating. This table is not instantiated when managementDomainVersionInUse is version1(1), version2(2) or none(3)."
  },
  "vtpDiscoverResultEntry": {
    "name": "vtpDiscoverResultEntry",
    "oid": "1.3.6.1.4.1.9.9.46.1.7.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "managementDomainIndex",
        "implied": 0
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpDiscoverResultIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A conceptual row is created for each VTP member which is found through successful discovery."
  },
  "vtpDiscoverResultIndex": {
    "name": "vtpDiscoverResultIndex",
    "oid": "1.3.6.1.4.1.9.9.46.1.7.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A value assigned by the system which identifies a VTP member and the associated database in the management domain."
  },
  "vtpDiscoverResultDatabaseName": {
    "name": "vtpDiscoverResultDatabaseName",
    "oid": "1.3.6.1.4.1.9.9.46.1.7.2.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 64
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The database name associated with the discovered VTP member."
  },
  "vtpDiscoverResultConflicting": {
    "name": "vtpDiscoverResultConflicting",
    "oid": "1.3.6.1.4.1.9.9.46.1.7.2.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Indicates whether this VTP member contains conflicting information. true(1) indicates that this member has conflicting information of the database type in the management domain. false(2) indicates that there is no conflicting information of the database type in the management domain."
  },
  "vtpDiscoverResultDeviceId": {
    "name": "vtpDiscoverResultDeviceId",
    "oid": "1.3.6.1.4.1.9.9.46.1.7.2.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 64
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The unique identifier of the device for this VTP member."
  },
  "vtpDiscoverResultPrimaryServer": {
    "name": "vtpDiscoverResultPrimaryServer",
    "oid": "1.3.6.1.4.1.9.9.46.1.7.2.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 64
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The unique identifier of the primary server for this VTP member and the associated database type. There are two different VTP servers, the primary server and the secondary server. When a local device is configured as a server for a certain database type, it becomes secondary server by default. Primary server is an operational role under which a server can initiate or change the VTP configuration of the database type. If this VTP member itself is the primary server, the value of this object is the same as the value of vtpDiscoverResultDeviceId of the instance."
  },
  "vtpDiscoverResultRevNumber": {
    "name": "vtpDiscoverResultRevNumber",
    "oid": "1.3.6.1.4.1.9.9.46.1.7.2.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The current configuration revision number as known by the VTP member. When the database type is unknown for the VTP member, this value is 0."
  },
  "vtpDiscoverResultSystemName": {
    "name": "vtpDiscoverResultSystemName",
    "oid": "1.3.6.1.4.1.9.9.46.1.7.2.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 64
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "sysName of the VTP member."
  },
  "vtpDatabase": {
    "name": "vtpDatabase",
    "oid": "1.3.6.1.4.1.9.9.46.1.8",
    "class": "objectidentity"
  },
  "vtpDatabaseTable": {
    "name": "vtpDatabaseTable",
    "oid": "1.3.6.1.4.1.9.9.46.1.8.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains information of the VTP databases. It is not instantiated when managementDomainVersionInUse is version1(1), version2(3) or none(3)."
  },
  "vtpDatabaseEntry": {
    "name": "vtpDatabaseEntry",
    "oid": "1.3.6.1.4.1.9.9.46.1.8.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "managementDomainIndex",
        "implied": 0
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpDatabaseIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Information about the status of the VTP database in the domain. Each VTP database type known to the local device type has an entry in this table. An entry is also created for unknown database which is notified through VTP advertisements from other VTP servers."
  },
  "vtpDatabaseIndex": {
    "name": "vtpDatabaseIndex",
    "oid": "1.3.6.1.4.1.9.9.46.1.8.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A value assigned by the system which uniquely identifies a VTP database in the local system."
  },
  "vtpDatabaseName": {
    "name": "vtpDatabaseName",
    "oid": "1.3.6.1.4.1.9.9.46.1.8.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 64
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The name of the database."
  },
  "vtpDatabaseLocalMode": {
    "name": "vtpDatabaseLocalMode",
    "oid": "1.3.6.1.4.1.9.9.46.1.8.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "client": 1,
          "server": 2,
          "transparent": 3,
          "off": 4
        }
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The local VTP mode for a particular database type in this administrative domain. - 'client' indicates that the local system is acting as a VTP client of the database type. - 'server' indicates that the local system is acting as a VTP server of the database type. - 'transparent' indicates that the local system does not generate or listen to VTP messages of this database type, but forwards messages. This mode can also be set by the device itself when the size of database is too large for it to hold in DRAM. - 'off' indicates that the local system does not generate, listen to or forward any VTP messages of this database type. The default mode is 'client' for the database type known to the local device and 'transparent' for the unknown database type."
  },
  "vtpDatabaseRevNumber": {
    "name": "vtpDatabaseRevNumber",
    "oid": "1.3.6.1.4.1.9.9.46.1.8.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The current configuration revision number as known by the local device for this VTP 3 database type in the management domain. This value is updated (if necessary) whenever a VTP advertisement for the database type is received or generated. When the database type is unknown to the local device or no VTP advertisement for the database type is received or generated, its value is 0."
  },
  "vtpDatabasePrimaryServer": {
    "name": "vtpDatabasePrimaryServer",
    "oid": "1.3.6.1.4.1.9.9.46.1.8.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "There are two kinds of VTP version 3 servers for a certain database type - the primary server and the secondary server. When a local device is configured as a server for a certain database type, it becomes secondary server by default. Primary server is an operational role under which a server can initiate or change the VTP configuration of the database type. A true(1) value indicates that the local device is the primary server of the database type in the management domain. A false(2) value indicates that the local device is not the primary server, or the database type is unknown to the local device."
  },
  "vtpDatabasePrimaryServerId": {
    "name": "vtpDatabasePrimaryServerId",
    "oid": "1.3.6.1.4.1.9.9.46.1.8.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 64
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The unique identifier of the primary server in the management domain for the database type. If no primary server is discovered for the database type, the object has a value of zero length string."
  },
  "vtpDatabaseTakeOverPrimary": {
    "name": "vtpDatabaseTakeOverPrimary",
    "oid": "1.3.6.1.4.1.9.9.46.1.8.1.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "There are two kinds of VTP version 3 servers for a certain database type - the primary server and the secondary server. When a local device is configured as a server for a certain database type, it becomes secondary server by default. Primary server is an operational role under which a server can initiate or change the VTP configuration of the database type. Setting this object to a true(1) value will advertise the configuration of this database type to the whole domain. In order to successfully setting this object to true(1), the value of vtpDatabaseLocalMode must be server(2). Besides that, when the VTP password is hidden from the configuration file, the password (vtpDatabaseTakeOverPassword) which matches the secret key (vtpAuthSecretKey) must be provided in the same data packet. When read, the object always returns false(2)."
  },
  "vtpDatabaseTakeOverPassword": {
    "name": "vtpDatabaseTakeOverPassword",
    "oid": "1.3.6.1.4.1.9.9.46.1.8.1.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 64
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "When read, this object always returns the value of a zero-length octet string. In the case that the VTP password is hidden from the configuration and the local device intends to take over the whole domain, this object must be set to the matching password with the secret key (vtpAuthSecretKey) in the same data packet as which the vtpDatabaseTakeOverPrimary is in. In all the other situations, setting a valid value to this object has no impact on the system."
  },
  "vtpAuthentication": {
    "name": "vtpAuthentication",
    "oid": "1.3.6.1.4.1.9.9.46.1.9",
    "class": "objectidentity"
  },
  "vtpAuthenticationTable": {
    "name": "vtpAuthenticationTable",
    "oid": "1.3.6.1.4.1.9.9.46.1.9.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The table contains the authentication information of VTP in which the local system participates. The security mechanism of VTP relies on a secret key that is used to alter the MD5 digest of the packets transmitted on the wire. The secret value is created from a password that may be saved in plain text in the configuration or hidden from the configuration. The device creating or modifying the VTP configuration signs it using the MD5 digest generated from the secret key before advertising it. Other devices in the domain receive this configuration use the same secret key to accept it if correctly signed or drop it otherwise. The user has the option to hide the password from the configuration. Once the password is hidden, the secret key generated from the password is shown in the configuration instead, and there is no other way to show the password in plain text again but clearing it or resetting it. In an un-trusted area, the password on a device can be configured without being unveiled. After that, it has to be provided again by setting the same value to vtpDatabaseTakeOverPassword if the user wants to take over the whole VTP management domain of the database type. When managementDomainVersionInUse is version3(4), the authentication mechanism is common to all VTP database type."
  },
  "vtpAuthEntry": {
    "name": "vtpAuthEntry",
    "oid": "1.3.6.1.4.1.9.9.46.1.9.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "managementDomainIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Information about the status of the VTP authentication information in one domain."
  },
  "vtpAuthPassword": {
    "name": "vtpAuthPassword",
    "oid": "1.3.6.1.4.1.9.9.46.1.9.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 64
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "By default, this object has a value of a zero-length character string and is considered to be not configured. The device uses the password to generate the secret key. It can be stored in the configuration in plain text or hidden from the configuration. If a VTP server intends to modify the database's configuration in the domain but the password was hidden from the configuration, the same password (vtpDatabaseTakeOverPassword) as the hidden one has to be provided. When this object is set alone, vtpAuthPasswordType is set to plaintext(1) automatically by the system. Setting this object to a zero length character string resets the password to its default value and the password is considered as not configured. This object is not allowed to be set at the same time when vtpAuthSecretKey is set. When the vtpAuthPasswordType is hidden(2), this object will return a zero-length character string when read."
  },
  "vtpAuthPasswordType": {
    "name": "vtpAuthPasswordType",
    "oid": "1.3.6.1.4.1.9.9.46.1.9.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "plaintext": 1,
          "hidden": 2
        }
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "By default this object has the value as plaintext(1) and the VTP password is stored in the configuration file in plain text. Setting this object to hidden(2) will hide the password from the configuration. Once this object is set to hidden(2), it cannot be set to plaintext(1) alone. However, it may be set to plaintext(1) at the same time the password is set."
  },
  "vtpAuthSecretKey": {
    "name": "vtpAuthSecretKey",
    "oid": "1.3.6.1.4.1.9.9.46.1.9.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 0
          },
          {
            "min": 16,
            "max": 16
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The device creating or modifying the VTP configuration signs it using the MD5 digest generated from the secret key before advertising it. Other devices in the domain receiving this configuration use the same secret key to accept it if it was correctly signed or drop it otherwise. By default, the object has the value as a zero-length string and this value is read only. It is set to this value automatically when the password (vtpAuthPassword) is set to a zero-length octet string. The secret key can be either generated using the password or configured by the user. Once the secret key is configured by the user, it is stored as a hexadecimal string in the device's configuration and the password is considered to be the secret key's matching password and hidden from the configuration automatically. This object is not allowed to be set at the same time when vtpAuthPassword is set. The secret key is overwritten by a newly generated secret key when the password is re-configured."
  },
  "vlanStatistics": {
    "name": "vlanStatistics",
    "oid": "1.3.6.1.4.1.9.9.46.1.10",
    "class": "objectidentity"
  },
  "vlanStatsVlans": {
    "name": "vlanStatsVlans",
    "oid": "1.3.6.1.4.1.9.9.46.1.10.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the number of the existing manageable VLANs with VLAN indices from 1 to 1024 in the system."
  },
  "vlanStatsExtendedVlans": {
    "name": "vlanStatsExtendedVlans",
    "oid": "1.3.6.1.4.1.9.9.46.1.10.2",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the number of the existing manageable VLANs with VLAN indices greater than 1024 in the system."
  },
  "vlanStatsInternalVlans": {
    "name": "vlanStatsInternalVlans",
    "oid": "1.3.6.1.4.1.9.9.46.1.10.3",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the number of the internal VLANs existing in the system."
  },
  "vlanStatsFreeVlans": {
    "name": "vlanStatsFreeVlans",
    "oid": "1.3.6.1.4.1.9.9.46.1.10.4",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the number of the free or unused VLANs in the system."
  },
  "vtpNotifications": {
    "name": "vtpNotifications",
    "oid": "1.3.6.1.4.1.9.9.46.2",
    "class": "objectidentity"
  },
  "vtpNotificationsPrefix": {
    "name": "vtpNotificationsPrefix",
    "oid": "1.3.6.1.4.1.9.9.46.2.0",
    "class": "objectidentity"
  },
  "vtpNotificationsObjects": {
    "name": "vtpNotificationsObjects",
    "oid": "1.3.6.1.4.1.9.9.46.2.1",
    "class": "objectidentity"
  },
  "vtpConfigRevNumberError": {
    "name": "vtpConfigRevNumberError",
    "oid": "1.3.6.1.4.1.9.9.46.2.0.1",
    "class": "notificationtype",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "managementDomainConfigRevNumber"
      }
    ],
    "status": "current",
    "description": "A configuration revision number error notification signifies that a device has incremented its vtpConfigRevNumberErrors counter. Generation of this notification is suppressed if the vtpNotificationsEnabled has the value 'false'. The device must throttle the generation of consecutive vtpConfigRevNumberError notifications so that there is at least a five-second gap between notification of this type. When notification are throttled, they are dropped, not queued for sending at a future time. (Note that 'generating' a notification means sending to all configured recipients.)"
  },
  "vtpConfigDigestError": {
    "name": "vtpConfigDigestError",
    "oid": "1.3.6.1.4.1.9.9.46.2.0.2",
    "class": "notificationtype",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "managementDomainConfigRevNumber"
      }
    ],
    "status": "current",
    "description": "A configuration digest error notification signifies that a device has incremented its vtpConfigDigestErrors counter. Generation of this notification is suppressed if the vtpNotificationsEnabled has the value 'false'. The device must throttle the generation of consecutive vtpConfigDigestError notifications so that there is at least a five-second gap between notification of this type. When notification are throttled, they are dropped, not queued for sending at a future time. (Note that 'generating' a notification means sending to all configured recipients.)"
  },
  "vtpServerDisabled": {
    "name": "vtpServerDisabled",
    "oid": "1.3.6.1.4.1.9.9.46.2.0.3",
    "class": "notificationtype",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "managementDomainConfigRevNumber"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpMaxVlanStorage"
      }
    ],
    "status": "current",
    "description": "A VTP Server disabled notification is generated when the local system is no longer able to function as a VTP Server because the number of defined VLANs is greater than vtpMaxVlanStorage or the local system is not able to recover complete VTP information after a reboot. Generation of this notification is suppressed if the vtpNotificationsEnabled has the value 'false'."
  },
  "vtpMtuTooBig": {
    "name": "vtpMtuTooBig",
    "oid": "1.3.6.1.4.1.9.9.46.2.0.4",
    "class": "notificationtype",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortManagementDomain"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanState"
      }
    ],
    "status": "current",
    "description": "A VTP MTU tooBig notification is generated when a VLAN's MTU size is larger than can be supported either: - by one or more of its trunk ports: the included vtpVlanState has the value 'mtuTooBigForTrunk' and the included vlanTrunkPortManagementDomain is for the first (or only) trunk port, or - by the device itself: vtpVlanState has the value 'mtuTooBigForDevice' and any instance of vlanTrunkPortManagementDomain is included. Devices which have no trunk ports do not send vtpMtuTooBig notifications. Generation of this notification is suppressed if the vtpNotificationsEnabled has the value 'false'."
  },
  "vtpVersionOneDeviceDetected": {
    "name": "vtpVersionOneDeviceDetected",
    "oid": "1.3.6.1.4.1.9.9.46.2.0.6",
    "class": "notificationtype",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortManagementDomain"
      }
    ],
    "status": "current",
    "description": "A VTP version one device detected notification is generated by a device when: a) a management domain has been put into version 2 mode (as accessed by managementDomainVersionInUse). b) 15 minutes has passed since a). c) a version 1 PDU is detected on a trunk on the device that is in that management domain which has a lower revision number than the current configuration."
  },
  "vlanTrunkPortDynamicStatusChange": {
    "name": "vlanTrunkPortDynamicStatusChange",
    "oid": "1.3.6.1.4.1.9.9.46.2.0.7",
    "class": "notificationtype",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortDynamicStatus"
      }
    ],
    "status": "current",
    "description": "A vlanTrunkPortDynamicStatusChange notification is generated by a device when the value of vlanTrunkPortDynamicStatus object has been changed."
  },
  "vtpLocalModeChanged": {
    "name": "vtpLocalModeChanged",
    "oid": "1.3.6.1.4.1.9.9.46.2.0.8",
    "class": "notificationtype",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "managementDomainLocalMode"
      }
    ],
    "status": "current",
    "description": "A vtpLocalModeChanged notification is generated by a device when the value of the object managementDomainLocalMode is changed."
  },
  "vtpVersionInUseChanged": {
    "name": "vtpVersionInUseChanged",
    "oid": "1.3.6.1.4.1.9.9.46.2.0.9",
    "class": "notificationtype",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "managementDomainVersionInUse"
      }
    ],
    "status": "current",
    "description": "A vtpVersionInUseChanged notification is generated by a device when the value of the object managementDomainVersionInUse is changed."
  },
  "vtpVlanCreated": {
    "name": "vtpVlanCreated",
    "oid": "1.3.6.1.4.1.9.9.46.2.0.10",
    "class": "notificationtype",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanName"
      }
    ],
    "status": "current",
    "description": "A vtpVlanCreated notification is generated by a device when a VLAN is created."
  },
  "vtpVlanDeleted": {
    "name": "vtpVlanDeleted",
    "oid": "1.3.6.1.4.1.9.9.46.2.0.11",
    "class": "notificationtype",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanName"
      }
    ],
    "status": "current",
    "description": "A vtpVlanDeleted notification is generated by a device when a VLAN is deleted."
  },
  "vtpVlanRingNumberConflict": {
    "name": "vtpVlanRingNumberConflict",
    "oid": "1.3.6.1.4.1.9.9.46.2.0.12",
    "class": "notificationtype",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanRingNumber"
      },
      {
        "module": "IF-MIB",
        "object": "ifIndex"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanPortLocalSegment"
      }
    ],
    "status": "current",
    "description": "A VTP ring number configuration conflict notification is generated if, and only at the time when, a device learns of a conflict between: a) the ring number (vtpVlanPortLocalSegment) being used on a token ring segment attached to the port identified by ifIndex, and b) the VTP-obtained ring number (vtpVlanRingNumber) for the VLAN identified by vtpVlanIndex. When such a conflict occurs, the bridge port is put into an administrative down position until the conflict is resolved through local/network management intervention. This notification is only applicable to VLANs of type 'tokenRing'."
  },
  "vtpPruningStateOperChange": {
    "name": "vtpPruningStateOperChange",
    "oid": "1.3.6.1.4.1.9.9.46.2.0.13",
    "class": "notificationtype",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "managementDomainPruningStateOper"
      }
    ],
    "status": "current",
    "description": "A vtpPruningStateOperChange notification is generated by the device when the instance value of managementDomainPruningStateOper is changed."
  },
  "vtpVlanPortLocalSegment": {
    "name": "vtpVlanPortLocalSegment",
    "oid": "1.3.6.1.4.1.9.9.46.2.1.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "accessible-for-notify",
    "status": "current",
    "description": "The ring (segment) number in use on a 802.5 ring. For bridges supporting RFC 1525, this value is the same as given by dot1dSrPortLocalSegment for the bridge port attached to that ring. When tokenRing VLANs are in use, each 'trNet' VLAN can/does have a different instance of dot1dSrPortLocalSegment for each physical port. Note that access to the particuler instance of dot1dSrPortLocalSegment requires knowledge of how the agent supports the multiple 'contexts' required to implement RFC 1525 for multiple VLANs; also note that the assignment of ifIndex values may be different in different 'contexts'."
  },
  "vtpMIBConformance": {
    "name": "vtpMIBConformance",
    "oid": "1.3.6.1.4.1.9.9.46.3",
    "class": "objectidentity"
  },
  "vtpMIBCompliances": {
    "name": "vtpMIBCompliances",
    "oid": "1.3.6.1.4.1.9.9.46.3.1",
    "class": "objectidentity"
  },
  "vtpMIBGroups": {
    "name": "vtpMIBGroups",
    "oid": "1.3.6.1.4.1.9.9.46.3.2",
    "class": "objectidentity"
  },
  "vtpMIBCompliance": {
    "name": "vtpMIBCompliance",
    "oid": "1.3.6.1.4.1.9.9.46.3.1.1",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "vtpBasicGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpStatsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpTrunkPortGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoEditGroup",
        "module": "CISCO-VTP-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for VTP implementations."
  },
  "vtpMIBCompliance2": {
    "name": "vtpMIBCompliance2",
    "oid": "1.3.6.1.4.1.9.9.46.3.1.2",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "vtpBasicGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpStatsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpTrunkPortGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoEditGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtp4kVlanGroup",
        "module": "CISCO-VTP-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for VTP implementations."
  },
  "vtpMIBCompliance3": {
    "name": "vtpMIBCompliance3",
    "oid": "1.3.6.1.4.1.9.9.46.3.1.3",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "vtpBasicGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpStatsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpTrunkPortGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoEditGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtp4kVlanGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpDot1qTunnelGroup",
        "module": "CISCO-VTP-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for VTP implementations."
  },
  "vtpMIBCompliance4": {
    "name": "vtpMIBCompliance4",
    "oid": "1.3.6.1.4.1.9.9.46.3.1.4",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "vtpBasicGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpStatsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpTrunkPortGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoEditGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtp4kVlanGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpDot1qTunnelGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanIfIndexGroup",
        "module": "CISCO-VTP-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for VTP implementations."
  },
  "vtpMIBCompliance5": {
    "name": "vtpMIBCompliance5",
    "oid": "1.3.6.1.4.1.9.9.46.3.1.5",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "vtpBasicGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpStatsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpTrunkPortGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVersion2BasicGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoEditGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtp4kVlanGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpDot1qTunnelGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanIfIndexGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoEditGroup2",
        "module": "CISCO-VTP-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for VTP implementations."
  },
  "vtpMIBCompliance6": {
    "name": "vtpMIBCompliance6",
    "oid": "1.3.6.1.4.1.9.9.46.3.1.6",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "vtpBasicGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpConfigNotificationsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpStatsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpTrunkPortGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVersion2BasicGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpNotificationObjectsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoEditGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtp4kVlanGroupRev1",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpDot1qTunnelGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanIfIndexGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoEditGroup2",
        "module": "CISCO-VTP-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for VTP implementations."
  },
  "vtpMIBCompliance7": {
    "name": "vtpMIBCompliance7",
    "oid": "1.3.6.1.4.1.9.9.46.3.1.7",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "vtpBasicGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpConfigNotificationsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpStatsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpTrunkPortGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVersion2BasicGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpNotificationObjectsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoEditGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtp4kVlanGroupRev1",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpDot1qTunnelGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanIfIndexGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoEditGroup2",
        "module": "CISCO-VTP-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for VTP implementations."
  },
  "vtpMIBCompliance8": {
    "name": "vtpMIBCompliance8",
    "oid": "1.3.6.1.4.1.9.9.46.3.1.8",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "vtpBasicGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpConfigNotificationsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpStatsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpTrunkPortGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVersion2BasicGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpNotificationObjectsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoEditGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtp4kVlanGroupRev1",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpDot1qTunnelGroup2",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanIfIndexGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoEditGroup2",
        "module": "CISCO-VTP-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for VTP implementations."
  },
  "vtpMIBCompliance9": {
    "name": "vtpMIBCompliance9",
    "oid": "1.3.6.1.4.1.9.9.46.3.1.9",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "vtpBasicGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpConfigNotificationsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpStatsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpTrunkPortGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVersion2BasicGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpNotificationObjectsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoEditGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtp4kVlanGroupRev1",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanIfIndexGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoEditGroup2",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanNotifEnabledGroup",
        "module": "CISCO-VTP-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for VTP implementations."
  },
  "vtpMIBCompliance10": {
    "name": "vtpMIBCompliance10",
    "oid": "1.3.6.1.4.1.9.9.46.3.1.10",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "vtpBasicGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpConfigNotificationsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpStatsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpTrunkPortGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVersion2BasicGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpNotificationObjectsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoEditGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtp4kVlanGroupRev1",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanIfIndexGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoEditGroup2",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanNotifEnabledGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpDiscoverGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpDatabaseGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpAuthGroup",
        "module": "CISCO-VTP-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for VTP implementations."
  },
  "vtpMIBCompliance11": {
    "name": "vtpMIBCompliance11",
    "oid": "1.3.6.1.4.1.9.9.46.3.1.11",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "vtpBasicGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpConfigNotificationsGroupRev1",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpStatsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpTrunkPortGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVersion2BasicGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpNotificationObjectsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoEditGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtp4kVlanGroupRev1",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanIfIndexGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoEditGroup2",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanNotifEnabledGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpDiscoverGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpDatabaseGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpAuthGroup",
        "module": "CISCO-VTP-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for VTP implementations."
  },
  "vtpMIBCompliance12": {
    "name": "vtpMIBCompliance12",
    "oid": "1.3.6.1.4.1.9.9.46.3.1.12",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "vtpBasicGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpConfigNotificationsGroupRev1",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpStatsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpTrunkPortGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVersion2BasicGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpNotificationObjectsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoEditGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtp4kVlanGroupRev1",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanIfIndexGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoEditGroup2",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanNotifEnabledGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpDiscoverGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpDatabaseGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpAuthGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpInternalVlanGrp",
        "module": "CISCO-VTP-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for VTP implementations."
  },
  "vtpMIBCompliance13": {
    "name": "vtpMIBCompliance13",
    "oid": "1.3.6.1.4.1.9.9.46.3.1.13",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "vtpBasicGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpConfigNotificationsGroupRev1",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpStatsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpTrunkPortGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVersion2BasicGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpNotificationObjectsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoEditGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtp4kVlanGroupRev1",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanIfIndexGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoEditGroup2",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanNotifEnabledGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpDiscoverGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpDatabaseGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpAuthGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpInternalVlanGrp",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vlanStatsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpConfigNotificationsGroup6",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpConfigNotificationsGroup7",
        "module": "CISCO-VTP-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for VTP implementations."
  },
  "vtpMIBCompliance14": {
    "name": "vtpMIBCompliance14",
    "oid": "1.3.6.1.4.1.9.9.46.3.1.14",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "vtpBasicGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpConfigNotificationsGroupRev1",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpStatsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpTrunkPortGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVersion2BasicGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpNotificationObjectsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpTrunkPruningGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpTrunkPruningGroup2",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpTrunkPortGroup2",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoEditGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpTrunkPortGroup3",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtp4kVlanGroupRev1",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanIfIndexGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoEditGroup2",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanNotifEnabledGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpConfigNotificationsGroup2",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpConfigNotificationsGroup3",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpConfigNotificationsGroup4",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpDiscoverGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpDatabaseGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpAuthGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpInternalVlanGrp",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vlanStatsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpConfigNotificationsGroup6",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpConfigNotificationsGroup7",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpTrunkPruningGroup3",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpConfigNotificationsGroup8",
        "module": "CISCO-VTP-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for VTP implementations."
  },
  "vtpMIBCompliance15": {
    "name": "vtpMIBCompliance15",
    "oid": "1.3.6.1.4.1.9.9.46.3.1.15",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "vtpBasicGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpConfigNotificationsGroupRev1",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpStatsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpTrunkPortGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVersion2BasicGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpNotificationObjectsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpTrunkPruningGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpTrunkPruningGroup2",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpTrunkPortGroup2",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoEditGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpTrunkPortGroup3",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtp4kVlanGroupRev1",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanIfIndexGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoEditGroup2",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanNotifEnabledGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpConfigNotificationsGroup2",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpConfigNotificationsGroup3",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpConfigNotificationsGroup4",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpDiscoverGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpDatabaseGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpAuthGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpInternalVlanGrp",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vlanStatsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpConfigNotificationsGroup6",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpConfigNotificationsGroup7",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpTrunkPruningGroup3",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpConfigNotificationsGroup8",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vlanTrunkPortActiveVlansGroup",
        "module": "CISCO-VTP-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for VTP implementations."
  },
  "vtpMIBCompliance16": {
    "name": "vtpMIBCompliance16",
    "oid": "1.3.6.1.4.1.9.9.46.3.1.16",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "vtpBasicGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpConfigNotificationsGroupRev1",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpStatsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpTrunkPortGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVersion2BasicGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpNotificationObjectsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpTrunkPruningGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpTrunkPruningGroup2",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpTrunkPortGroup2",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoEditGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpTrunkPortGroup3",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtp4kVlanGroupRev1",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanIfIndexGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanInfoEditGroup2",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanNotifEnabledGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpConfigNotificationsGroup2",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpConfigNotificationsGroup3",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpConfigNotificationsGroup4",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpDiscoverGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpDatabaseGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpAuthGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpInternalVlanGrp",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vlanStatsGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpConfigNotificationsGroup6",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpConfigNotificationsGroup7",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpTrunkPruningGroup3",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpConfigNotificationsGroup8",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vlanTrunkPortActiveVlansGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpSourceInterfaceGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpConfigFileGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpVlanLocalShutdownGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpLocalUpdaterGroup",
        "module": "CISCO-VTP-MIB"
      },
      {
        "object": "vtpDeviceIdGroup",
        "module": "CISCO-VTP-MIB"
      }
    ],
    "status": "current",
    "description": "The compliance statement for VTP implementations."
  },
  "vtpBasicGroup": {
    "name": "vtpBasicGroup",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.1",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVersion"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpMaxVlanStorage"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpNotificationsEnabled"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "managementDomainName"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "managementDomainLocalMode"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "managementDomainConfigRevNumber"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "managementDomainLastUpdater"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "managementDomainLastChange"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "managementDomainTftpServer"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "managementDomainTftpPathname"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "managementDomainRowStatus"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing basic status and control of a VTP implementation."
  },
  "vtpVlanInfoGroup": {
    "name": "vtpVlanInfoGroup",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.13",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanState"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanType"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanName"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanMtu"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanDot10Said"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanRingNumber"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanBridgeNumber"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanStpType"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanParentVlan"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanTranslationalVlan1"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanTranslationalVlan2"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanBridgeType"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanAreHopCount"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanSteHopCount"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanIsCRFBackup"
      }
    ],
    "status": "current",
    "description": "A collection of objects for monitoring VLAN information."
  },
  "vtpVlanInfoEditGroup": {
    "name": "vtpVlanInfoEditGroup",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.14",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanEditOperation"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanApplyStatus"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanEditBufferOwner"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanEditConfigRevNumber"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanEditState"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanEditType"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanEditName"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanEditMtu"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanEditDot10Said"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanEditRingNumber"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanEditBridgeNumber"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanEditStpType"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanEditParentVlan"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanEditRowStatus"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanEditTranslationalVlan1"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanEditTranslationalVlan2"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanEditBridgeType"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanEditAreHopCount"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanEditSteHopCount"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanEditIsCRFBackup"
      }
    ],
    "status": "current",
    "description": "A collection of objects for editing VLAN information in VTP Servers."
  },
  "vtpStatsGroup": {
    "name": "vtpStatsGroup",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.4",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpInSummaryAdverts"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpInSubsetAdverts"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpInAdvertRequests"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpOutSummaryAdverts"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpOutSubsetAdverts"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpOutAdvertRequests"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpConfigRevNumberErrors"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpConfigDigestErrors"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing VTP statistics."
  },
  "vtpTrunkPortGroup": {
    "name": "vtpTrunkPortGroup",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.5",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortManagementDomain"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortEncapsulationType"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortVlansEnabled"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortNativeVlan"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortRowStatus"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortSetSerialNo"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing information on trunk ports."
  },
  "vtpTrunkPortGroup2": {
    "name": "vtpTrunkPortGroup2",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.11",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortDynamicState"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortDynamicStatus"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortVtpEnabled"
      }
    ],
    "status": "current",
    "description": "Additional functionality added to the vlanTrunkPortTable."
  },
  "vtpTrunkPortGroup3": {
    "name": "vtpTrunkPortGroup3",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.15",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortEncapsulationOperType"
      }
    ],
    "status": "current",
    "description": "Additional functionality added to the vlanTrunkPortTable."
  },
  "vtpTrunkPruningGroup": {
    "name": "vtpTrunkPruningGroup",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.7",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortInJoins"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortOutJoins"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortOldAdverts"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortVlansPruningEligible"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortVlansXmitJoined"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortVlansRcvJoined"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing information on VLAN pruning."
  },
  "vtpTrunkPruningGroup2": {
    "name": "vtpTrunkPruningGroup2",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.10",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "managementDomainPruningState"
      }
    ],
    "status": "current",
    "description": "A collection of object providing information on whether VLAN pruning is enabled."
  },
  "vtpVersion2BasicGroup": {
    "name": "vtpVersion2BasicGroup",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.12",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "managementDomainVersionInUse"
      }
    ],
    "status": "current",
    "description": "The object required to indicate the version of VTP in use by a management domain."
  },
  "vtpConfigNotificationsGroup": {
    "name": "vtpConfigNotificationsGroup",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.6",
    "class": "notificationgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpConfigDigestError"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpConfigRevNumberError"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpServerDisabled"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpMtuTooBig"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVersionOneDeviceDetected"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortDynamicStatusChange"
      }
    ],
    "status": "deprecated",
    "description": "The notifications which a VTP implementation is required to implement. vtpConfigNotificationsGroup object is superseded by vtpConfigNotificationsGroupRev1, vtpConfigNotificationsGroup5."
  },
  "vtp4kVlanGroup": {
    "name": "vtp4kVlanGroup",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.16",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanTypeExt"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanEditTypeExt"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortVlansEnabled2k"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortVlansEnabled3k"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortVlansEnabled4k"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlansPruningEligible2k"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlansPruningEligible3k"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlansPruningEligible4k"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortVlansXmitJoined2k"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortVlansXmitJoined3k"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortVlansXmitJoined4k"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortVlansRcvJoined2k"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortVlansRcvJoined3k"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortVlansRcvJoined4k"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects providing information for VLANS with VlanIndex from 1024 to 4095. vtp4kVlanGroup object is superseded by vtp4kVlanGroupRev1."
  },
  "vtpDot1qTunnelGroup": {
    "name": "vtpDot1qTunnelGroup",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.17",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortsDot1qTag"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortDot1qTunnel"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects providing information for dot1qtunnel feature. vtpDot1qTunnelGroup object is superseded by vtpDot1qTunnelGroup2."
  },
  "vtpVlanIfIndexGroup": {
    "name": "vtpVlanIfIndexGroup",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.18",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanIfIndex"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing information for mapping of VLAN ID to its corresponding ifIndex."
  },
  "vtpVlanInfoEditGroup2": {
    "name": "vtpVlanInfoEditGroup2",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.19",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanEditModifiedVlan"
      }
    ],
    "status": "current",
    "description": "A collection of objects for editing VLAN information when only one VLAN is allowed to be edited for each 'apply' operation."
  },
  "vtp4kVlanGroupRev1": {
    "name": "vtp4kVlanGroupRev1",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.20",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanTypeExt"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanEditTypeExt2"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortVlansEnabled2k"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortVlansEnabled3k"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortVlansEnabled4k"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlansPruningEligible2k"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlansPruningEligible3k"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlansPruningEligible4k"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortVlansXmitJoined2k"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortVlansXmitJoined3k"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortVlansXmitJoined4k"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortVlansRcvJoined2k"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortVlansRcvJoined3k"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortVlansRcvJoined4k"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing information for VLANS with VlanIndex from 1024 to 4095."
  },
  "vtpNotificationObjectsGroup": {
    "name": "vtpNotificationObjectsGroup",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.21",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanPortLocalSegment"
      }
    ],
    "status": "current",
    "description": "A collection of objects included in VTP notifications."
  },
  "vtpDot1qTunnelGroup2": {
    "name": "vtpDot1qTunnelGroup2",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.22",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortsDot1qTag"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects providing information for dot1qtunnel feature."
  },
  "vtpConfigNotificationsGroup2": {
    "name": "vtpConfigNotificationsGroup2",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.23",
    "class": "notificationgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpLocalModeChanged"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVersionInUseChanged"
      }
    ],
    "status": "current",
    "description": "The notifications which a VTP implementation is required to implement."
  },
  "vtpVlanNotifEnabledGroup": {
    "name": "vtpVlanNotifEnabledGroup",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.24",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanCreatedNotifEnabled"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanDeletedNotifEnabled"
      }
    ],
    "status": "current",
    "description": "A collection of objects to indicate whether a certain group of notifications are enabled."
  },
  "vtpConfigNotificationsGroup3": {
    "name": "vtpConfigNotificationsGroup3",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.25",
    "class": "notificationgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanCreated"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanDeleted"
      }
    ],
    "status": "current",
    "description": "The notifications implemented by a device which supports these features."
  },
  "vtpConfigNotificationsGroup4": {
    "name": "vtpConfigNotificationsGroup4",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.26",
    "class": "notificationgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanRingNumberConflict"
      }
    ],
    "status": "current",
    "description": "The notifications implemented by a device which supports these features."
  },
  "vtpDiscoverGroup": {
    "name": "vtpDiscoverGroup",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.27",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpDiscoverAction"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpDiscoverStatus"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpLastDiscoverTime"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpDiscoverResultIndex"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpDiscoverResultDatabaseName"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpDiscoverResultConflicting"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpDiscoverResultDeviceId"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpDiscoverResultPrimaryServer"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpDiscoverResultRevNumber"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpDiscoverResultSystemName"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing information of VTP discovery."
  },
  "vtpDatabaseGroup": {
    "name": "vtpDatabaseGroup",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.28",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpDatabaseName"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpDatabaseLocalMode"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpDatabaseRevNumber"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpDatabasePrimaryServer"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpDatabasePrimaryServerId"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpDatabaseTakeOverPrimary"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpDatabaseTakeOverPassword"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing information of VTP databases."
  },
  "vtpAuthGroup": {
    "name": "vtpAuthGroup",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.29",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpAuthPassword"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpAuthPasswordType"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpAuthSecretKey"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing information of VTP authentication mechanism."
  },
  "vtpConfigNotificationsGroupRev1": {
    "name": "vtpConfigNotificationsGroupRev1",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.30",
    "class": "notificationgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpConfigDigestError"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpConfigRevNumberError"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVersionOneDeviceDetected"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortDynamicStatusChange"
      }
    ],
    "status": "current",
    "description": "The notifications which a VTP implementation is required to implement."
  },
  "vtpConfigNotificationsGroup5": {
    "name": "vtpConfigNotificationsGroup5",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.31",
    "class": "notificationgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpServerDisabled"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpMtuTooBig"
      }
    ],
    "status": "deprecated",
    "description": "The additional notifications that may be related to a VTP implementation. vtpConfigNotificationsGroup5 object is superseded by vtpConfigNotificationsGroup6, vtpConfigNotificationsGroup7."
  },
  "vtpInternalVlanGrp": {
    "name": "vtpInternalVlanGrp",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.32",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpInternalVlanAllocPolicy"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpInternalVlanOwner"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing information of internal VLANs."
  },
  "vlanStatsGroup": {
    "name": "vlanStatsGroup",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.33",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanStatsVlans"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanStatsExtendedVlans"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanStatsInternalVlans"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanStatsFreeVlans"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing VLAN statistics information in the system."
  },
  "vtpConfigNotificationsGroup6": {
    "name": "vtpConfigNotificationsGroup6",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.34",
    "class": "notificationgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpServerDisabled"
      }
    ],
    "status": "current",
    "description": "The additional notifications that may be related to a VTP implementation."
  },
  "vtpConfigNotificationsGroup7": {
    "name": "vtpConfigNotificationsGroup7",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.35",
    "class": "notificationgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpMtuTooBig"
      }
    ],
    "status": "current",
    "description": "The additional notifications that may be related to a VTP implementation."
  },
  "vtpTrunkPruningGroup3": {
    "name": "vtpTrunkPruningGroup3",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.36",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "managementDomainPruningStateOper"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing information on operational VTP pruning state in a manamgement domain."
  },
  "vtpConfigNotificationsGroup8": {
    "name": "vtpConfigNotificationsGroup8",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.37",
    "class": "notificationgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpPruningStateOperChange"
      }
    ],
    "status": "current",
    "description": "The additional notifications for operational VTP pruning state change in a management domain."
  },
  "vlanTrunkPortActiveVlansGroup": {
    "name": "vlanTrunkPortActiveVlansGroup",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.38",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortVlansActiveFirst2k"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "vlanTrunkPortVlansActiveSecond2k"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing active vlan information for a trunking port in a management domain."
  },
  "vtpSourceInterfaceGroup": {
    "name": "vtpSourceInterfaceGroup",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.39",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "managementDomainAdminSrcIf"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "managementDomainSourceOnlyMode"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "managementDomainOperSrcIf"
      }
    ],
    "status": "current",
    "description": "A collection of object providing the preferred source interface for the VTP IP updater address."
  },
  "vtpConfigFileGroup": {
    "name": "vtpConfigFileGroup",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.40",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "managementDomainConfigFile"
      }
    ],
    "status": "current",
    "description": "A collection of object providing the location of VTP configuration file."
  },
  "vtpVlanLocalShutdownGroup": {
    "name": "vtpVlanLocalShutdownGroup",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.41",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "vtpVlanLocalShutdown"
      }
    ],
    "status": "current",
    "description": "A collection of object providing the VLAN local shutdown state."
  },
  "vtpLocalUpdaterGroup": {
    "name": "vtpLocalUpdaterGroup",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.42",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "managementDomainLocalUpdaterType"
      },
      {
        "module": "CISCO-VTP-MIB",
        "object": "managementDomainLocalUpdater"
      }
    ],
    "status": "current",
    "description": "A collection of object providing the local updater IP address."
  },
  "vtpDeviceIdGroup": {
    "name": "vtpDeviceIdGroup",
    "oid": "1.3.6.1.4.1.9.9.46.3.2.43",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-VTP-MIB",
        "object": "managementDomainDeviceID"
      }
    ],
    "status": "current",
    "description": "A collection of object providing the device id."
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/CISCO-VTP-MIB",
      "Produced by pysmi-0.3.4 at Fri May 24 16:55:10 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "CISCO-VTP-MIB"
  }
}