{
  "imports": {
    "class": "imports",
    "CISCO-WAN-MG-MIB": [
      "mgProtocolNumber",
      "mgcNumber"
    ],
    "CISCOWAN-SMI": [
      "ciscoWan"
    ],
    "SNMPv2-CONF": [
      "MODULE-COMPLIANCE",
      "OBJECT-GROUP",
      "NOTIFICATION-GROUP"
    ],
    "SNMPv2-SMI": [
      "Integer32",
      "Bits",
      "Counter64",
      "Unsigned32",
      "Counter32",
      "NOTIFICATION-TYPE",
      "IpAddress",
      "MODULE-IDENTITY",
      "Gauge32",
      "MibIdentifier",
      "OBJECT-TYPE",
      "OBJECT-IDENTITY",
      "TimeTicks",
      "iso"
    ],
    "SNMPv2-TC": [
      "TEXTUAL-CONVENTION",
      "DisplayString",
      "TruthValue",
      "RowStatus"
    ]
  },
  "ciscoWanMgcRedunMIB": {
    "name": "ciscoWanMgcRedunMIB",
    "oid": "1.3.6.1.4.1.351.150.22",
    "class": "moduleidentity",
    "revisions": [
      {
        "revision": "2004-01-19 00:00",
        "description": "Update MIB with description changes"
      },
      {
        "revision": "2001-12-26 00:00",
        "description": "Added mgcRedundancyGrpProtocolRowStatus, mgcRedGrpProtPersistEvtPolicy, mgcRedGrpProtQuarantinePolicy, mgcRedGrpProtSigEvtOnOffPolicy, mgcRedGrpProtProvisionalResponse, mgcRedGrpProtResponseAckAttr, mgcRedGrpProtDisconnectProcedure, mgcRedGrpProtCancelGraceful for MGCP1.0 enhancements."
      },
      {
        "revision": "2001-07-19 15:00",
        "description": "Initial version of the MIB"
      }
    ],
    "lastupdated": "200401190000Z",
    "organization": "Cisco Systems, Inc.",
    "contactinfo": " Cisco Systems Customer Service Postal: 170 W Tasman Drive San Jose, CA 95134 USA Tel: +1 800 553-NETS E-mail: cs-vism@cisco.com",
    "description": "The MIB module for Media Gateways (MGs) to allow multiple Media Gateway Controllers (MGCs) to be configured and managed on the Gateway. MGCs can be group together as part of the same MGC redundancy group. Terms used: CA: Call Agent GW: Gateway MGC: Media Gateway Controller MGCP: Media Gateway Control Protocol NTFY: Notify message (MGCP standard message) RSIP: Restart In Progress (MGCP standard message) RSVP: Resource Reservation Setup Protocol SGCP: Simple Gateway Control Protocol SRCP: Simple Resource Coordination Protocol"
  },
  "mgcRedundancyObjects": {
    "name": "mgcRedundancyObjects",
    "oid": "1.3.6.1.4.1.351.150.22.1",
    "class": "objectidentity"
  },
  "mgcRedundancyGrpTable": {
    "name": "mgcRedundancyGrpTable",
    "oid": "1.3.6.1.4.1.351.150.22.1.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Multiple Media Gateway Controllers can be grouped together as part of the same MGC redundancy group. This configuration supports the notion of redundant Media Gateway Controllers. This table keeps track of the MGCs in a redundancy group. It is used to create MGC redundancy groups. MGCs can also be removed from a group."
  },
  "mgcRedundancyGrpEntry": {
    "name": "mgcRedundancyGrpEntry",
    "oid": "1.3.6.1.4.1.351.150.22.1.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-WAN-MGC-REDUN-MIB",
        "object": "mgcRedundancyGrpNum",
        "implied": 0
      },
      {
        "module": "CISCO-WAN-MG-MIB",
        "object": "mgcNumber",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Each row in the table is identified by an mgcRedundancyGrpNum and mgcNumber. Before adding an entry into this table the MGC has to be added in mgcTable defined in CISCO-WAN-MG-MIB. A single mgcRedundancyGrp can have multiple MGCs."
  },
  "mgcRedundancyGrpNum": {
    "name": "mgcRedundancyGrpNum",
    "oid": "1.3.6.1.4.1.351.150.22.1.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This is the MGC group number. A group can contain more than 1 MGC. So for a group containing more than 1 MGC, there will be more than 1 row of this table that will have a common group number."
  },
  "mgcRedundancyGrpPref": {
    "name": "mgcRedundancyGrpPref",
    "oid": "1.3.6.1.4.1.351.150.22.1.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Allows to configure the preference on a MGCs. The GW use this object in the selection of an MGC when there are multiple MGCs in the same MGC redundancy group. This object can be modified at any time while the mgcRedundancyGrpRowStatus is 'active'. It has to be unique among various MGCs of a same MGC redundancy group. The lower the number the higher the preference, for example 1 will have higher preference than 2."
  },
  "mgcRedundancyGrpActState": {
    "name": "mgcRedundancyGrpActState",
    "oid": "1.3.6.1.4.1.351.150.22.1.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "mgcActive": 1,
          "mgcInactive": 2
        }
      }
    },
    "default": {
      "default": {
        "value": "mgcInactive",
        "format": "enum"
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object is used to denote the status of MGC within an MGC Redundancy group. 'mgcActive' - Indicates the MGC is active or controlling the GW. 'mgcInactive' - Indicates the MGC is in standby state."
  },
  "mgcRedundancyGrpRowStatus": {
    "name": "mgcRedundancyGrpRowStatus",
    "oid": "1.3.6.1.4.1.351.150.22.1.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Controls the creation and deletion of a table entry. An entry may be created using the 'createAndGo' option. When the row is successfully created, the RowStatus would be set to 'active' by the agent. An entry may be deleted by setting the RowStatus to 'destroy'. Other options such as `createAndWait', 'notInService', 'notReady' are not supported. mgcRedundancyGrpNum, mgcNumber and mgcRedundancyGrpPref are the mandatory parameters while creating an entry."
  },
  "mgcRedundancyGrpParamTable": {
    "name": "mgcRedundancyGrpParamTable",
    "oid": "1.3.6.1.4.1.351.150.22.1.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains the parameters of the MGC redundancy groups like the association state and priority of the group within the GW. An entry in this table is implicitly created when the first MGC is added for an MGC redundancy group. The objects are set to their default values. When the last MGC from an MGC redundancy group is removed, the corresponding entry from this table is implicitly removed."
  },
  "mgcRedundancyGrpParamEntry": {
    "name": "mgcRedundancyGrpParamEntry",
    "oid": "1.3.6.1.4.1.351.150.22.1.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-WAN-MGC-REDUN-MIB",
        "object": "mgcRedundancyGrpNum",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Represents an individual entry in the mgcRedundancyGrpParamTable."
  },
  "mgcRedundancyGrpStateChangeNtfy": {
    "name": "mgcRedundancyGrpStateChangeNtfy",
    "oid": "1.3.6.1.4.1.351.150.22.1.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "true",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object 'true(1) will enable sending state change notifications to the MGC. 'false(2)' will disable sending state change notifications to MGC, for example, if MGCP/SGCP is the protocol used, then RSIPs are sent to the MGC if this object is set to 'true(1)'."
  },
  "mgcRedundancyGrpCommState": {
    "name": "mgcRedundancyGrpCommState",
    "oid": "1.3.6.1.4.1.351.150.22.1.2.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "commOk": 1,
          "commLoss": 2
        }
      }
    },
    "default": {
      "default": {
        "value": "commLoss",
        "format": "enum"
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Represents the state of the communication between the GW and the MGC (call agent) group. The possible values are: 'commOk': This indicates that the communication between the gateway and the media gateway controller is ok. 'commLoss': This indicates that the communication between the GW and the MGC is lost. This object is set to 'commLoss' if no response is receive from any MGC in this group to a GW initiated message. If the GW is able to successfully send a message to the MGC or if a message is received from the MGC, the value of this object is set to 'commOk' else it will remain in the 'commLoss' state."
  },
  "mgcRedundancyGrpPriority": {
    "name": "mgcRedundancyGrpPriority",
    "oid": "1.3.6.1.4.1.351.150.22.1.2.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 65535
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 1,
        "format": "decimal"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This field determines the priority amongst the MGC redundancy groups within the GW. A MGC group with a priority of 0 means that the MGC group is not interested in receiving GW initiated messages. A group with a priority value of 1 has the highest preference. A higher value indicates a lower preference. Multiple MGC redundancy groups can have the same priority."
  },
  "mgcRedundancyGrpProtocolTable": {
    "name": "mgcRedundancyGrpProtocolTable",
    "oid": "1.3.6.1.4.1.351.150.22.1.3",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains information about which protocols are being used in a particular association between the gateway and the MGC redundancy groups. Because there may be a number of different protocols in use for a particular control association between the gateway and an MGC group, this information is kept in a separate table rather than being included in mgcRedundancyGrpTable. In effect, it constitutes a relationship between mgcRedundancyGrpTable and mgSupportedProtocolTable defined in CISCO-WAN-MG-MIB. This table restricts all MGCs within a MGC redundancy group to have the same set of protocols defined."
  },
  "mgcRedundancyGrpProtocolEntry": {
    "name": "mgcRedundancyGrpProtocolEntry",
    "oid": "1.3.6.1.4.1.351.150.22.1.3.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-WAN-MGC-REDUN-MIB",
        "object": "mgcRedundancyGrpNum",
        "implied": 0
      },
      {
        "module": "CISCO-WAN-MG-MIB",
        "object": "mgProtocolNumber",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Represents an individual table entry in mgcRedundancyGrpProtocolTable. When active, it is expected that mgcRedundancyGrpNum and mgProtocolNumber contain valid values that maintain referential integrity into mgcRedundancyGrpTable and mgSupportedProtocolTable respectively. The attempt to create a row that would violate referential integrity shall be rejected."
  },
  "mgcRedundancyGrpProtocolRowStatus": {
    "name": "mgcRedundancyGrpProtocolRowStatus",
    "oid": "1.3.6.1.4.1.351.150.22.1.3.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Controls the creation and deletion of a table entry. An entry may be created using the 'createAndGo' option. When the row is successfully created, the mgcRedundancyGrpProtocolRowStatus would be set to 'active' by the agent. An entry can be modified at any time while the mgcRedundancyGrpProtocolRowStatus is 'active'. An entry may be deleted by setting the mgcRedundancyGrpProtocolRowStatus to 'destroy'."
  },
  "mgcRedGrpProtPersistEvtPolicy": {
    "name": "mgcRedGrpProtPersistEvtPolicy",
    "oid": "1.3.6.1.4.1.351.150.22.1.3.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "quarantinePersistEvts": 1,
          "notQuarantinePersistEvts": 2
        }
      }
    },
    "default": {
      "default": {
        "value": "quarantinePersistEvts",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object determines how the persistent events will be notified. Persistent events are events that call agent wants to be notified without explicitly requesting for it. A set of events can be provisioned on the Gateway as persistent events. Every event will have an action associated with it, which will determine, whether to be notified, ignored, accumulated etc.. MGC will specify the action when requesting the GW to notify the event. For persistent events the Action will be Notify. Call agent can change this by explicitly requesting the event associating an action with it. During the period where the Gateway has received a notification acknowledgement, and waiting for the next Request Notification, events could be observed. The Quarantine procedure determines what should be done with these events. This object is used to supercede the quarantine procedure, by enforcing loop, process as the quarantine procedure only for persistent events. During the period the Gateway has sent a Notification, and waiting for the acknowledgement all events including the persistent events will 'quarantinePersistEvts' - Quarantine Persistent events as in the case of non persistent events as determined by quarantine method. 'notQuarantinePersistEvts' - Don't quarantine Persistent events, and notify them. During the period the Gateway has sent a Notify and waiting for the acknowledgement, every event including persistent event will be quarantined. This value does not supercede that behaviour. This applies only during the period, where a Notify is acknowledged and waiting for the next RQNT where the quarantine method is 'step,process' or 'step,discard'. This object has no relevance when the protocol is SRCP."
  },
  "mgcRedGrpProtQuarantinePolicy": {
    "name": "mgcRedGrpProtQuarantinePolicy",
    "oid": "1.3.6.1.4.1.351.150.22.1.3.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "stepProcess": 1,
          "stepDiscard": 2,
          "loopProcess": 3,
          "loopDiscard": 4
        }
      }
    },
    "maxaccess": "read-create",
    "reference": "Media Gateway Control Protocol (MGCP), version 1.0 bis, May 10, 2001 : Sections 3.2.2.18, 3.3.1, 3.3.2.",
    "status": "current",
    "description": "This object determines the quarantine policy when MGC doesn't explicitly specify one. When a Request Notification is received from the MGC, the Gateway on observing the first event that qualifies to be notified will generate a Notify message with the list of observed events including the event which triggered the Notify. After the MGC acknowledges the Notify, if further events are observed and an event which qualifies to be notified, the Gateway may notify the event, or quarantine it until the next Request Notification, based on the quarantine policy set by the MGC. When the MGC doesn't explicitly specify the quarantine policy, the protocol defines the default behaviour. The default behaviour varies with different versions of the protocol. This object allows the user to configure the default quarantine policy per protocol per redundancy group. The default value for this object will be set based on the protocol. 'stepProcess' - Process the events in the quarantine list, and after one Notify quarantine events until next Request Notification 'stepDiscard' - Discard the events in the quarantine list, and after one Notify quarantine events until next Request Notification 'loopProcess' - Process the events in the quarantine list, and notify observed events as and when need arises 'loopDiscard' - Discard the events in the quarantine list, and notify observed events as and when need arises The default value for MGCP 1.0 will be stepProcess and stepDiscard for the rest. This object has no relevance when the protocol is SRCP."
  },
  "mgcRedGrpProtSigEvtOnOffPolicy": {
    "name": "mgcRedGrpProtSigEvtOnOffPolicy",
    "oid": "1.3.6.1.4.1.351.150.22.1.3.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "deleteEventNotPresent": 1,
          "deleteOnlyNegatedEvent": 2
        }
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object enables the user to provision the way signaled events from CA are handled by the gateway. This is configurable on a per MGC redundancy group, per protocol basis. If the protocol is MGCP 1.0 the default of this object is 'deleteOnlyNegatedEvent', else it is set to 'deleteEventNotPresent'. If this object is set to 'deleteOnlyNegatedEvent', then the signal currently active on a endpoint/connection can be turned OFF only by parameterizing it with a (-) for eg: S: T/co1(-) will turn off co1 event on an endpoint. And can be turned ON by just providing the signal name or by parameterizing the signal name with a (+) for eg: S:T/co1(+), L/hd will turn on co1 and hd events on the endpoint. If this object is set to 'deleteEventNotPresent', then the signal/s can be turned OFF by providing empty S: list. The signal can be turned ON by simply providing the signal name. for eg: S: will turn OFF all active signals on the endpoint S: T/co1 will turn ON co1 signal. The configuration of this object only applies to on/off signals and not for brief or timeout signals. MGCP 0.1 specification says if an empty signaled list is provided it is meant to turn off all the currently turned on signaled events. However in MGCP 1.0 specification, it says that unless specifically requested by the CA to turn off (signal is parameterized by a (-)) the signal cannot be turned off, in other words an empty signal list does imply that the currently active signals should be turned off. Although the behavior of the gateway is specified in the specs, some MGC may not follow the MGCP 1.0 spec. Hence this MIB serves as an interop knob. This object has no relevance when the protocol is SRCP."
  },
  "mgcRedGrpProtProvisionalResponse": {
    "name": "mgcRedGrpProtProvisionalResponse",
    "oid": "1.3.6.1.4.1.351.150.22.1.3.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "sendProvisionalResponse": 1,
          "notSendProvisionalResponse": 2
        }
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object enables or disables sending provisional response to the CA when processing a request received from the CA. The provisional response to the CA indicates that the GW is processing the request and will send a final response once the processing is complete. For example, if a CRCX request from the CA using MGCP protocol, requires that resources be reserved along the bearer path using RSVP, GW would send a provisional response if this parameter was set to true. It would then wait for the RSVP procedure to complete before sending the final response. On the other hand, if the value of this parameter was set to false, the final response will be sent out without waiting for the RSVP procedure to complete. When the RSVP procedure does complete, a NTFY will be sent from the GW indicating if the RSVP procedure was successful or not. The GW will receive provisional responses from the CA. These messages will be parsed and ignored regardless of this object. If the protocol supported by the CA is MGCP1.0, the default value for this object is 'sendProvisionalResponse'. In all other cases, it is 'notSendProvisionalResponse'. This object has no relevance when the protocol is SRCP."
  },
  "mgcRedGrpProtResponseAckAttr": {
    "name": "mgcRedGrpProtResponseAckAttr",
    "oid": "1.3.6.1.4.1.351.150.22.1.3.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "sendResponseAckAttr": 1,
          "notSendResponseAckAttr": 2
        }
      }
    },
    "maxaccess": "read-create",
    "reference": "Media Gateway Control Protocol (MGCP), version 1.0 bis, May 10, 2001 : Sections 3.2.2.18, 3.3.1, 3.3.2.",
    "status": "current",
    "description": "Every command from the MGC could contain Response Acknowledgement attribute. This attribute consists a list of transaction IDs which are acknowledged by the Call agent. The gateway on receiving this can free up the resources attached to this transaction ID. When this attribute is present in the Gateway response, it should contain an empty list of transaction ID. This attribute in the response from the Gateway is to invite a response acknowledgement message from the MGC for this response. This will be present in the final response sent by the gateway only when a provisional response had been sent prior to this final response for the same transaction. This object determines whether the Gateway should include response acknowledgement in the final response. This object does not determine the capability of the Gateway to receive response acknowledgement attribute as part of MGC commands. 'sendResponseAckAttr' - Gateway will include response acknowledgement attribute as part of final response when a provisional response had been sent earlier. 'notSendResponseAckAttr' - Gateway will not include response acknowledgement attribute as part of final response when a provisional response had been sent earlier. The default value will be 'sendResponseAckAttr' for MGCP 1.0 protocol and 'notSendResponseAckAttr' for every other protocol. This object has no relevance when the protocol is SRCP."
  },
  "mgcRedGrpProtDisconnectProcedure": {
    "name": "mgcRedGrpProtDisconnectProcedure",
    "oid": "1.3.6.1.4.1.351.150.22.1.3.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "doDisconnectProcedure": 1,
          "notDoDisconnectProcedure": 2
        }
      }
    },
    "maxaccess": "read-create",
    "reference": "Media Gateway Control Protocol (MGCP), version 1.0 bis, May 10, 2001 : Section 4.4.7.",
    "status": "current",
    "description": "This attribute describes whether disconnected procedure is enabled/disabled per protocol per MGC group configured. The endpoint becomes disconnected when a gateway initiated commands are sent to the MGC and has not received any response from the MGC. The disconnected endpoint initiates the disconnected procedure by sending Restart in Progress command with restart method RM:disconnected to the MGC. When the object is set to 'doDisconnectProcedure', then the endpoint will start the disconnected procedure and sends 'Restart In Progress' command with the restart method RM:disconnected to the MGC. By default, the object is set to 'doDisconnectProcedure' for MGCP 1.0 and 'notDoDisconnectProcedure' for all other protocols. This object has no relevance when the protocol is SRCP."
  },
  "mgcRedGrpProtCancelGraceful": {
    "name": "mgcRedGrpProtCancelGraceful",
    "oid": "1.3.6.1.4.1.351.150.22.1.3.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "sendCancelGraceful": 1,
          "notSendCancelGraceful": 2
        }
      }
    },
    "maxaccess": "read-create",
    "reference": "Media Gateway Control Protocol (MGCP), version 1.0 bis, May 10, 2001 : Section 4.4.7.",
    "status": "current",
    "description": "This attribute describes whether notification of RSIP cancel graceful is enabled/disabled per protocol per MGC group configured. The Restart in Progress command with the restart method of cancel graceful indicates that the gateway is canceling a previously issued 'graceful' restart in progress command. The endpoints are still in service. When the object is set to 'sendCancelGraceful', the gateway will send the Restart in Progress command with the restart method of cancel graceful indicating that it is canceling the previously sent 'graceful' Restart in Progress command. By default, the object is set to 'sendCancelGraceful' for MGCP 1.0 and 'notSendCancelGraceful' for all other protocols. This object has no relevance when the protocol is SRCP."
  },
  "mgcRedunNotificationPrefix": {
    "name": "mgcRedunNotificationPrefix",
    "oid": "1.3.6.1.4.1.351.150.22.2",
    "class": "objectidentity"
  },
  "mgcRedunNotifications": {
    "name": "mgcRedunNotifications",
    "oid": "1.3.6.1.4.1.351.150.22.2.0",
    "class": "objectidentity"
  },
  "mgcRedunMIBConformance": {
    "name": "mgcRedunMIBConformance",
    "oid": "1.3.6.1.4.1.351.150.22.3",
    "class": "objectidentity"
  },
  "mgcRedunMIBCompliances": {
    "name": "mgcRedunMIBCompliances",
    "oid": "1.3.6.1.4.1.351.150.22.3.1",
    "class": "objectidentity"
  },
  "mgcRedunMIBGroups": {
    "name": "mgcRedunMIBGroups",
    "oid": "1.3.6.1.4.1.351.150.22.3.2",
    "class": "objectidentity"
  },
  "mgcRedunMIBCompliance": {
    "name": "mgcRedunMIBCompliance",
    "oid": "1.3.6.1.4.1.351.150.22.3.1.1",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "mgcRedundancyGroup",
        "module": "CISCO-WAN-MGC-REDUN-MIB"
      },
      {
        "object": "mgcRedundancyParamGroup",
        "module": "CISCO-WAN-MGC-REDUN-MIB"
      },
      {
        "object": "mgcRedundancyProtocolGroup",
        "module": "CISCO-WAN-MGC-REDUN-MIB"
      }
    ],
    "status": "current",
    "description": "The compliance statement for the SNMP entities which implement MGC-REDUN-MIB."
  },
  "mgcRedundancyGroup": {
    "name": "mgcRedundancyGroup",
    "oid": "1.3.6.1.4.1.351.150.22.3.2.1",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-WAN-MGC-REDUN-MIB",
        "object": "mgcRedundancyGrpPref"
      },
      {
        "module": "CISCO-WAN-MGC-REDUN-MIB",
        "object": "mgcRedundancyGrpActState"
      },
      {
        "module": "CISCO-WAN-MGC-REDUN-MIB",
        "object": "mgcRedundancyGrpRowStatus"
      }
    ],
    "status": "current",
    "description": "This group contains objects that apply to the redundant media gateway controller group."
  },
  "mgcRedundancyParamGroup": {
    "name": "mgcRedundancyParamGroup",
    "oid": "1.3.6.1.4.1.351.150.22.3.2.2",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-WAN-MGC-REDUN-MIB",
        "object": "mgcRedundancyGrpStateChangeNtfy"
      },
      {
        "module": "CISCO-WAN-MGC-REDUN-MIB",
        "object": "mgcRedundancyGrpCommState"
      },
      {
        "module": "CISCO-WAN-MGC-REDUN-MIB",
        "object": "mgcRedundancyGrpPriority"
      }
    ],
    "status": "current",
    "description": "This group contains objects that describe the parameters of an MGC redundancy group."
  },
  "mgcRedundancyProtocolGroup": {
    "name": "mgcRedundancyProtocolGroup",
    "oid": "1.3.6.1.4.1.351.150.22.3.2.3",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-WAN-MGC-REDUN-MIB",
        "object": "mgcRedundancyGrpProtocolRowStatus"
      },
      {
        "module": "CISCO-WAN-MGC-REDUN-MIB",
        "object": "mgcRedGrpProtPersistEvtPolicy"
      },
      {
        "module": "CISCO-WAN-MGC-REDUN-MIB",
        "object": "mgcRedGrpProtQuarantinePolicy"
      },
      {
        "module": "CISCO-WAN-MGC-REDUN-MIB",
        "object": "mgcRedGrpProtSigEvtOnOffPolicy"
      },
      {
        "module": "CISCO-WAN-MGC-REDUN-MIB",
        "object": "mgcRedGrpProtProvisionalResponse"
      },
      {
        "module": "CISCO-WAN-MGC-REDUN-MIB",
        "object": "mgcRedGrpProtResponseAckAttr"
      },
      {
        "module": "CISCO-WAN-MGC-REDUN-MIB",
        "object": "mgcRedGrpProtDisconnectProcedure"
      },
      {
        "module": "CISCO-WAN-MGC-REDUN-MIB",
        "object": "mgcRedGrpProtCancelGraceful"
      }
    ],
    "status": "current",
    "description": "This group contains the protocols configured for an MGC redundancy group."
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/CISCO-WAN-MGC-REDUN-MIB",
      "Produced by pysmi-0.3.4 at Fri May 24 17:23:36 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "CISCO-WAN-MGC-REDUN-MIB"
  }
}