{
  "imports": {
    "class": "imports",
    "CISCO-SMI": [
      "ciscoExperiment"
    ],
    "CISCO-TC": [
      "CiscoInetAddressMask"
    ],
    "IF-MIB": [
      "ifPhysAddress",
      "InterfaceIndex"
    ],
    "INET-ADDRESS-MIB": [
      "InetAddress",
      "InetAddressType"
    ],
    "SNMP-FRAMEWORK-MIB": [
      "SnmpAdminString"
    ],
    "SNMPv2-CONF": [
      "OBJECT-GROUP",
      "NOTIFICATION-GROUP",
      "MODULE-COMPLIANCE"
    ],
    "SNMPv2-SMI": [
      "MODULE-IDENTITY",
      "Unsigned32",
      "OBJECT-IDENTITY",
      "Integer32",
      "Gauge32",
      "iso",
      "MibIdentifier",
      "IpAddress",
      "NOTIFICATION-TYPE",
      "Bits",
      "Counter64",
      "OBJECT-TYPE",
      "Counter32",
      "TimeTicks"
    ],
    "SNMPv2-TC": [
      "TEXTUAL-CONVENTION",
      "RowStatus",
      "DisplayString",
      "TruthValue",
      "TimeInterval",
      "TimeStamp",
      "MacAddress"
    ]
  },
  "ciscoDot11ContextServicesMIB": {
    "name": "ciscoDot11ContextServicesMIB",
    "oid": "1.3.6.1.4.1.9.10.110",
    "class": "moduleidentity",
    "revisions": [
      {
        "revision": "2003-09-15 00:00",
        "description": "Initial version of this MIB module. "
      }
    ],
    "lastupdated": "200309150000Z",
    "organization": "Cisco Systems Inc.",
    "contactinfo": " Cisco Systems, Customer Service Postal: 170 West Tasman Drive San Jose, CA 95134 USA Tel: +1 800 553-NETS E-mail: cs-dot11@cisco.com",
    "description": "This MIB supports managing the devices offering WDS and WNS services. The hierarchy of the devices offering the wireless domain and network services looks like the following. += = = = + | | | WNS | (Campus level) | | += = = = + / \\ / \\ / \\ / \\ \\/ \\/ += = =+ += = =+ | | | | | WNS | | WNS | | | | | += = =+ += = =+ / \\ \\ / \\ \\ / \\ \\ / \\ \\ \\/ \\/ \\/ +=====+ +=====+ +=====+ | | | | | | | WDS | | WDS | | WDS | ( Subnet | | | | | | level- +=====+ +=====+ +=====+ Single / \\ \\ \\ broadcast / \\ \\ \\ domain ) / \\ \\ \\ / \\ \\ \\ / \\ \\ \\ \\/ \\/ \\/ \\/ +~-~-~+ +~-~-~+ +~-~-~+ +~-~-~+ + + + + + + + + + AP + + AP + + AP + + AP + + + + + + + + + +~-~-~+ +~-~-~+ +~-~-~+ +~-~-~+ .. . . . . . . . . . . . . . . . . . . . . . . . \\/ \\/ \\/ \\/ \\/ +.....+ +.....+ +-.-.-.+ +~-~-~+ +......+ + + + + + + + + + + + MN + + MN + + WGB + + AP + + MN + + + + + + + + + + + +.....+ +.....+ +-.-.-.+ +~-~-~+ +......+ . . . . . . . . . . . . \\/ \\/ \\/ ++++++++ +......+ +......+ + + + + + + + EN + + MN + + MN + + + + + + + ++++++++ +......+ +......+ The diagram above depicts the overall campus network hierarchy and the services being offered at various levels in the hierarchy. Here, Infrastructure Node Authentication services are offered by the device providing WNS at the root (Campus) level. WNS at this level thus span an enterprise campus that resides in a geographic location. WNS are offered at various levels as shown in the hierarchy to achieve scalability. WNS at the subsequent levels other than the root level include authentication services for MNs and are typically confined to a single building. At the broadcast domain level, the WDS include authentication and registration services for the APs. An AP provides Proxy Authentication and registration services for the MNs. The APs that connect to parent APs through the wireless interface ( as shown by the dotted lines ) are Repeater-APs. The WGBs are managed in the same manner as the MNs. However, the Ethernet Nodes ( EN ) that are connected to the WGB won't be served as part of the WDS. GLOSSARY Access Point ( AP ) Any entity that contains an 802.11 medium access control ( MAC ) and physical layer ( PHY ) interface and provides access to the distribution services via the wireless medium for associated clients. Wireless Bridge An 802.11 entity that provides wireless connectivity between two wired LAN segments and is used in point- to-point or point-multipoint configurations. Mobile Node ( MN ) A roaming 802.11 wireless device in a wireless network associated with an access point. WorkGroup Bridge ( WGB ) A work-group bridge is a non-STP AP with an 802.11 primary port and a secondary Ethernet port that provides access to a non-STP secondary Ethernet LAN segment. STP refers to the IEEE 802.1D Spanning Tree Protocol. An 'STP AP' executes the 802.1D STP and the 802.1D STP is operated on an 'STP link'. A 'non-STP AP' does not execute the 802.1D STP. Repeater-AP A repeater is a 'wireless AP' that is attached to a parent AP on an 802.11 primary port. The Ethernet port is disabled in a Repeater-AP. Infrastructure Node ( IN ) This term refers to Access Points, Wireless Bridges and those devices that implement and offer WNS and WDS as shown in the network hierarchy. Ethernet Node ( EN ) The node that gets the uplink to the Wireless AP via the WGB. This node connects to the WGB through its primary Ethernet port. Context The mobility context for an MN includes its current mobility bindings with the APs, IP/802 address bindings, cached configuration parameters, QoS state, IP group membership, authentication state, accounting statistics, and other dynamically derived protocol state information. Wireless Domain Services The set of services being offered at a particular broadcast domain that may be an IP subnet or a particular VLAN. The services include the following. 1. MN security credential caching to provide seamless, secure intra-subnet roaming. 2. Authenticated context transfer for roaming client within the subnet. Since, by definition, the WDS are bound to one subnet ( broadcast domain ), if implemented in a device spanning multiple subnets, the implementation should take care to provide separate set of services for each of the subnets. Wireless Network Services The set of services that can be visualized as being offered at various levels other than the lowest (subnet) level of a hierarchical campus network. At the root level, Infrastructure Authentication services for all the devices in the network that provide WNS and WDS are offered. In case if WNS are not distributed at several levels as shown in the hierarchy above and is confined to be offered only at a single root level, the services offered also include authentication services for the MNs. WNS Entity The logical entity that resides in an infrastructure node and offers WNS to the descendants of that infrastructure node in the wireless services hierarchy. WDS Entity The logical entity that resides in an infrastructure node and offers WDS to the descendants of that infrastructure node in the wireless services hierarchy. WS Entity Refers to one of WNS / WDS Entities. Parent Node The node that immediately precedes an infrastructure node in the hierarchy. For mobile nodes, the parent APs provide proxy wireless services by talking to their immediate parent nodes that offer WDS. Root Node The infrastructure node that is at the highest level in the services hierarchy and that offers WNS. The WNS entity acts as the IN Authenticator for the rest of the infrastructure nodes. In case if WNS are not distributed, the root node also acts as the Mobile Node Authenticator ( See description below ). Descendant A node that is in the sub-tree of the campus hierarchy tree rooted at the node providing WNS. Infrastructure Node ( IN ) Authenticator The logical entity that communicates with the AAA server and provides authentication Services for the infrastructure nodes. Details of the IN Authenticator have to be configured in the device providing WDS manually. The AP learns about the IN Authenticator automatically upon registering with its immediate parent. The WDS also includes MN authentication services if the entity providing WDS is at the root level in the hierarchy. Mobile Node ( MN ) Authenticator The logical entity that communicates with the AAA server and provides authentication Services for mobile nodes. An infrastructure node learns the whereabouts of the MN Authenticator from the root node. Wireless Network Manager ( WNM ) The network management system that manages the entire hierarchy of devices providing WNS and WDS. Advertisement The process by which the Access Points identify their parent nodes providing WDS. APs listen to the advertisements of the WDS entities and gets registered with one of those entities to facilitate secured context transfer. WLCCP Wireless LAN Context Control Protocol. Used to establish and manage the network topology and securely manage the 'operational context' for mobile stations in a campus network. AAA Authentication, Authorization, Accounting A node will request network access by executing a protocol to an authentication server that provides protocols and services for providing authentication, authorization and session accounting. Service Set Identifier ( SSID ) 802.11 Service Set Identifier. An SSID identifies a set of mobile nodes grouped into a logical 'service set' and the APs that provide access for the service set. Wired Equivalent Privacy (WEP) This protocol uses a pseudo random generator and RC4 stream cipher and is specified by the 802.11 standard as the algorithm for encryption and authentication over the wireless segment of the LAN. Temporal Key Integrity Protocol ( TKIP ) This protocol provides initialization vector hashing and a Message Integrity Check ( MIC ) to ensure data integrity. TKIP includes use of dynamic keys to defeat capture of passive keys. TKIP uses the RC4 cipher as WEP but the difference is that TKIP changes temporal keys every 10,000 packets thereby providing a dynamic distribution network that enhances the security of the network. Cisco Key Integrity Protocol ( CKIP ) A proprietary implementation similar to TKIP. CKIP implements key permutation for protecting the CKIP key against attacks. Other features of CKIP include expansion of encryption key to 16 bytes of length for key protection and MIC to ensure data integrity. Wireless services at subnet level ================================= +========+ | | | WDS | ( Subnet level - Broadcast | | domain ) +========+ / \\ / \\ / \\ / \\ / \\ \\/ \\/ +~-~-~+ +~-~-~+ + + + + + AP + + AP + + + + + +~-~-~+ +~-~-~+ . . . . . . . . . . . . . . . . . . \\/ \\/ \\/ +......+ +-.-.-.+ +~-~-~-+ + + + + + + + MN + + WGB + + AP + + + + + + + +......+ +-.-.-.+ +~-~-~-+ The above diagram depicts how wireless services are being offered in an infrastructure node implementing WDS. In such a network, the WDS entity provides authentication services to both the infrastructure and mobile nodes. The other entities in the diagram are the Mobile Node ( MN ), the Workgroup Bridge (WGB) and another AP-in-repeater mode. The Repeater-APs first perform initial authentication with the AAA server ( through WDS ) and then perform infrastructure authentication and registration with the WDS entity. The WGBs go through the same procedure as the MNs for authentication and registration with the WDS entity. "
  },
  "ciscoDot11csMIBNotifications": {
    "name": "ciscoDot11csMIBNotifications",
    "oid": "1.3.6.1.4.1.9.10.110.0",
    "class": "objectidentity"
  },
  "ciscoDot11csMIBObjects": {
    "name": "ciscoDot11csMIBObjects",
    "oid": "1.3.6.1.4.1.9.10.110.1",
    "class": "objectidentity"
  },
  "ciscoDot11csMIBConformance": {
    "name": "ciscoDot11csMIBConformance",
    "oid": "1.3.6.1.4.1.9.10.110.2",
    "class": "objectidentity"
  },
  "cDot11csConfigGlobal": {
    "name": "cDot11csConfigGlobal",
    "oid": "1.3.6.1.4.1.9.10.110.1.1",
    "class": "objectidentity"
  },
  "cDot11csDescendantIn": {
    "name": "cDot11csDescendantIn",
    "oid": "1.3.6.1.4.1.9.10.110.1.2",
    "class": "objectidentity"
  },
  "cDot11csMn": {
    "name": "cDot11csMn",
    "oid": "1.3.6.1.4.1.9.10.110.1.3",
    "class": "objectidentity"
  },
  "CDot11csNodeIndex": {
    "name": "CDot11csNodeIndex",
    "class": "textualconvention",
    "type": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 8,
            "max": 8
          }
        ]
      }
    },
    "status": "current",
    "description": "This textual convention defines an identifier that is used to uniquely identify a WS Entity in the wireless services hierarchy. "
  },
  "cDot11csServiceType": {
    "name": "cDot11csServiceType",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "none": 1,
          "wds": 2,
          "wns": 3,
          "rootWns": 4
        }
      }
    },
    "default": {
      "default": {
        "value": "none",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object identifies the type of service this infrastructure node will offer. none(1) - This infrastructure node is not configured to offer any services. wds(2) - This infrastructure node is configured to offer Wireless Domain Services. To configure this infrastructure node to offer Wireless Domain Services, cDot11csServiceType should be set to 'wds' and an entry should be added to cDot11csWdsInstanceTable to specify the configuration for the WDS. wns(3) - This infrastructure node is configured to offer Wireless Network Services. To configure this infrastructure node to offer Wireless Network Services, cDot11csServiceType should be set to 'wns' and cDot11csPrimaryRootNodeAddr should be set to the IP address of the root infrastructure node that offers WNS. rootWns(4) - This infrastructure node is configured to offer Wireless Network Services at the root level in the wireless services hierarchy. To configure an infrastructure node as the root node, cDot11csServiceType should be set to 'rootWns' and cDot11csPrimaryRootNodeAddr should be set to 0.0.0.0 to imply that this infrastructure node is the root node in the wireless services hierarchy. "
  },
  "cDot11csParentNodeIpAddressType": {
    "name": "cDot11csParentNodeIpAddressType",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.2",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressType",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Represents the type of Internet address stored in cDot11csParentNodeIpAddress. "
  },
  "cDot11csParentNodeIpAddress": {
    "name": "cDot11csParentNodeIpAddress",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.3",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The IP address of the immediate parent node of this infrastructure node in the wireless services hierarchy. The semantics for this object are defined as follows. If the value of cDot11csServiceType is 'rootWns' and the value of this object is 0.0.0.0, then this node is the root node offering WNS. If the value of cDot11csServiceType is 'wns', the value of this object is the IP address of the root infrastructure node offering WNS. If the values of cDot11csServiceType, cDot11csIsRootNode and this object are 'wds', 'true' and 0.0.0.0 respectively, then this node is the root node in the wireless services hierarchy. If the values of cDot11csServiceType and cDot11csIsRootNode are 'wds' and 'false' respectively, the value of this object is the IP address of the immediate parent infrastructure node. "
  },
  "cDot11csPrimaryRootNodeAddrType": {
    "name": "cDot11csPrimaryRootNodeAddrType",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.4",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressType",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Represents the type of Internet address stored in cDot11csPrimaryRootNodeAddr. "
  },
  "cDot11csPrimaryRootNodeAddr": {
    "name": "cDot11csPrimaryRootNodeAddr",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.5",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The IP address of the infrastructure node to be configured as the primary root node. The primary root node performs infrastructure authentication for all the infrastructure nodes in the wireless services network. The semantics for this object are defined as follows. If the value of cDot11csServiceType is 'wds' and this infrastructure node is the root node in the wireless services hierarchy, the value configured is 0.0.0.0 to indicate that this node is the root node in the wireless services hierarchy. If the value of cDot11csServiceType is 'wds' and this infrastructure node is not the root node in the wireless services hierarchy, the value configured is the IP address of the infrastructure node for which the value of cDot11csServiceType is 'rootWns'. If the value of cDot11csServiceType is 'wns', the value configured is the IP address of the infrastructure node for which the value of cDot11csServiceType is 'rootWns'. If the value of cDot11csServiceType is 'rootWns', the value 0.0.0.0 is configured to indicate that this infrastructure node is the root node in the wireless services hierarchy. "
  },
  "cDot11csSecondaryRootNodeAddrType": {
    "name": "cDot11csSecondaryRootNodeAddrType",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.6",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressType",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Represents the type of Internet address stored in cWSSecondaryRootNodeAddr. "
  },
  "cDot11csSecondaryRootNodeAddr": {
    "name": "cDot11csSecondaryRootNodeAddr",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.7",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The IP address of the Secondary root node acting as a standby for the primary root node. The semantics for this object are defined as follows. If the values of cDot11wsServiceType, cDot11wsIsRootNode and this object are 'wds', 'true' and 0.0.0.0 respectively, then there is no secondary root node in the wireless hierarchy. If the values of cDot11wsServiceType and cDot11wsIsRootNode are 'wds' and 'false' respectively, then the value of this object is the IP address of an infrastructure node that acts as a backup for the current root node. If the value of cDot11wsServiceType is 'wns', the value of this object is the IP address of an infrastructure node that acts as a backup for the current root node. If value of cDot11wsServiceType is 'rootWns', the value of this object is the IP address of an infrastructure node that acts as a backup for the current root node. "
  },
  "cDot11csCurrentRootNodeAddrType": {
    "name": "cDot11csCurrentRootNodeAddrType",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.8",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressType",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Represents the type of Internet address stored in cDot11csCurrentRootNodeAddr. "
  },
  "cDot11csCurrentRootNodeAddr": {
    "name": "cDot11csCurrentRootNodeAddr",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.9",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The IP address of the infrastructure node that is currently the root node. This object's value is 0.0.0.0 if this infrastructure node is the root node. Else, this object's value is the IP address of the root node. Thus, the object's value is 0.0.0.0 if either one of the following is true. 1) this infrastructure node offers WDS and is the root node. 2) this infrastructure node offers WNS with the value of cDot11csServiceType equal to 'rootWns'. The object's value is the IP address of the root node if the value of cDot11csServiceType is 'wns' for this node. "
  },
  "cDot11csWnsEntityName": {
    "name": "cDot11csWnsEntityName",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.10",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 32
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The name associated with the WNS being offered by this infrastructure node. This name is unique across the wireless services network at the campus level. This is applicable only if the infrastructure node offers WNS. This object is not applicable for read-write operations, if this is an infrastructure node offering WDS. "
  },
  "cDot11csMnaIpAddressType": {
    "name": "cDot11csMnaIpAddressType",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.11",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressType",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Represents the type of Internet address stored in cDot11csMnaIpAddress. "
  },
  "cDot11csMnaIpAddress": {
    "name": "cDot11csMnaIpAddress",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.12",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The IP address of the Mobile Node Authenticator. The semantics for this object are defined as follows. If the value of cDot11csServiceType, cDot11csIsRootNode and this object are 'wds', 'true' and 0.0.0.0 respectively, this node is the MN Authenticator. If the values of cDot11csServiceType is 'wds' and the value of cDot11csIsRootNode is 'false' indicating that there is at least one node up in the wireless services hierarchy that offers Wireless Network Services, the value of this object is the IP address of the immediate parent node for which the value of cDot11csServiceType is 'wns'. If the values of cDot11csServiceType and this object are 'wns' and 0.0.0.0 respectively, this infrastructure node is the MN Authenticator. This object is not applicable to a root node offering WNS which is identified by a value of 'rootWns' for cDot11csServiceType. "
  },
  "cDot11csIsRootNode": {
    "name": "cDot11csIsRootNode",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.13",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates if this infrastructure node is the root node. If the value of this object is 'true', this node is the root node. "
  },
  "cDot11csNodeOperationMode": {
    "name": "cDot11csNodeOperationMode",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.14",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "adminStandAlone": 1,
          "infrastructure": 2,
          "fallbackStandAlone": 3
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the mode which this infrastructure node is currently operating in. The semantics are described as follows. adminStandAlone - An infrastructure node in this mode has been configured to be the highest level node in the wireless services hierarchy and acts as both the Infrastructure and Mobile Node Authenticator. For an infrastructure node for which cDot11csServiceType is configured as 'rootWns', the mode of operation is always 'adminStandAlone' as it is the highest level node in the wireless services hierarchy. An infrastructure node whose cDot11csServiceType is 'wds' can be in 'adminStandAlone' mode if there is no node offering Wireless Network Services and is the root node in the wireless services hierarchy. An infrastructure node for which the value of cDot11csServiceType is 'wns' can't be in 'adminStandAlone' mode since it always has another infrastructure node as its parent for which the value of cDot11csServiceType is 'rootWns' and won't be the root node in the wireless services hierarchy. infrastructure - An infrastructure node in this mode has been configured with an external IN Authenticator. The external IN Authenticator in this case is the infrastructure node whose value of cDot11csServiceType is 'rootWns'. The immediate parent of this infrastructure node is given by the object cDot11csParentNodeAddress. fallbackStandAlone - This infrastructure node has been configured to function in the 'infrastructure' mode but the node has dropped back to 'fallbackStandAlone' mode due to loss of communication with its parent node. From an operational point of view, 'fallbackStandAlone' mode is same as 'adminStandAlone' mode. However, in the 'fallbackStandAlone' mode, an infrastructure node continuously attempts to get back to the 'infrastructure' mode. "
  },
  "cDot11csWnsTable": {
    "name": "cDot11csWnsTable",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.15",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table holds the information about the subnets that are bound to each WNS entity. This WNS-to-WDS mapping is configured in the root WNS entity. A WDS entity requests the root WNS entity for the parent WNS entity. This table is applicable only for a root node. A row is added to this table in the root WNS entity by the administrator through the WNM, each row holding information about one particular subnet that is being served by a WNS entity. The name of the WNS entity is given by the object cDot11csWnsEntityName. "
  },
  "cDot11csWnsEntry": {
    "name": "cDot11csWnsEntry",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.15.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csWnsIndex",
        "implied": 0
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csWnsAddrType",
        "implied": 0
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csWnsSubnetAddr",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry corresponds to one WDS-to-WNS mapping configured in the root WNS entity. "
  },
  "cDot11csWnsIndex": {
    "name": "cDot11csWnsIndex",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.15.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 32
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The name of the WNS entity that serves a given set of subnets. This object holds the value configured in cDot11csWnsEntityName. "
  },
  "cDot11csWnsAddrType": {
    "name": "cDot11csWnsAddrType",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.15.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressType",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Represents the type of Internet addresses stored in cDot11csWnsSubnetAddr and cDot11csWnsSubnetMask. "
  },
  "cDot11csWnsSubnetAddr": {
    "name": "cDot11csWnsSubnetAddr",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.15.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The address of the subnet configured to be served by the WNS entity identified by cDot11csWnsIndex. "
  },
  "cDot11csWnsSubnetMask": {
    "name": "cDot11csWnsSubnetMask",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.15.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CiscoInetAddressMask",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The subnet mask associated with the subnet address given by cDot11csWnsSubnetAddr. "
  },
  "cDot11csWnsRowStatus": {
    "name": "cDot11csWnsRowStatus",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.15.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status column used for creating and deleting instances of the columnar objects in the cDot11csWnsTable. The following information must be provided by the WNM while creating a row. The subnet address (cDot11csWnsSubnetAddr), the subnet mask ( cDot11csWnsSubnetMask) and Row Status ( cDot11csWnsRowStatus) The type of the addresses stored by the subnet address and the subnet mask should also be specified. The row, when created with the row status value of 'createAndGo' is moved to the 'active' state automatically by the agent and remains in that state till the time the row is removed through the 'destroy' option. This is used to create an entry for a new subnet that is assigned to be serviced by a WNS entity. The 'destroy' option is used when the administrator decides to remove the row representing a particular subnet being served by a WNS entity. "
  },
  "cDot11csWnmConfigTable": {
    "name": "cDot11csWnmConfigTable",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.16",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table holds the list of IP addresses of those WNMs that have been identified as recipients of the notifications sent by a WS entity. In case of multiple WDS entities running in a single box, this table is common across all the WDS entities. Notifications are sent to those WNMs in this table whose cDot11csConfigWnmAuthenState value is 'authenticated'. A row is added to this table by the administrator through the WNM to specify a particular instance of WNM as a recipient of the notification sent by a infrastructure node configured to offer WDS/WNS. "
  },
  "cDot11csWnmConfigEntry": {
    "name": "cDot11csWnmConfigEntry",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.16.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csWnmConfigIpAddressType",
        "implied": 0
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csWnmConfigIpAddress",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry corresponds to one WNM instance that is identified as a recipient of the notifications sent by an infrastructure node configured to provide wireless services. "
  },
  "cDot11csWnmConfigIpAddressType": {
    "name": "cDot11csWnmConfigIpAddressType",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.16.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressType",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Represents the type of Internet address stored in cDot11csWnmConfigIpAddress. "
  },
  "cDot11csWnmConfigIpAddress": {
    "name": "cDot11csWnmConfigIpAddress",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.16.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The IP address of this WNM. "
  },
  "cDot11csWnmConfigAuthenState": {
    "name": "cDot11csWnmConfigAuthenState",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.16.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "unauthenticated": 1,
          "authenticationInProgess": 2,
          "authenticationFailed": 3,
          "authenticated": 4,
          "keysSetUpWithWds": 5
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The semantics for this object are defined as follows. unauthenticated - The WNM hasn't initiated the authentication process yet. authenticationInProgress - The WNM has initiated the the authentication process to get authenticated with the WS entity and the process is currently underway. authenticationFailed - The WNM has failed to get authenticate successfully with the WS Entity. authenticated - The WNM has got authenticated with the WS entity and established a mutual trust relationship with the same. keysSetUpWithScm - The WNM has got authenticated with the WS Entity and set secret keys for securing the communication with the WS Entity. The WNM initiates authentication process only with an 'active' WDS entity. (The state of the WDS entity is given by the object cDot11csWdsInstanceState). Hence, all the authentication states other than 'unauthenticated' are valid only for an 'active' WDS entity. Also, the 'active' WDS entity ( the entity for which the the value of cDot11csWdsInstanceState is 'active ) has to be configured with the address of the WNM before the WNM initiates the authentication process. The value is always 'unauthenticated' for a WDS entity in 'backup' state. "
  },
  "cDot11csWnmConfigRowStatus": {
    "name": "cDot11csWnmConfigRowStatus",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.16.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status column used for creating and deleting instances of the columnar objects in cDot11csWnmConfigTable. The administrator must specify the following information while creating a row. The IP address type (cDot11csWnmConfigIpAddressType) The IP address of the WNM (cDot11csWnmConfigIpAddress) The Row status ( cDot11csWnmConfigRowStatus ) The row, when created, is automatically set to active by the agent as indicated by 'createAndGo' and remains in that state till the time the row is removed through the 'destroy' option. The administrator should manually remove a row from this table to remove a WNM instance from the list of notification recipients. The 'createAndGo' option is used to create an entry to configure a particular WNM as one of the recipients of the notifications sent by a WS entity configured in an infrastructure node. The 'destroy' option is used when the administrator decides to remove this WNM from the list of notification recipients for a WS entity. "
  },
  "cDot11csWdsInstanceTable": {
    "name": "cDot11csWdsInstanceTable",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.17",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains the list of WDS entities currently configured in this device on each of the logical interfaces/VLANs. This table is applicable only if the value of cDot11csServiceType is 'wds'. Before adding a row to this table, the object cDot11csServiceType should have been set to 'wds'. The table is indexed by cDot11csWdsInstanceIndex. The object cDot11csWdsInstanceNodeIndex is an internally generated unique value and so it can't be specified at the time of creating of row. Hence it has been made a read-only object. A row is added to this table to associate a WDS entity with one of the logical interfaces/VLANs configured in this device. "
  },
  "cDot11csWdsInstanceEntry": {
    "name": "cDot11csWdsInstanceEntry",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.17.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csWdsInstanceIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry represents a WDS entity currently associated with one of the logical interfaces/VLANs configured in this device. "
  },
  "cDot11csWdsInstanceIndex": {
    "name": "cDot11csWdsInstanceIndex",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.17.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 512
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This object identifies this entry corresponding to a particular WDS entity in the infrastructure node. "
  },
  "cDot11csWdsInstanceNodeIndex": {
    "name": "cDot11csWdsInstanceNodeIndex",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.17.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CDot11csNodeIndex",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object represents the node identifier of this WDS entity. "
  },
  "cDot11csWdsInstanceInterfaceIndex": {
    "name": "cDot11csWdsInstanceInterfaceIndex",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.17.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InterfaceIndex",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object specifies the ifIndex corresponding to the interface / VLAN which this WDS entity is bound to. "
  },
  "cDot11csWdsInstancePriority": {
    "name": "cDot11csWdsInstancePriority",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.17.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 255
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object specifies the priority value being configured by the administrator for this WDS entity. Based on the priority value, a WDS entity candidate gets elected as the active WDS. 1-127 are typically used for backup WDS candidates and 128 to 255 are typically used for primary WDS candidates. "
  },
  "cDot11csWdsInstanceState": {
    "name": "cDot11csWdsInstanceState",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.17.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "active": 1,
          "backup": 2,
          "candidate": 3
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the current state of this WDS entity. A value of 'active' indicates that this is an active WDS entity that sends periodic WDS advertisement messages for APs to pick those messages and identify the WDS entity they can register with. An 'active' WDS entity moves to the 'backup' state if it receives advertisement message from a WDS entity configured with a higher priority. A value of 'backup' indicates that this WDS entity is in standby mode. A 'backup' WDS entity moves to the 'active' state when it receives advertisement message from a WDS entity configured with a higher priority. The 'candidate' state is the initial state of a WDS entity that participates in the election process. A WDS candidate entity moves either to the 'active' state if it doesn't receive an advertisement message from a higher priority WDS entity within the listen period or to the 'backup' state if it receives a higher priority advertisement message within the listen period. "
  },
  "cDot11csWdsInstanceRowStatus": {
    "name": "cDot11csWdsInstanceRowStatus",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.17.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status column used for creating, modifying, and deleting instances of the columnar objects in the cDot11csWdsInstanceTable. The administrator must specify the following to create a row in this table and activate it. 1) The ifIndex of the interface / VLAN this WDS entity should bound to. 2) The Priority value of the WDS entity to be created through the object cDot11csWdsInstancePriority. 3) The Row status through the object cDot11csWdsInstanceRowStatus. The 'createAndGo' option is used to create a new instance of WDS entity and bind it to a particular broadcast domain which can either be an IP subnet or a VLAN. While creating a row, the ifIndex of the interface the particular IP subnet/VLAN is bound to and the priority of this WDS entity must be specified along with the row status. The 'destroy' option is used when the administrator decides to decommission a particular WDS entity and remove its bindings with a particular broadcast domain. A row in this table is destroyed when it is in the 'active' state. The ifIndex of the interface the particular IP subnet/VLAN is bound to must be specified along with the row status set to 'destroy' to remove a row from cDot11csWdsInstanceTable. "
  },
  "cDot11csStatusTable": {
    "name": "cDot11csStatusTable",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.18",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table provides information about the status of wireless service entities currently being configured in this device. "
  },
  "cDot11csStatusEntry": {
    "name": "cDot11csStatusEntry",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.18.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csStatusNodeIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry provides information about the entity currently offering wireless services and associated with one of the logical interfaces/VLANs configured in this device. For a WDS entity bound to a logical interface/VLAN, a row is added to this table whenever an entry for a WDS entity is added to cDot11csWdsInstanceTable with cDot11csWdsInstanceState set to 'active'. The administrator can't create rows in this table but he can select and temporarily bring the services being provided by one entity to its descendants down by setting the value of cDot11csStatusAdminStatus to 'down'. If the entity provides WNS, this table contains a single row. A row is deleted from this table automatically when one of the following occurs. 1) A WDS entity is decommissioned by destroying the row corresponding to the same in the cDot11csWdsInstance Table. 2) The wireless services are shut down internally. "
  },
  "cDot11csStatusNodeIndex": {
    "name": "cDot11csStatusNodeIndex",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.18.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CDot11csNodeIndex",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This object uniquely identifies an active wireless service entity. For an active WDS entity, this object holds the same value as the object cDot11csWdsInstanceNodeIndex in cDot11csWdsInstanceTable. For a WNS entity, this will hold a value of type CDot11csNodeIndex. "
  },
  "cDot11csStatusAdminStatus": {
    "name": "cDot11csStatusAdminStatus",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.18.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "up": 1,
          "down": 2
        }
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The desired status of the services offered by this entity to its descendants. This has a default value of 'up' whenever a row is created by the agent in this table. Setting this to 'down' disables the services provided by this entity to its descendants. The agent sets this value to 'down' if the entity couldn't offer the services due to failures detected in the underlying interface this entity is bound to. "
  },
  "cDot11csStatusOperStatus": {
    "name": "cDot11csStatusOperStatus",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.18.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "up": 1,
          "down": 2
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The current operational status of the wireless services provided by this entity. The agent sets the value of this object whenever the administrative status value is modified either through explicit management action or by detecting failures in the functioning of the wireless service entity. "
  },
  "cDot11csStatusChangeTimeStamp": {
    "name": "cDot11csStatusChangeTimeStamp",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.18.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TimeStamp",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The value of sysUpTime at the time a state transition occurs in cDot11csStatusOperStatus. "
  },
  "cDot11csStatusAdvtInterval": {
    "name": "cDot11csStatusAdvtInterval",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.18.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TimeInterval",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the time interval between transmission of advertisement messages. "
  },
  "cDot11csStatusInRegistrations": {
    "name": "cDot11csStatusInRegistrations",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.18.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of descendant infrastructure nodes registered with this entity since the last reboot of this device. "
  },
  "cDot11csStatusInDeRegistrations": {
    "name": "cDot11csStatusInDeRegistrations",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.18.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of descendant infrastructure nodes de-registered with this entity since the last reboot of this device. "
  },
  "cDot11csStatusCurrentlyRegisteredIns": {
    "name": "cDot11csStatusCurrentlyRegisteredIns",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.18.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of descendant infrastructure nodes currently registered with this entity since the operational status of this entity last changed to 'up'. "
  },
  "cDot11csStatusSentAdvts": {
    "name": "cDot11csStatusSentAdvts",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.18.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of advertisement messages sent by this entity since the last reboot of this device. "
  },
  "cDot11csElectedAsWdsEnable": {
    "name": "cDot11csElectedAsWdsEnable",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.19",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object controls the generation of the cDot11csElectedAsWdsEnable notification. If the value of this object is set to 'true', the agent shall send the cDot11csElectedAsWds notification to the intended trap recipients. "
  },
  "cDot11csInRegisteredWithWsEnable": {
    "name": "cDot11csInRegisteredWithWsEnable",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.20",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object controls the generation of the cDot11csInRegisteredWithWs notification. If the value of this object is set to 'true', the agent shall send the cDot11csInRegisteredWithWs notification to the intended trap recipients. "
  },
  "cDot11csInDeRegisteredWithWsEnable": {
    "name": "cDot11csInDeRegisteredWithWsEnable",
    "oid": "1.3.6.1.4.1.9.10.110.1.1.21",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object controls the generation of the cDot11csInDeRegisteredWithWs notification. If the value of this object is set to 'true', the agent shall send the cDot11csInDeRegisteredWithWs notification to the intended trap recipients. "
  },
  "cDot11csDescendantInTable": {
    "name": "cDot11csDescendantInTable",
    "oid": "1.3.6.1.4.1.9.10.110.1.2.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains the list of the descendant nodes currently registered with this infrastructure node. This table has an expansion dependent relationship on the cDot11csStatusTable, relating one or more descendants with a wireless service entity and holds entries carrying information about the descendants of a particular wireless service entity identified by cDot11csStatusNodeIndex in cDot11csStatusTable. "
  },
  "cDot11csDescendantInEntry": {
    "name": "cDot11csDescendantInEntry",
    "oid": "1.3.6.1.4.1.9.10.110.1.2.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csStatusNodeIndex",
        "implied": 0
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csDescendantInId",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry represents an descendant infrastructure node that is currently registered with the WS entity identified by cDot11csStatusNodeIndex. A row is added to the table by the agent when a descendant infrastructure node registers with the entity identified by the object cDot11csStatusNodeIndex. A row is deleted from this table by the agent when a descendant loses its registration with the wireless service entity identified by cDot11csStatusNodeIndex. Loss of registration occurs if the WS entity identified by cDot11csStatusNodeIndex loses contact with a particular descendant identified by cDot11csDescendantInId. Also, all the entries in this table are deleted if the entry for the wireless service entity is deleted from cDot11csStatusTable. "
  },
  "cDot11csDescendantInId": {
    "name": "cDot11csDescendantInId",
    "oid": "1.3.6.1.4.1.9.10.110.1.2.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "MacAddress",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The MAC address of this descendant IN. "
  },
  "cDot11csDescendantInType": {
    "name": "cDot11csDescendantInType",
    "oid": "1.3.6.1.4.1.9.10.110.1.2.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "ap": 1,
          "wds": 2,
          "wns": 3
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object specifies the type of the infrastructure node. 'ap' - Access Point. 'wds' - Wireless Domain Services Entity. 'wns' - Wireless Network Services Entity. "
  },
  "cDot11csDescendantInIpAddressType": {
    "name": "cDot11csDescendantInIpAddressType",
    "oid": "1.3.6.1.4.1.9.10.110.1.2.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressType",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Represents the type of Internet address stored in cDot11csDescendantInIpAddressType. "
  },
  "cDot11csDescendantInIpAddress": {
    "name": "cDot11csDescendantInIpAddress",
    "oid": "1.3.6.1.4.1.9.10.110.1.2.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The IP address of the descendant IN. "
  },
  "cDot11csDescendantInRegistrationAge": {
    "name": "cDot11csDescendantInRegistrationAge",
    "oid": "1.3.6.1.4.1.9.10.110.1.2.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TimeInterval",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The time elapsed since this infrastructure node has registered with the WS entity identified by cDot11csStatusNodeIndex. "
  },
  "cDot11csDescendantInCtkRefreshes": {
    "name": "cDot11csDescendantInCtkRefreshes",
    "oid": "1.3.6.1.4.1.9.10.110.1.2.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of context transfer key refreshes done by this infrastructure node with the WS entity identified by cDot11csStatusNodeIndex. "
  },
  "cDot11csDescendantInNskExpiryTimeOut": {
    "name": "cDot11csDescendantInNskExpiryTimeOut",
    "oid": "1.3.6.1.4.1.9.10.110.1.2.1.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TimeInterval",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The network session key timeout value assigned by the AAA server to this infrastructure node. "
  },
  "cDot11csMnContextTable": {
    "name": "cDot11csMnContextTable",
    "oid": "1.3.6.1.4.1.9.10.110.1.3.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table has an expansion dependent relationship on the cDot11csStatusTable, relating one or more mobile clients with a wireless service entity and holds entries carrying information about the mobile nodes registered with the entity identified by cDot11csStatusNodeIndex in cDot11csStatusTable. "
  },
  "cDot11csMnContextEntry": {
    "name": "cDot11csMnContextEntry",
    "oid": "1.3.6.1.4.1.9.10.110.1.3.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csStatusNodeIndex",
        "implied": 0
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csMnContextId",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry represents a mobile node that is currently registered with the entity identified by cDot11csStatusNodeIndex. A row is added to the table by the agent when a mobile node registers with the entity identified by the object cDot11csStatusNodeIndex. A row is deleted from this table by the agent when a mobile node loses its registration with the entity identified by cDot11csStatusNodeIndex. Loss of registration occurs when the mobile node roams from one subnet to another. Also, all the entries in this table are deleted if the entry for the entity is deleted from cDot11csStatusTable. "
  },
  "cDot11csMnContextId": {
    "name": "cDot11csMnContextId",
    "oid": "1.3.6.1.4.1.9.10.110.1.3.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "MacAddress",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The MAC address of this mobile node. "
  },
  "cDot11csMnContextSsid": {
    "name": "cDot11csMnContextSsid",
    "oid": "1.3.6.1.4.1.9.10.110.1.3.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 32
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The Service Set Identifier of this mobile node. "
  },
  "cDot11csMnContextSystemName": {
    "name": "cDot11csMnContextSystemName",
    "oid": "1.3.6.1.4.1.9.10.110.1.3.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 32
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The hostname by which the mobile node is uniquely identified in the network. "
  },
  "cDot11csMnContextUserId": {
    "name": "cDot11csMnContextUserId",
    "oid": "1.3.6.1.4.1.9.10.110.1.3.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 32
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The name of this mobile node's user. "
  },
  "cDot11csMnContextIpAddressType": {
    "name": "cDot11csMnContextIpAddressType",
    "oid": "1.3.6.1.4.1.9.10.110.1.3.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddressType",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Represents the type of Internet addresses stored in cDot11csMnContextIpAddress and cDot11csMnParentInIpAddress. "
  },
  "cDot11csMnContextIpAddress": {
    "name": "cDot11csMnContextIpAddress",
    "oid": "1.3.6.1.4.1.9.10.110.1.3.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The IP address of this mobile node. "
  },
  "cDot11csMnParentInIpAddress": {
    "name": "cDot11csMnParentInIpAddress",
    "oid": "1.3.6.1.4.1.9.10.110.1.3.1.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InetAddress",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The IP address of the parent infrastructure node of this mobile node. "
  },
  "cDot11csMnRegistrationAge": {
    "name": "cDot11csMnRegistrationAge",
    "oid": "1.3.6.1.4.1.9.10.110.1.3.1.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TimeInterval",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The time elapsed since this mobile node has registered with the wireless service entity identified by cDot11csStatusNodeIndex in hundredths of a second. This object is not applicable if the entity identified by cDot11csStatusNodeIndex is not a MN Authenticator. "
  },
  "cDot11csMnNskExpiryTimeOut": {
    "name": "cDot11csMnNskExpiryTimeOut",
    "oid": "1.3.6.1.4.1.9.10.110.1.3.1.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TimeInterval",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The network session timeout value assigned by the AAA server to this mobile node in hundredths of a of a second. This object is not applicable if the entity identified by cDot11csStatusNodeIndex is not a MN Authenticator. "
  },
  "cDot11csMnCipherNegotiated": {
    "name": "cDot11csMnCipherNegotiated",
    "oid": "1.3.6.1.4.1.9.10.110.1.3.1.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "none": 0,
          "wep": 1,
          "tkip": 2,
          "ckip": 3,
          "other": 4
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The type of the cipher negotiated for privacy and authenticity. The various types are described as follows. none - No protocol in use for privacy and authenticity. wep - Wired Equivalent Privacy. tkip - Temporal Key Integrity Protocol. ckip - A proprietary implementation similar to TKIP. other - vendor specific implementations. "
  },
  "cDot11csElectedAsWds": {
    "name": "cDot11csElectedAsWds",
    "oid": "1.3.6.1.4.1.9.10.110.0.1",
    "class": "notificationtype",
    "objects": [
      {
        "module": "IF-MIB",
        "object": "ifPhysAddress"
      }
    ],
    "status": "current",
    "description": "This notification is sent by the WDS entity that has got elected to offer Wireless Domain Services."
  },
  "cDot11csInRegisteredWithWs": {
    "name": "cDot11csInRegisteredWithWs",
    "oid": "1.3.6.1.4.1.9.10.110.0.2",
    "class": "notificationtype",
    "objects": [
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csDescendantInIpAddressType"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csDescendantInIpAddress"
      },
      {
        "module": "IF-MIB",
        "object": "ifPhysAddress"
      }
    ],
    "status": "current",
    "description": "This notification is sent by the wireless service entity upon an infrastructure node getting registered with that wireless service entity. The notification carries the MAC address of the wireless service entity. "
  },
  "cDot11csInDeRegisteredWithWs": {
    "name": "cDot11csInDeRegisteredWithWs",
    "oid": "1.3.6.1.4.1.9.10.110.0.3",
    "class": "notificationtype",
    "objects": [
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csDescendantInIpAddressType"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csDescendantInIpAddress"
      },
      {
        "module": "IF-MIB",
        "object": "ifPhysAddress"
      }
    ],
    "status": "current",
    "description": "This notification is sent by the wireless service entity upon an infrastructure node getting deregistered with that wireless service entity. The notification carries the MAC address of the wireless service entity. "
  },
  "ciscoDot11csMIBCompliances": {
    "name": "ciscoDot11csMIBCompliances",
    "oid": "1.3.6.1.4.1.9.10.110.2.1",
    "class": "objectidentity"
  },
  "ciscoDot11csMIBGroups": {
    "name": "ciscoDot11csMIBGroups",
    "oid": "1.3.6.1.4.1.9.10.110.2.2",
    "class": "objectidentity"
  },
  "ciscoDot11csCompliance": {
    "name": "ciscoDot11csCompliance",
    "oid": "1.3.6.1.4.1.9.10.110.2.1.1",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "cDot11csConfigGlobalGroup",
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB"
      },
      {
        "object": "cDot11csDescendantInGroup",
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB"
      },
      {
        "object": "cDot11csMnGroup",
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB"
      },
      {
        "object": "cDot11csMIBNotifGroup",
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB"
      }
    ],
    "status": "current",
    "description": "The compliance statement for the SNMP entities that implement Wireless Domain Services and Wireless Network Services. "
  },
  "cDot11csConfigGlobalGroup": {
    "name": "cDot11csConfigGlobalGroup",
    "oid": "1.3.6.1.4.1.9.10.110.2.2.1",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csServiceType"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csParentNodeIpAddressType"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csParentNodeIpAddress"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csPrimaryRootNodeAddrType"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csPrimaryRootNodeAddr"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csSecondaryRootNodeAddrType"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csSecondaryRootNodeAddr"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csCurrentRootNodeAddrType"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csCurrentRootNodeAddr"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csWnsEntityName"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csMnaIpAddressType"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csMnaIpAddress"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csIsRootNode"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csNodeOperationMode"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csWnsSubnetMask"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csWnsRowStatus"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csWnmConfigAuthenState"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csWnmConfigRowStatus"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csWdsInstanceNodeIndex"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csWdsInstanceInterfaceIndex"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csWdsInstancePriority"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csWdsInstanceState"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csWdsInstanceRowStatus"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csStatusAdminStatus"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csStatusOperStatus"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csStatusChangeTimeStamp"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csStatusAdvtInterval"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csStatusInRegistrations"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csStatusInDeRegistrations"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csStatusCurrentlyRegisteredIns"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csStatusSentAdvts"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csElectedAsWdsEnable"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csInRegisteredWithWsEnable"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csInDeRegisteredWithWsEnable"
      }
    ],
    "status": "current",
    "description": "This collection of objects provide information about the wireless services configured in a device and their current status. "
  },
  "cDot11csDescendantInGroup": {
    "name": "cDot11csDescendantInGroup",
    "oid": "1.3.6.1.4.1.9.10.110.2.2.2",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csDescendantInType"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csDescendantInIpAddressType"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csDescendantInIpAddress"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csDescendantInRegistrationAge"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csDescendantInCtkRefreshes"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csDescendantInNskExpiryTimeOut"
      }
    ],
    "status": "current",
    "description": "A collection of objects that contain information about all the descendant infrastructure nodes of a wireless service entity. "
  },
  "cDot11csMnGroup": {
    "name": "cDot11csMnGroup",
    "oid": "1.3.6.1.4.1.9.10.110.2.2.3",
    "class": "objectgroup",
    "objects": [
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csMnContextSsid"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csMnContextSystemName"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csMnContextUserId"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csMnContextIpAddressType"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csMnContextIpAddress"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csMnParentInIpAddress"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csMnRegistrationAge"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csMnNskExpiryTimeOut"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csMnCipherNegotiated"
      }
    ],
    "status": "current",
    "description": "The collection of objects that provide mobile node context information cached in a wireless service entity. "
  },
  "cDot11csMIBNotifGroup": {
    "name": "cDot11csMIBNotifGroup",
    "oid": "1.3.6.1.4.1.9.10.110.2.2.4",
    "class": "notificationgroup",
    "objects": [
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csElectedAsWds"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csInRegisteredWithWs"
      },
      {
        "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB",
        "object": "cDot11csInDeRegisteredWithWs"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing notifications related to election of WDS, registration and deregistration of infrastructure nodes with entities offering wireless services. "
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/CISCO-DOT11-CONTEXT-SERVICES-MIB",
      "Produced by pysmi-0.3.4 at Fri May 24 17:00:00 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "CISCO-DOT11-CONTEXT-SERVICES-MIB"
  }
}