{
  "imports": {
    "class": "imports",
    "DIFFSERV-DSCP-TC": [
      "Dscp"
    ],
    "HCNUM-TC": [
      "ZeroBasedCounter64",
      "CounterBasedGauge64"
    ],
    "RMON-MIB": [
      "rmon",
      "OwnerString"
    ],
    "RMON2-MIB": [
      "ZeroBasedCounter32",
      "TimeFilter",
      "protocolDirLocalIndex",
      "DataSource",
      "LastCreateTime"
    ],
    "SNMP-FRAMEWORK-MIB": [
      "SnmpAdminString"
    ],
    "SNMPv2-CONF": [
      "OBJECT-GROUP",
      "MODULE-COMPLIANCE",
      "NOTIFICATION-GROUP"
    ],
    "SNMPv2-SMI": [
      "IpAddress",
      "Bits",
      "TimeTicks",
      "Unsigned32",
      "MODULE-IDENTITY",
      "MibIdentifier",
      "iso",
      "OBJECT-TYPE",
      "Integer32",
      "NOTIFICATION-TYPE",
      "Counter32",
      "Counter64",
      "Gauge32",
      "OBJECT-IDENTITY"
    ],
    "SNMPv2-TC": [
      "TimeStamp",
      "RowStatus",
      "TruthValue",
      "TEXTUAL-CONVENTION",
      "DisplayString"
    ]
  },
  "dsmonMIB": {
    "name": "dsmonMIB",
    "oid": "1.3.6.1.2.1.16.26",
    "class": "moduleidentity",
    "revisions": [
      {
        "revision": "2002-05-31 00:00",
        "description": "Initial version of the DSMON MIB module. This version published as RFC 3287."
      }
    ],
    "lastupdated": "200205310000Z",
    "organization": "IETF RMONMIB Working Group",
    "contactinfo": " Andy Bierman Cisco Systems, Inc. RMONMIB WG Chair and DSMON MIB Editor Postal: 170 West Tasman Drive San Jose, CA USA 95134 Tel: +1 408 527-3711 E-mail: abierman@cisco.com Send comments to <rmonmib@ietf.org> Mailing list subscription info: http://www.ietf.org/mailman/listinfo/rmonmib ",
    "description": "This module defines Remote Monitoring MIB extensions for Differentiated Services enabled networks. RMON DIFFSERV DSCP statistics * Per Counter Aggregation Group * Per Protocol Per Counter Aggregation Group * Per Counter Aggregation Group Per Host * Per Counter Aggregation Group Per Host-Pair In order to maintain the RMON 'look-and-feel' and semantic consistency, some of the text from the RMON-2 and HC-RMON MIBs by Steve Waldbusser has been adapted for use in this MIB."
  },
  "dsmonObjects": {
    "name": "dsmonObjects",
    "oid": "1.3.6.1.2.1.16.26.1",
    "class": "objectidentity"
  },
  "dsmonNotifications": {
    "name": "dsmonNotifications",
    "oid": "1.3.6.1.2.1.16.26.2",
    "class": "objectidentity"
  },
  "dsmonConformance": {
    "name": "dsmonConformance",
    "oid": "1.3.6.1.2.1.16.26.3",
    "class": "objectidentity"
  },
  "dsmonAggObjects": {
    "name": "dsmonAggObjects",
    "oid": "1.3.6.1.2.1.16.26.1.1",
    "class": "objectidentity"
  },
  "dsmonStatsObjects": {
    "name": "dsmonStatsObjects",
    "oid": "1.3.6.1.2.1.16.26.1.2",
    "class": "objectidentity"
  },
  "dsmonPdistObjects": {
    "name": "dsmonPdistObjects",
    "oid": "1.3.6.1.2.1.16.26.1.3",
    "class": "objectidentity"
  },
  "dsmonHostObjects": {
    "name": "dsmonHostObjects",
    "oid": "1.3.6.1.2.1.16.26.1.4",
    "class": "objectidentity"
  },
  "dsmonCapsObjects": {
    "name": "dsmonCapsObjects",
    "oid": "1.3.6.1.2.1.16.26.1.5",
    "class": "objectidentity"
  },
  "dsmonMatrixObjects": {
    "name": "dsmonMatrixObjects",
    "oid": "1.3.6.1.2.1.16.26.1.6",
    "class": "objectidentity"
  },
  "DsmonCounterAggGroupIndex": {
    "name": "DsmonCounterAggGroupIndex",
    "class": "textualconvention",
    "type": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 2147483647
          }
        ]
      }
    },
    "status": "current",
    "description": "This TC describes a data type which identifies a DSMON counter aggregation group, which is an arbitrary grouping of conceptual counters, for monitoring purposes only. The range for this data type begins with zero (instead of one), to allow for a direct mapping between counter indexing schemes that start at zero (e.g. DSCP values in packets) and counter aggregation group values."
  },
  "DsmonCounterAggProfileIndex": {
    "name": "DsmonCounterAggProfileIndex",
    "class": "textualconvention",
    "type": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 2147483647
          }
        ]
      }
    },
    "status": "current",
    "description": "This TC describes a data type which identifies a DSMON counter aggregation profile, which is a set of counter aggregation group assignments for each of the 64 DSCP values, for a particular statistical collection."
  },
  "dsmonCapabilities": {
    "name": "dsmonCapabilities",
    "oid": "1.3.6.1.2.1.16.26.1.5.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Bits",
      "class": "type",
      "bits": {
        "dsmonCounterAggControl": 0,
        "dsmonStats": 1,
        "dsmonStatsOvfl": 2,
        "dsmonStatsHC": 3,
        "dsmonPdist": 4,
        "dsmonPdistOvfl": 5,
        "dsmonPdistHC": 6,
        "dsmonHost": 7,
        "dsmonHostOvfl": 8,
        "dsmonHostHC": 9,
        "dsmonCaps": 10,
        "dsmonMatrix": 11,
        "dsmonMatrixOvfl": 12,
        "dsmonMatrixHC": 13
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object provides an indication of the DSMON groups supported by the agent. If a bit is set, then the agent implements all of the objects in the DSMON object group, where bit 'n' represents the MIB group identified by the OBJECT IDENTIFIER value { dsmonGroups n+1 }."
  },
  "dsmonMaxAggGroups": {
    "name": "dsmonMaxAggGroups",
    "oid": "1.3.6.1.2.1.16.26.1.1.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 2,
            "max": 64
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The maximum number of counter aggregation groups that this agent can support. The agent will allow this number of distinct groups to be configured in the dsmonAggProfileTable, numbered from '0' to 'dsmonMaxAggGroups - 1', for each counter aggregation profile entry supported by the agent. The agent MUST NOT lower this value during system operation, and SHOULD set this object to an appropriate value during system initialization."
  },
  "dsmonAggControlLocked": {
    "name": "dsmonAggControlLocked",
    "oid": "1.3.6.1.2.1.16.26.1.1.2",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Controls the setup of counter aggregation groups for this agent. If this object contains the value 'true', then write access to the objects in the dsmonAggControlTable (except the dsmonAggControlOwner object), dsmonAggProfileTable, and dsmonAggGroupTable is not permitted, and data collection is possible. This object only controls write access to these MIB objects. The DSMON data collection control tables (e.g., dsmonHostCtlTable) can be configured at any time, regardless of the value of this object. If this object contains the value 'false', write access to the objects in the dsmonAggControlTable, dsmonAggProfileTable, and dsmonAggGroupTable is permitted, and data collection is not possible. In addition, all objects in all DSMON data tables (e.g., dsmonStatsTable) shall be deleted. An agent is not required to process SNMP Set Requests for this object in conjunction with other objects from this MIB. This is intended to simplify the processing of Set Requests for tables such as the dsmonAggProfileTable, by eliminating the possibility that a single Set PDU will contain multiple varbinds which are in conflict, such as a PDU which both modifies the dsmonAggProfileTable and locks the dsmonAggProfileTable at the same time. Note that the agent is not required to validate the entire counter aggregation configuration when an attempt is made to transition an instance of this object from 'true' to 'false'. That validation is done if and when a DSMON data collection is activated. An agent is required to reactivate any suspended data collections when this object transitions to 'true', Each active data control entry (e.g., dsmonStatsControlEntry), will be validated with respect to the new counter aggregation configuration. If the counter aggregation profile referenced in the data collection is valid, then that collection will be restarted. Otherwise, the RowStatus object (e.g., dsmonStatsControlStatus) will be set to 'notReady' for that collection control entry."
  },
  "dsmonAggControlChanges": {
    "name": "dsmonAggControlChanges",
    "oid": "1.3.6.1.2.1.16.26.1.1.3",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object counts the number of times the value of the dsmonAggControlLocked object has changed. A management station can use this object to detect if counters in the DSMON data tables (e.g., dsmonStatsEntry) have been deleted and recreated between polls. This object shall be incremented by one each time the dsmonAggControlLocked object changes from 'false' to 'true', or from 'true' to 'false'."
  },
  "dsmonAggControlLastChangeTime": {
    "name": "dsmonAggControlLastChangeTime",
    "oid": "1.3.6.1.2.1.16.26.1.1.4",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TimeStamp",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object identifies the value of sysUpTime at the moment the dsmonAggControlLocked object was last modified. A management station can use this object to detect if counters in the DSMON data tables (e.g., dsmonStatsEntry) have been deleted and recreated between polls. This object shall be updated with the current value of sysUpTime, if the dsmonAggControlLocked object changes from 'false' to 'true', or from 'true' to 'false'. Upon system initialization, this object shall contain the value zero."
  },
  "dsmonAggControlTable": {
    "name": "dsmonAggControlTable",
    "oid": "1.3.6.1.2.1.16.26.1.1.5",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table provides an overall description and control point for all dsmonAggProfileEntries with the same dsmonAggControlIndex value. A management application SHOULD create a counter aggregation profile by first creating and activating an entry in this table. This will cause the agent to create a set of 64 dsmonAggProfileEntries on behalf of this control entry. An application can then set the individual counter aggregation group assignments for each of the 64 DSCP values, This table MUST NOT be modified if the dsmonAggControlLocked object is equal to 'true'. Note that an agent MAY choose to limit the actual number of entries which may be created in this table, and (independently) the number of counter aggregation profiles which may be applied to a particular data source. In this case, the agent SHOULD return an error-status of 'resourceUnavailable(13)', as per section 4.2.5 of the 'Protocol Operations for SNMPv2' specification [RFC1905]. The agent SHOULD support non-volatile configuration of this table, and upon system initialization, the table SHOULD be initialized with the saved values. Otherwise, each potential counter aggregation group description string SHOULD contain the empty string."
  },
  "dsmonAggControlEntry": {
    "name": "dsmonAggControlEntry",
    "oid": "1.3.6.1.2.1.16.26.1.1.5.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "DSMON-MIB",
        "object": "dsmonAggControlIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A conceptual row in the dsmonAggControlTable."
  },
  "dsmonAggControlIndex": {
    "name": "dsmonAggControlIndex",
    "oid": "1.3.6.1.2.1.16.26.1.1.5.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DsmonCounterAggProfileIndex",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "An arbitrary integer index value used to identify the counter aggregation profile specified by this control entry."
  },
  "dsmonAggControlDescr": {
    "name": "dsmonAggControlDescr",
    "oid": "1.3.6.1.2.1.16.26.1.1.5.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 64
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "An administratively assigned description of the counter aggregation profile identified by this entry. Upon first creation of an instance of this object, the agent SHOULD set this object to the empty string. If the agent supports non-volatile storage, then this object SHOULD be re-initialized with its stored value after a system reboot. This object MUST NOT be modified if the associated dsmonAggControlStatus object is equal to 'active', or the dsmonAggControlLocked object is equal to 'true'."
  },
  "dsmonAggControlOwner": {
    "name": "dsmonAggControlOwner",
    "oid": "1.3.6.1.2.1.16.26.1.1.5.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OwnerString",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The entity that configured this entry and is therefore using the resources assigned to it."
  },
  "dsmonAggControlStatus": {
    "name": "dsmonAggControlStatus",
    "oid": "1.3.6.1.2.1.16.26.1.1.5.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status of this row. An entry MUST NOT exist in the active state unless all objects in the entry have an appropriate value. Upon setting this object to active(1), the agent will create a complete set of 64 associated entries in the dsmonAggProfileTable. If this object is not equal to active(1), all associated entries in the dsmonAggProfileTable shall be deleted. This object MUST NOT be modified if the dsmonAggControlLocked object is equal to 'true'."
  },
  "dsmonAggProfileTable": {
    "name": "dsmonAggProfileTable",
    "oid": "1.3.6.1.2.1.16.26.1.1.6",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Controls the setup of counter aggregation profiles for this agent. For each such profile, every DSCP value MUST be configured into exactly one counter aggregation group. This table MUST NOT be modified if the dsmonAggControlLocked object is equal to 'true'. The agent will create a set of 64 entries in this table (with the same dsmonAggControlIndex value) when the associated dsmonAggControlEntry is activated. If the agent supports non-volatile configuration of this table, then upon system initialization, this table SHOULD be initialized with the saved values."
  },
  "dsmonAggProfileEntry": {
    "name": "dsmonAggProfileEntry",
    "oid": "1.3.6.1.2.1.16.26.1.1.6.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "DSMON-MIB",
        "object": "dsmonAggControlIndex",
        "implied": 0
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonAggProfileDSCP",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A conceptual row in the dsmonAggProfileTable. The dsmonAggControlIndex value in the index identifies the dsmonAggControlEntry associated with each entry in this table."
  },
  "dsmonAggProfileDSCP": {
    "name": "dsmonAggProfileDSCP",
    "oid": "1.3.6.1.2.1.16.26.1.1.6.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Dscp",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The specific DSCP value for the DSCP counter which is configured in a counter aggregation group by this entry."
  },
  "dsmonAggGroupIndex": {
    "name": "dsmonAggGroupIndex",
    "oid": "1.3.6.1.2.1.16.26.1.1.6.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DsmonCounterAggGroupIndex",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The counter aggregation group which contains this DSCP value. Upon creation of a new sub-tree (set of 64 entries with the same dsmonAggControlIndex value) in this table, the agent SHOULD initialize all related instances of this object to the value zero. This object MUST NOT be modified if the dsmonAggControlLocked object is equal to 'true'."
  },
  "dsmonAggGroupTable": {
    "name": "dsmonAggGroupTable",
    "oid": "1.3.6.1.2.1.16.26.1.1.7",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table provides a description of each counter aggregation group configured on this system. Note that the semantics of a particular counter aggregation group are only relevant within the scope of a particular counter aggregation profile. This table MUST NOT be modified if the dsmonAggControlLocked object is equal to 'true'. Note that an agent MAY choose to limit the actual number of entries which may be created in this table, and (independently) the number of counter aggregation profiles which may be applied to a particular data source. In this case, the agent SHOULD return an error-status of 'resourceUnavailable(13)', as per section 4.2.5 of the 'Protocol Operations for SNMPv2' specification [RFC1905]. If the agent supports non-volatile configuration of this table, then upon system initialization, this table SHOULD be initialized with the saved values. Otherwise, each potential counter aggregation group description string SHOULD contain the empty string. An agent SHOULD allow entries to be created or modified in this table, even if the specified dsmonAggControlIndex value does not identify a valid dsmonAggControlEntry or a complete set of valid dsmonAggProfileEntries, to reduce row creation order dependencies."
  },
  "dsmonAggGroupEntry": {
    "name": "dsmonAggGroupEntry",
    "oid": "1.3.6.1.2.1.16.26.1.1.7.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "DSMON-MIB",
        "object": "dsmonAggControlIndex",
        "implied": 0
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonAggGroupIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A conceptual row in the dsmonAggGroupTable. The dsmonAggGroupIndex value in the INDEX identifies the counter aggregation group associated with each entry. The dsmonAggControlIndex in the index identifies the counter aggregation profile associated with each entry, identified by the dsmonAggControlEntry and dsmonAggProfileEntries with the same index value. The agent SHOULD support non-volatile configuration of this table, and upon system initialization, the table SHOULD be initialized with the saved values. The dsmonAggGroupIndex in the index identifies the counter aggregation group associated with each entry. This object SHOULD be indexed from zero to 'N', where 'N' is less than the value of the dsmonMaxAggGroups for this agent."
  },
  "dsmonAggGroupDescr": {
    "name": "dsmonAggGroupDescr",
    "oid": "1.3.6.1.2.1.16.26.1.1.7.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 64
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "An administratively assigned description of the counter aggregation group identified by this entry. Upon first creation of an instance of this object, the agent SHOULD set this object to the empty string. This object MUST NOT be modified if the associated dsmonAggGroupStatus object is equal to 'active', or the dsmonAggControlLocked object is equal to 'true'."
  },
  "dsmonAggGroupStatus": {
    "name": "dsmonAggGroupStatus",
    "oid": "1.3.6.1.2.1.16.26.1.1.7.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status of this row. An entry MUST NOT exist in the active state unless all objects in the entry have an appropriate value. This object MUST NOT be modified if the dsmonAggControlLocked object is equal to 'true'."
  },
  "dsmonStatsControlTable": {
    "name": "dsmonStatsControlTable",
    "oid": "1.3.6.1.2.1.16.26.1.2.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Controls the setup of per data source per counter aggregation group distribution statistics. Note that an agent MAY choose to limit the actual number of entries which may be created in this table. In this case, the agent SHOULD return an error-status of 'resourceUnavailable(13)', as per section 4.2.5 of the 'Protocol Operations for SNMPv2' specification [RFC1905]."
  },
  "dsmonStatsControlEntry": {
    "name": "dsmonStatsControlEntry",
    "oid": "1.3.6.1.2.1.16.26.1.2.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "DSMON-MIB",
        "object": "dsmonStatsControlIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A conceptual row in the dsmonStatsControlTable. Entries are created and deleted from this table by management action only, using the dsmonStatsControlStatus RowStatus object. The agent SHOULD support non-volatile configuration of this table, and upon system initialization, the table SHOULD be initialized with the saved values. Activation of a control row in this table will cause an associated dsmonStatsTable to be created and maintained by the agent."
  },
  "dsmonStatsControlIndex": {
    "name": "dsmonStatsControlIndex",
    "oid": "1.3.6.1.2.1.16.26.1.2.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "An arbitrary and unique index for this dsmonStatsControlEntry."
  },
  "dsmonStatsControlDataSource": {
    "name": "dsmonStatsControlDataSource",
    "oid": "1.3.6.1.2.1.16.26.1.2.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DataSource",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The data source of this per protocol per counter aggregation group distribution. Note that only packets that contain a network protocol encapsulation which contains a DS field [RFC2474] will be counted in this table. This object MUST NOT be modified if the associated dsmonStatsControlStatus object is equal to active(1)."
  },
  "dsmonStatsControlAggProfile": {
    "name": "dsmonStatsControlAggProfile",
    "oid": "1.3.6.1.2.1.16.26.1.2.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DsmonCounterAggProfileIndex",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The dsmonAggControlIndex value identifying the counter aggregation profile which should be used on behalf of this dsmonStatsControlEntry. The associated dsmonAggControlEntry and dsmonAggProfileEntries, identified by the same dsmonAggControlIndex index value, MUST be active in order for this entry to remain active. It is possible for the counter aggregation configuration to change from a valid to invalid state for this dsmonStats collection. In this case, the associated dsmonStatsControlStatus object will be changed to the 'notReady' state, and data collection will not occur on behalf of this control entry. Note that an agent MAY choose to limit the actual number of counter aggregation profiles which may be applied to a particular data source. This object MUST NOT be modified if the associated dsmonStatsControlStatus object is equal to active(1)."
  },
  "dsmonStatsControlDroppedFrames": {
    "name": "dsmonStatsControlDroppedFrames",
    "oid": "1.3.6.1.2.1.16.26.1.2.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "frames",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The total number of frames which were received by the probe and therefore not accounted for in the *StatsDropEvents, but for which the probe chose not to count for this entry for whatever reason. Most often, this event occurs when the probe is out of some resources and decides to shed load from this collection. This count does not include packets that were not counted because they had MAC-layer errors. Note that, unlike the dropEvents counter, this number is the exact number of frames dropped."
  },
  "dsmonStatsControlCreateTime": {
    "name": "dsmonStatsControlCreateTime",
    "oid": "1.3.6.1.2.1.16.26.1.2.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "LastCreateTime",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The value of sysUpTime when this control entry was last activated. This can be used by the management station to detect if the table has been deleted and recreated between polls."
  },
  "dsmonStatsControlOwner": {
    "name": "dsmonStatsControlOwner",
    "oid": "1.3.6.1.2.1.16.26.1.2.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OwnerString",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The entity that configured this entry and is therefore using the resources assigned to it."
  },
  "dsmonStatsControlStatus": {
    "name": "dsmonStatsControlStatus",
    "oid": "1.3.6.1.2.1.16.26.1.2.1.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status of this row. An entry MUST NOT exist in the active state unless all objects in the entry have an appropriate value. If this object is not equal to active(1), all associated entries in the dsmonStatsTable shall be deleted."
  },
  "dsmonStatsTable": {
    "name": "dsmonStatsTable",
    "oid": "1.3.6.1.2.1.16.26.1.2.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A list of information on counter aggregation group usage for each monitored data source. The following table defines per counter aggregation group statistics for full and/or half-duplex links as well as high capacity links. For half-duplex links, or full-duplex-capable links operating in half-duplex mode, the dsmonStatsIn* objects shall be used and the dsmonStatsOut* objects will not increment. For full-duplex links, the dsmonStatsOut* objects will be present. Whenever possible, the probe SHOULD count packets moving away from the closest terminating equipment as output packets. Failing that, the probe SHOULD count packets moving away from the DTE as output packets. If the dsmonAggControlLocked object is equal to 'false', then all entries in this table will be deleted and the agent will not process packets on behalf of any dsmonStatsControlEntry."
  },
  "dsmonStatsEntry": {
    "name": "dsmonStatsEntry",
    "oid": "1.3.6.1.2.1.16.26.1.2.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "DSMON-MIB",
        "object": "dsmonStatsControlIndex",
        "implied": 0
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonAggGroupIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A list of information on Differentiated Services DSCP usage, containing inbound and outbound packet and octet counters for each counter aggregation group configured for collection. The dsmonStatsControlIndex value in the index identifies the dsmonStatsControlEntry on whose behalf this entry was created. The dsmonAggGroupIndex value in the index is determined by examining the DSCP value in each monitored packet, and the dsmonAggProfileTable entry for that DSCP value. Note that only packets that contain a network protocol encapsulation which contains a DS field [RFC2474] will be counted in this table. An example of the indexing of this entry is dsmonStatsOutPkts.1.16"
  },
  "dsmonStatsInPkts": {
    "name": "dsmonStatsInPkts",
    "oid": "1.3.6.1.2.1.16.26.1.2.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of packets using one of the DSCP values in the indicated counter aggregation group, received on a half- duplex link or on the inbound connection of a full-duplex link."
  },
  "dsmonStatsInOctets": {
    "name": "dsmonStatsInOctets",
    "oid": "1.3.6.1.2.1.16.26.1.2.2.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter32",
      "class": "type"
    },
    "units": "octets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of octets in packets, using one of the DSCP values in the indicated counter aggregation group, received on a half-duplex link or on the inbound connection of a full-duplex link."
  },
  "dsmonStatsInOvflPkts": {
    "name": "dsmonStatsInOvflPkts",
    "oid": "1.3.6.1.2.1.16.26.1.2.2.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The number of times the associated dsmonStatsInPkts counter has overflowed. Note that this object will only be instantiated if the associated dsmonStatsInHCPkts object is also instantiated for a particular dataSource."
  },
  "dsmonStatsInOvflOctets": {
    "name": "dsmonStatsInOvflOctets",
    "oid": "1.3.6.1.2.1.16.26.1.2.2.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The number of times the associated dsmonStatsInOctets counter has overflowed. Note that this object will only be instantiated if the associated dsmonStatsInHCOctets object is also instantiated for a particular dataSource."
  },
  "dsmonStatsInHCPkts": {
    "name": "dsmonStatsInHCPkts",
    "oid": "1.3.6.1.2.1.16.26.1.2.2.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter64",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The 64-bit version of the dsmonStatsInPkts object. Note that this object will only be instantiated if the RMON agent supports High Capacity monitoring for a particular dataSource."
  },
  "dsmonStatsInHCOctets": {
    "name": "dsmonStatsInHCOctets",
    "oid": "1.3.6.1.2.1.16.26.1.2.2.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter64",
      "class": "type"
    },
    "units": "octets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The 64-bit version of the dsmonStatsInOctets object. Note that this object will only be instantiated if the RMON agent supports High Capacity monitoring for a particular dataSource."
  },
  "dsmonStatsOutPkts": {
    "name": "dsmonStatsOutPkts",
    "oid": "1.3.6.1.2.1.16.26.1.2.2.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of packets using one of the DSCP values in the indicated counter aggregation group, received on a full- duplex link in the direction of the network."
  },
  "dsmonStatsOutOctets": {
    "name": "dsmonStatsOutOctets",
    "oid": "1.3.6.1.2.1.16.26.1.2.2.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter32",
      "class": "type"
    },
    "units": "octets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of octets in packets, using one of the DSCP values in the indicated counter aggregation group, received on a full-duplex link in the direction of the network."
  },
  "dsmonStatsOutOvflPkts": {
    "name": "dsmonStatsOutOvflPkts",
    "oid": "1.3.6.1.2.1.16.26.1.2.2.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The number of times the associated dsmonStatsOutPkts counter has overflowed. Note that this object will only be instantiated if the associated dsmonStatsOutHCPkts object is also instantiated for a particular dataSource."
  },
  "dsmonStatsOutOvflOctets": {
    "name": "dsmonStatsOutOvflOctets",
    "oid": "1.3.6.1.2.1.16.26.1.2.2.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The number of times the associated dsmonStatsOutOctets counter has overflowed. Note that this object will only be instantiated if the associated dsmonStatsOutHCOctets object is also instantiated for a particular dataSource."
  },
  "dsmonStatsOutHCPkts": {
    "name": "dsmonStatsOutHCPkts",
    "oid": "1.3.6.1.2.1.16.26.1.2.2.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter64",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The 64-bit version of the dsmonStatsOutPkts object. Note that this object will only be instantiated if the RMON agent supports High Capacity monitoring for a particular dataSource."
  },
  "dsmonStatsOutHCOctets": {
    "name": "dsmonStatsOutHCOctets",
    "oid": "1.3.6.1.2.1.16.26.1.2.2.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter64",
      "class": "type"
    },
    "units": "octets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The 64-bit version of the dsmonStatsOutOctets object. Note that this object will only be instantiated if the RMON agent supports High Capacity monitoring for a particular dataSource."
  },
  "dsmonPdistCtlTable": {
    "name": "dsmonPdistCtlTable",
    "oid": "1.3.6.1.2.1.16.26.1.3.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Controls the setup of per application per counter aggregation group distribution statistics. Note that an agent MAY choose to limit the actual number of entries which may be created in this table. In this case, the agent SHOULD return an error-status of 'resourceUnavailable(13)', as per section 4.2.5 of the 'Protocol Operations for SNMPv2' specification [RFC1905]."
  },
  "dsmonPdistCtlEntry": {
    "name": "dsmonPdistCtlEntry",
    "oid": "1.3.6.1.2.1.16.26.1.3.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistCtlIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A conceptual row in the dsmonPdistCtlTable. Entries are created and deleted from this table by management action only, using the dsmonPdistCtlStatus RowStatus object. The agent SHOULD support non-volatile configuration of this table, and upon system initialization, the table SHOULD be initialized with the saved values. Activation of a control row in this table will cause an associated dsmonPdistStatsTable to be created and maintained by the agent."
  },
  "dsmonPdistCtlIndex": {
    "name": "dsmonPdistCtlIndex",
    "oid": "1.3.6.1.2.1.16.26.1.3.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "An arbitrary and unique index for this dsmonPdistCtlEntry."
  },
  "dsmonPdistCtlDataSource": {
    "name": "dsmonPdistCtlDataSource",
    "oid": "1.3.6.1.2.1.16.26.1.3.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DataSource",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The source of data for the this per protocol counter aggregation group distribution. This object MUST NOT be modified if the associated dsmonPdistCtlStatus object is equal to active(1)."
  },
  "dsmonPdistCtlAggProfile": {
    "name": "dsmonPdistCtlAggProfile",
    "oid": "1.3.6.1.2.1.16.26.1.3.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DsmonCounterAggProfileIndex",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The dsmonAggControlIndex value identifying the counter aggregation profile which should be used on behalf of this dsmonPdistCtlEntry. The associated dsmonAggControlEntry and dsmonAggProfileEntries, identified by the same dsmonAggControlIndex index value, MUST be active in order for this entry to remain active. It is possible for the counter aggregation configuration to change from a valid to invalid state for this dsmonPdist collection. In this case, the associated dsmonPdistCtlStatus object will be changed to the 'notReady' state, and data collection will not occur on behalf of this control entry. Note that an agent MAY choose to limit the actual number of counter aggregation profiles which may be applied to a particular data source. This object MUST NOT be modified if the associated dsmonPdistCtlStatus object is equal to active(1)."
  },
  "dsmonPdistCtlMaxDesiredEntries": {
    "name": "dsmonPdistCtlMaxDesiredEntries",
    "oid": "1.3.6.1.2.1.16.26.1.3.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": -1,
            "max": -1
          },
          {
            "min": 1,
            "max": 2147483647
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The maximum number of entries that are desired in the dsmonPdistStatsTable on behalf of this control entry. The probe will not create more than this number of associated entries in the table, but MAY choose to create fewer entries in this table for any reason including the lack of resources. If this value is set to -1, the probe MAY create any number of entries in this table. This object MUST NOT be modified if the associated dsmonPdistCtlStatus object is equal to active(1)."
  },
  "dsmonPdistCtlDroppedFrames": {
    "name": "dsmonPdistCtlDroppedFrames",
    "oid": "1.3.6.1.2.1.16.26.1.3.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "frames",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The total number of frames which were received by the probe and therefore not accounted for in the *StatsDropEvents, but for which the probe chose not to count for this entry for whatever reason. Most often, this event occurs when the probe is out of some resources and decides to shed load from this collection. This count does not include packets that were not counted because they had MAC-layer errors. Note that, unlike the dropEvents counter, this number is the exact number of frames dropped."
  },
  "dsmonPdistCtlInserts": {
    "name": "dsmonPdistCtlInserts",
    "oid": "1.3.6.1.2.1.16.26.1.3.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "table entries",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of times a dsmonPdist entry has been inserted into the dsmonPdistTable. If an entry is inserted, then deleted, and then inserted, this counter will be incremented by 2. To allow for efficient implementation strategies, agents MAY delay updating this object for short periods of time. For example, an implementation strategy may allow internal data structures to differ from those visible via SNMP for short periods of time. This counter may reflect the internal data structures for those short periods of time. Note that the table size can be determined by subtracting dsmonPdistCtlDeletes from dsmonPdistCtlInserts."
  },
  "dsmonPdistCtlDeletes": {
    "name": "dsmonPdistCtlDeletes",
    "oid": "1.3.6.1.2.1.16.26.1.3.1.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "table entries",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of times a dsmonPdist entry has been deleted from the dsmonPdist table (for any reason). If an entry is deleted, then inserted, and then deleted, this counter will be incremented by 2. To allow for efficient implementation strategies, agents MAY delay updating this object for short periods of time. For example, an implementation strategy may allow internal data structures to differ from those visible via SNMP for short periods of time. This counter may reflect the internal data structures for those short periods of time. Note that the table size can be determined by subtracting dsmonPdistCtlDeletes from dsmonPdistCtlInserts."
  },
  "dsmonPdistCtlCreateTime": {
    "name": "dsmonPdistCtlCreateTime",
    "oid": "1.3.6.1.2.1.16.26.1.3.1.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "LastCreateTime",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The value of sysUpTime when this control entry was last activated. This can be used by the management station to detect if the table has been deleted and recreated between polls."
  },
  "dsmonPdistCtlOwner": {
    "name": "dsmonPdistCtlOwner",
    "oid": "1.3.6.1.2.1.16.26.1.3.1.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OwnerString",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The entity that configured this entry and is therefore using the resources assigned to it."
  },
  "dsmonPdistCtlStatus": {
    "name": "dsmonPdistCtlStatus",
    "oid": "1.3.6.1.2.1.16.26.1.3.1.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status of this row. An entry MUST NOT exist in the active state unless all objects in the entry have an appropriate value. If this object is not equal to active(1), all associated entries in the dsmonPdistStatsTable shall be deleted."
  },
  "dsmonPdistStatsTable": {
    "name": "dsmonPdistStatsTable",
    "oid": "1.3.6.1.2.1.16.26.1.3.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A list of information on a per protocol per counter aggregation group usage. If the dsmonAggControlLocked object is equal to 'false', then all entries in this table will be deleted and the agent will not process packets on behalf of any dsmonPdistCtlEntry."
  },
  "dsmonPdistStatsEntry": {
    "name": "dsmonPdistStatsEntry",
    "oid": "1.3.6.1.2.1.16.26.1.3.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistCtlIndex",
        "implied": 0
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistTimeMark",
        "implied": 0
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonAggGroupIndex",
        "implied": 0
      },
      {
        "module": "RMON2-MIB",
        "object": "protocolDirLocalIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A list of information on Differentiated Services DSCP usage, containing packet and octet counters for each counter aggregation group configured for collection, and each protocol (as identified by the protocolDirLocalIndex for the protocol) identified in each monitored packet. The dsmonPdistCtlIndex value in the index identifies the dsmonPdistCtlEntry on whose behalf this entry was created. Note that only packets that contain a network protocol encapsulation which contains a DS field [RFC2474] will be counted in this table. The dsmonAggGroupIndex value in the index is determined by examining the DSCP value in each monitored packet, and the dsmonAggProfileTable entry for that value. The protocolDirLocalIndex in the index identifies the protocolDirEntry for the protocol encapsulation of each monitored packet. The agent will include only application layer protocols in the associated dsmonPdistStatsTable. Any 'terminal' protocol is considered to be an application protocol. An example of the indexing of this entry is dsmonPdistStatsPkts.9.29943.0.42."
  },
  "dsmonPdistTimeMark": {
    "name": "dsmonPdistTimeMark",
    "oid": "1.3.6.1.2.1.16.26.1.3.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TimeFilter",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The Time Filter index for this table. This object may be used by a management station to retrieve only rows which have been created or modified since a particular time. Note that the current value for a row are always returned and the TimeFilter is not a historical data archiving mechanism. Refer to RFC 2021 [RFC2021] for a detailed description of TimeFilter operation."
  },
  "dsmonPdistStatsPkts": {
    "name": "dsmonPdistStatsPkts",
    "oid": "1.3.6.1.2.1.16.26.1.3.2.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of packets, using one of the DSCP values in the indicated counter aggregation group, for the protocol identified by the associated protocolDirLocalIndex value."
  },
  "dsmonPdistStatsOctets": {
    "name": "dsmonPdistStatsOctets",
    "oid": "1.3.6.1.2.1.16.26.1.3.2.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter32",
      "class": "type"
    },
    "units": "octets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of octets in packets, using one of the DSCP values in the indicated counter aggregation group, for the protocol identified by the associated protocolDirLocalIndex value. Note that this object doesn't count just those octets in the particular protocol frames, but includes the entire packet that contained the protocol."
  },
  "dsmonPdistStatsOvflPkts": {
    "name": "dsmonPdistStatsOvflPkts",
    "oid": "1.3.6.1.2.1.16.26.1.3.2.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The number of times the associated dsmonPdistStatsPkts counter has overflowed. Note that this object will only be instantiated if the associated dsmonPdistStatsHCPkts object is also instantiated for a particular dataSource."
  },
  "dsmonPdistStatsOvflOctets": {
    "name": "dsmonPdistStatsOvflOctets",
    "oid": "1.3.6.1.2.1.16.26.1.3.2.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The number of times the associated dsmonPdistStatsOctets counter has overflowed. Note that this object will only be instantiated if the associated dsmonPdistStatsHCOctets object is also instantiated for a particular dataSource."
  },
  "dsmonPdistStatsHCPkts": {
    "name": "dsmonPdistStatsHCPkts",
    "oid": "1.3.6.1.2.1.16.26.1.3.2.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter64",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The 64-bit version of the dsmonPdistStatsPkts object. Note that this object will only be instantiated if the RMON agent supports High Capacity monitoring for a particular dataSource."
  },
  "dsmonPdistStatsHCOctets": {
    "name": "dsmonPdistStatsHCOctets",
    "oid": "1.3.6.1.2.1.16.26.1.3.2.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter64",
      "class": "type"
    },
    "units": "octets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The 64-bit version of the dsmonPdistStatsOctets object. Note that this object will only be instantiated if the RMON agent supports High Capacity monitoring for a particular dataSource."
  },
  "dsmonPdistStatsCreateTime": {
    "name": "dsmonPdistStatsCreateTime",
    "oid": "1.3.6.1.2.1.16.26.1.3.2.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "LastCreateTime",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The value of sysUpTime when this dsmonPdistStats entry was last instantiated by the agent. This can be used by the management station to detect if the entry has been deleted and recreated between polls."
  },
  "dsmonPdistTopNCtlTable": {
    "name": "dsmonPdistTopNCtlTable",
    "oid": "1.3.6.1.2.1.16.26.1.3.3",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A set of parameters that control the creation of a report of the top N dsmonPdist entries according to a particular metric. Note that an agent MAY choose to limit the actual number of entries which may be created in this table. In this case, the agent SHOULD return an error-status of 'resourceUnavailable(13)', as per section 4.2.5 of the 'Protocol Operations for SNMPv2' specification [RFC1905]."
  },
  "dsmonPdistTopNCtlEntry": {
    "name": "dsmonPdistTopNCtlEntry",
    "oid": "1.3.6.1.2.1.16.26.1.3.3.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistTopNCtlIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A conceptual row in the dsmonPdistTopNCtlTable. Entries are created and deleted from this table by management action only, using the dsmonPdistTopNCtlStatus RowStatus object. The agent SHOULD support non-volatile configuration of this table, and upon system initialization, the table SHOULD be initialized with the saved values. Activation of a control row in this table will cause an associated dsmonPdistTopNTable to be created and maintained by the agent."
  },
  "dsmonPdistTopNCtlIndex": {
    "name": "dsmonPdistTopNCtlIndex",
    "oid": "1.3.6.1.2.1.16.26.1.3.3.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "An index that uniquely identifies an entry in the dsmonPdistTopNCtlTable, with the same dsmonPdistTopNCtlIndex value as this object. Each entry in this table defines one Top N report prepared on behalf of the dsmonPdistStatsEntry collection with the same dsmonPdistCtlIndex as this object."
  },
  "dsmonPdistTopNCtlPdistIndex": {
    "name": "dsmonPdistTopNCtlPdistIndex",
    "oid": "1.3.6.1.2.1.16.26.1.3.3.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The dsmonPdistTable for which a top N report will be prepared on behalf of this entry. The dsmonPdistTable is identified by the value of the dsmonPdistCtlIndex for that table - that value is used here to identify the particular table. This object MUST NOT be modified if the associated dsmonPdistTopNCtlStatus object is equal to active(1)."
  },
  "dsmonPdistTopNCtlRateBase": {
    "name": "dsmonPdistTopNCtlRateBase",
    "oid": "1.3.6.1.2.1.16.26.1.3.3.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "dsmonPdistTopNPkts": 1,
          "dsmonPdistTopNOctets": 2,
          "dsmonPdistTopNHCPkts": 3,
          "dsmonPdistTopNHCOctets": 4
        }
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The variable for each dsmonPdist that the dsmonPdistTopNRate and dsmonPdistTopNHCRate variables are based upon. Each dsmonPdistTopN report generated on behalf of this control entry will be ranked in descending order, based on the associated dsmonPdistStatsTable counter, identified by this object. The following table identifies the dsmonPdistTable counter associated with each enumeration: Enumeration RateBase MIB Object ----------- ------------------- dsmonPdistTopNPkts dsmonPdistStatsPkts dsmonPdistTopNOctets dsmonPdistStatsOctets dsmonPdistTopNHCPkts dsmonPdistStatsHCPkts dsmonPdistTopNHCOctets dsmonPdistStatsHCOctets Note that the dsmonPdistTopNHCPkts and dsmonPdistTopNHCOctets enumerations are only available if the agent supports High Capacity monitoring. This object MUST NOT be modified if the associated dsmonPdistTopNCtlStatus object is equal to active(1)."
  },
  "dsmonPdistTopNCtlTimeRemaining": {
    "name": "dsmonPdistTopNCtlTimeRemaining",
    "oid": "1.3.6.1.2.1.16.26.1.3.3.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 2147483647
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 1800,
        "format": "decimal"
      }
    },
    "units": "seconds",
    "maxaccess": "read-create",
    "status": "current",
    "description": "The number of seconds left in the report currently being collected. When this object is modified by the management station, a new collection is started, possibly aborting a currently running report. The new value is used as the requested duration of this report, and is immediately loaded into the associated dsmonPdistTopNCtlDuration object. When the report finishes, the probe will automatically start another collection with the same initial value of dsmonPdistTopNCtlTimeRemaining. Thus the management station may simply read the resulting reports repeatedly, checking the startTime and duration each time to ensure that a report was not missed or that the report parameters were not changed. While the value of this object is non-zero, it decrements by one per second until it reaches zero. At the time that this object decrements to zero, the report is made accessible in the dsmonPdistTopNTable, overwriting any report that may be there. When this object is modified by the management station, any associated entries in the dsmonPdistTopNTable shall be deleted."
  },
  "dsmonPdistTopNCtlGeneratedReprts": {
    "name": "dsmonPdistTopNCtlGeneratedReprts",
    "oid": "1.3.6.1.2.1.16.26.1.3.3.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "reports",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of reports that have been generated by this entry."
  },
  "dsmonPdistTopNCtlDuration": {
    "name": "dsmonPdistTopNCtlDuration",
    "oid": "1.3.6.1.2.1.16.26.1.3.3.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 2147483647
          }
        ]
      }
    },
    "units": "seconds",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of seconds that this report has collected during the last sampling interval. When the associated dsmonPdistTopNCtlTimeRemaining object is set, this object shall be set by the probe to the same value and shall not be modified until the next time the dsmonPdistTopNCtlTimeRemaining is set. This value shall be zero if no reports have been requested for this dsmonPdistTopNCtlEntry."
  },
  "dsmonPdistTopNCtlRequestedSize": {
    "name": "dsmonPdistTopNCtlRequestedSize",
    "oid": "1.3.6.1.2.1.16.26.1.3.3.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 2147483647
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 150,
        "format": "decimal"
      }
    },
    "units": "table entries",
    "maxaccess": "read-create",
    "status": "current",
    "description": "The maximum number of dsmonPdist entries requested for this report. When this object is created or modified, the probe SHOULD set dsmonPdistTopNCtlGrantedSize as closely to this object as is possible for the particular probe implementation and available resources."
  },
  "dsmonPdistTopNCtlGrantedSize": {
    "name": "dsmonPdistTopNCtlGrantedSize",
    "oid": "1.3.6.1.2.1.16.26.1.3.3.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 2147483647
          }
        ]
      }
    },
    "units": "table entries",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The maximum number of dsmonPdist entries in this report. When the associated dsmonPdistTopNCtlRequestedSize object is created or modified, the probe SHOULD set this object as closely to the requested value as is possible for the particular implementation and available resources. The probe MUST NOT lower this value except as a result of a set to the associated dsmonPdistTopNCtlRequestedSize object. Protocol entries with the highest value of dsmonPdistTopNRate or dsmonPdistTopNHCRate (depending on the value of the associated dsmonPdistTopNCtlRateBase object) shall be placed in this table in decreasing order of this rate until there is no more room or until there are no more dsmonPdist entries."
  },
  "dsmonPdistTopNCtlStartTime": {
    "name": "dsmonPdistTopNCtlStartTime",
    "oid": "1.3.6.1.2.1.16.26.1.3.3.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TimeStamp",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The value of sysUpTime when this top N report was last started. In other words, this is the time that the associated dsmonPdistTopNCtlTimeRemaining object was modified to start the requested report or the time the report was last automatically (re)started. This object may be used by the management station to determine if a report was missed or not."
  },
  "dsmonPdistTopNCtlOwner": {
    "name": "dsmonPdistTopNCtlOwner",
    "oid": "1.3.6.1.2.1.16.26.1.3.3.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OwnerString",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The entity that configured this entry and is therefore using the resources assigned to it."
  },
  "dsmonPdistTopNCtlStatus": {
    "name": "dsmonPdistTopNCtlStatus",
    "oid": "1.3.6.1.2.1.16.26.1.3.3.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status of this dsmonPdistTopNCtlEntry. An entry MUST NOT exist in the active state unless all objects in the entry have an appropriate value. If this object is not equal to active(1), all associated entries in the dsmonPdistTopNTable shall be deleted by the agent."
  },
  "dsmonPdistTopNTable": {
    "name": "dsmonPdistTopNTable",
    "oid": "1.3.6.1.2.1.16.26.1.3.4",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A set of statistics for those protocol distribution entries that have counted the highest number of octets or packets. If the dsmonAggControlLocked object is equal to 'false', then all entries in this table SHALL be deleted, and the agent will not process TopN reports on behalf of any dsmonPdistTopNCtlEntry. When the dsmonAggControlLocked object is set to 'true', then particular reports SHOULD be restarted from the beginning, on behalf of all active rows in the dsmonPdistTopNCtlTable. Note that dsmonPdist entries which did not increment at all during the report interval SHOULD NOT be included in dsmonPdistTopN reports."
  },
  "dsmonPdistTopNEntry": {
    "name": "dsmonPdistTopNEntry",
    "oid": "1.3.6.1.2.1.16.26.1.3.4.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistTopNCtlIndex",
        "implied": 0
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistTopNIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A conceptual row in the dsmonPdistTopNTable. The dsmonPdistTopNCtlIndex value in the index identifies the dsmonPdistTopNCtlEntry on whose behalf this entry was created. Entries in this table are ordered from 1 to 'N', where lower numbers represent higher values of the rate base object, over the report interval."
  },
  "dsmonPdistTopNIndex": {
    "name": "dsmonPdistTopNIndex",
    "oid": "1.3.6.1.2.1.16.26.1.3.4.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 2147483647
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "An index that uniquely identifies an entry in the dsmonPdistTopNTable among those in the same report. This index is between 1 and N, where N is the number of entries in this report. Note that 'N' may change over time, and may also be less than the dsmonPdistTopNCtlGrantedSize value associated with this entry."
  },
  "dsmonPdistTopNPDLocalIndex": {
    "name": "dsmonPdistTopNPDLocalIndex",
    "oid": "1.3.6.1.2.1.16.26.1.3.4.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 2147483647
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The protocolDirLocalIndex value which identifies the protocol associated with this entry. If the protocolDirEntry associated with the protocolDirLocalIndex with the same value as this object is de-activated or deleted, then the agent MUST delete this dsmonPdistTopN entry."
  },
  "dsmonPdistTopNAggGroup": {
    "name": "dsmonPdistTopNAggGroup",
    "oid": "1.3.6.1.2.1.16.26.1.3.4.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DsmonCounterAggGroupIndex",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The DSCP counter aggregation group index value associated with protocol identified in this entry. This object identifies the dsmonAggGroupEntry with the same dsmonAggControlIndex value as the associated dsmonPdistCtlAggProfile object and the same dsmonAggGroupIndex value as this object."
  },
  "dsmonPdistTopNRate": {
    "name": "dsmonPdistTopNRate",
    "oid": "1.3.6.1.2.1.16.26.1.3.4.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The amount of change in the selected variable during this sampling interval. The selected variable is this protocol's instance of the object selected by dsmonPdistTopNCtlRateBase. If the associated dsmonPdistTopNCtlRateBase is equal to 'dsmonPdistTopNHCPkts' or 'dsmonPdistTopNHCOctets', then this object will contain the the least significant 32 bits of the associated dsmonPdistTopNHCRate object."
  },
  "dsmonPdistTopNRateOvfl": {
    "name": "dsmonPdistTopNRateOvfl",
    "oid": "1.3.6.1.2.1.16.26.1.3.4.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The most significant 32 bits of the associated dsmonPdistTopNHCRate object. If the associated dsmonPdistTopNCtlRateBase is equal to 'dsmonPdistTopNHCPkts' or 'dsmonPdistTopNHCOctets', then this object will contain the upper 32 bits of the associated dsmonPdistTopNHCRate object. If the associated dsmonPdistTopNCtlRateBase is equal to 'dsmonPdistTopNPkts' or 'dsmonPdistTopNOctets', then this object will contain the value zero. The agent MAY choose not to instantiate this object if High Capacity monitoring is not supported."
  },
  "dsmonPdistTopNHCRate": {
    "name": "dsmonPdistTopNHCRate",
    "oid": "1.3.6.1.2.1.16.26.1.3.4.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CounterBasedGauge64",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The amount of change in the selected variable during this sampling interval. The selected variable is this protocol's instance of the object selected by dsmonPdistTopNCtlRateBase. If the associated dsmonPdistTopNCtlRateBase is equal to 'dsmonPdistTopNPkts' or 'dsmonPdistTopNOctets', then this object will contain the value zero, and the associated dsmonPdistTopNRate object will contain the change in the selected variable during the sampling interval. The agent MAY choose not to instantiate this object if High Capacity monitoring is not supported."
  },
  "dsmonHostCtlTable": {
    "name": "dsmonHostCtlTable",
    "oid": "1.3.6.1.2.1.16.26.1.4.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Controls setup of per counter aggregation group, per network layer host distribution statistics. Note that an agent MAY choose to limit the actual number of entries which may be created in this table. In this case, the agent SHOULD return an error-status of 'resourceUnavailable(13)', as per section 4.2.5 of the 'Protocol Operations for SNMPv2' specification [RFC1905]."
  },
  "dsmonHostCtlEntry": {
    "name": "dsmonHostCtlEntry",
    "oid": "1.3.6.1.2.1.16.26.1.4.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostCtlIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A conceptual row in the dsmonHostCtlTable. Entries are created and deleted from this table by management action only, using the dsmonHostCtlStatus RowStatus object. The agent SHOULD support non-volatile configuration of this table, and upon system initialization, the table SHOULD be initialized with the saved values. Activation of a control row in this table will cause an associated dsmonHostTable to be created and maintained by the agent."
  },
  "dsmonHostCtlIndex": {
    "name": "dsmonHostCtlIndex",
    "oid": "1.3.6.1.2.1.16.26.1.4.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "An arbitrary and unique index for this dsmonHostCtlEntry."
  },
  "dsmonHostCtlDataSource": {
    "name": "dsmonHostCtlDataSource",
    "oid": "1.3.6.1.2.1.16.26.1.4.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DataSource",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The source of data for the associated dsmonHostTable. Note that only packets that contain a network protocol encapsulation which contains a DS field [RFC2474] will be counted in this table. This object MUST NOT be modified if the associated dsmonHostCtlStatus object is equal to active(1)."
  },
  "dsmonHostCtlAggProfile": {
    "name": "dsmonHostCtlAggProfile",
    "oid": "1.3.6.1.2.1.16.26.1.4.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DsmonCounterAggProfileIndex",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The dsmonAggControlIndex value identifying the counter aggregation profile which should be used on behalf of this dsmonHostCtlEntry. The associated dsmonAggControlEntry and dsmonAggProfileEntries, identified by the same dsmonAggControlIndex index value, MUST be active in order for this entry to remain active. It is possible for the counter aggregation configuration to change from a valid to invalid state for this dsmonHost collection. In this case, the associated dsmonHostCtlStatus object will be changed to the 'notReady' state, and data collection will not occur on behalf of this control entry. Note that an agent MAY choose to limit the actual number of counter aggregation profiles which may be applied to a particular data source. This object MUST NOT be modified if the associated dsmonHostCtlStatus object is equal to active(1)."
  },
  "dsmonHostCtlMaxDesiredEntries": {
    "name": "dsmonHostCtlMaxDesiredEntries",
    "oid": "1.3.6.1.2.1.16.26.1.4.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": -1,
            "max": -1
          },
          {
            "min": 1,
            "max": 2147483647
          }
        ]
      }
    },
    "units": "table entries",
    "maxaccess": "read-create",
    "status": "current",
    "description": "The maximum number of entries that are desired in the dsmonHostTable on behalf of this control entry. The probe will not create more than this number of associated entries in the table, but MAY choose to create fewer entries in this table for any reason including the lack of resources. If this value is set to -1, the probe MAY create any number of entries in this table. This object MUST NOT be modified if the associated dsmonHostCtlStatus object is equal to active(1)."
  },
  "dsmonHostCtlIPv4PrefixLen": {
    "name": "dsmonHostCtlIPv4PrefixLen",
    "oid": "1.3.6.1.2.1.16.26.1.4.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 8,
            "max": 32
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 32,
        "format": "decimal"
      }
    },
    "units": "bits",
    "maxaccess": "read-create",
    "status": "current",
    "description": "The number of 'leftmost' contiguous bits in the host address field for encapsulations of IPv4, that should be maintained in this collection. This object controls how the dsmonHostAddress object is derived for packets which contain an encapsulation of IPv4. If this object has a value less than 32, then 'm' rightmost bits, where 'm' is equal to '32 - dsmonHostCtlIPv4PrefixLen', will be cleared to zero for counting purposes only. The 'leftmost' bit is the most significant bit of the first network-byte-order octet of the address. If this object is equal to 32, then no bits are cleared in each dsmonHostAddress field. This object MUST NOT be modified if the associated dsmonHostCtlStatus object is equal to active(1)."
  },
  "dsmonHostCtlIPv6PrefixLen": {
    "name": "dsmonHostCtlIPv6PrefixLen",
    "oid": "1.3.6.1.2.1.16.26.1.4.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 8,
            "max": 128
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 128,
        "format": "decimal"
      }
    },
    "units": "bits",
    "maxaccess": "read-create",
    "status": "current",
    "description": "The number of 'leftmost' contiguous bits in the host address field for encapsulations of IPv6, that should be maintained in this collection. This object controls how the dsmonHostAddress object is derived for packets which contain an encapsulation of IPv6. If this object has a value less than 128, then 'm' rightmost bits, where 'm' is equal to '128 - dsmonHostCtlIPv6PrefixLen', will be cleared to zero for counting purposes only. The 'leftmost' bit is the most significant bit of the first network-byte-order octet of the address. If this object is equal to 128, then no bits are cleared in each dsmonHostAddress field. This object MUST NOT be modified if the associated dsmonHostCtlStatus object is equal to active(1)."
  },
  "dsmonHostCtlDroppedFrames": {
    "name": "dsmonHostCtlDroppedFrames",
    "oid": "1.3.6.1.2.1.16.26.1.4.1.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "frames",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The total number of frames which were received by the probe and therefore not accounted for in the *StatsDropEvents, but for which the probe chose not to count for the associated dsmonHost entries for whatever reason. Most often, this event occurs when the probe is out of some resources and decides to shed load from this collection. This count does not include packets that were not counted because they had MAC-layer errors. Note that if the dsmonHostTable is inactive because no appropriate protocols are enabled in the protocol directory, this value SHOULD be 0. Note that, unlike the dropEvents counter, this number is the exact number of frames dropped."
  },
  "dsmonHostCtlInserts": {
    "name": "dsmonHostCtlInserts",
    "oid": "1.3.6.1.2.1.16.26.1.4.1.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "table entries",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of times a dsmonHost entry has been inserted into the dsmonHost table. If an entry is inserted, then deleted, and then inserted, this counter will be incremented by 2. To allow for efficient implementation strategies, agents MAY delay updating this object for short periods of time. For example, an implementation strategy may allow internal data structures to differ from those visible via SNMP for short periods of time. This counter may reflect the internal data structures for those short periods of time. Note that the table size can be determined by subtracting dsmonHostCtlDeletes from dsmonHostCtlInserts."
  },
  "dsmonHostCtlDeletes": {
    "name": "dsmonHostCtlDeletes",
    "oid": "1.3.6.1.2.1.16.26.1.4.1.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "table entries",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of times a dsmonHost entry has been deleted from the dsmonHost table (for any reason). If an entry is deleted, then inserted, and then deleted, this counter will be incremented by 2. To allow for efficient implementation strategies, agents MAY delay updating this object for short periods of time. For example, an implementation strategy may allow internal data structures to differ from those visible via SNMP for short periods of time. This counter may reflect the internal data structures for those short periods of time. Note that the table size can be determined by subtracting dsmonHostCtlDeletes from dsmonHostCtlInserts."
  },
  "dsmonHostCtlCreateTime": {
    "name": "dsmonHostCtlCreateTime",
    "oid": "1.3.6.1.2.1.16.26.1.4.1.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "LastCreateTime",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The value of sysUpTime when this control entry was last activated. This can be used by the management station to detect if the table has been deleted and recreated between polls."
  },
  "dsmonHostCtlOwner": {
    "name": "dsmonHostCtlOwner",
    "oid": "1.3.6.1.2.1.16.26.1.4.1.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OwnerString",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The entity that configured this entry and is therefore using the resources assigned to it."
  },
  "dsmonHostCtlStatus": {
    "name": "dsmonHostCtlStatus",
    "oid": "1.3.6.1.2.1.16.26.1.4.1.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status of this dsmonHostCtlEntry. An entry MUST NOT exist in the active state unless all objects in the entry have an appropriate value. If this object is not equal to active(1), all associated entries in the dsmonHostTable shall be deleted."
  },
  "dsmonHostTable": {
    "name": "dsmonHostTable",
    "oid": "1.3.6.1.2.1.16.26.1.4.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A collection of statistics for particular network protocols which contain a DS field, and that has been discovered on a particular dataSource. The probe will add to this table all appropriate network protocols, for each network address seen as the source or destination address in all packets with no MAC errors, and will increment octet and packet counts in the table for all packets with no MAC errors. If the dsmonAggControlLocked object is equal to 'false', then all entries in this table will be deleted, and the agent will not process packets on behalf of any dsmonHostCtlEntry."
  },
  "dsmonHostEntry": {
    "name": "dsmonHostEntry",
    "oid": "1.3.6.1.2.1.16.26.1.4.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostCtlIndex",
        "implied": 0
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostTimeMark",
        "implied": 0
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonAggGroupIndex",
        "implied": 0
      },
      {
        "module": "RMON2-MIB",
        "object": "protocolDirLocalIndex",
        "implied": 0
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostAddress",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A list of information on Differentiated Services DSCP usage, containing packet and octet counters for each counter aggregation group index configured for collection per host address, as identified in the dsmonAggProfileTable. The dsmonHostCtlIndex value in the index identifies the dsmonHostCtlEntry on whose behalf this entry was created. The protocolDirLocalIndex value in the index identifies the specific network layer protocol encapsulation associated with each entry, and the network protocol type of the dsmonHostAddress object. It MUST identify a protocolDirEntry which contains a DS field (e.g., IPv4 or IPv6). Note that if a protocol encapsulation with multiple network layers is specified, then associated entries in this table refer to the innermost network protocol layer host address. The dsmonAggGroupIndex value in the index is determined by examining the DSCP value in each monitored packet, and the dsmonAggProfileTable entry configured for that value. An example of the indexing of this entry is dsmonHostOutPkts.1.27273.3.200.4.171.69.120.0"
  },
  "dsmonHostTimeMark": {
    "name": "dsmonHostTimeMark",
    "oid": "1.3.6.1.2.1.16.26.1.4.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TimeFilter",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The Time Filter index for this table. This object may be used by a management station to retrieve only rows which have been created or modified since a particular time. Note that the current value for a row are always returned and the TimeFilter is not a historical data archiving mechanism. Refer to RFC 2021 [RFC2021] for a detailed description of TimeFilter operation."
  },
  "dsmonHostAddress": {
    "name": "dsmonHostAddress",
    "oid": "1.3.6.1.2.1.16.26.1.4.2.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 110
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The network address for this dsmonHostEntry. This object is encoded according to the protocol type indicated by the protocolDirLocalIndex value in the index. In addition, this object may have some 'rightmost' bits cleared to zero for counting purposes, as indicated by the associated dsmonHostCtlIPv4PrefixLen or dsmonHostCtlIPv6PrefixLen objects."
  },
  "dsmonHostInPkts": {
    "name": "dsmonHostInPkts",
    "oid": "1.3.6.1.2.1.16.26.1.4.2.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of packets without errors, using one of the DSCP values in the indicated counter aggregation group, and transmitted to this address, since this entry was added to the dsmonHostTable. Note that this is the number of link- layer packets, so if a single network-layer packet is fragmented into several link-layer frames, this counter is incremented several times."
  },
  "dsmonHostInOctets": {
    "name": "dsmonHostInOctets",
    "oid": "1.3.6.1.2.1.16.26.1.4.2.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter32",
      "class": "type"
    },
    "units": "octets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of octets in all packets, transmitted to this address and using one of the DSCP values in the indicated counter aggregation group, since this entry was added to the dsmonHostTable (excluding framing bits but including FCS octets), excluding those octets in packets that contained errors. Note this doesn't count just those octets in the particular protocol frames, but includes the entire packet that contained the protocol."
  },
  "dsmonHostInOvflPkts": {
    "name": "dsmonHostInOvflPkts",
    "oid": "1.3.6.1.2.1.16.26.1.4.2.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The number of times the associated dsmonHostInPkts counter has overflowed. Note that this object will only be instantiated if the associated dsmonHostInHCPkts object is also instantiated for a particular dataSource."
  },
  "dsmonHostInOvflOctets": {
    "name": "dsmonHostInOvflOctets",
    "oid": "1.3.6.1.2.1.16.26.1.4.2.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The number of times the associated dsmonHostInOctets counter has overflowed. Note that this object will only be instantiated if the associated dsmonHostInHCOctets object is also instantiated for a particular dataSource."
  },
  "dsmonHostInHCPkts": {
    "name": "dsmonHostInHCPkts",
    "oid": "1.3.6.1.2.1.16.26.1.4.2.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter64",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The 64-bit version of the dsmonHostInPkts object. Note that this object will only be instantiated if the RMON agent supports High Capacity monitoring for a particular dataSource."
  },
  "dsmonHostInHCOctets": {
    "name": "dsmonHostInHCOctets",
    "oid": "1.3.6.1.2.1.16.26.1.4.2.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter64",
      "class": "type"
    },
    "units": "octets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The 64-bit version of the dsmonHostInOctets object. Note that this object will only be instantiated if the RMON agent supports High Capacity monitoring for a particular dataSource."
  },
  "dsmonHostOutPkts": {
    "name": "dsmonHostOutPkts",
    "oid": "1.3.6.1.2.1.16.26.1.4.2.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of packets without errors, using one of the DSCP values in the indicated counter aggregation group, and transmitted by this address, since this entry was added to the dsmonHostTable. Note that this is the number of link- layer packets, so if a single network-layer packet is fragmented into several link-layer frames, this counter is incremented several times."
  },
  "dsmonHostOutOctets": {
    "name": "dsmonHostOutOctets",
    "oid": "1.3.6.1.2.1.16.26.1.4.2.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter32",
      "class": "type"
    },
    "units": "octets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of octets, transmitted by this address and using one of the DSCP values in the identified counter aggregation group, since this entry was added to the dsmonHostTable (excluding framing bits but including FCS octets), excluding those octets in packets that contained errors. Note this doesn't count just those octets in the particular protocol frames, but includes the entire packet that contained the protocol."
  },
  "dsmonHostOutOvflPkts": {
    "name": "dsmonHostOutOvflPkts",
    "oid": "1.3.6.1.2.1.16.26.1.4.2.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The number of times the associated dsmonHostOutPkts counter has overflowed. Note that this object will only be instantiated if the associated dsmonHostOutHCPkts object is also instantiated for a particular dataSource."
  },
  "dsmonHostOutOvflOctets": {
    "name": "dsmonHostOutOvflOctets",
    "oid": "1.3.6.1.2.1.16.26.1.4.2.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The number of times the associated dsmonHostOutOctets counter has overflowed. Note that this object will only be instantiated if the associated dsmonHostOutHCOctets object is also instantiated for a particular dataSource."
  },
  "dsmonHostOutHCPkts": {
    "name": "dsmonHostOutHCPkts",
    "oid": "1.3.6.1.2.1.16.26.1.4.2.1.13",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter64",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The 64-bit version of the dsmonHostOutPkts object. Note that this object will only be instantiated if the RMON agent supports High Capacity monitoring for a particular dataSource."
  },
  "dsmonHostOutHCOctets": {
    "name": "dsmonHostOutHCOctets",
    "oid": "1.3.6.1.2.1.16.26.1.4.2.1.14",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter64",
      "class": "type"
    },
    "units": "octets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The 64-bit version of the dsmonHostOutOctets object. Note that this object will only be instantiated if the RMON agent supports High Capacity monitoring for a particular dataSource."
  },
  "dsmonHostCreateTime": {
    "name": "dsmonHostCreateTime",
    "oid": "1.3.6.1.2.1.16.26.1.4.2.1.15",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "LastCreateTime",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The value of sysUpTime when this dsmonHost entry was last instantiated by the agent. This can be used by the management station to ensure that the entry has not been deleted and recreated between polls."
  },
  "dsmonHostTopNCtlTable": {
    "name": "dsmonHostTopNCtlTable",
    "oid": "1.3.6.1.2.1.16.26.1.4.3",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A set of parameters that control the creation of a report of the top N dsmonHost entries according to a selected metric. Note that an agent MAY choose to limit the actual number of entries which may be created in this table. In this case, the agent SHOULD return an error-status of 'resourceUnavailable(13)', as per section 4.2.5 of the 'Protocol Operations for SNMPv2' specification [RFC1905]."
  },
  "dsmonHostTopNCtlEntry": {
    "name": "dsmonHostTopNCtlEntry",
    "oid": "1.3.6.1.2.1.16.26.1.4.3.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostTopNCtlIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A conceptual row in the dsmonHostTopNCtlTable. Entries are created and deleted from this table by management action only, using the dsmonHostTopNCtlStatus RowStatus object. The agent SHOULD support non-volatile configuration of this table, and upon system initialization, the table SHOULD be initialized with the saved values. Activation of a control row in this table will cause an associated dsmonHostTopNTable to be created and maintained by the agent."
  },
  "dsmonHostTopNCtlIndex": {
    "name": "dsmonHostTopNCtlIndex",
    "oid": "1.3.6.1.2.1.16.26.1.4.3.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "An index that uniquely identifies an entry in the dsmonHostTopNCtlTable. Each such entry defines one Top N report prepared for one RMON dataSource."
  },
  "dsmonHostTopNCtlHostIndex": {
    "name": "dsmonHostTopNCtlHostIndex",
    "oid": "1.3.6.1.2.1.16.26.1.4.3.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The dsmonHostTable for which a top N report will be prepared on behalf of this entry. The dsmonHostTable is identified by the value of the dsmonHostCtlIndex for that table - that value is used here to identify the particular table. This object MUST NOT be modified if the associated dsmonHostTopNCtlStatus object is equal to active(1)."
  },
  "dsmonHostTopNCtlRateBase": {
    "name": "dsmonHostTopNCtlRateBase",
    "oid": "1.3.6.1.2.1.16.26.1.4.3.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "dsmonHostTopNInPkts": 1,
          "dsmonHostTopNInOctets": 2,
          "dsmonHostTopNOutPkts": 3,
          "dsmonHostTopNOutOctets": 4,
          "dsmonHostTopNTotalPkts": 5,
          "dsmonHostTopNTotalOctets": 6,
          "dsmonHostTopNInHCPkts": 7,
          "dsmonHostTopNInHCOctets": 8,
          "dsmonHostTopNOutHCPkts": 9,
          "dsmonHostTopNOutHCOctets": 10,
          "dsmonHostTopNTotalHCPkts": 11,
          "dsmonHostTopNTotalHCOctets": 12
        }
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The variable(s) for each dsmonHost that the dsmonHostTopNRate and dsmonHostTopNHCRate variables are based upon. Each dsmonHostTopN report generated on behalf of this control entry will be ranked in descending order, based on the associated dsmonHostTable counter(s), identified by this object. The following table identifies the dsmonHostTable counters associated with each enumeration: Enumeration RateBase MIB Objects ----------- -------------------- dsmonHostTopNInPkts dsmonHostInPkts dsmonHostTopNInOctets dsmonHostInOctets dsmonHostTopNOutPkts dsmonHostOutPkts dsmonHostTopNOutOctets dsmonHostOutOctets dsmonHostTopNTotalPkts dsmonHostInPkts + dsmonHostOutPkts dsmonHostTopNTotalOctets dsmonHostInOctets + dsmonHostOutOctets dsmonHostTopNInHCPkts dsmonHostInHCPkts dsmonHostTopNInHCOctets dsmonHostInHCOctets dsmonHostTopNOutHCPkts dsmonHostOutHCPkts dsmonHostTopNOutHCOctets dsmonHostOutHCPkts dsmonHostTopNTotalHCPkts dsmonHostInHCPkts + dsmonHostOutHCPkts dsmonHostTopNTotalHCOctets dsmonHostInHCOctets + dsmonHostOutHCOctets The following enumerations are only available if the agent supports High Capacity monitoring: dsmonHostTopNInHCPkts dsmonHostTopNInHCOctets dsmonHostTopNOutHCPkts dsmonHostTopNOutHCOctets dsmonHostTopNTotalHCPkts dsmonHostTopNTotalHCOctets It is an implementation-specific matter whether an agent can detect an overflow condition resulting from the addition of two counter delta values for the following enumerations: dsmonHostTopNTotalPkts dsmonHostTopNTotalOctets dsmonHostTopNTotalHCPkts dsmonHostTopNTotalHCOctets In the event such an overflow condition can be detected by the agent, the associated dsmonHostTopNRate, dsmonHostTopNRateOvfl, and/or dsmonHostTopNHCRate objects should be set to their maximum value. This object MUST NOT be modified if the associated dsmonHostTopNCtlStatus object is equal to active(1)."
  },
  "dsmonHostTopNCtlTimeRemaining": {
    "name": "dsmonHostTopNCtlTimeRemaining",
    "oid": "1.3.6.1.2.1.16.26.1.4.3.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 2147483647
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 1800,
        "format": "decimal"
      }
    },
    "units": "seconds",
    "maxaccess": "read-create",
    "status": "current",
    "description": "The number of seconds left in the report currently being collected. When this object is modified by the management station, a new collection is started, possibly aborting a currently running report. The new value is used as the requested duration of this report, and is immediately loaded into the associated dsmonHostTopNCtlDuration object. When the report finishes, the probe will automatically start another collection with the same initial value of dsmonHostTopNCtlTimeRemaining. Thus the management station may simply read the resulting reports repeatedly, checking the startTime and duration each time to ensure that a report was not missed or that the report parameters were not changed. While the value of this object is non-zero, it decrements by one per second until it reaches zero. At the time that this object decrements to zero, the report is made accessible in the dsmonHostTopNTable, overwriting any report that may be there. When this object is modified by the management station, any associated entries in the dsmonHostTopNTable shall be deleted."
  },
  "dsmonHostTopNCtlGeneratedReports": {
    "name": "dsmonHostTopNCtlGeneratedReports",
    "oid": "1.3.6.1.2.1.16.26.1.4.3.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "reports",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of reports that have been generated by this entry."
  },
  "dsmonHostTopNCtlDuration": {
    "name": "dsmonHostTopNCtlDuration",
    "oid": "1.3.6.1.2.1.16.26.1.4.3.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 2147483647
          }
        ]
      }
    },
    "units": "seconds",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of seconds that this report has collected during the last sampling interval. When the associated dsmonHostTopNCtlTimeRemaining object is set, this object shall be set by the probe to the same value and shall not be modified until the next time the dsmonHostTopNCtlTimeRemaining is set. This value shall be zero if no reports have been requested for this dsmonHostTopNCtlEntry."
  },
  "dsmonHostTopNCtlRequestedSize": {
    "name": "dsmonHostTopNCtlRequestedSize",
    "oid": "1.3.6.1.2.1.16.26.1.4.3.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 2147483647
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 150,
        "format": "decimal"
      }
    },
    "units": "table entries",
    "maxaccess": "read-create",
    "status": "current",
    "description": "The maximum number of dsmonHost entries requested for this report. When this object is created or modified, the probe SHOULD set dsmonHostTopNCtlGrantedSize as closely to this object as is possible for the particular probe implementation and available resources."
  },
  "dsmonHostTopNCtlGrantedSize": {
    "name": "dsmonHostTopNCtlGrantedSize",
    "oid": "1.3.6.1.2.1.16.26.1.4.3.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 2147483647
          }
        ]
      }
    },
    "units": "table entries",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The maximum number of dsmonHost entries in this report. When the associated dsmonHostTopNCtlRequestedSize object is created or modified, the probe SHOULD set this object as closely to the requested value as is possible for the particular implementation and available resources. The probe MUST NOT lower this value except as a result of a set to the associated dsmonHostTopNCtlRequestedSize object. Protocol entries with the highest value of dsmonHostTopNRate or dsmonHostTopNHCRate (depending on the value of the associated dsmonHostTopNCtlRateBase object) shall be placed in this table in decreasing order of this rate until there is no more room or until there are no more dsmonHost entries."
  },
  "dsmonHostTopNCtlStartTime": {
    "name": "dsmonHostTopNCtlStartTime",
    "oid": "1.3.6.1.2.1.16.26.1.4.3.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TimeStamp",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The value of sysUpTime when this top N report was last started. In other words, this is the time that the associated dsmonHostTopNCtlTimeRemaining object was modified to start the requested report or the time the report was last automatically (re)started. This object may be used by the management station to determine if a report was missed or not."
  },
  "dsmonHostTopNCtlOwner": {
    "name": "dsmonHostTopNCtlOwner",
    "oid": "1.3.6.1.2.1.16.26.1.4.3.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OwnerString",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The entity that configured this entry and is therefore using the resources assigned to it."
  },
  "dsmonHostTopNCtlStatus": {
    "name": "dsmonHostTopNCtlStatus",
    "oid": "1.3.6.1.2.1.16.26.1.4.3.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status of this dsmonHostTopNCtlEntry. An entry MUST NOT exist in the active state unless all objects in the entry have an appropriate value. If this object is not equal to active(1), all associated entries in the dsmonHostTopNTable shall be deleted by the agent."
  },
  "dsmonHostTopNTable": {
    "name": "dsmonHostTopNTable",
    "oid": "1.3.6.1.2.1.16.26.1.4.4",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A set of statistics for those dsmonHost entries that have counted the highest number of octets or packets. If the dsmonAggControlLocked object is equal to 'false', then all entries in this table SHALL be deleted, and the agent will not process TopN reports on behalf of any dsmonHostTopNCtlEntry. When the dsmonAggControlLocked object is set to 'true', then particular reports SHOULD be restarted from the beginning, on behalf of all active rows in the dsmonHostTopNCtlTable. Note that dsmonHost entries which did not increment at all during the report interval SHOULD NOT be included in dsmonHostTopN reports."
  },
  "dsmonHostTopNEntry": {
    "name": "dsmonHostTopNEntry",
    "oid": "1.3.6.1.2.1.16.26.1.4.4.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostTopNCtlIndex",
        "implied": 0
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostTopNIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A conceptual row in the dsmonHostTopNTable. The dsmonHostTopNCtlIndex value in the index identifies the dsmonHostTopNCtlEntry on whose behalf this entry was created. Entries in this table are ordered from 1 to 'N', where lower numbers represent higher values of the rate base object, over the report interval."
  },
  "dsmonHostTopNIndex": {
    "name": "dsmonHostTopNIndex",
    "oid": "1.3.6.1.2.1.16.26.1.4.4.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 2147483647
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "An index that uniquely identifies an entry in the dsmonHostTopNTable among those in the same report. This index is between 1 and N, where N is the number of entries in this report."
  },
  "dsmonHostTopNPDLocalIndex": {
    "name": "dsmonHostTopNPDLocalIndex",
    "oid": "1.3.6.1.2.1.16.26.1.4.4.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 2147483647
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The protocolDirLocalIndex value which identifies the protocol associated with the dsmonHostTopNAddress object in this entry. If the protocolDirEntry associated with the protocolDirLocalIndex with the same value as this object is de-activated or deleted, then the agent MUST delete this dsmonHostTopN entry."
  },
  "dsmonHostTopNAddress": {
    "name": "dsmonHostTopNAddress",
    "oid": "1.3.6.1.2.1.16.26.1.4.4.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The dsmonHostAddress value for the network host identified in this entry. The associated dsmonHostTopNPDLocalIndex object identifies the network protocol type and the encoding rules for this object."
  },
  "dsmonHostTopNAggGroup": {
    "name": "dsmonHostTopNAggGroup",
    "oid": "1.3.6.1.2.1.16.26.1.4.4.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DsmonCounterAggGroupIndex",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The counter aggregation group index value associated with host identified in this entry. This object identifies the dsmonAggGroupEntry with the same dsmonAggControlIndex value as the associated dsmonHostCtlAggProfile object and the same dsmonAggGroupIndex value as this object."
  },
  "dsmonHostTopNRate": {
    "name": "dsmonHostTopNRate",
    "oid": "1.3.6.1.2.1.16.26.1.4.4.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The amount of change in the selected variable during this sampling interval. The selected variable is this host's instance of the object selected by dsmonHostTopNCtlRateBase. If the associated dsmonHostTopNCtlRateBase indicates a High Capacity monitoring enumeration, (e.g. 'dsmonHostTopNInHCPkts'), then this object will contain the the least significant 32 bits of the associated dsmonHostTopNHCRate object."
  },
  "dsmonHostTopNRateOvfl": {
    "name": "dsmonHostTopNRateOvfl",
    "oid": "1.3.6.1.2.1.16.26.1.4.4.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The most significant 32 bits of the associated dsmonHostTopNHCRate object. If the associated dsmonHostTopNCtlRateBase is equal to any of the High Capacity monitoring enumerations (e.g. 'dsmonHostTopNInHCPkts'), then this object will contain the upper 32 bits of the associated dsmonHostTopNHCRate object. If the associated dsmonHostTopNCtlRateBase is not equal to any of High Capacity monitoring enumerations, then this object will contain the value zero. The agent MAY choose not to instantiate this object if High Capacity monitoring is not supported."
  },
  "dsmonHostTopNHCRate": {
    "name": "dsmonHostTopNHCRate",
    "oid": "1.3.6.1.2.1.16.26.1.4.4.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CounterBasedGauge64",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The amount of change in the selected variable during this sampling interval. The selected variable is this host's instance of the object selected by dsmonHostTopNCtlRateBase. If the associated dsmonHostTopNCtlRateBase is not equal to any of the High Capacity monitoring enumerations (e.g., 'dsmonHostTopNInPkts'), then this object will contain the value zero, and the associated dsmonHostTopNRate object will contain the change in the selected variable during the sampling interval. The agent MAY choose not to instantiate this object if High Capacity monitoring is not supported."
  },
  "dsmonMatrixCtlTable": {
    "name": "dsmonMatrixCtlTable",
    "oid": "1.3.6.1.2.1.16.26.1.6.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Controls setup of per counter aggregation group, per host- pair, application protocol distribution statistics. Note that an agent MAY choose to limit the actual number of entries which may be created in this table. In this case, the agent SHOULD return an error-status of 'resourceUnavailable(13)', as per section 4.2.5 of the 'Protocol Operations for SNMPv2' specification [RFC1905]."
  },
  "dsmonMatrixCtlEntry": {
    "name": "dsmonMatrixCtlEntry",
    "oid": "1.3.6.1.2.1.16.26.1.6.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixCtlIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A conceptual row in the dsmonMatrixCtlTable. Entries are created and deleted from this table by management action only, using the dsmonMatrixCtlStatus RowStatus object. The agent SHOULD support non-volatile configuration of this table, and upon system initialization, the table SHOULD be initialized with the saved values. Activation of a control row in this table will cause an associated dsmonMatrixSDTable and dsmonMatrixDSTable to be created and maintained by the agent."
  },
  "dsmonMatrixCtlIndex": {
    "name": "dsmonMatrixCtlIndex",
    "oid": "1.3.6.1.2.1.16.26.1.6.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "An arbitrary and unique index for this dsmonMatrixCtlEntry."
  },
  "dsmonMatrixCtlDataSource": {
    "name": "dsmonMatrixCtlDataSource",
    "oid": "1.3.6.1.2.1.16.26.1.6.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DataSource",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The source of data for the associated dsmonMatrixSDTable and dsmonMatrixDSTable. Note that only packets that contain a network protocol encapsulation which contains a DS field [RFC2474] will be counted in this table. This object MUST NOT be modified if the associated dsmonMatrixCtlStatus object is equal to active(1)."
  },
  "dsmonMatrixCtlAggProfile": {
    "name": "dsmonMatrixCtlAggProfile",
    "oid": "1.3.6.1.2.1.16.26.1.6.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DsmonCounterAggProfileIndex",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The dsmonAggControlIndex value identifying the counter aggregation profile which should be used on behalf of this dsmonMatrixCtlEntry. The associated dsmonAggControlEntry and dsmonAggProfileEntries, identified by the same dsmonAggControlIndex index value, MUST be active in order for this entry to remain active. It is possible for the counter aggregation configuration to change from a valid to invalid state for this dsmonMatrix collection. In this case, the associated dsmonMatrixCtlStatus object will be changed to the 'notReady' state, and data collection will not occur on behalf of this control entry. Note that an agent MAY choose to limit the actual number of counter aggregation profiles which may be applied to a particular data source. This object MUST NOT be modified if the associated dsmonMatrixCtlStatus object is equal to active(1)."
  },
  "dsmonMatrixCtlMaxDesiredEntries": {
    "name": "dsmonMatrixCtlMaxDesiredEntries",
    "oid": "1.3.6.1.2.1.16.26.1.6.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": -1,
            "max": -1
          },
          {
            "min": 1,
            "max": 2147483647
          }
        ]
      }
    },
    "units": "table entries",
    "maxaccess": "read-create",
    "status": "current",
    "description": "The maximum number of entries that are desired in the dsmonMatrix tables on behalf of this control entry. The probe will not create more than this number of associated entries in these tables, but may choose to create fewer entries in this table for any reason including the lack of resources. If this value is set to -1, the probe may create any number of entries in this table. This object MUST NOT be modified if the associated dsmonMatrixCtlStatus object is equal to active(1)."
  },
  "dsmonMatrixCtlDroppedFrames": {
    "name": "dsmonMatrixCtlDroppedFrames",
    "oid": "1.3.6.1.2.1.16.26.1.6.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "frames",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The total number of frames which were received by the probe and therefore not accounted for in the *StatsDropEvents, but for which the probe chose not to count for the associated dsmonMatrixSD and dsmonMatrixDS entries for whatever reason. Most often, this event occurs when the probe is out of some resources and decides to shed load from this collection. This count does not include packets that were not counted because they had MAC-layer errors. Note that if the dsmonMatrix tables are inactive because no appropriate protocols are enabled in the protocol directory, this value SHOULD be 0. Note that, unlike the dropEvents counter, this number is the exact number of frames dropped."
  },
  "dsmonMatrixCtlInserts": {
    "name": "dsmonMatrixCtlInserts",
    "oid": "1.3.6.1.2.1.16.26.1.6.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "table entries",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of times a dsmonMatrix entry has been inserted into the dsmonMatrix tables. If an entry is inserted, then deleted, and then inserted, this counter will be incremented by 2. The addition of a conversation into both the dsmonMatrixSDTable and dsmonMatrixDSTable shall be counted as two insertions (even though every addition into one table must be accompanied by an insertion into the other). To allow for efficient implementation strategies, agents may delay updating this object for short periods of time. For example, an implementation strategy may allow internal data structures to differ from those visible via SNMP for short periods of time. This counter may reflect the internal data structures for those short periods of time. Note that the sum of the dsmonMatrixSDTable and dsmonMatrixDSTable sizes can be determined by subtracting dsmonMatrixCtlDeletes from dsmonMatrixCtlInserts."
  },
  "dsmonMatrixCtlDeletes": {
    "name": "dsmonMatrixCtlDeletes",
    "oid": "1.3.6.1.2.1.16.26.1.6.1.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "table entries",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of times a dsmonMatrix entry has been deleted from the dsmonMatrix tables (for any reason). If an entry is deleted, then inserted, and then deleted, this counter will be incremented by 2. The deletion of a conversation from both the dsmonMatrixSDTable and dsmonMatrixDSTable shall be counted as two deletions (even though every deletion from one table must be accompanied by a deletion from the other). To allow for efficient implementation strategies, agents MAY delay updating this object for short periods of time. For example, an implementation strategy may allow internal data structures to differ from those visible via SNMP for short periods of time. This counter may reflect the internal data structures for those short periods of time. Note that the sum of the dsmonMatrixSDTable and dsmonMatrixDSTable sizes can be determined by subtracting dsmonMatrixCtlDeletes from dsmonMatrixCtlInserts."
  },
  "dsmonMatrixCtlCreateTime": {
    "name": "dsmonMatrixCtlCreateTime",
    "oid": "1.3.6.1.2.1.16.26.1.6.1.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "LastCreateTime",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The value of sysUpTime when this control entry was last activated. This can be used by the management station to detect if the table has been deleted and recreated between polls."
  },
  "dsmonMatrixCtlOwner": {
    "name": "dsmonMatrixCtlOwner",
    "oid": "1.3.6.1.2.1.16.26.1.6.1.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OwnerString",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The entity that configured this entry and is therefore using the resources assigned to it."
  },
  "dsmonMatrixCtlStatus": {
    "name": "dsmonMatrixCtlStatus",
    "oid": "1.3.6.1.2.1.16.26.1.6.1.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status of this dsmonMatrixCtlEntry. An entry MUST NOT exist in the active state unless all objects in the entry have an appropriate value. If this object is not equal to active(1), all associated entries in the dsmonMatrixSDTable and dsmonMatrixDSTable shall be deleted."
  },
  "dsmonMatrixSDTable": {
    "name": "dsmonMatrixSDTable",
    "oid": "1.3.6.1.2.1.16.26.1.6.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A list of application traffic matrix entries which collect statistics for conversations of a particular application protocol between two network-level addresses. This table is indexed first by the source address and then by the destination address to make it convenient to collect all statistics from a particular address. The probe will add to this table all pairs of addresses for all protocols seen in all packets with no MAC errors, and will increment octet and packet counts in the table for all packets with no MAC errors."
  },
  "dsmonMatrixSDEntry": {
    "name": "dsmonMatrixSDEntry",
    "oid": "1.3.6.1.2.1.16.26.1.6.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixCtlIndex",
        "implied": 0
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixTimeMark",
        "implied": 0
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonAggGroupIndex",
        "implied": 0
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixNLIndex",
        "implied": 0
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixSourceAddress",
        "implied": 0
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixDestAddress",
        "implied": 0
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixALIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A conceptual row in the dsmonMatrixSDTable. The dsmonMatrixCtlIndex value in the index identifies the dsmonMatrixCtlEntry on whose behalf this entry was created. The dsmonAggGroupIndex value in the index is determined by examining the DSCP value in each monitored packet, and the dsmonAggProfileTable entry configured for that value."
  },
  "dsmonMatrixTimeMark": {
    "name": "dsmonMatrixTimeMark",
    "oid": "1.3.6.1.2.1.16.26.1.6.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TimeFilter",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The Time Filter index for this table. This object may be used by a management station to retrieve only rows which have been created or modified since a particular time. Note that the current value for a row are always returned and the TimeFilter is not a historical data archiving mechanism. Refer to RFC 2021 [RFC2021] for a detailed description of TimeFilter operation."
  },
  "dsmonMatrixNLIndex": {
    "name": "dsmonMatrixNLIndex",
    "oid": "1.3.6.1.2.1.16.26.1.6.2.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 2147483647
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The protocolDirLocalIndex value of a protocolDirEntry representing the specific network layer protocol encapsulation associated with each entry, and the network protocol type of the dsmonMatrixSourceAddress and dsmonMatrixDestAddress objects."
  },
  "dsmonMatrixSourceAddress": {
    "name": "dsmonMatrixSourceAddress",
    "oid": "1.3.6.1.2.1.16.26.1.6.2.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 54
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The network source address for this dsmonMatrix entry. This is represented as an octet string with specific semantics and length as identified by the dsmonMatrixNLIndex component of the index. For example, if the dsmonMatrixNLIndex indicates an encapsulation of IPv4, this object is encoded as a length octet of 4, followed by the 4 octets of the IPv4 address, in network byte order."
  },
  "dsmonMatrixDestAddress": {
    "name": "dsmonMatrixDestAddress",
    "oid": "1.3.6.1.2.1.16.26.1.6.2.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 54
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The network destination address for this dsmonMatrix entry. This is represented as an octet string with specific semantics and length as identified by the dsmonMatrixNLIndex component of the index. For example, if the dsmonMatrixNLIndex indicates an encapsulation of IPv4, this object is encoded as a length octet of 4, followed by the 4 octets of the IPv4 address, in network byte order."
  },
  "dsmonMatrixALIndex": {
    "name": "dsmonMatrixALIndex",
    "oid": "1.3.6.1.2.1.16.26.1.6.2.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 2147483647
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The protocolDirLocalIndex value of the protocolDirEntry representing the specific application layer protocol associated with each entry. It MUST identify an protocolDirEntry which is a direct or indirect descendant of the protocolDirEntry identified by the associated dsmonMatrixNLIndex object."
  },
  "dsmonMatrixSDPkts": {
    "name": "dsmonMatrixSDPkts",
    "oid": "1.3.6.1.2.1.16.26.1.6.2.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of packets of this protocol type (indicated by the associated dsmonMatrixALIndex object) without errors transmitted from the source address to the destination address since this entry was added to the dsmonMatrixSDTable. Note that this is the number of link- layer packets, so if a single network-layer packet is fragmented into several link-layer frames, this counter is incremented several times."
  },
  "dsmonMatrixSDOvflPkts": {
    "name": "dsmonMatrixSDOvflPkts",
    "oid": "1.3.6.1.2.1.16.26.1.6.2.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The number of times the associated dsmonMatrixSDPkts counter has overflowed, since this entry was added to the dsmonMatrixSDTable."
  },
  "dsmonMatrixSDHCPkts": {
    "name": "dsmonMatrixSDHCPkts",
    "oid": "1.3.6.1.2.1.16.26.1.6.2.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter64",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The 64-bit version of the dsmonMatrixSDPkts object. Note that this object will only be instantiated if the RMON agent supports High Capacity monitoring for a particular dataSource."
  },
  "dsmonMatrixSDOctets": {
    "name": "dsmonMatrixSDOctets",
    "oid": "1.3.6.1.2.1.16.26.1.6.2.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter32",
      "class": "type"
    },
    "units": "octets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of octets in packets of this protocol type transmitted from the source address to the destination address since this entry was added to the dsmonMatrixSDTable (excluding framing bits but including FCS octets), excluding those octets in packets that contained errors. Note this doesn't count just those octets in the particular protocol frames, but includes the entire packet that contained the protocol."
  },
  "dsmonMatrixSDOvflOctets": {
    "name": "dsmonMatrixSDOvflOctets",
    "oid": "1.3.6.1.2.1.16.26.1.6.2.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The number of times the associated dsmonMatrixSDOctets counter has overflowed, since this entry was added to the dsmonMatrixSDTable."
  },
  "dsmonMatrixSDHCOctets": {
    "name": "dsmonMatrixSDHCOctets",
    "oid": "1.3.6.1.2.1.16.26.1.6.2.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter64",
      "class": "type"
    },
    "units": "octets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The 64-bit version of the dsmonMatrixSDPkts object. Note that this object will only be instantiated if the RMON agent supports High Capacity monitoring for a particular dataSource."
  },
  "dsmonMatrixSDCreateTime": {
    "name": "dsmonMatrixSDCreateTime",
    "oid": "1.3.6.1.2.1.16.26.1.6.2.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "LastCreateTime",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The value of sysUpTime when this entry was last activated. This can be used by the management station to ensure that the entry has not been deleted and recreated between polls."
  },
  "dsmonMatrixDSTable": {
    "name": "dsmonMatrixDSTable",
    "oid": "1.3.6.1.2.1.16.26.1.6.3",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A list of application traffic matrix entries which collect statistics for conversations of a particular application protocol between two network-level addresses. This table is indexed first by the destination address and then by the source address to make it convenient to collect all statistics from a particular address. The probe will add to this table all pairs of addresses for all protocols seen in all packets with no MAC errors, and will increment octet and packet counts in the table for all packets with no MAC errors."
  },
  "dsmonMatrixDSEntry": {
    "name": "dsmonMatrixDSEntry",
    "oid": "1.3.6.1.2.1.16.26.1.6.3.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixCtlIndex",
        "implied": 0
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixTimeMark",
        "implied": 0
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonAggGroupIndex",
        "implied": 0
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixNLIndex",
        "implied": 0
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixDestAddress",
        "implied": 0
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixSourceAddress",
        "implied": 0
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixALIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A conceptual row in the dsmonMatrixDSTable. Note that this table is conceptually a re-ordered version of the dsmonMatrixSDTable. Therefore, all of the index values from that table are used by reference, and their semantics are exactly as described in the dsmonMatrixSDTable. The dsmonMatrixCtlIndex value in the index identifies the dsmonMatrixCtlEntry on whose behalf this entry was created. The dsmonMatrixTimeMark value in the index identifies the Time Filter index for this table. The dsmonAggGroupIndex value in the index is determined by examining the DSCP value in each monitored packet, and the dsmonAggProfileTable entry configured for that value. The dsmonMatrixNLIndex value in the index identifies the protocolDirLocalIndex value of a protocolDirEntry representing the specific network layer protocol encapsulation associated with each entry, and the network protocol type of the dsmonMatrixSourceAddress and dsmonMatrixDestAddress objects. The dsmonMatrixDestAddress value in the index identifies the network destination address for this dsmonMatrix entry. The dsmonMatrixSourceAddress value in the index identifies the network source address for this dsmonMatrix entry. The dsmonMatrixALIndex value in the index identifies the protocolDirLocalIndex value of the protocolDirEntry representing the specific application layer protocol associated with each entry."
  },
  "dsmonMatrixDSPkts": {
    "name": "dsmonMatrixDSPkts",
    "oid": "1.3.6.1.2.1.16.26.1.6.3.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter32",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of packets of this protocol type (indicated by the associated dsmonMatrixALIndex object) without errors transmitted from the source address to the destination address since this entry was added to the dsmonMatrixDSTable. Note that this is the number of link- layer packets, so if a single network-layer packet is fragmented into several link-layer frames, this counter is incremented several times."
  },
  "dsmonMatrixDSOvflPkts": {
    "name": "dsmonMatrixDSOvflPkts",
    "oid": "1.3.6.1.2.1.16.26.1.6.3.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The number of times the associated dsmonMatrixDSPkts counter has overflowed, since this entry was added to the dsmonMatrixDSTable."
  },
  "dsmonMatrixDSHCPkts": {
    "name": "dsmonMatrixDSHCPkts",
    "oid": "1.3.6.1.2.1.16.26.1.6.3.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter64",
      "class": "type"
    },
    "units": "packets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The 64-bit version of the dsmonMatrixDSPkts object. Note that this object will only be instantiated if the RMON agent supports High Capacity monitoring for a particular dataSource."
  },
  "dsmonMatrixDSOctets": {
    "name": "dsmonMatrixDSOctets",
    "oid": "1.3.6.1.2.1.16.26.1.6.3.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter32",
      "class": "type"
    },
    "units": "octets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of octets in packets of this protocol type transmitted from the source address to the destination address since this entry was added to the dsmonMatrixDSTable (excluding framing bits but including FCS octets), excluding those octets in packets that contained errors. Note this doesn't count just those octets in the particular protocol frames, but includes the entire packet that contained the protocol."
  },
  "dsmonMatrixDSOvflOctets": {
    "name": "dsmonMatrixDSOvflOctets",
    "oid": "1.3.6.1.2.1.16.26.1.6.3.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The number of times the associated dsmonMatrixDSOctets counter has overflowed, since this entry was added to the dsmonMatrixDSTable."
  },
  "dsmonMatrixDSHCOctets": {
    "name": "dsmonMatrixDSHCOctets",
    "oid": "1.3.6.1.2.1.16.26.1.6.3.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter64",
      "class": "type"
    },
    "units": "octets",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The 64-bit version of the dsmonMatrixDSPkts object. Note that this object will only be instantiated if the RMON agent supports High Capacity monitoring for a particular dataSource."
  },
  "dsmonMatrixDSCreateTime": {
    "name": "dsmonMatrixDSCreateTime",
    "oid": "1.3.6.1.2.1.16.26.1.6.3.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "LastCreateTime",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The value of sysUpTime when this entry was last activated. This can be used by the management station to ensure that the entry has not been deleted and recreated between polls."
  },
  "dsmonMatrixTopNCtlTable": {
    "name": "dsmonMatrixTopNCtlTable",
    "oid": "1.3.6.1.2.1.16.26.1.6.4",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A set of parameters that control the creation of a report of the top N dsmonMatrix entries according to a selected metric. Note that an agent MAY choose to limit the actual number of entries which may be created in this table. In this case, the agent SHOULD return an error-status of 'resourceUnavailable(13)', as per section 4.2.5 of the 'Protocol Operations for SNMPv2' specification [RFC1905]."
  },
  "dsmonMatrixTopNCtlEntry": {
    "name": "dsmonMatrixTopNCtlEntry",
    "oid": "1.3.6.1.2.1.16.26.1.6.4.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixTopNCtlIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A conceptual row in the dsmonMatrixTopNCtlTable. Entries are created and deleted from this table by management action only, using the dsmonMatrixTopNCtlStatus RowStatus object. The agent SHOULD support non-volatile configuration of this table, and upon system initialization, the table SHOULD be initialized with the saved values. Activation of a control row in this table will cause an associated dsmonMatrixTopNTable to be created and maintained by the agent."
  },
  "dsmonMatrixTopNCtlIndex": {
    "name": "dsmonMatrixTopNCtlIndex",
    "oid": "1.3.6.1.2.1.16.26.1.6.4.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "An index that uniquely identifies an entry in the dsmonMatrixTopNCtlTable. Each such entry defines one Top N report prepared for one RMON dataSource."
  },
  "dsmonMatrixTopNCtlMatrixIndex": {
    "name": "dsmonMatrixTopNCtlMatrixIndex",
    "oid": "1.3.6.1.2.1.16.26.1.6.4.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The dsmonMatrixSDTable for which a top N report will be prepared on behalf of this entry. The dsmonMatrixSDTable is identified by the same value of the dsmonMatrixCtlIndex object. This object MUST NOT be modified if the associated dsmonMatrixTopNCtlStatus object is equal to active(1)."
  },
  "dsmonMatrixTopNCtlRateBase": {
    "name": "dsmonMatrixTopNCtlRateBase",
    "oid": "1.3.6.1.2.1.16.26.1.6.4.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "dsmonMatrixTopNPkts": 1,
          "dsmonMatrixTopNOctets": 2,
          "dsmonMatrixTopNHCPkts": 3,
          "dsmonMatrixTopNHCOctets": 4
        }
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The variable for each dsmonMatrixSD entry that the dsmonMatrixTopNRate and dsmonMatrixTopNHCRate variables are based upon. Each dsmonMatrixTopN report generated on behalf of this control entry will be ranked in descending order, based on the associated dsmonMatrixSDTable counter, identified by this object. The following table identifies the dsmonMatrixSDTable counters associated with each enumeration: Enumeration RateBase MIB Objects ----------- -------------------- dsmonMatrixTopNPkts dsmonMatrixSDPkts dsmonMatrixTopNOctets dsmonMatrixSDOctets dsmonMatrixTopNHCPkts dsmonMatrixSDHCPkts dsmonMatrixTopNHCOctets dsmonMatrixSDHCOctets The following enumerations are only available if the agent supports High Capacity monitoring: dsmonMatrixTopNHCPkts dsmonMatrixTopNHCOctets This object MUST NOT be modified if the associated dsmonMatrixTopNCtlStatus object is equal to active(1)."
  },
  "dsmonMatrixTopNCtlTimeRemaining": {
    "name": "dsmonMatrixTopNCtlTimeRemaining",
    "oid": "1.3.6.1.2.1.16.26.1.6.4.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 2147483647
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 1800,
        "format": "decimal"
      }
    },
    "units": "seconds",
    "maxaccess": "read-create",
    "status": "current",
    "description": "The number of seconds left in the report currently being collected. When this object is modified by the management station, a new collection is started, possibly aborting a currently running report. The new value is used as the requested duration of this report, and is immediately loaded into the associated dsmonMatrixTopNCtlDuration object. When the report finishes, the probe will automatically start another collection with the same initial value of dsmonMatrixTopNCtlTimeRemaining. Thus the management station may simply read the resulting reports repeatedly, checking the startTime and duration each time to ensure that a report was not missed or that the report parameters were not changed. While the value of this object is non-zero, it decrements by one per second until it reaches zero. At the time that this object decrements to zero, the report is made accessible in the dsmonMatrixTopNTable, overwriting any report that may be there. When this object is modified by the management station, any associated entries in the dsmonMatrixTopNTable shall be deleted."
  },
  "dsmonMatrixTopNCtlGeneratedRpts": {
    "name": "dsmonMatrixTopNCtlGeneratedRpts",
    "oid": "1.3.6.1.2.1.16.26.1.6.4.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "reports",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of reports that have been generated by this entry."
  },
  "dsmonMatrixTopNCtlDuration": {
    "name": "dsmonMatrixTopNCtlDuration",
    "oid": "1.3.6.1.2.1.16.26.1.6.4.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 2147483647
          }
        ]
      }
    },
    "units": "seconds",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of seconds that this report has collected during the last sampling interval. When the associated dsmonMatrixTopNCtlTimeRemaining object is set, this object shall be set by the probe to the same value and shall not be modified until the next time the dsmonMatrixTopNCtlTimeRemaining is set. This value shall be zero if no reports have been requested for this dsmonMatrixTopNCtlEntry."
  },
  "dsmonMatrixTopNCtlRequestedSize": {
    "name": "dsmonMatrixTopNCtlRequestedSize",
    "oid": "1.3.6.1.2.1.16.26.1.6.4.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 2147483647
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 150,
        "format": "decimal"
      }
    },
    "units": "table entries",
    "maxaccess": "read-create",
    "status": "current",
    "description": "The maximum number of dsmonMatrix entries requested for this report. When this object is created or modified, the probe SHOULD set dsmonMatrixTopNCtlGrantedSize as closely to this object as is possible for the particular probe implementation and available resources."
  },
  "dsmonMatrixTopNCtlGrantedSize": {
    "name": "dsmonMatrixTopNCtlGrantedSize",
    "oid": "1.3.6.1.2.1.16.26.1.6.4.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 2147483647
          }
        ]
      }
    },
    "units": "table entries",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The maximum number of dsmonMatrix entries in this report. When the associated dsmonMatrixTopNCtlRequestedSize object is created or modified, the probe SHOULD set this object as closely to the requested value as is possible for the particular implementation and available resources. The probe MUST NOT lower this value except as a result of a set to the associated dsmonMatrixTopNCtlRequestedSize object. Protocol entries with the highest value of dsmonMatrixTopNRate or dsmonMatrixTopNHCRate (depending on the value of the associated dsmonMatrixTopNCtlRateBase object) shall be placed in this table in decreasing order of this rate until there is no more room or until there are no more dsmonMatrix entries."
  },
  "dsmonMatrixTopNCtlStartTime": {
    "name": "dsmonMatrixTopNCtlStartTime",
    "oid": "1.3.6.1.2.1.16.26.1.6.4.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TimeStamp",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The value of sysUpTime when this top N report was last started. In other words, this is the time that the associated dsmonMatrixTopNCtlTimeRemaining object was modified to start the requested report or the time the report was last automatically (re)started. This object may be used by the management station to determine if a report was missed or not."
  },
  "dsmonMatrixTopNCtlOwner": {
    "name": "dsmonMatrixTopNCtlOwner",
    "oid": "1.3.6.1.2.1.16.26.1.6.4.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OwnerString",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The entity that configured this entry and is therefore using the resources assigned to it."
  },
  "dsmonMatrixTopNCtlStatus": {
    "name": "dsmonMatrixTopNCtlStatus",
    "oid": "1.3.6.1.2.1.16.26.1.6.4.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status of this dsmonMatrixTopNCtlEntry. An entry MUST NOT exist in the active state unless all objects in the entry have an appropriate value. If this object is not equal to active(1), all associated entries in the dsmonMatrixTopNTable shall be deleted by the agent."
  },
  "dsmonMatrixTopNTable": {
    "name": "dsmonMatrixTopNTable",
    "oid": "1.3.6.1.2.1.16.26.1.6.5",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A set of statistics for those dsmonMatrix entries that have counted the highest number of octets or packets. If the dsmonAggControlLocked object is equal to 'false', then all entries in this table SHALL be deleted, and the agent will not process TopN reports on behalf of any dsmonMatrixTopNCtlEntry. When the dsmonAggControlLocked object is set to 'true', then particular reports SHOULD be restarted from the beginning, on behalf of all active rows in the dsmonMatrixTopNCtlTable. Note that dsmonMatrix entries which did not increment at all during the report interval SHOULD NOT be included in dsmonMatrixTopN reports."
  },
  "dsmonMatrixTopNEntry": {
    "name": "dsmonMatrixTopNEntry",
    "oid": "1.3.6.1.2.1.16.26.1.6.5.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixTopNCtlIndex",
        "implied": 0
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixTopNIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A conceptual row in the dsmonMatrixTopNTable. The dsmonMatrixTopNCtlIndex value in the index identifies the dsmonMatrixTopNCtlEntry on whose behalf this entry was created. Entries in this table are ordered from 1 to 'N', where lower numbers represent higher values of the rate base object, over the report interval."
  },
  "dsmonMatrixTopNIndex": {
    "name": "dsmonMatrixTopNIndex",
    "oid": "1.3.6.1.2.1.16.26.1.6.5.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 2147483647
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "An index that uniquely identifies an entry in the dsmonMatrixTopNTable among those in the same report. This index is between 1 and N, where N is the number of entries in this report."
  },
  "dsmonMatrixTopNAggGroup": {
    "name": "dsmonMatrixTopNAggGroup",
    "oid": "1.3.6.1.2.1.16.26.1.6.5.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DsmonCounterAggGroupIndex",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The counter aggregation group index value associated with host identified in this entry. This object identifies the dsmonAggGroupEntry with the same dsmonAggControlIndex value as the associated dsmonMatrixCtlAggProfile object and the same dsmonAggGroupIndex value as this object."
  },
  "dsmonMatrixTopNNLIndex": {
    "name": "dsmonMatrixTopNNLIndex",
    "oid": "1.3.6.1.2.1.16.26.1.6.5.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 2147483647
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The protocolDirLocalIndex value which identifies the protocol associated with the dsmonMatrixTopNSourceAddress and dsmonMatrixTopNDestAddress objects in this entry. If the protocolDirEntry associated with the protocolDirLocalIndex with the same value as this object is de-activated or deleted, then the agent MUST delete this dsmonMatrixTopN entry."
  },
  "dsmonMatrixTopNSourceAddress": {
    "name": "dsmonMatrixTopNSourceAddress",
    "oid": "1.3.6.1.2.1.16.26.1.6.5.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The dsmonMatrixSDSourceAddress value for the source network host identified in this entry. The associated dsmonMatrixTopNNLIndex object identifies the network protocol type and the encoding rules for this object."
  },
  "dsmonMatrixTopNDestAddress": {
    "name": "dsmonMatrixTopNDestAddress",
    "oid": "1.3.6.1.2.1.16.26.1.6.5.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The dsmonMatrixSDDestAddress value for the destination network host identified in this entry. The associated dsmonMatrixTopNNLIndex object identifies the network protocol type and the encoding rules for this object."
  },
  "dsmonMatrixTopNALIndex": {
    "name": "dsmonMatrixTopNALIndex",
    "oid": "1.3.6.1.2.1.16.26.1.6.5.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 2147483647
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The protocolDirLocalIndex value which identifies the application protocol associated with this entry. If the protocolDirEntry associated with the protocolDirLocalIndex with the same value as this object is de-activated or deleted, then the agent MUST delete this dsmonMatrixTopN entry."
  },
  "dsmonMatrixTopNPktRate": {
    "name": "dsmonMatrixTopNPktRate",
    "oid": "1.3.6.1.2.1.16.26.1.6.5.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of packets seen of this protocol from the source host to the destination host during this sampling interval, counted using the rules for counting the dsmonMatrixSDPkts object. If the value of dsmonMatrixTopNCtlRateBase is dsmonMatrixTopNPkts, this variable will be used to sort this report. If the value of the dsmonMatrixTopNCtlRateBase is dsmonMatrixTopNHCPkts or dsmonMatrixTopNHCOctets, then this object will contain the the least significant 32 bits of the associated dsmonMatrixTopNHCPktRate object."
  },
  "dsmonMatrixTopNPktRateOvfl": {
    "name": "dsmonMatrixTopNPktRateOvfl",
    "oid": "1.3.6.1.2.1.16.26.1.6.5.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The most significant 32 bits of the associated dsmonMatrixTopNHCPktRate object. If the associated dsmonMatrixTopNCtlRateBase is equal to dsmonMatrixTopNHCPkts or dsmonMatrixTopNHCOctets, then this object will contain the most significant 32 bits of the associated dsmonMatrixTopNHCPktRate object, otherwise this object will contain the value zero. The agent MAY choose not to instantiate this object if High Capacity monitoring is not supported."
  },
  "dsmonMatrixTopNHCPktRate": {
    "name": "dsmonMatrixTopNHCPktRate",
    "oid": "1.3.6.1.2.1.16.26.1.6.5.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CounterBasedGauge64",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of packets seen of this protocol from the source host to the destination host during this sampling interval, counted using the rules for counting the dsmonMatrixSDHCPkts object. If the value of dsmonMatrixTopNCtlRateBase is dsmonMatrixTopNHCPkts, this variable will be used to sort this report. The agent MAY choose not to instantiate this object if High Capacity monitoring is not supported."
  },
  "dsmonMatrixTopNRevPktRate": {
    "name": "dsmonMatrixTopNRevPktRate",
    "oid": "1.3.6.1.2.1.16.26.1.6.5.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of packets seen of this protocol from the destination host to the source host during this sampling interval, counted using the rules for counting the dsmonMatrixDSPkts object (note that the corresponding dsmonMatrixSDPkts object selected is the one whose source address is equal to dsmonMatrixTopNDestAddress and whose destination address is equal to dsmonMatrixTopNSourceAddress.)"
  },
  "dsmonMatrixTopNRevPktRateOvfl": {
    "name": "dsmonMatrixTopNRevPktRateOvfl",
    "oid": "1.3.6.1.2.1.16.26.1.6.5.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The most significant 32 bits of the associated dsmonMatrixTopNHCRevPktRate object. If the associated dsmonMatrixTopNCtlRateBase is equal to dsmonMatrixTopNHCPkts or dsmonMatrixTopNHCOCtets, then this object will contain the most significant 32 bits of the associated dsmonMatrixTopNHCRevPktRate object, otherwise this object will contain the value zero. The agent MAY choose not to instantiate this object if High Capacity monitoring is not supported."
  },
  "dsmonMatrixTopNHCRevPktRate": {
    "name": "dsmonMatrixTopNHCRevPktRate",
    "oid": "1.3.6.1.2.1.16.26.1.6.5.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CounterBasedGauge64",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of packets seen of this protocol from the destination host to the source host during this sampling interval, counted using the rules for counting the dsmonMatrixDSHCPkts object (note that the corresponding dsmonMatrixSDHCPkts object selected is the one whose source address is equal to dsmonMatrixTopNDestAddress and whose destination address is equal to dsmonMatrixTopNSourceAddress.) The agent MAY choose not to instantiate this object if High Capacity monitoring is not supported."
  },
  "dsmonMatrixTopNOctetRate": {
    "name": "dsmonMatrixTopNOctetRate",
    "oid": "1.3.6.1.2.1.16.26.1.6.5.1.13",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of octets seen of this protocol from the source host to the destination host during this sampling interval, counted using the rules for counting the dsmonMatrixSDOctets object. If the value of dsmonMatrixTopNCtlRateBase is dsmonMatrixTopNOctets, this variable will be used to sort this report. If the value of the dsmonMatrixTopNCtlRateBase is dsmonMatrixTopNHCPkts or dsmonMatrixTopNHCOctets, then this object will contain the the least significant 32 bits of the associated dsmonMatrixTopNHCPktRate object."
  },
  "dsmonMatrixTopNOctetRateOvfl": {
    "name": "dsmonMatrixTopNOctetRateOvfl",
    "oid": "1.3.6.1.2.1.16.26.1.6.5.1.14",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The most significant 32 bits of the associated dsmonMatrixTopNHCOctetRate object. If the associated dsmonMatrixTopNCtlRateBase is equal to dsmonMatrixTopNHCPkts or dsmonMatrixTopNHCOctets, then this object will contain the most significant 32 bits of the associated dsmonMatrixTopNHCOctetRate object, otherwise this object will contain the value zero. The agent MAY choose not to instantiate this object if High Capacity monitoring is not supported."
  },
  "dsmonMatrixTopNHCOctetRate": {
    "name": "dsmonMatrixTopNHCOctetRate",
    "oid": "1.3.6.1.2.1.16.26.1.6.5.1.15",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CounterBasedGauge64",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of octets seen of this protocol from the source host to the destination host during this sampling interval, counted using the rules for counting the dsmonMatrixSDHCOctets object. If the value of dsmonMatrixTopNCtlRateBase is dsmonMatrixTopNHCOctets, this variable will be used to sort this report. The agent MAY choose not to instantiate this object if High Capacity monitoring is not supported."
  },
  "dsmonMatrixTopNRevOctetRate": {
    "name": "dsmonMatrixTopNRevOctetRate",
    "oid": "1.3.6.1.2.1.16.26.1.6.5.1.16",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of octets seen of this protocol from the destination host to the source host during this sampling interval, counted using the rules for counting the dsmonMatrixDSOctets object (note that the corresponding dsmonMatrixSDOctets object selected is the one whose source address is equal to dsmonMatrixTopNDestAddress and whose destination address is equal to dsmonMatrixTopNSourceAddress.)"
  },
  "dsmonMatrixTopNRevOctetRateOvfl": {
    "name": "dsmonMatrixTopNRevOctetRateOvfl",
    "oid": "1.3.6.1.2.1.16.26.1.6.5.1.17",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The most significant 32 bits of the associated dsmonMatrixTopNHCRevOctetRate object. If the associated dsmonMatrixTopNCtlRateBase is equal to dsmonMatrixTopNHCPkts or dsmonMatrixTopNHCOCtets, then this object will contain the most significant 32 bits of the associated dsmonMatrixTopNHCRevPktRate object, otherwise this object will contain the value zero. The agent MAY choose not to instantiate this object if High Capacity monitoring is not supported."
  },
  "dsmonMatrixTopNHCRevOctetRate": {
    "name": "dsmonMatrixTopNHCRevOctetRate",
    "oid": "1.3.6.1.2.1.16.26.1.6.5.1.18",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CounterBasedGauge64",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of octets seen of this protocol from the destination host to the source host during this sampling interval, counted using the rules for counting the dsmonMatrixDSHCOctets object (note that the corresponding dsmonMatrixSDHCOctets object selected is the one whose source address is equal to dsmonMatrixTopNDestAddress and whose destination address is equal to dsmonMatrixTopNSourceAddress.) The agent MAY choose not to instantiate this object if High Capacity monitoring is not supported."
  },
  "dsmonCompliances": {
    "name": "dsmonCompliances",
    "oid": "1.3.6.1.2.1.16.26.3.1",
    "class": "objectidentity"
  },
  "dsmonGroups": {
    "name": "dsmonGroups",
    "oid": "1.3.6.1.2.1.16.26.3.2",
    "class": "objectidentity"
  },
  "dsmonCompliance": {
    "name": "dsmonCompliance",
    "oid": "1.3.6.1.2.1.16.26.3.1.1",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "dsmonCounterAggControlGroup",
        "module": "DSMON-MIB"
      },
      {
        "object": "dsmonStatsGroup",
        "module": "DSMON-MIB"
      },
      {
        "object": "dsmonCapsGroup",
        "module": "DSMON-MIB"
      },
      {
        "object": "dsmonStatsHCGroup",
        "module": "DSMON-MIB"
      },
      {
        "object": "dsmonPdistGroup",
        "module": "DSMON-MIB"
      },
      {
        "object": "dsmonPdistHCGroup",
        "module": "DSMON-MIB"
      },
      {
        "object": "dsmonHostGroup",
        "module": "DSMON-MIB"
      },
      {
        "object": "dsmonHostHCGroup",
        "module": "DSMON-MIB"
      },
      {
        "object": "dsmonMatrixGroup",
        "module": "DSMON-MIB"
      },
      {
        "object": "dsmonMatrixHCGroup",
        "module": "DSMON-MIB"
      }
    ],
    "status": "current",
    "description": "Describes the requirements for conformance to the Differentiated Services Monitoring MIB."
  },
  "dsmonHCCompliance": {
    "name": "dsmonHCCompliance",
    "oid": "1.3.6.1.2.1.16.26.3.1.2",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "dsmonCounterAggControlGroup",
        "module": "DSMON-MIB"
      },
      {
        "object": "dsmonStatsGroup",
        "module": "DSMON-MIB"
      },
      {
        "object": "dsmonStatsHCGroup",
        "module": "DSMON-MIB"
      },
      {
        "object": "dsmonCapsGroup",
        "module": "DSMON-MIB"
      },
      {
        "object": "dsmonPdistGroup",
        "module": "DSMON-MIB"
      },
      {
        "object": "dsmonPdistHCGroup",
        "module": "DSMON-MIB"
      },
      {
        "object": "dsmonHostGroup",
        "module": "DSMON-MIB"
      },
      {
        "object": "dsmonHostHCGroup",
        "module": "DSMON-MIB"
      },
      {
        "object": "dsmonMatrixGroup",
        "module": "DSMON-MIB"
      },
      {
        "object": "dsmonMatrixHCGroup",
        "module": "DSMON-MIB"
      }
    ],
    "status": "current",
    "description": "Describes the requirements for conformance to the Differentiated Services Monitoring MIB for agents which also support High Capacity monitoring and the Counter64 data type."
  },
  "dsmonHCNoC64Compliance": {
    "name": "dsmonHCNoC64Compliance",
    "oid": "1.3.6.1.2.1.16.26.3.1.3",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "dsmonCounterAggControlGroup",
        "module": "DSMON-MIB"
      },
      {
        "object": "dsmonStatsGroup",
        "module": "DSMON-MIB"
      },
      {
        "object": "dsmonStatsOvflGroup",
        "module": "DSMON-MIB"
      },
      {
        "object": "dsmonCapsGroup",
        "module": "DSMON-MIB"
      },
      {
        "object": "dsmonStatsHCGroup",
        "module": "DSMON-MIB"
      },
      {
        "object": "dsmonPdistGroup",
        "module": "DSMON-MIB"
      },
      {
        "object": "dsmonPdistOvflGroup",
        "module": "DSMON-MIB"
      },
      {
        "object": "dsmonPdistHCGroup",
        "module": "DSMON-MIB"
      },
      {
        "object": "dsmonHostGroup",
        "module": "DSMON-MIB"
      },
      {
        "object": "dsmonHostOvflGroup",
        "module": "DSMON-MIB"
      },
      {
        "object": "dsmonHostHCGroup",
        "module": "DSMON-MIB"
      },
      {
        "object": "dsmonMatrixGroup",
        "module": "DSMON-MIB"
      },
      {
        "object": "dsmonMatrixOvflGroup",
        "module": "DSMON-MIB"
      },
      {
        "object": "dsmonMatrixHCGroup",
        "module": "DSMON-MIB"
      }
    ],
    "status": "deprecated",
    "description": "Describes the requirements for conformance to the Differentiated Services Monitoring MIB for an agent which supports high capacity monitoring, but does not support the Counter64 data type (e.g., only supports the SNMPv1 protocol)."
  },
  "dsmonCounterAggControlGroup": {
    "name": "dsmonCounterAggControlGroup",
    "oid": "1.3.6.1.2.1.16.26.3.2.1",
    "class": "objectgroup",
    "objects": [
      {
        "module": "DSMON-MIB",
        "object": "dsmonMaxAggGroups"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonAggControlLocked"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonAggControlChanges"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonAggControlLastChangeTime"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonAggControlDescr"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonAggControlOwner"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonAggControlStatus"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonAggGroupIndex"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonAggGroupDescr"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonAggGroupStatus"
      }
    ],
    "status": "current",
    "description": "A collection of objects used to configure and manage counter aggregation groups for DSMON collection purposes."
  },
  "dsmonStatsGroup": {
    "name": "dsmonStatsGroup",
    "oid": "1.3.6.1.2.1.16.26.3.2.2",
    "class": "objectgroup",
    "objects": [
      {
        "module": "DSMON-MIB",
        "object": "dsmonStatsControlDataSource"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonStatsControlAggProfile"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonStatsControlDroppedFrames"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonStatsControlCreateTime"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonStatsControlOwner"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonStatsControlStatus"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonStatsInPkts"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonStatsInOctets"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonStatsOutPkts"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonStatsOutOctets"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing per DSCP statistics."
  },
  "dsmonStatsOvflGroup": {
    "name": "dsmonStatsOvflGroup",
    "oid": "1.3.6.1.2.1.16.26.3.2.3",
    "class": "objectgroup",
    "objects": [
      {
        "module": "DSMON-MIB",
        "object": "dsmonStatsInOvflPkts"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonStatsInOvflOctets"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonStatsOutOvflPkts"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonStatsOutOvflOctets"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects providing per-DSCP overflow counters for systems with high capacity data sources, but without support for the Counter64 data type."
  },
  "dsmonStatsHCGroup": {
    "name": "dsmonStatsHCGroup",
    "oid": "1.3.6.1.2.1.16.26.3.2.4",
    "class": "objectgroup",
    "objects": [
      {
        "module": "DSMON-MIB",
        "object": "dsmonStatsInHCPkts"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonStatsInHCOctets"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonStatsOutHCPkts"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonStatsOutHCOctets"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing per DSCP statistics for high capacity data sources."
  },
  "dsmonPdistGroup": {
    "name": "dsmonPdistGroup",
    "oid": "1.3.6.1.2.1.16.26.3.2.5",
    "class": "objectgroup",
    "objects": [
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistCtlDataSource"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistCtlAggProfile"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistCtlMaxDesiredEntries"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistCtlDroppedFrames"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistCtlInserts"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistCtlDeletes"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistCtlCreateTime"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistCtlOwner"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistCtlStatus"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistStatsPkts"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistStatsOctets"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistStatsCreateTime"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistTopNCtlPdistIndex"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistTopNCtlRateBase"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistTopNCtlTimeRemaining"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistTopNCtlGeneratedReprts"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistTopNCtlDuration"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistTopNCtlRequestedSize"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistTopNCtlGrantedSize"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistTopNCtlStartTime"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistTopNCtlOwner"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistTopNCtlStatus"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistTopNPDLocalIndex"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistTopNAggGroup"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistTopNRate"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing per protocol DSCP monitoring extensions to the RMON-2 MIB."
  },
  "dsmonPdistOvflGroup": {
    "name": "dsmonPdistOvflGroup",
    "oid": "1.3.6.1.2.1.16.26.3.2.6",
    "class": "objectgroup",
    "objects": [
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistStatsOvflPkts"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistStatsOvflOctets"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistTopNRateOvfl"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects providing per-protocol DSCP overflow counters for systems with high capacity data sources, but without support for the Counter64 data type."
  },
  "dsmonPdistHCGroup": {
    "name": "dsmonPdistHCGroup",
    "oid": "1.3.6.1.2.1.16.26.3.2.7",
    "class": "objectgroup",
    "objects": [
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistStatsHCPkts"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistStatsHCOctets"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonPdistTopNHCRate"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing per protocol DSCP monitoring extensions to the RMON-2 MIB for High Capacity networks."
  },
  "dsmonHostGroup": {
    "name": "dsmonHostGroup",
    "oid": "1.3.6.1.2.1.16.26.3.2.8",
    "class": "objectgroup",
    "objects": [
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostCtlDataSource"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostCtlAggProfile"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostCtlMaxDesiredEntries"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostCtlIPv4PrefixLen"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostCtlIPv6PrefixLen"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostCtlDroppedFrames"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostCtlInserts"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostCtlDeletes"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostCtlCreateTime"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostCtlOwner"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostCtlStatus"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostInPkts"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostInOctets"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostOutPkts"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostOutOctets"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostCreateTime"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostTopNCtlHostIndex"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostTopNCtlRateBase"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostTopNCtlTimeRemaining"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostTopNCtlGeneratedReports"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostTopNCtlDuration"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostTopNCtlRequestedSize"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostTopNCtlGrantedSize"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostTopNCtlStartTime"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostTopNCtlOwner"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostTopNCtlStatus"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostTopNPDLocalIndex"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostTopNAddress"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostTopNAggGroup"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostTopNRate"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing per Host monitoring functions."
  },
  "dsmonHostOvflGroup": {
    "name": "dsmonHostOvflGroup",
    "oid": "1.3.6.1.2.1.16.26.3.2.9",
    "class": "objectgroup",
    "objects": [
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostInOvflPkts"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostInOvflOctets"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostOutOvflPkts"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostOutOvflOctets"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostTopNRateOvfl"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects providing per host DSCP overflow counters for systems with high capacity data sources, but without support for the Counter64 data type."
  },
  "dsmonHostHCGroup": {
    "name": "dsmonHostHCGroup",
    "oid": "1.3.6.1.2.1.16.26.3.2.10",
    "class": "objectgroup",
    "objects": [
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostInHCPkts"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostInHCOctets"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostOutHCPkts"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostOutHCOctets"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonHostTopNHCRate"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing per Host monitoring functions for High Capacity networks."
  },
  "dsmonCapsGroup": {
    "name": "dsmonCapsGroup",
    "oid": "1.3.6.1.2.1.16.26.3.2.11",
    "class": "objectgroup",
    "objects": [
      {
        "module": "DSMON-MIB",
        "object": "dsmonCapabilities"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing an indication of the DSMON monitoring functions supported by the agent."
  },
  "dsmonMatrixGroup": {
    "name": "dsmonMatrixGroup",
    "oid": "1.3.6.1.2.1.16.26.3.2.12",
    "class": "objectgroup",
    "objects": [
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixCtlDataSource"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixCtlAggProfile"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixCtlMaxDesiredEntries"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixCtlDroppedFrames"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixCtlInserts"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixCtlDeletes"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixCtlCreateTime"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixCtlOwner"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixCtlStatus"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixSDPkts"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixSDOctets"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixSDCreateTime"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixDSPkts"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixDSOctets"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixDSCreateTime"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixTopNCtlMatrixIndex"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixTopNCtlRateBase"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixTopNCtlTimeRemaining"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixTopNCtlGeneratedRpts"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixTopNCtlDuration"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixTopNCtlRequestedSize"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixTopNCtlGrantedSize"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixTopNCtlStartTime"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixTopNCtlOwner"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixTopNCtlStatus"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixTopNAggGroup"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixTopNNLIndex"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixTopNSourceAddress"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixTopNDestAddress"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixTopNALIndex"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixTopNPktRate"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixTopNRevPktRate"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixTopNOctetRate"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixTopNRevOctetRate"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing per conversation monitoring functions."
  },
  "dsmonMatrixOvflGroup": {
    "name": "dsmonMatrixOvflGroup",
    "oid": "1.3.6.1.2.1.16.26.3.2.13",
    "class": "objectgroup",
    "objects": [
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixSDOvflPkts"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixSDOvflOctets"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixDSOvflPkts"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixDSOvflOctets"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixTopNPktRateOvfl"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixTopNRevPktRateOvfl"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixTopNOctetRateOvfl"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixTopNRevOctetRateOvfl"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects providing per conversation monitoring functions for systems with high capacity data sources, but without support for the Counter64 data type."
  },
  "dsmonMatrixHCGroup": {
    "name": "dsmonMatrixHCGroup",
    "oid": "1.3.6.1.2.1.16.26.3.2.14",
    "class": "objectgroup",
    "objects": [
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixSDHCPkts"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixSDHCOctets"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixDSHCPkts"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixDSHCOctets"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixTopNHCPktRate"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixTopNHCRevPktRate"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixTopNHCOctetRate"
      },
      {
        "module": "DSMON-MIB",
        "object": "dsmonMatrixTopNHCRevOctetRate"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing per conversation monitoring functions for High Capacity networks."
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/DSMON-MIB",
      "Produced by pysmi-0.3.4 at Fri May 24 18:11:51 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "DSMON-MIB"
  }
}