{
  "imports": {
    "class": "imports",
    "IF-MIB": [
      "InterfaceIndex",
      "ifSpeed",
      "ifIndex"
    ],
    "SNMP-FRAMEWORK-MIB": [
      "SnmpAdminString"
    ],
    "SNMPv2-CONF": [
      "OBJECT-GROUP",
      "NOTIFICATION-GROUP",
      "MODULE-COMPLIANCE"
    ],
    "SNMPv2-SMI": [
      "IpAddress",
      "Gauge32",
      "TimeTicks",
      "mib-2",
      "Counter64",
      "OBJECT-IDENTITY",
      "Counter32",
      "Integer32",
      "Bits",
      "Unsigned32",
      "MibIdentifier",
      "NOTIFICATION-TYPE",
      "MODULE-IDENTITY",
      "iso",
      "OBJECT-TYPE"
    ],
    "SNMPv2-TC": [
      "PhysAddress",
      "TEXTUAL-CONVENTION",
      "RowStatus",
      "TruthValue",
      "DisplayString"
    ],
    "Zhone": [
      "ietfDrafts"
    ]
  },
  "efmCuMIB": {
    "name": "efmCuMIB",
    "oid": "1.3.6.1.4.1.5504.10.1.7",
    "class": "moduleidentity",
    "revisions": [
      {
        "revision": "2012-06-29 00:00",
        "description": "Added SHDSL Regenerator Statistics."
      },
      {
        "revision": "2005-04-04 00:00",
        "description": "Initial version, published as RFC XXXX."
      }
    ],
    "lastupdated": "200504040000Z",
    "organization": "IETF Ethernet Interfaces and Hub MIB Working Group",
    "contactinfo": "WG charter: http://www.ietf.org/html.charters/hubmib-charter.html Mailing Lists: General Discussion: hubmib@ietf.org To Subscribe: hubmib-request@ietf.org In Body: subscribe your_email_address Chair: Dan Romascanu Postal: Avaya Atidim Technology Park, Bldg. 3 Tel Aviv 61131 Israel Tel: +972 3 645 8414 E-mail: dromasca@avaya.com Editor: Edward Beili Postal: Actelis Networks Inc. 25 Bazel St., P.O.B. 10173 Petach-Tikva 10173 Israel Tel: +972-3-924-3491 E-mail: edward.beili@actelis.com",
    "description": "The objects in this MIB module are used to manage the Ethernet in the First Mile (EFM) Copper (EFMCu) Interfaces 2BASE-TL and 10PASS-TS, defined in IEEE Draft P802.3ah/D3.3. The following reference is used throughout this MIB module: [802.3ah] refers to: IEEE Std 802.3ah-2004: 'IEEE Standard for Information technology - Telecommunications and information exchange between systems - Local and metropolitan area networks - Specific requirements - Part 3: Carrier Sense Multiple Access with Collision Detection (CSMA/CD) Access Method and Physical Layer Specifications - Amendment: Media Access Control Parameters, Physical Layers and Management Parameters for Subscriber Access Networks', 07 September 2004. Of particular interest are Clause 61, 'Physical Coding Sublayer (PCS) and common specifications, type 10PASS-TS and type 2BASE-TL', Clause 30, 'Management', Clause 45, 'Management Data Input/Output (MDIO) Interface', Annex 62A, 'PMD profiles for 10PASS-TS' and Annex 63A, 'PMD profiles for 2BASE-TL'. Naming Conventions: Atn - Attenuation CO - Central Office CPE - Customer Premises Equipment EFM - Ethernet in the First Mile EFMCu - EFM Copper MDIO - Management Data Input/Output Mgn - Margin PAF - PME Aggregation Function PCS - Physical Coding Sublayer PMD - Physical Medium Dependent PME - Physical Medium Entity PSD - Power Spectral Density SNR - Signal to Noise Ratio TCPAM - Trellis Coded Pulse Amplitude Modulation Copyright (C) The Internet Society (2004). This version of this MIB module is part of RFC XXXX; see the RFC itself for full legal notices."
  },
  "efmCuObjects": {
    "name": "efmCuObjects",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1",
    "class": "objectidentity"
  },
  "efmCuConformance": {
    "name": "efmCuConformance",
    "oid": "1.3.6.1.4.1.5504.10.1.7.2",
    "class": "objectidentity"
  },
  "efmCuPort": {
    "name": "efmCuPort",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1",
    "class": "objectidentity"
  },
  "efmCuPme": {
    "name": "efmCuPme",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2",
    "class": "objectidentity"
  },
  "ProfileIndex": {
    "name": "ProfileIndex",
    "class": "textualconvention",
    "type": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 255
          }
        ]
      }
    },
    "displayhint": "d",
    "status": "current",
    "description": "A unique value, greater than zero, for each PME configuration profile in the managed EFMCu port. It is recommended that values are assigned contiguously starting from 1. The value for each profile must remain constant at least from one re-initialization of the entity's network management system to the next re-initialization."
  },
  "ProfileIndexOrZero": {
    "name": "ProfileIndexOrZero",
    "class": "textualconvention",
    "type": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 255
          }
        ]
      }
    },
    "displayhint": "d",
    "status": "current",
    "description": "This textual convention is an extension of the ProfileIndex convention. The latter defines a greater than zero value used to identify a PME profile in the managed EFMCu port. This extension permits the additional value of zero. The value of zero is object-specific and must therefore be defined as part of the description of any object which uses this syntax. Examples of the usage of zero value migh include situations where current operational profile is unknown."
  },
  "ProfileIndexList": {
    "name": "ProfileIndexList",
    "class": "textualconvention",
    "type": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 6
          }
        ]
      }
    },
    "displayhint": "1d:",
    "status": "current",
    "description": "Represents a list of up to 6 ProfileIndex's. The ProfileIndex textual convention defines a greater than zero value used to identify a PME profile in the managed EFMCu port. The value of this object is a concatenation of one or more (up to 6) octets, where each octet contains an 8-bit ProfileIndex value. The ProfileIndexList specifies a list of alternative profiles, any of which can be chosen for configuration of an PME."
  },
  "TruthValueOrUnknown": {
    "name": "TruthValueOrUnknown",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "unknown": 0,
          "true": 1,
          "false": 2
        }
      }
    },
    "status": "current",
    "description": "This textual convention is an extension of the TruthValue convention. The latter defines a boolean value with possible values of true(1) and false(2). This extension permits the additional value of unknown(0), which can be returned as a result of GET operation, when an exact true or false value of the object cannot be determined."
  },
  "efmCuPortNotifications": {
    "name": "efmCuPortNotifications",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.0",
    "class": "objectidentity"
  },
  "efmCuLowBandwidth": {
    "name": "efmCuLowBandwidth",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.0.1",
    "class": "notificationtype",
    "objects": [
      {
        "module": "IF-MIB",
        "object": "ifSpeed"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuThreshLowBandwidth"
      }
    ],
    "status": "current",
    "description": "This notification indicates that EFMCu port's data rate reached or dropped below a Low Bandwidth Threshold (i.e. bandwidth degradation happening in case of PAF when one or more PMEs drop)."
  },
  "efmCuPortConfTable": {
    "name": "efmCuPortConfTable",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Table for Configuration of EFMCu 2BASE-TL/10PASS-TS (PCS) Ports. Entries in this table MUST be maintained in a persistent manner"
  },
  "efmCuPortConfEntry": {
    "name": "efmCuPortConfEntry",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry in the EFMCu Port Configuration table. Each entry represents an EFMCu port indexed by the ifIndex. Note that an EFMCu PCS port runs on top of a single or multiple PME port(s), which are also indexed by ifIndex."
  },
  "efmCuPAFAdminState": {
    "name": "efmCuPAFAdminState",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "enabled": 1,
          "disabled": 2
        }
      }
    },
    "default": {
      "default": {
        "value": "enabled",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "reference": "[802.3ah] 61.2.2, 45.2.3.18.3",
    "status": "current",
    "description": "Administrative (desired) state of the PAF of the EFMCu port (PCS). When 'disabled', PME Aggregation will not be performed by the PCS. No more than a single PME can be assigned to this PCS in this case. When 'enabled', PAF will be performed by the PCS when the link is Up, even on a single attached PME, if PAF is supported. PCS ports incapable of supporting PAF SHALL return a value of 'disabled'. Attempts to 'enable' such ports SHALL be ignored. PAF 'enabled' port with multiple PMEs assigned cannot be 'disabled'. Attempts to 'disable' such port SHALL be rejected, until at most one PME is left assigned. Changing PAFAdminState is a traffic disruptive operation and as such SHALL be done when the link is Down. Attempts to change this object SHALL be ignored if the link is Up or Initializing. This object maps to the Clause 30 attribute aPAFAdminState. If a Clause 45 MDIO Interface to the PCS is present, then this object maps to the PAF enable bit in the 10P/2B PCS control register. This object MUST be maintained in a persistent manner."
  },
  "efmCuPAFDiscoveryCode": {
    "name": "efmCuPAFDiscoveryCode",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PhysAddress",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "000000000000",
        "format": "hex"
      }
    },
    "maxaccess": "read-write",
    "reference": "[802.3ah] 61.2.2.8.3, 61.2.2.8.4, 45.2.6.6.1",
    "status": "current",
    "description": "PAF Discovery Code of the EFMCu port (PCS). A unique 6 Byte long code used by the Discovery function, when PAF is supported. PCS ports incapable of supporting PAF SHALL return a value of all zeroes. Attempts to change this object SHALL be ignored in this case. This object MUST be instantiated for the -O subtype PCS before writing operations on the efmCuPAFRemoteDiscoveryCode (Set_if_Clear and Clear_if_Same) are performed by PMEs associated with the PCS. The value of this object is read-only for -R port subtypes. The initial value of this object for -R ports after reset is 0. This value may be changed as a result of writing operation on efmCuPAFRemoteDiscoveryCode variable of remote PME of -O subtype, connected to one of the local PMEs associated with the PCS. Discovery MUST be performed when the link is Down. Attempts to change this object MUST be rejected with the error inconsistentValue if the link is Up or Initializing. The PAF Discovery code maps to the local Discovery code variable in PAF (note that it does not have a corresponding Clause 45 register)"
  },
  "efmCuAdminProfile": {
    "name": "efmCuAdminProfile",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ProfileIndexList",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "01",
        "format": "hex"
      }
    },
    "maxaccess": "read-write",
    "reference": "[802.3ah] 30.11.2.1.6",
    "status": "current",
    "description": "Desired configuration Profile(s), common for all PMEs in the EFMCu port. This object is a list of pointers to entries in either efmCuPme2BProfileTable or efmCuPme10PProfileTable, depending on the current operating SubType of the EFMCu port as indicated by efmCuPortSide. The value of this object is a list of up to 6 indices of Profiles. If this list consists of a single Profile index, then all PMEs assigned to this EFMCu port SHALL be configured according to the Profile referenced by that index, unless it is overwritten by corresponding non-zero efmCuPmeAdminProfile, which takes precedence over efmCuAdminProfile. The list, consisting of more than one index, allows each PME in the port to be configured according to any Profile specified in the list. By default this object has a single profile index 1, referencing 1st entry in efmCuPme2BProfileTable/ efmCuPme2BProfileTable. This object is writable and readable for the -O subtype (2BaseTL-O or 10PassTS-O) EFMCu ports. It is unavailable for the -R subtype (2BaseTL-R or 10PassTS-R) ports. Note that current operational Profile value is available via efmCuPmeOperProfile object. Modification of this object must be performed when the link is Down. Attempts to change this object MUST be rejected, if the link is Up or Initializing. Attempts to set this object to a list with a member value, that is not the value of the index for an active entry in the corresponding profile table, MUST be rejected. This object MUST be maintained in a persistent manner."
  },
  "efmCuTargetDataRate": {
    "name": "efmCuTargetDataRate",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 100000
          },
          {
            "min": 999999,
            "max": 999999
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 50000,
        "format": "decimal"
      }
    },
    "units": "Kbps",
    "maxaccess": "read-write",
    "status": "current",
    "description": "Desired EFMCu port 'net' (as seen across MII) Data Rate in Kbps, to be achieved during initialization, under spectral restrictions placed on each PME via efmCuAdminProfile or efmCuPmeAdminProfile, with the desired SNR Margin specified by efmCuTargetWorstCaseSnrMgn and efmCuTargetCurrentConditionSnrMgn depending on the values of efmCuTargetWorstCaseMode and efmCuTargetCurrentConditionMode. In case of PAF, this object represents a sum of individual PME data rates, modified to compensate for fragmentation and 64/65B framing overhead (e.g. target data rate of 10Mbps shall allow lossless transmission of full-duplex 10Mbps Ethernet frame stream with minimal inter-frame gap). The value is limited above by 100Mbps as this is the max burst rate across MII for EFMCu ports. The value between 1 and 100000 indicates that the total data rate (ifSpeed) of the EFMCu port after initialization should be equal to the target data rate or less, if the target data rate cannot be achieved under spectral restrictions specified by efmCuAdminProfile/efmCuPmeAdminProfile and with desired SNR margin. In case the copper environment allows to achieve higher total data rate than specified by the target, the excess capability SHALL be converted to additional SNR margin and spread evenly across all active PMEs assigned to the (PCS) port. The value of 999999 means that the target data rate is not fixed and should be set to the maximum attainable rate during initialization (Best Effort), under specified spectral restrictions and with desired SNR Margin. This object is read-write for the -O subtype EFMCu ports (2BaseTL-O/10PassTS-O) and not available for the -R subtypes. Changing of the Target Data Rate MUST be performed when the link is Down. Attempts to change this object MUST be rejected with the error inconsistentValue, if the link is Up or Initializing. Note that current Data Rate of the EFMCu port is represented by ifSpeed object of IF-MIB. This object MUST be maintained in a persistent manner."
  },
  "efmCuTargetWorstCaseSnrMgn": {
    "name": "efmCuTargetWorstCaseSnrMgn",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": -10,
            "max": 21
          }
        ]
      }
    },
    "units": "dB",
    "maxaccess": "read-write",
    "reference": "[802.3ah] 61.1.2",
    "status": "current",
    "description": "Desired EFMCu port SNR Margin to be achieved on all PMEs assigned to the port, during initializiation if efmCuTargetWorstCaseMode is TRUE. (The SNR margin is the difference between the desired SNR and the actual SNR). Note that 802.3ah recommends using default Target SNR Margin of 5dB for 2BASE-TL ports and 6dB for 10PASS-TS ports in order to achieve mean Bit Error Rate (BER) of 10^-7 at the PMA service interface. This object is read-write for the -O subtype EFMCu ports (2BaseTL-O/10PassTS-O) and not available for the -R subtypes. Changing of the Target SNR Margin MUST be performed when the link is Down. Attempts to change this object MUST be rejected with the error inconsistentValue, if the link is Up or Initializing. Note that current SNR Margin of the PMEs comprising the EFMCu port is represented by efmCuPmeSnrMgn. This object MUST be maintained in a persistent manner."
  },
  "efmCuThreshLowBandwidth": {
    "name": "efmCuThreshLowBandwidth",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 100000
          }
        ]
      }
    },
    "units": "Kbps",
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object configures the EFMCu port Low Bandwidth alarm threshold. When the current value of ifSpeed for this port reaches or drops below this threshold, an efmCuLowBandwidth notification MAY be generated if enabled by efmCuLowBandwidthEnable. The value of 0 means no efmCuLowBandwidth notifications SHALL ever be generated. This object is read-write for the -O subtype EFMCu ports (2BaseTL-O/10PassTS-O) and not available for the -R subtypes. This object MUST be maintained in a persistent manner."
  },
  "efmCuLowBandwidthEnable": {
    "name": "efmCuLowBandwidthEnable",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.1.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Indicates whether efmCuLowBandwidth notifications should be generated for this interface. Value of true(1) indicates that efmCuLowBandwidth notification is enabled. Value of false(2) indicates that the notification is disabled. This object MUST be maintained in a persistent manner."
  },
  "efmCuTargetCurrentConditionMode": {
    "name": "efmCuTargetCurrentConditionMode",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.1.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "reference": "[802.3ah] 61.1.2",
    "status": "current",
    "description": " Note that 802.3ah recommends using default Target SNR Margin of 5dB for 2BASE-TL ports and 6dB for 10PASS-TS ports in order to achieve mean Bit Error Rate (BER) of 10^-7 at the PMA service interface. This object is read-write for the -O subtype EFMCu ports (2BaseTL-O/10PassTS-O) and not available for the -R subtypes. Changing of the Target SNR Margin MUST be performed when the link is Down. Attempts to change this object MUST be rejected with the error inconsistentValue, if the link is Up or Initializing. Note that current SNR Margin of the PMEs comprising the EFMCu port is represented by efmCuPmeSnrMgn. This object MUST be maintained in a persistent manner."
  },
  "efmCuTargetCurrentConditionSnrMgn": {
    "name": "efmCuTargetCurrentConditionSnrMgn",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.1.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": -10,
            "max": 21
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 6,
        "format": "decimal"
      }
    },
    "units": "dB",
    "maxaccess": "read-write",
    "reference": "[802.3ah] 61.1.2",
    "status": "current",
    "description": "Desired EFMCu port SNR Margin to be achieved on all PMEs assigned to the port, during initializiation if efmCuTargetCurrentConditionMode is TRUE. (The SNR margin is the difference between the desired SNR and the actual SNR). Note that 802.3ah recommends using default Target SNR Margin of 5dB for 2BASE-TL ports and 6dB for 10PASS-TS ports in order to achieve mean Bit Error Rate (BER) of 10^-7 at the PMA service interface. This object is read-write for the -O subtype EFMCu ports (2BaseTL-O/10PassTS-O) and not available for the -R subtypes. Changing of the Target SNR Margin MUST be performed when the link is Down. Attempts to change this object MUST be rejected with the error inconsistentValue, if the link is Up or Initializing. Note that current SNR Margin of the PMEs comprising the EFMCu port is represented by efmCuPmeSnrMgn. This object MUST be maintained in a persistent manner."
  },
  "efmCuTargetWorstCaseMode": {
    "name": "efmCuTargetWorstCaseMode",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.1.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "true",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "reference": "[802.3ah] 61.1.2",
    "status": "current",
    "description": " Note that 802.3ah recommends using default Target SNR Margin of 5dB for 2BASE-TL ports and 6dB for 10PASS-TS ports in order to achieve mean Bit Error Rate (BER) of 10^-7 at the PMA service interface. This object is read-write for the -O subtype EFMCu ports (2BaseTL-O/10PassTS-O) and not available for the -R subtypes. Changing of the Target SNR Margin MUST be performed when the link is Down. Attempts to change this object MUST be rejected with the error inconsistentValue, if the link is Up or Initializing. Note that current SNR Margin of the PMEs comprising the EFMCu port is represented by efmCuPmeSnrMgn. This object MUST be maintained in a persistent manner."
  },
  "efmCuPAFAutoDiscovery": {
    "name": "efmCuPAFAutoDiscovery",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.1.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "disabled": 1,
          "optional": 2,
          "required": 3
        }
      }
    },
    "default": {
      "default": {
        "value": "disabled",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Setting this value to disabled causes the CO and CPE to cease EFM Discovery communications. Bond groups and members must by created manually. Setting this value to optional has the following results depending on the current setup. If no EFM Bond group exists and the CO and CPE have multiple connections connecting them and both support EFM Discovery, then an EFM Bond group will be dynamically created and members will be added to the group. If an EFM bond group exists and it was created dynamically, the CO and CPE will start EFM Discovery. If the EFM Bond group was created manually or by ZMS, EFM Discovery will not be started. When setting this value to required, both the CO and CPE must be capable of supporting EFM Discovery. If two or more connections exist between the CO and CPE, an EFM Bond group will be dynamically created and members will be added to the group. This object MUST be maintained in a persistent manner."
  },
  "efmCuPmeErrorClearStats": {
    "name": "efmCuPmeErrorClearStats",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.1.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "normalStats": 1,
          "clearStats": 2
        }
      }
    },
    "default": {
      "default": {
        "value": "normalStats",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This leaf is used to clear Error Monitor statistics. When the value is set to clearStats (2) the stats are cleared for this port. Once the stats have been cleared a read of this entry will return the value for normalStats (1). Only valid user settable value is clearStats (2)."
  },
  "efmCuPmeSnrClearStats": {
    "name": "efmCuPmeSnrClearStats",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.1.1.13",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "normalStats": 1,
          "clearStats": 2
        }
      }
    },
    "default": {
      "default": {
        "value": "normalStats",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This leaf is used to clear Snr Monitor statistics. When the value is set to clearStats (2) the stats are cleared for this port. Once the stats have been cleared a read of this entry will return the value for normalStats (1). Only valid user settable value is clearStats (2)."
  },
  "efmCuPortCapabilityTable": {
    "name": "efmCuPortCapabilityTable",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Table for Capabilities of EFMCu 2BASE-TL/10PASS-TS (PCS) Ports. Entries in this table MUST be maintained in a persistent manner"
  },
  "efmCuPortCapabilityEntry": {
    "name": "efmCuPortCapabilityEntry",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry in the EFMCu Port Capability table. Each entry represents an EFMCu port indexed by the ifIndex. Note that an EFMCu PCS port runs on top of a single or multiple PME port(s), which are also indexed by ifIndex."
  },
  "efmCuPAFSupported": {
    "name": "efmCuPAFSupported",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah] 61.2.2, 30.11.1.1.4, 45.2.3.17.1",
    "status": "current",
    "description": "PME Aggregation Function (PAF) Capability of the EFMCu port (PCS). This object has a value of true(1) when the PCS can perform PME aggregation on the available PMEs. Ports incapable of PAF SHALL return a value of false(2). This object maps to the Clause 30 attribute aPAFSupported. If a Clause 45 MDIO Interface to the PCS is present, then this object maps to the PAF available bit in the 10P/2B capability register."
  },
  "efmCuPeerPAFSupported": {
    "name": "efmCuPeerPAFSupported",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.2.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValueOrUnknown",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah] 61.2.2, 30.11.1.1.9, 45.2.3.17.2",
    "status": "current",
    "description": "PME Aggregation Function (PAF) Capability of the EFMCu port (PCS) link partner. This object has a value of true(1) when the remote PCS can perform PME aggregation on its available PMEs. Ports whose peers are incapable of PAF, SHALL return a value of false(2). Ports whose peers cannot be reached because of the link state, SHALL return a value if unknown(0). This object maps to the Clause 30 attribute aRemotePAFSupported. If a Clause 45 MDIO Interface to the PCS is present, then this object maps to the Remote PAF supported bit in the 10P/2B capability register."
  },
  "efmCuPAFCapacity": {
    "name": "efmCuPAFCapacity",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.2.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 32
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah] 61.2.2, 30.11.1.1.6",
    "status": "current",
    "description": "Number of PMEs that can be aggregated by the local PAF. The number of PMEs currently assigned to a particular EFMCu port (efmCuNumPMEs) is never greater than efmCuPAFCapacity. This object maps to the Clause 30 attribute aLocalPAFCapacity."
  },
  "efmCuPeerPAFCapacity": {
    "name": "efmCuPeerPAFCapacity",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.2.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 0
          },
          {
            "min": 1,
            "max": 32
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah] 61.2.2, 30.11.1.1.10",
    "status": "current",
    "description": "Number of PMEs that can be aggregated by the PAF of the peer Phy (PCS port). Value of 0 is returned when peer PAF Capacity is unknown (peer cannot be reached). This object maps to the Clause 30 attribute aRemotePAFCapacity."
  },
  "efmCuPortStatusTable": {
    "name": "efmCuPortStatusTable",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.3",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table provides overall status information of EFMCu 2BASE-TL/10PASS-TS ports. This table contains live data from the equipment. As such, it is NOT persistent."
  },
  "efmCuPortStatusEntry": {
    "name": "efmCuPortStatusEntry",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.3.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry in the EFMCu Port Status table. Each entry represents an EFMCu port indexed by the ifIndex. Note that an EFMCu PCS port runs on top of a single or multiple PME port(s), which are also indexed by ifIndex."
  },
  "efmCuFltStatus": {
    "name": "efmCuFltStatus",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.3.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Bits",
      "class": "type",
      "bits": {
        "noPeer": 0,
        "pmeSubTypeMismatch": 1,
        "lowBandwidth": 2
      }
    },
    "maxaccess": "read-only",
    "reference": "ifOperStatus in IF-MIB; efmCuPmeFltStatus",
    "status": "current",
    "description": "EFMCu (PCS) port Fault Status. This is a bitmap of possible conditions. The various bit positions are: noPeer - peer PHY cannot be reached (e.g. no PMEs attached, all PMEs are Down etc.) More info is available in efmCuPmeFltStatus. pmeSubTypeMismatch - local PMEs in the aggregation group are not of the same sub-type, e.g. some PMEs in the local device are -O while others are -R subtype. lowBandwidth - ifSpeed of the port reached or droped below efmCuThreshLowBandwidth This object is intended to supplement ifOperStatus object in IF-MIB. Additional information is available via efmCuPmeFltStatus object for each PME in the aggregation group (single PME if PAF is disabled)."
  },
  "efmCuPortSide": {
    "name": "efmCuPortSide",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.3.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "subscriber": 1,
          "office": 2,
          "unknown": 3
        }
      }
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah] 61.1, 30.11.1.1.2",
    "status": "current",
    "description": "EFM port mode of operation (subtype). The value of 'subscriber' indicates the port is designated as '-R' subtype (all PMEs assigned to this port are of subtype '-R'). The value of the 'office' indicates that the port is designated as '-O' subtype (all PMEs assigned to this port are of subtype '-O'). The value of 'unknown' indicates that the port has no assigned PMEs yet or that the assigned PMEs are not of the same side (subTypePMEMismatch). This object partially maps to the Clause 30 attribute aPhyEnd"
  },
  "efmCuNumPMEs": {
    "name": "efmCuNumPMEs",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.3.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 32
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah] 61.2.2, 30.11.1.1.6",
    "status": "current",
    "description": "Number of PMEs that is currently aggregated by the local PAF (assigned to the EFMCu port using ifStackTable). This number is never greater than efmCuPAFCapacity. This object SHALL be automatically incremented or decremented when a PME is added or deleted to/from the EFMCu port using ifStackTable."
  },
  "efmCuPAFInErrors": {
    "name": "efmCuPAFInErrors",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.3.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah] 45.2.3.21",
    "status": "current",
    "description": "A number of fragments that have been received across the gamma interface with RxErr asserted and discarded. This read-only counter is inactive (not incremented) when the PAF is unsupported or disabled. Upon disabling the PAF, the counter retains its previous value. If a Clause 45 MDIO Interface to the PCS is present, then this object maps to the 10P/2B PAF RX error register."
  },
  "efmCuPAFInSmallFragments": {
    "name": "efmCuPAFInSmallFragments",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.3.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah] 45.2.3.22",
    "status": "current",
    "description": "A number of fragments smaller than minFragmentSize (64 Bytes), that have been received across the gamma interface and discarded. This read-only counter is inactive when the PAF is unsupported or disabled. Upon disabling the PAF, the counter retains its previous value. If a Clause 45 MDIO Interface to the PCS is present, then this object maps to the 10P/2B PAF small fragments register."
  },
  "efmCuPAFInLargeFragments": {
    "name": "efmCuPAFInLargeFragments",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.3.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah] 45.2.3.23",
    "status": "current",
    "description": "A number of fragments larger than maxFragmentSize (512 Bytes), that have been received across the gamma interface and discarded. This read-only counter is inactive when the PAF is unsupported or disabled. Upon disabling the PAF, the counter retains its previous value. If a Clause 45 MDIO Interface to the PCS is present, then this object maps to the 10P/2B PAF large fragments register."
  },
  "efmCuPAFInBadFragments": {
    "name": "efmCuPAFInBadFragments",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.3.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah] 45.2.3.25",
    "status": "current",
    "description": "A number of fragments which do not fit into the sequence expected by the frame assembly function, that have been received across the gamma interface and discarded (the frame buffer is flushed to the next valid frame start). This read-only counter is inactive when the PAF is unsupported or disabled. Upon disabling the PAF, the counter retains its previous value. If a Clause 45 MDIO Interface to the PCS is present, then this object maps to the 10P/2B PAF bad fragments register."
  },
  "efmCuPAFInLostFragments": {
    "name": "efmCuPAFInLostFragments",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.3.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah] 45.2.3.26",
    "status": "current",
    "description": "A number of gaps in the sequence of fragments, that have been received across the gamma interface (the frame buffer is flushed to the next valid frame start, when fragment/fragments expected by the frame assembly function is/are not received). This read-only counter is inactive when the PAF is unsupported or disabled. Upon disabling the PAF, the counter retains its previous value. If a Clause 45 MDIO Interface to the PCS is present, then this object maps to the 10P/2B PAF lost fragment register."
  },
  "efmCuPAFInLostStarts": {
    "name": "efmCuPAFInLostStarts",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.3.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah] 45.2.3.27",
    "status": "current",
    "description": "A number of missing StartOfPacket indicators expected by the frame assembly function. This read-only counter is inactive when the PAF is unsupported or disabled. Upon disabling the PAF, the counter retains its previous value. If a Clause 45 MDIO Interface to the PCS is present, then this object maps to the 10P/2B PAF lost start of fragment register."
  },
  "efmCuPAFInLostEnds": {
    "name": "efmCuPAFInLostEnds",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.3.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah] 45.2.3.28",
    "status": "current",
    "description": "A number of missing EndOfPacket indicators expected by the frame assembly function. This read-only counter is inactive when the PAF is unsupported or disabled. Upon disabling the PAF, the counter retains its previous value. If a Clause 45 MDIO Interface to the PCS is present, then this object maps to the 10P/2B PAF lost start of fragment register."
  },
  "efmCuPAFInOverflows": {
    "name": "efmCuPAFInOverflows",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.1.3.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah] 45.2.3.24",
    "status": "current",
    "description": "A number of fragements, received accross the gamma interface and discarded, which would have caused the frame assembly buffer to overflow. This read-only counter is inactive when the PAF is unsupported or disabled. Upon disabling the PAF, the counter retains its previous value. If a Clause 45 MDIO Interface to the PCS is present, then this object maps to the 10P/2B PAF overflow register."
  },
  "efmCuPmeNotifications": {
    "name": "efmCuPmeNotifications",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.0",
    "class": "objectidentity"
  },
  "efmCuPmeLineAtnCrossing": {
    "name": "efmCuPmeLineAtnCrossing",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.0.1",
    "class": "notificationtype",
    "objects": [
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeLineAtn"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeThreshLineAtn"
      }
    ],
    "status": "current",
    "description": "This notification indicates that the loop attenuation threshold (as per the efmCuPmeThreshLineAtn value) has been reached/exceeded for the 2BASE-TL/10PASS-TS PME. This notification MAY be send on the crossing event in both directions: from normal to exceeded and from exceeded to normal. Generation of this notification is controlled by the efmCuPmeLineAtnCrossingEnable object."
  },
  "efmCuPmeSnrMgnCrossing": {
    "name": "efmCuPmeSnrMgnCrossing",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.0.2",
    "class": "notificationtype",
    "objects": [
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeSnrMgn"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeThreshMinSnrMgn"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeThreshMaxSnrMgnDelta"
      }
    ],
    "status": "current",
    "description": "This notification indicates that the SNR margin threshold (as per the efmCuPmeThreshMinSnrMgn efmCuPmeThreshMaxSnrMgnDelta values) has been reached/exceeded for the 2BASE-TL/10PASS-TS PME. This notification MAY be send on the crossing event from normal to exceeded. Generation of this notification is controlled by the efmCuPmeSnrMgnCrossingTrapEnable object. The Interval that this is sent can be controlled by the efmCuPmeSnrMonitoringInterval object."
  },
  "efmCuPmeDeviceFault": {
    "name": "efmCuPmeDeviceFault",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.0.3",
    "class": "notificationtype",
    "objects": [
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeFltStatus"
      }
    ],
    "status": "current",
    "description": "This notification indicates that a fault in the PME has been detected by a vendor specific diagnostic or a self-test. Generation of this notification is controlled by the efmCuPmeDeviceFaultEnable object."
  },
  "efmCuPmeConfigInitFailure": {
    "name": "efmCuPmeConfigInitFailure",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.0.4",
    "class": "notificationtype",
    "objects": [
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeFltStatus"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuAdminProfile"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeAdminProfile"
      }
    ],
    "status": "current",
    "description": "This notification indicates that PME initialization has failed, due to inability of the PME link to achieve requested configuration profile. Generation of this notification is controlled by the efmCuPmeConfigInitFailEnable object."
  },
  "efmCuPmeProtocolInitFailure": {
    "name": "efmCuPmeProtocolInitFailure",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.0.5",
    "class": "notificationtype",
    "objects": [
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeFltStatus"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeOperSubType"
      }
    ],
    "status": "current",
    "description": "This notification indicates that peer PME was using incompatible protocol during initialization. Generation of this notification is controlled by the efmCuPmeProtocolInitFailEnable object."
  },
  "efmCuPmeSnrMgnCrossingClear": {
    "name": "efmCuPmeSnrMgnCrossingClear",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.0.6",
    "class": "notificationtype",
    "objects": [
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeSnrMgn"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeThreshMinSnrMgn"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeThreshMaxSnrMgnDelta"
      }
    ],
    "status": "current",
    "description": "This notification indicates that the SNR margin threshold (as per the efmCuPmeThreshMinSnrMgn efmCuPmeThreshMaxSnrMgnDelta values) has been returned within the threshold for the 2BASE-TL/10PASS-TS PME. This notification MAY be sent on the crossing event from exceeded to normal. Generation of this notification is controlled by the efmCuPmeSnrMgnCrossingTrapEnable object. The Interval that this is sent can be controlled by the efmCuPmeSnrMonitoringInterval object."
  },
  "efmCuPmeErrorThreshEfmTrafficDisable": {
    "name": "efmCuPmeErrorThreshEfmTrafficDisable",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.0.7",
    "class": "notificationtype",
    "objects": [
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeErrorThreshMonInterval"
      }
    ],
    "status": "current",
    "description": "This notification indicates that the Error threshold has seen errors for the efmCuPmeErrorThreshMonInterval consecutive seconds for the 2BASE-TL/10PASS-TS PME. This notification indicates that Efm traffic will be stopped from traversing this link. Generation of this notification is controlled by the efmCuPmeErrorThreshMonNotifyEnable object."
  },
  "efmCuPmeErrorThreshEfmTrafficEnable": {
    "name": "efmCuPmeErrorThreshEfmTrafficEnable",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.0.8",
    "class": "notificationtype",
    "objects": [
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeErrorThreshMonClrInterval"
      }
    ],
    "status": "current",
    "description": "This notification indicates that the Error threshold has seen no errors for the efmCuPmeErrorThreshMonClrInterval consecutive seconds for the 2BASE-TL/10PASS-TS PME. This notification indicates that Efm traffic will resume across this link. Generation of this notification is controlled by the efmCuPmeErrorThreshMonNotifyEnable object."
  },
  "efmCuPmeBondGroupTrafficDisabled": {
    "name": "efmCuPmeBondGroupTrafficDisabled",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.0.9",
    "class": "notificationtype",
    "status": "current",
    "description": "This notification indicates that the Efm Bond Group has no links which are active and capable of allowing traffic to traverse the bond group. This notification indicates that Efm traffic will be stopped from traversing this bond group."
  },
  "efmCuPmeBondGroupTrafficEnabled": {
    "name": "efmCuPmeBondGroupTrafficEnabled",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.0.10",
    "class": "notificationtype",
    "status": "current",
    "description": "This notification indicates that the Efm Bond Group has at least one link which is active and capable of allowing traffic to traverse the link. This notification indicates that Efm traffic will resume across this bond group."
  },
  "efmCuPmeLinkTrafficDisabled": {
    "name": "efmCuPmeLinkTrafficDisabled",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.0.11",
    "class": "notificationtype",
    "status": "current",
    "description": "This notification indicates that the Efm link is no longer capable of allowing traffic to traverse the link. This notification indicates that Efm traffic will be stopped from traversing this particular link."
  },
  "efmCuPmeLinkTrafficEnabled": {
    "name": "efmCuPmeLinkTrafficEnabled",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.0.12",
    "class": "notificationtype",
    "status": "current",
    "description": "This notification indicates that the Efm link is now capable of allowing traffic to traverse the link. This notification indicates that Efm traffic will resume across this particular Efm link."
  },
  "efmCuPmeConfTable": {
    "name": "efmCuPmeConfTable",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Table for Configuration of common aspects for EFMCu 2BASE-TL/10PASS-TS PME ports (modems). Configuration of aspects specific to 2BASE-TL or 10PASS-TS PME types is represented in efmCuPme2BConfTable and efmCuPme10PConfTable respectively. Entries in this table MUST be maintained in a persistent manner."
  },
  "efmCuPmeConfEntry": {
    "name": "efmCuPmeConfEntry",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry in the EFMCu PME Configuration table. Each entry represents common aspects of an EFMCu PME port indexed by the ifIndex. Note that an EFMCu PME port can be stacked below a single PCS port, also indexed by ifIndex, possibly together with other PME ports if PAF is enabled."
  },
  "efmCuPmeAdminSubType": {
    "name": "efmCuPmeAdminSubType",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "ieee2BaseTLO": 1,
          "ieee2BaseTLR": 2,
          "ieee10PassTSO": 3,
          "ieee10PassTSR": 4,
          "ieee2BaseTLor10PassTSR": 5,
          "ieee2BaseTLor10PassTSO": 6,
          "ieee10PassTSor2BaseTLO": 7
        }
      }
    },
    "default": {
      "default": {
        "value": "ieee2BaseTLR",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "reference": "[802.3ah] 61.1, 45.2.1.11.4, 45.2.1.11.7",
    "status": "current",
    "description": "Administrative (desired) sub-type of the PME. Possible values are: ieee2BaseTLO - PME shall operate as 2BaseTL-O ieee2BaseTLR - PME shall operate as 2BaseTL-R ieee10PassTSO - PME shall operate as 10PassTS-O ieee10PassTSR - PME shall operate as 10PassTS-R ieee2BaseTLor10PassTSR - PME shall operate as 2BaseTL-R or 10PassTS-R. Actual value will be set by -O link partner during initialization (handshake). ieee2BaseTLor10PassTSO - PME shall operate as 2BaseTL-O (preferred) or 10PassTS-O. Actual value will be set during initialization depending on -R link partner capability (i.e. if -R is incapable of the preferred 2BaseTL mode, 10PassTS will be used). ieee10PassTSor2BaseTLO - PME shall operate as 10PassTS-O (preferred) or 2BaseTL-O. Actual value will be set during initialization depending on -R link partner capability (i.e. if -R is incapable of the preferred 10PassTS mode, 2BaseTL will be used). Changing efmCuPmeAdminSubType is a traffic disruptive operation and as such SHALL be done when the link is Down. Attempts to change this object SHALL be ignored if the link is Up or Initializing. Attempts to change this object to an unsupported subtype (see efmCuPmeSubTypesSupported) SHALL be rejected. The current operational sub type is indicated by efmCuPmeOperSubType variable. If a Clause 45 MDIO Interface to the PMA/PMD is present, then this object combines values of the Port sub-type select bits and the PMA/PMD type selection bits in the 10P/2B PMA/PMD control register"
  },
  "efmCuPmeAdminProfile": {
    "name": "efmCuPmeAdminProfile",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ProfileIndexOrZero",
      "class": "type"
    },
    "maxaccess": "read-write",
    "reference": "[802.3ah] 30.11.2.1.6",
    "status": "current",
    "description": "Desired PME configuration Profile. This object is a pointer to an entry in either efmCuPme2BProfileTable or efmCuPme10PProfileTable, depending on the current operating SubType of the PME. The value of this object is the index of the referenced profile. The value of zero (default) indicates that the PME is configured via efmCuAdminProfile object for the PCS port, to which this PME is assigned. That is, the profile referenced by efmCuPmeAdminProfile takes precedence over the profile(s) referenced by efmCuAdminProfile. This object is writable and readable for the CO subtype PMEs (2BaseTL-O or 10PassTS-O). It is unavailable for the CPE subtype (2BaseTL-R or 10PassTS-R). Note that current operational Profile value is available via efmCuPmeOperProfile object. Modification of this object must be performed when the link is Down. Attempts to change this object MUST be rejected, if the link is Up or Initializing. Attempts to set this object to a value that is not the value of the index for an active entry in the corresponding profile table, MUST be rejected."
  },
  "efmCuPAFRemoteDiscoveryCode": {
    "name": "efmCuPAFRemoteDiscoveryCode",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PhysAddress",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "000000000000",
        "format": "hex"
      }
    },
    "maxaccess": "read-write",
    "reference": "[802.3ah] 61.2.2.8.4, 45.2.6.6-45.2.6.8",
    "status": "current",
    "description": "PAF Remote Discovery Code of the PME port at CO. A 6 Byte long Discovery Code of the peer PCS connected via the PME. Reading this object results in a Discovery Get operation. Writing a zero to this object results in a Discovery Clear_if_Same operation (the value of efmCuPAFDiscoveryCode at the peer PCS shall be the same as efmCuPAFDiscoveryCode of the local PCS associated with the PME for the operation to succeed). Writing a non-zero value to this object results in a Discovery Set_if_Clear operation. This object does not exist in CPE port subtypes. A zero length octet string SHALL be returned for CPE port subtypes and also when PAF aggregation is not enabled. Discovery MUST be performed when the link is Down. Attempts to change this object MUST be rejected with the error inconsistentValue, if the link is Up or Initializing. If a Clause 45 MDIO Interface to the PMA/PMD is present, then this object is a function of 10P/2B aggregation discovery control register, Discovery operation result bits in 10P/2B aggregation and discovery status register and 10P/2B aggregation discovery code register"
  },
  "efmCuPmeThreshLineAtn": {
    "name": "efmCuPmeThreshLineAtn",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": -127,
            "max": 128
          }
        ]
      }
    },
    "units": "dB",
    "maxaccess": "read-write",
    "reference": "[802.3ah] 45.2.1.36",
    "status": "current",
    "description": "Desired Line Attenuation Threshold for the 2B/10P PME. This object configures the line attenuation alarm threshold. When the current value of Line Attenuation reaches or exceeds this threshold, a efmCuPmeLineAtnCrossing notification MAY be generated, if enabled by efmCuPmeLineAtnCrossingEnable. This object is writable for the CO subtype PMEs (-O). It is read-only for the CPE subtype (-R). Changing of the Line Attenuation Threshold must be performed when the link is Down. Attempts to change this object MUST be rejected with the error inconsistentValue, if the link is Up or Initializing. If a Clause 45 MDIO Interface to the PME is present, then this object will map to the Loop attenuation threshold bits in the 2B PMD line quality thresholds register"
  },
  "efmCuPmeThreshMinSnrMgn": {
    "name": "efmCuPmeThreshMinSnrMgn",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": -127,
            "max": 128
          }
        ]
      }
    },
    "units": "dB",
    "maxaccess": "read-write",
    "status": "current",
    "description": "Desired Min SNR Margin Threshold for the 2B/10P PME. This object configures the Min SNR margin alarm threshold. When the current value of SNR Margin drops below this threshold, a efmCuPmeSnrMgnCrossing notification MAY be generated, if enabled by efmCuPmeSnrMgnCrossingTrapEnable."
  },
  "efmCuPmeLineAtnCrossingEnable": {
    "name": "efmCuPmeLineAtnCrossingEnable",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Indicates whether efmCuPmeLineAtnCrossing notifications should be generated for this interface. Value of true(1) indicates that efmCuPmeLineAtnCrossing notification is enabled. Value of false(2) indicates that the notification is disabled."
  },
  "efmCuPmeSnrMgnCrossingTrapEnable": {
    "name": "efmCuPmeSnrMgnCrossingTrapEnable",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.1.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Indicates whether efmCuPmeSnrMgnCrossing notifications should be generated for this interface. Value of true(1) indicates that efmCuPmeSnrMgnCrossing notification is enabled. Value of false(2) indicates that the notification is disabled."
  },
  "efmCuPmeDeviceFaultEnable": {
    "name": "efmCuPmeDeviceFaultEnable",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.1.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Indicates whether efmCuPmeDeviceFault notifications should be generated for this interface. Value of true(1) indicates that efmCuPmeDeviceFault notification is enabled. Value of false(2) indicates that the notification is disabled."
  },
  "efmCuPmeConfigInitFailEnable": {
    "name": "efmCuPmeConfigInitFailEnable",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.1.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Indicates whether efmCuPmeConfigInitFailure notifications should be generated for this interface. Value of true(1) indicates that efmCuPmeConfigInitFailure notification is enabled. Value of false(2) indicates that the notification is disabled."
  },
  "efmCuPmeProtocolInitFailEnable": {
    "name": "efmCuPmeProtocolInitFailEnable",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.1.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Indicates whether efmCuPmeProtocolInitFailure notifications should be generated for this interface. Value of true(1) indicates that efmCuPmeProtocolInitFailure notification is enabled. Value of false(2) indicates that the notification is disabled."
  },
  "efmCuPmeThreshMaxSnrMgnDelta": {
    "name": "efmCuPmeThreshMaxSnrMgnDelta",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.1.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 128
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 20,
        "format": "decimal"
      }
    },
    "units": "dB",
    "maxaccess": "read-write",
    "status": "current",
    "description": "Desired Max SNR Margin Threshold Delta for the 2B/10P PME. This object configures the Max SNR margin threshold delta. When the current value of SNR Margin exceeds the efmCuTargetWorstCaseSnrMgn or efmCuTargetCurrentConditionSnrMgn by more than this max SNR margin threshold delta value, then a efmCuPmeSnrMgnCrossing notification MAY be generated, if enabled by efmCuPmeSnrMgnCrossingTrapEnable. This object is writable for the CO subtype PMEs (2BaseTL-O/10PassTS-R). It is read-only for the CPE subtype (2BaseTL-R/10PassTS-R)."
  },
  "efmCuPmeMaintenanceMode": {
    "name": "efmCuPmeMaintenanceMode",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.1.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "off": 1,
          "manual": 2,
          "automaticOnce": 3,
          "automaticDaily": 4,
          "automaticContinuous": 5
        }
      }
    },
    "default": {
      "default": {
        "value": "off",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Administrative (desired) Maintenance of the PME. Possible values are: off - No monitoring of SNR values manual - Retrain line only once during the Maintenance Window specified by efmCuPmeMaintenanceStartTime and by efmCuPmeMaintenanceEndTime. automaticOnce - Monitor the SNR only once during the maintenance window, specified by efmCuPmeMaintenanceStartTime and by efmCuPmeMaintenanceEndTime. Retrain the line if the value has crossed the efmCuPmeThreshMinSnrMgn or the efmCuPmeThreshMaxSnrMgnDelta values. automaticDaily - Monitor the SNR daily during the maintenance window, specified by efmCuPmeMaintenanceStartTime and by efmCuPmeMaintenanceEndTime. Retrain the line only once each day during the maintenance window if the value has crossed the efmCuPmeThreshMinSnrMgn or the efmCuPmeThreshMaxSnrMgnDelta values. automaticContinuous - Monitor the SNR daily during the maintenance window, specified by efmCuPmeMaintenanceStartTime and by efmCuPmeMaintenanceEndTime. Retrain the line continuously during the maintenance window after each time elapsed specified by the efmCuPmeSnrMonitoringInterval, if the value has crossed the efmCuPmeThreshMinSnrMgn or the efmCuPmeThreshMaxSnrMgnDelta values. The current operational Maintenance Mode is indicated by efmCuPmeMonitorMode variable."
  },
  "efmCuPmeMaintenanceStartTime": {
    "name": "efmCuPmeMaintenanceStartTime",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.1.1.13",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "00:00",
        "format": "string"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This will represent the maintenance window start time for the maintenance to retrain the link in manual maintenance mode or the monitoring of the snr value with respect to the snr threshold values specified in efmCuPmeThreshMinSnrMgn and efmCuPmeThreshMaxSnrMgnDelta if the Maintenance Mode is set to automaticOnce or automaticDaily. The format of this string is HH:MM where HH is the military time for hour 0-23 and MM is the military time for minutes 0-59. The current Maintenance Start Time is indicated by efmCuPmeMaintenanceStartTime variable."
  },
  "efmCuPmeMaintenanceEndTime": {
    "name": "efmCuPmeMaintenanceEndTime",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.1.1.14",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "23:59",
        "format": "string"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This will represent the maintenance window end time for the maintenance to retrain the link in manual maintenance mode or the monitoring of the snr value with respect to the snr threshold values specified in efmCuPmeThreshMinSnrMgn and efmCuPmeThreshMaxSnrMgnDelta if the Maintenance Mode is set to automaticOnce or automaticDaily. The format of this string is HH:MM where HH is the military time for hour 0-23 and MM is the military time for minutes 0-59. The current Maintenance End Time is indicated by efmCuPmeMaintenanceEndTime variable."
  },
  "efmCuPmeSnrMonitoringInterval": {
    "name": "efmCuPmeSnrMonitoringInterval",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.1.1.15",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "01:00",
        "format": "string"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This will represent the snr monitoring interval for the time elapsed between the monitoring of the snr value with respect to the snr threshold values specified in efmCuPmeThreshMinSnrMgn and efmCuPmeThreshMaxSnrMgnDelta. The format of this string is HH:MM where HH is the military time for hour 0-23 and MM is the military time for minutes 0-59."
  },
  "efmCuPmeErrorThreshMonEnable": {
    "name": "efmCuPmeErrorThreshMonEnable",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.1.1.16",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This will enable/disable the error threshold monitoring. Error threshold monitoring looks for errors on the physical line. When there have been efmCuPmeErrorThreshMonInterval number of consecutive seconds with errors the line will first be taken down with a retrain in hopes of bettering the SNR to rectify the error situation. If, when the line comes up, we do not achieve efmCuPmeErrorThreshMonClrInterval number of consective error-free seconds before hitting another efmCuPmeErrorThreshMonInterval number of consecutive seconds with errors, the line will cease to be used for carrying traffic. The physical line will remain active so error monitoring can continue but data will no longer traverse until efmCuPmeErrorThreshMonClrInterval number of consecutive error-free seconds is achieved, at which time the line will resume carrying traffic."
  },
  "efmCuPmeErrorThreshMonNotifyEnable": {
    "name": "efmCuPmeErrorThreshMonNotifyEnable",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.1.1.17",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This will enable/disable the error threshold monitoring notification (via cli or alarm manager) when an error threshold has been exceeded or cleared."
  },
  "efmCuPmeErrorThreshMonInterval": {
    "name": "efmCuPmeErrorThreshMonInterval",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.1.1.18",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 3,
            "max": 65535
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 12,
        "format": "decimal"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This will specify the number of consecutive seconds of detecting errors that, once reached, will cause the physical line to be deemed a poor performer and cause an action to be taken. See efmCuPmeErrorThreshMonEnable."
  },
  "efmCuPmeErrorThreshMonClrInterval": {
    "name": "efmCuPmeErrorThreshMonClrInterval",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.1.1.19",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 3,
            "max": 65535
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 1800,
        "format": "decimal"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This will specify the number of consecutive error-free seconds that must be achieved in order to declare the physical line usable for carrying data traffic. See efmCuPmeErrorThreshMonEnable."
  },
  "efmCuPmeLinkTrfcDisablTrapEnable": {
    "name": "efmCuPmeLinkTrfcDisablTrapEnable",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.1.1.20",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "enabled": 1,
          "disabled": 2
        }
      }
    },
    "default": {
      "default": {
        "value": "disabled",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This will enable/disable the link traffic disable notification (via cli or alarm manager) when a link is capable or no longer capable of passing traffic."
  },
  "efmCuPmeCapabilityTable": {
    "name": "efmCuPmeCapabilityTable",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Table for Configuration of common aspects for EFMCu 2BASE-TL/10PASS-TS PME ports (modems). Configuration of aspects specific to 2BASE-TL or 10PASS-TS PME types is represented in efmCuPme2BConfTable and efmCuPme10PConfTable respectively. Entries in this table MUST be maintained in a persistent manner."
  },
  "efmCuPmeCapabilityEntry": {
    "name": "efmCuPmeCapabilityEntry",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry in the EFMCu PME Capability table. Each entry represents common aspects of an EFMCu PME port indexed by the ifIndex. Note that an EFMCu PME port can be stacked below a single PCS port, also indexed by ifIndex, possibly together with other PME ports if PAF is enabled."
  },
  "efmCuPmeSubTypesSupported": {
    "name": "efmCuPmeSubTypesSupported",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Bits",
      "class": "type",
      "bits": {
        "ieee2BaseTLO": 0,
        "ieee2BaseTLR": 1,
        "ieee10PassTSO": 2,
        "ieee10PassTSR": 3
      }
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah] 61.1, 45.2.1.4.1, 45.2.1.4.2, 45.2.1.12.2, 45.2.1.12.3",
    "status": "current",
    "description": "PME supported sub-types. This is a bitmap of possible sub-types. The various bit positions are: ieee2BaseTLO - PME is capable of operating as 2BaseTL-O ieee2BaseTLR - PME is capable of operating as 2BaseTL-R ieee10PassTSO - PME is capable of operating as 10PassTS-O ieee10PassTSR - PME is capable of operating as 10PassTS-R An desired mode of operation is determined by efmCuPmeAdminSubType, while efmCuPmeOperSubType relects the current operating mode. If a Clause 45 MDIO Interface to the PCS is present, then this object combines the 10PASS-TS capable and 2BASE-TL capable bits in the 10P/2B PMA/PMD speed ability register and the CO supported and CPE supported bits in the 10P/2B PMA/PMD status register"
  },
  "efmCuPmeStatusTable": {
    "name": "efmCuPmeStatusTable",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.3",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table provides common status information of EFMCu 2BASE-TL/10PASS-TS PME ports. Status information specific to 10PASS-TS PME is represented in efmCuPme10PStatusTable. This table contains live data from the equipment. As such, it is NOT persistent."
  },
  "efmCuPmeStatusEntry": {
    "name": "efmCuPmeStatusEntry",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.3.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry in the EFMCu PME Status table. Each entry represents common aspects of an EFMCu PME port indexed by the ifIndex. Note that an EFMCu PME port can be stacked below a single PCS port, also indexed by ifIndex, possibly together with other PME ports if PAF is enabled."
  },
  "efmCuPmeOperStatus": {
    "name": "efmCuPmeOperStatus",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.3.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "up": 1,
          "downNotReady": 2,
          "downReady": 3,
          "init": 4
        }
      }
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah] 30.11.2.1.3, 45.2.1.12.4",
    "status": "current",
    "description": "Current PME link Operational Status. Possible values are: up(1) - link is Up and ready to pass 64/65B encoded frames or fragments. downNotReady(2) - link is Down and the PME does not detect Handshake tones from its peer. This value may indicate a possible problem with the peer PME. downReady(3) - link is Down and the PME detects Handshake tones from its peer. init(4) - link is initializing, as a result of ifAdminStatus being set to 'up' for a particular PME or a PCS the PME is connected to. This object is intended to supplement Down state of ifOperStatus. This object partially maps to the Clause 30 attribute aPMEStatus. If a Clause 45 MDIO Interface to the PME is present, then this object partially maps to PMA/PMD link status bits in 10P/2B PMA/PMD status register."
  },
  "efmCuPmeFltStatus": {
    "name": "efmCuPmeFltStatus",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.3.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Bits",
      "class": "type",
      "bits": {
        "lossOfFraming": 0,
        "snrMgnDefect": 1,
        "lineAtnDefect": 2,
        "deviceFault": 3,
        "configInitFailure": 4,
        "protocolInitFailure": 5
      }
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah] 30.11.2.1.3, 45.2.1.2.1, 45.2.1.38, 45.2.1.39, 45.2.1.54",
    "status": "current",
    "description": "Current/Last PME link Fault Status. This is a bitmap of possible conditions. The various bit positions are: lossOfFraming - Loss of Framing for 10P or Loss of Sync word for 2B PMD or Loss of 64/65B Framing snrMgnDefect - SNR Margin dropped below the Threshold lineAtnDefect - Line Attenuation exceeds the Threshold deviceFault - Indicates a vendor-dependent diagnostic or self-test fault has been detected. configInitFailure - Configuration initialization failure, due to inability of the PME link to support configuration profile, requested during initialization. protocolInitFailure - Protocol initialization failure, due to incompatible protocol used by the Peer PME during init (that could happen if a peer PMD is G.SDHSL/VDSL modem for 2BASE-TL/10PASS-TS PME respectively). This object is intended to supplement ifOperStatus in IF-MIB. The indications hold information about the last fault. efmCuPmeFltStatus is cleared by the device restart. In addition lossOfFraming, configInitFailure and protocolInitFailure are cleared by PME init. deviceFault is cleared by successful diagnostics/test. snrMgnDefect and lineAtnDefect are cleared by SNR Margin and line Attenuation respectively returning to norm and by PME init. This object partially maps to the Clause 30 attribute aPMEStatus. If a Clause 45 MDIO Interface to the PME is present, then this object consolidates information from various PMA/PMD registers, namely: Fault bit in PMA/PMD status 1 register, 10P/2B PMA/PMD link loss register, 10P outgoing indicator bits status register, 10P incoming indicator bits status register, 2B state defects register."
  },
  "efmCuPmeOperSubType": {
    "name": "efmCuPmeOperSubType",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.3.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "ieee2BaseTLO": 1,
          "ieee2BaseTLR": 2,
          "ieee10PassTSO": 3,
          "ieee10PassTSR": 4
        }
      }
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah] 61.1, 45.2.1.11.4, 45.2.1.11.7, 45.2.1.12.4",
    "status": "current",
    "description": "Current operational sub-type of the PME. Possible values are: ieee2BaseTLO - PME operates as 2BaseTL-O ieee2BaseTLR - PME operates as 2BaseTL-R ieee10PassTSO - PME operates as 10PassTS-O ieee10PassTSR - PME operates as 10PassTS-R The operational sub type of the PME can be configured via efmCuPmeAdminSubType variable. If a Clause 45 MDIO Interface to the PMA/PMD is present, then this object combines values of the Port sub-type select bits, the PMA/PMD type selection bits in the 10P/2B PMA/PMD control register and the PMA/PMD link status bits in the 10P/2B PMA/PMD status register."
  },
  "efmCuPmeOperProfile": {
    "name": "efmCuPmeOperProfile",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.3.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ProfileIndexOrZero",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah] 30.11.2.1.7",
    "status": "current",
    "description": "PME current operating Profile. This object is a pointer to an entry in either efmCuPme2BProfileTable or efmCuPme10PProfileTable, depending on the current operating SubType of the PME as indicated by efmCuPmeOperSubType. Note that a profile entry, to which efmCuPmeOperProfile is pointing to, can be created automatically, to reflect achieved parameters in adaptive (not fixed) initialization, i.e. values of efmCuPmeOperProfile and efmCuAdminProfile or efmCuPmeAdminProfile MAY differ. The value of zero indicates that PME is down or initializing. This object partially maps to the aOperatingProfile attribute in Clause 30."
  },
  "efmCuPmeSnrMgn": {
    "name": "efmCuPmeSnrMgn",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.3.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": -127,
            "max": 128
          },
          {
            "min": 65535,
            "max": 65535
          }
        ]
      }
    },
    "units": "dB",
    "maxaccess": "read-only",
    "reference": "[802.3ah] 30.11.2.1.4, 45.2.1.16",
    "status": "current",
    "description": "The current Signal-to-Noise Ratio (SNR) margin with respect to the received signal as perceived by the local PME. The value of 65535 is returned when PME is down or initializing. This object maps to the aPMESNRMgn attribute in Clause 30. If a Clause 45 MDIO Interface is present, then this object maps to the 10P/2B RX SNR margin register."
  },
  "efmCuPmePeerSnrMgn": {
    "name": "efmCuPmePeerSnrMgn",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.3.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": -127,
            "max": 128
          },
          {
            "min": 65535,
            "max": 65535
          }
        ]
      }
    },
    "units": "dB",
    "maxaccess": "read-only",
    "reference": "[802.3ah] 45.2.1.17",
    "status": "current",
    "description": "The current SNR margin in dB with respect to the received signal, as perceived by the remote (link partner) PME. The value of 65535 is returned when PME is down or initializing. This object is not supported by -R PME subtypes. If a Clause 45 MDIO Interface is present, then this object maps to the 10P/2B link partner RX SNR margin register."
  },
  "efmCuPmeLineAtn": {
    "name": "efmCuPmeLineAtn",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.3.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": -127,
            "max": 128
          },
          {
            "min": 65535,
            "max": 65535
          }
        ]
      }
    },
    "units": "dB",
    "maxaccess": "read-only",
    "reference": "[802.3ah] 45.2.1.18",
    "status": "current",
    "description": "The current Line Attenuation in dB as perceived by the local PME. The value of 65535 is returned when PME is down or initializing. If a Clause 45 MDIO Interface is present, then this object maps to the Line Attenuation register"
  },
  "efmCuPmePeerLineAtn": {
    "name": "efmCuPmePeerLineAtn",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.3.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": -127,
            "max": 128
          },
          {
            "min": 65535,
            "max": 65535
          }
        ]
      }
    },
    "units": "dB",
    "maxaccess": "read-only",
    "reference": "[802.3ah] 45.2.1.19",
    "status": "current",
    "description": "The current Line Attenuation in dB as perceived by the remote (link partner) PME. The value of 65535 is returned when PME is down or initializing. This object is not supported by CPE port subtypes. If a Clause 45 MDIO Interface is present, then this object maps to the 20P/2B link partner Line Attenuation register."
  },
  "efmCuPmeTCCodingErrors": {
    "name": "efmCuPmeTCCodingErrors",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.3.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah] 61.3.3.1, 45.2.6.12",
    "status": "current",
    "description": "A number of 64/65-octet encapsulation errors. This counter is incremented for each 64/65-octet encapsulation error detected by the 64/65-octet receive function. The value of zero SHALL be returned when PME is down or initializing. If a Clause 45 MDIO Interface to the PME TC is present, then this object maps to the TC coding violations register (see 45.2.6.12)."
  },
  "efmCuPmeTCCrcErrors": {
    "name": "efmCuPmeTCCrcErrors",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.3.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah] 61.3.3.3, 45.2.6.11",
    "status": "current",
    "description": "A number of TC-CRC errors. This counter is incremented for each TC-CRC error detected by the 64/65-octet receive function (see 61.3.3.3 and Figure 61-19). The value of zero SHALL be returned when PME is down or initializing. If a Clause 45 MDIO Interface to the PCME TC is present, then this object maps to the TC CRC error register (see 45.2.6.11)."
  },
  "efmCuPmeSnrCrossingCnt": {
    "name": "efmCuPmeSnrCrossingCnt",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.3.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A count of the number of times that the Snr Margin crossed the threshold. This counter is incremented for each time the target snr margin specified by efmCuPmeSnrMgn exceeds the snr threshold specified by efmCuPmeThreshMinSnrMgn and efmCuPmeThreshMaxSnrMgnDelta. The value of zero SHALL be returned when PME is down or initializing."
  },
  "efmCuPmeTCDownCnt": {
    "name": "efmCuPmeTCDownCnt",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.3.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A count of the number of times that the TC Layer went down since the line has obtained link."
  },
  "efmCuPmeErrorTCDownCnt": {
    "name": "efmCuPmeErrorTCDownCnt",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.3.1.13",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A count of the number of times that the TC Layer was forced down because of the Error Monitoring Feature. "
  },
  "efmCuPmeErrorRestartCnt": {
    "name": "efmCuPmeErrorRestartCnt",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.3.1.14",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A count of the number of times that the line was forced to retrain because of the Error Monitoring Feature. "
  },
  "efmCuPmeSnrRestartCnt": {
    "name": "efmCuPmeSnrRestartCnt",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.3.1.15",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A count of the number of times that the line was forced to retrain because of the Snr Monitoring Feature. "
  },
  "efmCuPmeErrorConsecutiveSec": {
    "name": "efmCuPmeErrorConsecutiveSec",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.3.1.16",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A count of the number of consecutive seconds with an error. This value is set to zero when there is a second without an error."
  },
  "efmCuPmeErrorMaxConsecutiveSec": {
    "name": "efmCuPmeErrorMaxConsecutiveSec",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.3.1.17",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A count of the Max number of consecutive seconds with an error where there has been no need for Error Monitoring to take action on the link."
  },
  "efmCuPme2B": {
    "name": "efmCuPme2B",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.5",
    "class": "objectidentity"
  },
  "efmCuPme2BProfileTable": {
    "name": "efmCuPme2BProfileTable",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.5.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "reference": "[802.3ah] Annex 63A, 30.11.2.1.6",
    "status": "current",
    "description": "This table supports definitions of administrative and operating Profiles for 2BASE-TL PMEs. First 14 entries in this table SHALL always be defined as follows (see 802.3ah Annex 63A): -------+------+-----+--------+------------------ Profile Rate Power Region Constellation index (Kbps) (dBm) (G.991.2) -------+------+-----+--------+------------------ 1 512 13.5 1 16-TCPAM (default) 2 704 13.5 1 16-TCPAM 3 1024 13.5 1 16-TCPAM 4 2048 13.5 1 16-TCPAM 5 3072 13.5 1 32-TCPAM 6 5696 13.5 1 32-TCPAM 7 512 13.5 2 16-TCPAM 8 704 13.5 2 16-TCPAM 9 1024 13.5 2 16-TCPAM 10 2048 14.5 2 16-TCPAM 11 3072 14.5 2 32-TCPAM 12 5696 14.5 2 32-TCPAM 13 0 0 1 0 (best effort) 14 0 0 2 0 (best effort) These default entries SHALL be created during agent initialization and MUST not be deleted. Entries following the first 14, can be dynamically created and deleted, to provide custom administrative (configuration) profiles and automatic operating profiles. This table MUST be maintained in a persistent manner."
  },
  "efmCuPme2BProfileEntry": {
    "name": "efmCuPme2BProfileEntry",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.5.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPme2BProfileIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Each entry corresponds to a single 2BASE-TL PME profile. Each profile contains a set of parameters, used either for configuration or representation of a 2BASE-TL PME. In case a particular profile is referenced via efmCuPmeAdminProfile object (or efmCuAdminProfile if efmCuPmeAdminProfile is zero), it represent the desired parameters the 2BaseTL-O PME initialization. If a profile is referenced via efmCuPmeOperProfile object, it represents current operating parameters of the operational PME. Profiles may be created/deleted using the row creation/ deletion mechanism via efmCuPme2BProfileRowStatus. If an active entry is referenced, the entry MUST remain 'active' until all references are removed. Default entries MUST not be removed."
  },
  "efmCuPme2BProfileIndex": {
    "name": "efmCuPme2BProfileIndex",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.5.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ProfileIndex",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "2BASE-TL PME Profile index. This object is the unique index associated with this profile. Entries in this table are referenced via efmCuAdminProfile or efmCuPmeAdminProfile objects."
  },
  "efmCuPme2BProfileDescr": {
    "name": "efmCuPme2BProfileDescr",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.5.2.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 255
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "A textual string containing information about 2BASE-TL PME Profile. The string MAY include information about data rate and spectral limitations of this particular profile."
  },
  "efmCuPme2BRegion": {
    "name": "efmCuPme2BRegion",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.5.2.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "region1": 1,
          "region2": 2
        }
      }
    },
    "maxaccess": "read-create",
    "reference": "[802.3ah] 45.2.1.42",
    "status": "current",
    "description": "Power Spectral Density (PSD) Regional settings as specified in the relevant Regional Annex of [G.991.2]. Regional settings place limitations on the max allowed data rate, power and constellation. Possible values for this object are: region1 -- Annexes A and F (e.g. North America) region2 -- Annexes B and G (e.g. Europe) Changing of the Region must be performed when the link is Down. Attempts to change this object MUST be rejected with the error inconsistentValue, if the link is Up or Initializing. If a Clause 45 MDIO Interface to the PME is present, then this object maps to the Region bits in the 2B general parameter register."
  },
  "efmCuPme2BDataRate": {
    "name": "efmCuPme2BDataRate",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.5.2.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 15352
          }
        ]
      }
    },
    "units": "Kbps",
    "maxaccess": "read-create",
    "reference": "[802.3ah] 45.2.1.43",
    "status": "current",
    "description": "2BASE-TL PME Data Rate. The rate is fixed when the value of this object is n x 64Kbps, where n=3..60 for 16-TCPAM and n=12..89 for 32-TCPAM. The value of 0 in the administrative profile means that data rate is not fixed but is adaptive and should be set to the maximum attainable rate during line probing, under the spectral limitations placed by the efmCuPme2BRegion. If a Clause 45 MDIO Interface to the PME is present, then this object maps to the Min/Max Data Rate1 bits in the 2B PMD parameters register. This object MUST be maintained in a persistent manner."
  },
  "efmCuPme2BPower": {
    "name": "efmCuPme2BPower",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.5.2.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 0
          },
          {
            "min": 10,
            "max": 42
          }
        ]
      }
    },
    "units": "0.5 dBm",
    "maxaccess": "read-create",
    "reference": "[802.3ah] 45.2.1.43",
    "status": "current",
    "description": "Signal Transmit Power. Multiple of 0.5dBm. The value of 0 in the administrative profile means that the signal transmit power is not fixed and should be set to maximize the attainable rate, under the spectral limitations placed by the efmCuPme2BRegion. Changing of the Signal Transmit Power must be performed when the link is Down. Attempts to change this object MUST be rejected with the error inconsistentValue, if the link is Up or Initializing. If a Clause 45 MDIO Interface to the PME is present, then this object will map to the Power1 bits in the 2B PMD parameters register"
  },
  "efmCuPme2BConstellation": {
    "name": "efmCuPme2BConstellation",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.5.2.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "adaptive": 0,
          "tcpam16": 1,
          "tcpam32": 2,
          "tcpam4": 3,
          "tcpam8": 4,
          "tcpam64": 5,
          "tcpam128": 6
        }
      }
    },
    "maxaccess": "read-create",
    "reference": "[802.3ah] 45.2.1.43",
    "status": "current",
    "description": "TCPAM Constellation of the 2BASE-TL PME. The possible values are: adaptive(0) - either 16- or 32-TCPAM tcpam16(1) - 16-TCPAM tcpam32(2) - 32-TCPAM tcpam4(3) - 4-TCPAM tcpam8(4) - 8-TCPAM tcpam64(5) - 64-TCPAM tcpam128(6) - 128-TCPAM The value of adaptive(0) in the administrative profile means that the constellation is not fixed and should be set to maximize the attainable rate, under the spectral limitations placed by the efmCuPme2BRegion. If a Clause 45 MDIO Interface to the PME is present, then this object map to the Constellation1 bits in the 2B general parameter register."
  },
  "efmCuPme2BProfileRowStatus": {
    "name": "efmCuPme2BProfileRowStatus",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.5.2.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object controls creation/deletion of the associated entry in efmCuPme2BProfileTable per the semantics of RowStatus. If an 'active' entry is referenced via efmCuAdminProfile or efmCuPmeAdminProfile, the entry MUST remain 'active' until all references are removed."
  },
  "efmCuPmeNtr": {
    "name": "efmCuPmeNtr",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.5.2.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "localOsc": 1,
          "refClk8khz": 2
        }
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Network Time and Power The possible values are: localOsc(1) - use local osc for timimg refClk8khz(2) - use Backplane 8KHZ clock for timimg"
  },
  "efmCuPme10P": {
    "name": "efmCuPme10P",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.6",
    "class": "objectidentity"
  },
  "efmCuPme10PProfileTable": {
    "name": "efmCuPme10PProfileTable",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.6.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "reference": "[802.3ah] Annex 62B.3, 30.11.2.1.6",
    "status": "current",
    "description": "This table supports definitions of configuration profiles for 10PassTL PMEs. First 22 entries in this table SHALL always be defined as follows (see 802.3ah Annex 62B.3): -------+--------+----+---------+-----+------------ Profile Bandplan UPBO BandNotch DRate URate Index PSDMask# p# p# p# p# -------+--------+----+---------+-----+------------ 1 1 3 2,6,10,11 20 20(default) 2 13 5 0 20 20 3 1 1 0 20 20 4 16 0 0 100 100 5 16 0 0 70 50 6 6 0 0 50 10 7 17 0 0 30 30 8 8 0 0 30 5 9 4 0 0 25 25 10 4 0 0 15 15 11 23 0 0 10 10 12 23 0 0 5 5 13 16 0 2,5,9,11 100 100 14 16 0 2,5,9,11 70 50 15 6 0 2,6,10,11 50 10 16 17 0 2,5,9,11 30 30 17 8 0 2,6,10,11 30 5 18 4 0 2,6,10,11 25 25 19 4 0 2,6,10,11 15 15 20 23 0 2,5,9,11 10 10 21 23 0 2,5,9,11 5 5 22 30 0 0 200 50 These default entries SHALL be created by during agent initialization and MUST not be deleted. Entries following the first 22, can be dynamically created and deleted, to provide custom administrative (configuration) profiles and automatic operating profiles. This table MUST be maintained in a persistent manner."
  },
  "efmCuPme10PProfileEntry": {
    "name": "efmCuPme10PProfileEntry",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.6.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPme10PProfileIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Each entry corresponds to a single 10PASS-TS PME profile. Each profile contains a set of parameters, used either for configuration or representation of a 10PASS-TS PME. In case a particular profile is referenced via efmCuPmeAdminProfile object (or efmCuAdminProfile if efmCuPmeAdminProfile is zero), it represent the desired parameters the 10PassTS-O PME initialization. If a profile is referenced via efmCuPmeOperProfile object, it represents current operating parameters of the PME. Profiles may be created/deleted using the row creation/ deletion mechanism via efmCuPme10PProfileRowStatus. If an 'active' entry is referenced, the entry MUST remain 'active' until all references are removed. Default entries MUST not be removed."
  },
  "efmCuPme10PProfileIndex": {
    "name": "efmCuPme10PProfileIndex",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.6.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ProfileIndex",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "10PASS-TS PME Profile Index. This object is the unique index associated with this profile. Entries in this table are referenced via efmCuAdminProfile or efmCuPmeAdminProfile."
  },
  "efmCuPme10PProfileDescr": {
    "name": "efmCuPme10PProfileDescr",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.6.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 255
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "A textual string containing information about 10PASS-TS PME Profile. The string MAY include information about data rate and spectral limitations of this particular profile."
  },
  "efmCuPme10PBandplanPSDMskProfile": {
    "name": "efmCuPme10PBandplanPSDMskProfile",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.6.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "profile1": 1,
          "profile2": 2,
          "profile3": 3,
          "profile4": 4,
          "profile5": 5,
          "profile6": 6,
          "profile7": 7,
          "profile8": 8,
          "profile9": 9,
          "profile10": 10,
          "profile11": 11,
          "profile12": 12,
          "profile13": 13,
          "profile14": 14,
          "profile15": 15,
          "profile16": 16,
          "profile17": 17,
          "profile18": 18,
          "profile19": 19,
          "profile20": 20,
          "profile21": 21,
          "profile22": 22,
          "profile23": 23,
          "profile24": 24,
          "profile25": 25,
          "profile26": 26,
          "profile27": 27,
          "profile28": 28,
          "profile29": 29
        }
      }
    },
    "maxaccess": "read-create",
    "reference": "[802.3ah] Annex 62A, 30.5.1.1.22",
    "status": "current",
    "description": "10PASS-TS PME Bandplan and PSD Mask profile, as specified in 802.3ah Annex 62A. Possible values are: --------------+------------------------+-----------+--------- Profile Name PSD Mask Bands Bandplan --------------+------------------------+-----------+--------- profile1(1) - T1.424/T-U P1 FTTCab.M1 x/D/U/D/U A profile2(2) - T1.424/T-U P1 FTTEx.M1 profile3(3) - T1.424/T-U P1 FTTCab.M2 profile4(4) - T1.424/T-U P1 FTTEx.M2 profile5(5) - T1.424/T-U P1 FTTCab.M1 D/D/U/D/U profile6(6) - T1.424/T-U P1 FTTEx.M1 profile7(7) - T1.424/T-U P1 FTTCab.M2 profile8(8) - T1.424/T-U P1 FTTEx.M2 profile9(9) - T1.424/T-U P1 FTTCab.M1 U/D/U/D/x profile10(10) - T1.424/T-U P1 FTTEx.M1 profile11(11) - T1.424/T-U P1 FTTCab.M2 profile12(12) - T1.424/T-U P1 FTTEx.M2 profile13(13) - TS1 101 270-1 Pcab.M1.A x/D/U/D/U B profile14(14) - TS1 101 270-1 Pcab.M1.B profile15(15) - TS1 101 270-1 Pex.P1.M1 profile16(16) - TS1 101 270-1 Pex.P2.M1 profile17(17) - TS1 101 270-1 Pcab.M2 profile18(18) - TS1 101 270-1 Pex.P1.M2 profile19(19) - TS1 101 270-1 Pex.P2.M2 profile20(20) - TS1 101 270-1 Pcab.M1.A U/D/U/D/x profile21(21) - TS1 101 270-1 Pcab.M1.B profile22(22) - TS1 101 270-1 Pex.P1.M1 profile23(23) - TS1 101 270-1 Pex.P2.M1 profile24(24) - TS1 101 270-1 Pcab.M2 profile25(25) - TS1 101 270-1 Pex.P1.M2 profile26(26) - TS1 101 270-1 Pex.P2.M2 profile27(27) - G.993.1 F.1.2.1 (VDSLoPOTS) x/D/U/D/U F profile28(28) - G.993.1 F.1.2.2 (VDSLoTCM-ISDN) profile29(29) - G.993.1 F.1.2.3 (PSD reduction) This object maps to the aBandplanPSDMaskProfile attribute in Clause 30."
  },
  "efmCuPme10PUPBOReferenceProfile": {
    "name": "efmCuPme10PUPBOReferenceProfile",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.6.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "profile1": 1,
          "profile2": 2,
          "profile3": 3,
          "profile4": 4,
          "profile5": 5,
          "profile6": 6,
          "profile7": 7,
          "profile8": 8,
          "profile9": 9
        }
      }
    },
    "maxaccess": "read-create",
    "reference": "[802.3ah] Annex 62A.3.4, 30.5.1.1.23",
    "status": "current",
    "description": "10PASS-TS PME Upstream Power Back-Off (UPBO) Reference PSD Profile, as specified in 802.3ah Annex 62A. Possible values are: profile1(1) - T1.424/T-U Noise A M1 profile2(2) - T1.424/T-U Noise A M2 profile3(3) - T1.424/T-U Noise F M1 profile4(4) - T1.424/T-U Noise F M2 profile5(5) - ETSI TS 101 270-1 Noise A&B profile6(6) - ETSI TS 101 270-1 Noise C profile7(7) - ETSI TS 101 270-1 Noise D profile8(8) - ETSI TS 101 270-1 Noise E profile9(9) - ETSI TS 101 270-1 Noise F This object maps to the aUPBOReferenceProfile attribute in Clause 30."
  },
  "efmCuPme10PBandNotchProfiles": {
    "name": "efmCuPme10PBandNotchProfiles",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.6.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Bits",
      "class": "type",
      "bits": {
        "profile0": 0,
        "profile1": 1,
        "profile2": 2,
        "profile3": 3,
        "profile4": 4,
        "profile5": 5,
        "profile6": 6,
        "profile7": 7,
        "profile8": 8,
        "profile9": 9,
        "profile10": 10,
        "profile11": 11
      }
    },
    "maxaccess": "read-create",
    "reference": "[802.3ah] Annex 62A.3.5, 30.5.1.1.19",
    "status": "current",
    "description": "10PASS-TS PME Egress Control Band Notch Profile bitmap, as specified in 802.3ah Annex 62A. Possible values are: --------------+---------+----------+-----------+------+----- Profile Name G.991.3 T1.424/T-U TS101 270-1 StartF EndF Table Table Table (MHz) (MHz) --------------+---------+----------+-----------+------+----- profile0(0) - no profile profile1(1) - F-5 #01 - - 1.810 1.825 profile2(2) - 6-2 15-1 17 1.810 2.000 profile3(3) - F-5 #02 - - 1.907 1.912 profile4(4) - F-5 #03 - - 3.500 3.575 profile5(5) - 6-2 - 17 3.500 3.800 profile6(6) - - 15-1 - 3.500 4.000 profile7(7) - F-5 #04 - - 3.747 3.754 profile8(8) - F-5 #05 - - 3.791 3.805 profile9(9) - 6-2 - 17 7.000 7.100 profile10(10) - F-5 #06 15-1 - 7.000 7.300 profile11(11) - 6-2 15-1 1 10.100 10.150 Any combination of profiles can be specified by ORing individual profiles, for example value of 0x0622 selects profiles 2,6,10 and 11. This object maps to the aBandNotchProfile attribute in Clause 30."
  },
  "efmCuPme10PPayloadURateProfile": {
    "name": "efmCuPme10PPayloadURateProfile",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.6.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "profile5": 5,
          "profile10": 10,
          "profile15": 15,
          "profile20": 20,
          "profile25": 25,
          "profile30": 30,
          "profile50": 50,
          "profile70": 70,
          "profile100": 100
        }
      }
    },
    "maxaccess": "read-create",
    "reference": "[802.3ah] Annex 62A.3.6, 30.5.1.1.20",
    "status": "current",
    "description": "10PASS-TS PME Upstream Payload Rate Profile, as specified in 802.3ah Annex 62A. Possible values are: profile5(5) - 2.5 Mbps profile10(10) - 5 Mbps profile15(15) - 7.5 Mbps profile20(20) - 10 Mbps profile25(25) - 12.5 Mbps profile30(30) - 15 Mbps profile50(50) - 25 Mbps profile70(70) - 35 Mbps profile100(100) - 50 Mbps Each value represents a target for the PME's Upstream Payload Bitrate as seen at the MII. If the payload rate of the selected profile cannot be achieved based on the loop environment, bandplan and PSD mask, the PME initialization SHALL fail. This object maps to the aPayloadRateProfileUpstream attribute in Clause 30."
  },
  "efmCuPme10PPayloadDRateProfile": {
    "name": "efmCuPme10PPayloadDRateProfile",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.6.1.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "profile5": 5,
          "profile10": 10,
          "profile15": 15,
          "profile20": 20,
          "profile25": 25,
          "profile30": 30,
          "profile50": 50,
          "profile70": 70,
          "profile100": 100,
          "profile140": 140,
          "profile200": 200
        }
      }
    },
    "maxaccess": "read-create",
    "reference": "[802.3ah] Annex 62A.3.6, 30.5.1.1.21",
    "status": "current",
    "description": "10PASS-TS PME Downstream Payload Rate Profile, as specified in 802.3ah Annex 62A. Possible values are: profile5(5) - 2.5 Mbps profile10(10) - 5 Mbps profile15(15) - 7.5 Mbps profile20(20) - 10 Mbps profile25(25) - 12.5 Mbps profile30(30) - 15 Mbps profile50(50) - 25 Mbps profile70(70) - 35 Mbps profile100(100) - 50 Mbps profile140(140) - 70 Mbps profile200(200) - 100 Mbps Each value represents a target for the PME's Downstream Payload Bitrate as seen at the MII. If the payload rate of the selected profile cannot be achieved based on the loop environment, bandplan and PSD mask, the PME initialization SHALL fail. This object maps to the aPayloadRateProfileDownstream attribute in Clause 30."
  },
  "efmCuPme10PProfileRowStatus": {
    "name": "efmCuPme10PProfileRowStatus",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.6.1.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object controls creation/deletion of the associated entry in efmCuPme10PProfileTable per the semantics of RowStatus. If an active entry is referenced via efmCuAdminProfile or efmCuPmeAdminProfile, the entry MUST remain 'active' until all references are removed."
  },
  "efmCuPme10PStatusTable": {
    "name": "efmCuPme10PStatusTable",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.6.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Table reflecting status of EFMCu 10PASS-TS PMEs (modems)."
  },
  "efmCuPme10PStatusEntry": {
    "name": "efmCuPme10PStatusEntry",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.6.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "augmention": {
      "name": "efmCuPme10PStatusEntry",
      "module": "EFM-CU-MIB",
      "object": "efmCuPmeStatusEntry"
    },
    "status": "current",
    "description": "An entry in the EFMCu 10PASS-TS PME Status table."
  },
  "efmCuPme10PElectricalLength": {
    "name": "efmCuPme10PElectricalLength",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.6.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 8192
          },
          {
            "min": 65535,
            "max": 65535
          }
        ]
      }
    },
    "units": "m",
    "maxaccess": "read-only",
    "reference": "[802.3ah] 45.2.1.21",
    "status": "current",
    "description": "Electrical Length in meters as perceived by the 10PASS-TS PME after the link is established. The value of 65535 is returned if the link is Down or Initializing or the PME is unable to estimate the Electrical Length. If a Clause 45 MDIO Interface to the PME is present, then this object maps to the 10P Electrical Length register"
  },
  "efmCuPme10PFECCorrectedBlocks": {
    "name": "efmCuPme10PFECCorrectedBlocks",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.6.2.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah] 45.2.1.22",
    "status": "current",
    "description": "A count of received and corrected FEC codewords in 10PASS-TS PME. This object maps to aPMEFECCorrectedBlocks attribute in clause 30. If a Clause 45 MDIO Interface to the PMA/PMD is present, then this object maps to the 10P FEC correctable errors register"
  },
  "efmCuPme10PFECUncorrectedBlocks": {
    "name": "efmCuPme10PFECUncorrectedBlocks",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.2.6.2.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah] 45.2.1.23",
    "status": "current",
    "description": "A count of received FEC codewords in 10PASS-TS PME, which are uncorrectable. This object maps to aPMEFECUncorrectableBlocks attribute in clause 30. If a Clause 45 MDIO Interface to the PMA/PMD is present, then this object maps to the 10P FEC uncorrectable errors register"
  },
  "ifAvailableStackTable": {
    "name": "ifAvailableStackTable",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.3",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "reference": "ifStackTable of RFC 2863",
    "status": "current",
    "description": "This table, modeled after ifStackTable from [IF-MIB], contains information on the possible 'on-top-of' relationships between the multiple sub-layers of network interfaces (as opposed to actual relationships in ifStackTable). In particular, it contains information on which PCS ports (sublayers) can possibly run 'on top of' which PMEs (sublayers), as determined by cross-connect capability of the EFMCu device, where each sub-layer corresponds to a conceptual row in the ifTable. For example, when the PCS port with ifIndex value x can be connected to run on top of the PME with ifIndex value y, then this table contains: ifAvailableStackStatus.x.y=capable Note that there's always at least on PCS for each PME and at least one PME for each PCS in the EFMCu devices, with efmCuPAFCapacity and efmCuPeerPAFCapacity indicating maximum number of PMEs which can be aggregated by local and remote PCS port respectively. This table is read only as it describes device capability"
  },
  "ifAvailableStackEntry": {
    "name": "ifAvailableStackEntry",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.3.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "EFM-CU-MIB",
        "object": "ifAvailableStackHigherLayer",
        "implied": 0
      },
      {
        "module": "EFM-CU-MIB",
        "object": "ifAvailableStackLowerLayer",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Information on a particular relationship between two sub-layers, specifying that one sub-layer (PCS) runs on 'top' of the other sub-layer (PME). Each sub-layer corresponds to a conceptual row in the ifTable (interface index for PCS and PME respectively)."
  },
  "ifAvailableStackHigherLayer": {
    "name": "ifAvailableStackHigherLayer",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.3.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InterfaceIndex",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The value of ifIndex corresponding to the higher sub-layer of the 'cross-connect capability' relationship, i.e., the PCS sub-layer which MAY run on 'top' of the PME sub-layer identified by the corresponding instance of ifAvailableStackLowerLayer."
  },
  "ifAvailableStackLowerLayer": {
    "name": "ifAvailableStackLowerLayer",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.3.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InterfaceIndex",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The value of ifIndex corresponding to the lower sub-layer of the 'cross-connect capability' relationship, i.e., the PME sub-layer which MAY run 'below' the PCS sub-layer identified by the corresponding instance of ifAvailableStackHigherLayer."
  },
  "ifAvailableStackStatus": {
    "name": "ifAvailableStackStatus",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.3.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "capable": 1,
          "outOfService": 2
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The status of the 'cross-connect capability' relationship between two sub-layers. The following values are defined: capable(1) - the PME sub-layer interface, identified by the ifAvailableStackLowerLayer MAY be connected to run 'below' the PCS sub-layer interface, identified by the ifAvailableStackLowerLayer. outOfService(2) - the PME sub-layer interface cannot be connected due to unavailability of the interface. Note that PME availability per PCS, indicated by 'capable' value, can be constrained by other parameters, for example by aggregation capacity of a PCS or by the PME in question being already connected to another PCS. So, in order to ensure that a particular PME can be connected to the PCS, all respective parameters (e.g. ifAvailableStackTable, ifStackTable and efmCuPAFCapacity) SHALL be inspected. This object is read only, unlike ifStackStatus, as it describes the device capability."
  },
  "efmCuRegeneratorStats": {
    "name": "efmCuRegeneratorStats",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.4",
    "class": "objectidentity"
  },
  "efmCuRegeneratorStatusTable": {
    "name": "efmCuRegeneratorStatusTable",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.4.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Each EFMCu Regenerator Status table contains performance status aspects of SHDSL modems for nodes on a span of SHDSL regenerators connected to an EFMCu SHDSL port. This table contains live data from the equipment. As such, it is NOT persistent."
  },
  "efmCuRegeneratorStatusEntry": {
    "name": "efmCuRegeneratorStatusEntry",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.4.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuRegenIndex",
        "implied": 0
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuRegenSide",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "This is an entry in the EFMCu Regenerator Status table. Each entry contains performance status aspects of a particular SHDSL modem for a node on a span of SHDSL regenerators connected to an EFMCu SHDSL port. Each entry is indexed by the ifIndex, the address of the node and if the modem at the node is on the network or customer side of the node. The LTU-C is the CO node and it has no network side modem. The LTU-R is the CPE node and it has no customer side modem. All regenerators 1-8 have both network and customer side modems."
  },
  "efmCuRegenIndex": {
    "name": "efmCuRegenIndex",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.4.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "ltu-c": 1,
          "ltu-r": 2,
          "regenerator-1": 3,
          "regenerator-2": 4,
          "regenerator-3": 5,
          "regenerator-4": 6,
          "regenerator-5": 7,
          "regenerator-6": 8,
          "regenerator-7": 9,
          "regenerator-8": 10
        }
      }
    },
    "units": "Address",
    "maxaccess": "not-accessible",
    "reference": "ITU G.991.2 9.5.5.5 Unit Addresses",
    "status": "current",
    "description": "The unit address of the regenerator node in the SHDSL span. 1 = STU C (CO) 2 = STU R (CPE) 3 through 10 = Regenerators 1 - 8"
  },
  "efmCuRegenSide": {
    "name": "efmCuRegenSide",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.4.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "network": 1,
          "customer": 2
        }
      }
    },
    "units": "Side",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Specification if the modem is on the network or customer side of the node. Repeaters have both network (up stream) and customer (down stream) facing modems. The CO only has a customer facing modem. The CPE only has a network facing modem."
  },
  "efmCuRegenSNR": {
    "name": "efmCuRegenSNR",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.4.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type"
    },
    "units": "tenths of dB",
    "maxaccess": "read-only",
    "reference": "ITU G.991.2 9.5.5.7.14 SHDSL Network Side Performance Status",
    "status": "current",
    "description": "The current SHDSL Signal-to-Noise Ratio (SNR) margin with respect to the received signal as perceived by the specific SHDSL modem in the span. The value is reported in tenths of a dB. A value of 65535 is returned when the port is down."
  },
  "efmCuRegenLineAttn": {
    "name": "efmCuRegenLineAttn",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.4.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type"
    },
    "units": "tenths of dB",
    "maxaccess": "read-only",
    "reference": "ITU G.991.2 9.5.5.7.14 SHDSL Network Side Performance Status",
    "status": "current",
    "description": "The current SHDSL Line Attenuation as perceived by the specific SHDSL modem in the span. The value is reported in tenths of a dB. A value of 65535 is returned when the port is down."
  },
  "efmCuRegenCRC": {
    "name": "efmCuRegenCRC",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.4.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "Errors",
    "maxaccess": "read-only",
    "reference": "ITU G.991.2 9.5.5.7.14 SHDSL Network Side Performance Status",
    "status": "current",
    "description": "The current SHDSL count of CRC Anomalies as perceived by the specific SHDSL modem in the span. This value is reset when the port is down."
  },
  "efmCuRegenES": {
    "name": "efmCuRegenES",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.4.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "Seconds",
    "maxaccess": "read-only",
    "reference": "ITU G.991.2 9.5.5.7.14 SHDSL Network Side Performance Status",
    "status": "current",
    "description": "The current SHDSL count of Errored Seconds as perceived by the specific SHDSL modem in the span. This value is reset when the port is down."
  },
  "efmCuRegenSES": {
    "name": "efmCuRegenSES",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.4.1.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "Seconds",
    "maxaccess": "read-only",
    "reference": "ITU G.991.2 9.5.5.7.14 SHDSL Network Side Performance Status",
    "status": "current",
    "description": "The current SHDSL count of Severely Errored Seconds as perceived by the specific SHDSL modem in the span. This value is reset when the port is down."
  },
  "efmCuRegenUAS": {
    "name": "efmCuRegenUAS",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.4.1.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "Seconds",
    "maxaccess": "read-only",
    "reference": "ITU G.991.2 9.5.5.7.14 SHDSL Network Side Performance Status",
    "status": "current",
    "description": "The current SHDSL count of Unavailable Seconds as perceived by the specific SHDSL modem in the span. This value is reset when the port is down."
  },
  "efmCuRegenLOSWS": {
    "name": "efmCuRegenLOSWS",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.4.1.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "units": "Seconds",
    "maxaccess": "read-only",
    "reference": "ITU G.991.2 9.5.5.7.14 SHDSL Network Side Performance Status",
    "status": "current",
    "description": "The current SHDSL Loss of Sync Word Second (LOSWS) defect count as perceived by the specific SHDSL modem in the span. This value is reset when the port is down. "
  },
  "efmCuRegenDCAlarm": {
    "name": "efmCuRegenDCAlarm",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.4.1.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "no": 1,
          "yes": 2
        }
      }
    },
    "units": "Alarm",
    "maxaccess": "read-only",
    "reference": "ITU G.991.2 9.5.5.7.14 SHDSL Network Side Performance Status",
    "status": "current",
    "description": "The DC Continuity Fault indicator. This is used to indicate conditions that interfere with span powering such as shorts and open circuits. A value of No is returned when the port is down or initializing."
  },
  "efmCuRegenClearCounts": {
    "name": "efmCuRegenClearCounts",
    "oid": "1.3.6.1.4.1.5504.10.1.7.1.4.1.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "normalCounts": 1,
          "clearCounts": 2
        }
      }
    },
    "default": {
      "default": {
        "value": "normalCounts",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This leaf is used to clear SHDSL Regenerator Status counters. When the value is set to clearCounts (2) the stats are cleared for this SHDSL port, regenerator node address, and modem side. Once the stats have been cleared a read of this entry returns the value for normalCounts (1). The only valid user settable value is clearCounts and when set the following counts are cleared: SHDSL count of CRC Anomalies SHDSL count of Errored Seconds SHDSL count of Severely Errored Seconds SHDSL count of Unavailable Seconds SHDSL Loss of Sync Word Second (LOSWS) defect count"
  },
  "efmCuGroups": {
    "name": "efmCuGroups",
    "oid": "1.3.6.1.4.1.5504.10.1.7.2.1",
    "class": "objectidentity"
  },
  "efmCuCompliances": {
    "name": "efmCuCompliances",
    "oid": "1.3.6.1.4.1.5504.10.1.7.2.2",
    "class": "objectidentity"
  },
  "efmCuBasicGroup": {
    "name": "efmCuBasicGroup",
    "oid": "1.3.6.1.4.1.5504.10.1.7.2.1.1",
    "class": "objectgroup",
    "objects": [
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPAFSupported"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuAdminProfile"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuTargetDataRate"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuTargetWorstCaseSnrMgn"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPortSide"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuFltStatus"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuTargetCurrentConditionMode"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuTargetCurrentConditionSnrMgn"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuTargetWorstCaseMode"
      }
    ],
    "status": "current",
    "description": "A collection of objects required for all of EFMCu ports."
  },
  "efmCuPAFGroup": {
    "name": "efmCuPAFGroup",
    "oid": "1.3.6.1.4.1.5504.10.1.7.2.1.2",
    "class": "objectgroup",
    "objects": [
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPeerPAFSupported"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPAFCapacity"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPeerPAFCapacity"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPAFAdminState"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPAFDiscoveryCode"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPAFRemoteDiscoveryCode"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuNumPMEs"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "ifAvailableStackStatus"
      }
    ],
    "status": "current",
    "description": "A collection of objects required for optional PME Aggregation Function (PAF) and PAF discovery in EFMCu ports."
  },
  "ifStackCapabilityGroup": {
    "name": "ifStackCapabilityGroup",
    "oid": "1.3.6.1.4.1.5504.10.1.7.2.1.3",
    "class": "objectgroup",
    "objects": [
      {
        "module": "EFM-CU-MIB",
        "object": "ifAvailableStackStatus"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing information on the stacking capability of MIB-II interfaces."
  },
  "efmCuPAFErrorsGroup": {
    "name": "efmCuPAFErrorsGroup",
    "oid": "1.3.6.1.4.1.5504.10.1.7.2.1.4",
    "class": "objectgroup",
    "objects": [
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPAFInErrors"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPAFInSmallFragments"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPAFInLargeFragments"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPAFInBadFragments"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPAFInLostFragments"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPAFInLostStarts"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPAFInLostEnds"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPAFInOverflows"
      }
    ],
    "status": "current",
    "description": "A collection of objects supporting optional error counters of PAF on EFMCu ports."
  },
  "efmCuPmeGroup": {
    "name": "efmCuPmeGroup",
    "oid": "1.3.6.1.4.1.5504.10.1.7.2.1.5",
    "class": "objectgroup",
    "objects": [
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeAdminProfile"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeOperStatus"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeFltStatus"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeSubTypesSupported"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeAdminSubType"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeOperSubType"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPAFRemoteDiscoveryCode"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeOperProfile"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeSnrMgn"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmePeerSnrMgn"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeLineAtn"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmePeerLineAtn"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeTCCodingErrors"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeTCCrcErrors"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeThreshLineAtn"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeThreshMinSnrMgn"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeThreshMaxSnrMgnDelta"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing information about a 2BASE-TL/10PASS-TS PME."
  },
  "efmCuAlarmConfGroup": {
    "name": "efmCuAlarmConfGroup",
    "oid": "1.3.6.1.4.1.5504.10.1.7.2.1.6",
    "class": "objectgroup",
    "objects": [
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuThreshLowBandwidth"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuLowBandwidthEnable"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeThreshLineAtn"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeLineAtnCrossingEnable"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeThreshMinSnrMgn"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeSnrMgnCrossingTrapEnable"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeLineAtnCrossingEnable"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeDeviceFaultEnable"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeConfigInitFailEnable"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeProtocolInitFailEnable"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeThreshMaxSnrMgnDelta"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeMaintenanceMode"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeMaintenanceStartTime"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeMaintenanceEndTime"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeSnrMonitoringInterval"
      }
    ],
    "status": "current",
    "description": "A collection of objects required for configuration of alarm thresholds and notifications in EFMCu ports."
  },
  "efmCuNotificationGroup": {
    "name": "efmCuNotificationGroup",
    "oid": "1.3.6.1.4.1.5504.10.1.7.2.1.7",
    "class": "notificationgroup",
    "objects": [
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuLowBandwidth"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeLineAtnCrossing"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeSnrMgnCrossing"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeDeviceFault"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeConfigInitFailure"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeProtocolInitFailure"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPmeSnrMgnCrossingClear"
      }
    ],
    "status": "current",
    "description": "This group supports notifications of significant conditions associated with EFMCu ports."
  },
  "efmCuPme2BProfileGroup": {
    "name": "efmCuPme2BProfileGroup",
    "oid": "1.3.6.1.4.1.5504.10.1.7.2.1.8",
    "class": "objectgroup",
    "objects": [
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPme2BProfileDescr"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPme2BRegion"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPme2BDataRate"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPme2BPower"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPme2BConstellation"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPme2BProfileRowStatus"
      }
    ],
    "status": "current",
    "description": "A collection of objects that constitute a configuration profile for configuration of 2BASE-TL ports."
  },
  "efmCuPme10PProfileGroup": {
    "name": "efmCuPme10PProfileGroup",
    "oid": "1.3.6.1.4.1.5504.10.1.7.2.1.9",
    "class": "objectgroup",
    "objects": [
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPme10PProfileDescr"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPme10PBandplanPSDMskProfile"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPme10PUPBOReferenceProfile"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPme10PBandNotchProfiles"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPme10PPayloadURateProfile"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPme10PPayloadDRateProfile"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPme10PProfileRowStatus"
      }
    ],
    "status": "current",
    "description": "A collection of objects that constitute a configuration profile for configuration of 10PASS-TS ports."
  },
  "efmCuPme10PStatusGroup": {
    "name": "efmCuPme10PStatusGroup",
    "oid": "1.3.6.1.4.1.5504.10.1.7.2.1.10",
    "class": "objectgroup",
    "objects": [
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPme10PElectricalLength"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPme10PFECCorrectedBlocks"
      },
      {
        "module": "EFM-CU-MIB",
        "object": "efmCuPme10PFECUncorrectedBlocks"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing status information specific to 10PASS-TS PMEs."
  },
  "efmCuCompliance": {
    "name": "efmCuCompliance",
    "oid": "1.3.6.1.4.1.5504.10.1.7.2.2.1",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "efmCuBasicGroup",
        "module": "EFM-CU-MIB"
      },
      {
        "object": "efmCuPmeGroup",
        "module": "EFM-CU-MIB"
      },
      {
        "object": "efmCuAlarmConfGroup",
        "module": "EFM-CU-MIB"
      },
      {
        "object": "efmCuNotificationGroup",
        "module": "EFM-CU-MIB"
      },
      {
        "object": "efmCuPme2BProfileGroup",
        "module": "EFM-CU-MIB"
      },
      {
        "object": "efmCuPme10PProfileGroup",
        "module": "EFM-CU-MIB"
      },
      {
        "object": "efmCuPAFGroup",
        "module": "EFM-CU-MIB"
      },
      {
        "object": "ifStackCapabilityGroup",
        "module": "EFM-CU-MIB"
      },
      {
        "object": "efmCuPAFErrorsGroup",
        "module": "EFM-CU-MIB"
      },
      {
        "object": "efmCuPme10PStatusGroup",
        "module": "EFM-CU-MIB"
      }
    ],
    "status": "current",
    "description": "The compliance statement for 2BASE-TL/10PASS-TS interfaces. Compliance with the following external compliance statements is prerequisite: MIB Module Compliance Statement ---------- -------------------- IF-MIB ifCompliance3 IF-INVERTED-STACK-MIB ifInvCompliance EtherLike-MIB dot3Compliance2 MAU-MIB mauModIfCompl3"
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/EFM-CU-MIB",
      "Produced by pysmi-0.3.4 at Fri May 24 18:20:11 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "EFM-CU-MIB"
  }
}