{
  "imports": {
    "class": "imports",
    "ENTERASYS-MIB-NAMES": [
      "etsysModules"
    ],
    "SNMP-FRAMEWORK-MIB": [
      "SnmpAdminString"
    ],
    "SNMPv2-CONF": [
      "OBJECT-GROUP",
      "NOTIFICATION-GROUP",
      "MODULE-COMPLIANCE"
    ],
    "SNMPv2-SMI": [
      "TimeTicks",
      "Integer32",
      "iso",
      "MibIdentifier",
      "OBJECT-TYPE",
      "Counter32",
      "Counter64",
      "Bits",
      "Gauge32",
      "IpAddress",
      "MODULE-IDENTITY",
      "Unsigned32",
      "OBJECT-IDENTITY",
      "NOTIFICATION-TYPE"
    ],
    "SNMPv2-TC": [
      "DateAndTime",
      "RowStatus",
      "DisplayString",
      "TEXTUAL-CONVENTION"
    ]
  },
  "etsysConfigurationManagementMIB": {
    "name": "etsysConfigurationManagementMIB",
    "oid": "1.3.6.1.4.1.5624.1.2.16",
    "class": "moduleidentity",
    "revisions": [
      {
        "revision": "2008-12-05 14:13",
        "description": "Added Secure Copy (SCP) as a supported URL type."
      },
      {
        "revision": "2002-10-03 20:21",
        "description": "Updated the Security Considerations section."
      },
      {
        "revision": "2002-09-30 17:02",
        "description": "Added a bootPromDownload bit to the ConfigMgmtOperations textual convention."
      },
      {
        "revision": "2001-12-03 19:49",
        "description": "The initial version of this MIB module."
      }
    ],
    "lastupdated": "200812051413Z",
    "organization": "Enterasys Networks, Inc",
    "contactinfo": "Postal: Enterasys Networks, Inc. 50 Minuteman Rd. Andover, MA 01810-1008 USA Phone: +1 978 684 1000 E-mail: support@enterasys.com WWW: http://www.enterasys.com",
    "description": "This MIB module defines a portion of the SNMP MIB under Enterasys Networks' enterprise OID pertaining to configuration management."
  },
  "etsysConfigMgmtStatus": {
    "name": "etsysConfigMgmtStatus",
    "oid": "1.3.6.1.4.1.5624.1.2.16.1",
    "class": "objectidentity"
  },
  "etsysConfigMgmtChange": {
    "name": "etsysConfigMgmtChange",
    "oid": "1.3.6.1.4.1.5624.1.2.16.2",
    "class": "objectidentity"
  },
  "etsysConfigMgmtConformance": {
    "name": "etsysConfigMgmtConformance",
    "oid": "1.3.6.1.4.1.5624.1.2.16.3",
    "class": "objectidentity"
  },
  "ConfigMgmtOperations": {
    "name": "ConfigMgmtOperations",
    "class": "textualconvention",
    "type": {
      "type": "Bits",
      "class": "type",
      "bits": {
        "resetHardware": 0,
        "resetSoftware": 1,
        "imageDownload": 2,
        "imageDownloadNonPersistent": 3,
        "configurationReset": 4,
        "configurationUpload": 5,
        "configurationDownload": 6,
        "imageSetSelected": 7,
        "imageGetSelected": 8,
        "configurationActivate": 9,
        "configurationAppend": 10,
        "configurationPersist": 11,
        "configurationParse": 12,
        "validationMD5sum": 13,
        "bootPromDownload": 14
      }
    },
    "status": "current",
    "description": "Operations that can be used to effect the configuration of the managed entity. ------------------------------------------------------- -- Any or all of these operations MAY be supported on -- all devices. ------------------------------------------------------- resetHardware - Initiate a hardware reset. If this operation is requested in conjunction with other operations than this operation should be performed only after all of the other requested operations have completed successfully. resetSoftware - Initiate a software reset. If this operation is requested in conjunction with other operations than this operation should be performed only after all of the other requested operations have completed successfully. imageDownload - The managed entity will initiate an image download using the least disruptive method available to it given the specified protocol. The downloaded image WILL be stored in persistent storage. This operation MAY initiate a reset. bootPromDownload - The managed entity will initiate a boot PROM download using the least disruptive method available to it given the specified protocol. The downloaded boot PROM WILL be stored in persistent storage. This operation MAY initiate a reset. imageDownloadNonPersistent - The managed entity will initiate an image download using the least disruptive method available to it given the specified protocol. This operation WILL cause the managed entity to reset. The managed entity will not execute the new image on subsequent resets. configurationReset - Reset the configuration to the factory default state. This operation MAY initiate a reset. configurationUpload - The managed entity will transfer the currently active configuration to the specified destination. The destination may be a local file on entities that support a user file system. configurationDownload - The managed entity will initiate a configuration file download using the least disruptive method available to it given the specified protocol. The downloaded configuration WILL be stored in persistent storage. This operation MAY cause the managed entity to reset. validationMD5sum, - The system will calculate the MD5 message digest, as specified in RFC1321, for the file specified in etsysConfigMgmtChangeURL and compare that with the value of the etsysConfigMgmtChangeValidationString object. If this operation is requested in conjunction with other operations then this operation MUST be initiated as soon as practical and all operations MUST be terminated/aborted as soon as practical if the calculated value does not match the specified value. If the etsysConfigMgmtChangeValidationString is empty the calculate the MD5 message digest will be returned in that object. ------------------------------------------------------- -- Any or all of these operations MAY be supported on -- devices that have user file systems. ------------------------------------------------------- imageSetSelected - The file specified in etsysConfigMgmtChangeURL is selected as the boot image. Although a reset MAY be required to execute the selected boot image this operation WILL NOT initiate a reset. This operation will fail if the specified file is not a valid boot image. imageGetSelected - The file selected as the boot image is returned in etsysConfigMgmtChangeURL. This operation MUST NOT be used in conjunction with any other operations. configurationActivate - The configuration file specified in the etsysConfigMgmtChangeURL is applied to the factory default configuration and the result becomes the active configuration. If the entity does not support the configurationPersist operation the result also becomes the start-up configuration. This operation MAY initiate a reset operation. configurationAppend - The configuration file specified in the etsysConfigMgmtChangeURL is applied to the active configuration and the result becomes the active configuration. If the entity does not support the configurationPersist operation the result also becomes the start-up configuration. This operation SHOULD NOT initiate a reset operation. configurationPersist - The active configuration will be save to persistent storage and become the start-up configuration. This operation WILL NOT initiate a reset operation. configurationParse - The configuration file specified in the etsysConfigMgmtChangeURL is parsed for errors. This operation WILL NOT effect active configuration. This operation WILL NOT initiate a reset operation."
  },
  "etsysConfigMgmtCurrentImageURL": {
    "name": "etsysConfigMgmtCurrentImageURL",
    "oid": "1.3.6.1.4.1.5624.1.2.16.1.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The URL of the last image to be successfully loaded into memory. Return an empty string if this feature is not supported or the information is unavailable."
  },
  "etsysConfigMgmtCurrentConfigURL": {
    "name": "etsysConfigMgmtCurrentConfigURL",
    "oid": "1.3.6.1.4.1.5624.1.2.16.1.2",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The URL of the last configuration file to be successfully loaded into memory. Return an empty string if this feature is not supported or the information is unavailable."
  },
  "etsysConfigMgmtPersistentStorageStatus": {
    "name": "etsysConfigMgmtPersistentStorageStatus",
    "oid": "1.3.6.1.4.1.5624.1.2.16.1.3",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A descriptive status of any current failures of any of the persistent storage facilities on this entity. When this information is unavailable return a null string. 'operational' should be returned if there are no problems. Transitional information MAY be reported as well."
  },
  "etsysConfigMgmtPersistentStorageCkSum": {
    "name": "etsysConfigMgmtPersistentStorageCkSum",
    "oid": "1.3.6.1.4.1.5624.1.2.16.1.4",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The MD5 message digest, as specified in RFC1321, for the persistent configuration information. This object MAY be used by management applications to detect changes to the configuration of the managed entity. If it is not possible to compute this value return an empty string."
  },
  "etsysConfigMgmtChangeLimit": {
    "name": "etsysConfigMgmtChangeLimit",
    "oid": "1.3.6.1.4.1.5624.1.2.16.2.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 4294967295
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The maximum number of configuration change requests this entity can hold in the etsysConfigMgmtChangeTable. A value of 0 indicates no configured limit."
  },
  "etsysConfigMgmtChangeCurrent": {
    "name": "etsysConfigMgmtChangeCurrent",
    "oid": "1.3.6.1.4.1.5624.1.2.16.2.2",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of configuration change requests currently in the etsysConfigMgmtChangeTable."
  },
  "etsysConfigMgmtChangeCompleted": {
    "name": "etsysConfigMgmtChangeCompleted",
    "oid": "1.3.6.1.4.1.5624.1.2.16.2.3",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of configuration change requests that have completed successfully or otherwise. This object should be stored in persistent memory."
  },
  "etsysConfigMgmtChangeSupportedURLs": {
    "name": "etsysConfigMgmtChangeSupportedURLs",
    "oid": "1.3.6.1.4.1.5624.1.2.16.2.4",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Bits",
      "class": "type",
      "bits": {
        "etsysConfigMgmtFtp": 0,
        "etsysConfigMgmtRcp": 1,
        "etsysConfigMgmtHttp": 2,
        "etsysConfigMgmtTftp": 3,
        "etsysConfigMgmtFile": 4,
        "etsysConfigMgmtBootP": 5,
        "etsysConfigMgmtScp": 6
      }
    },
    "maxaccess": "read-only",
    "reference": "RFC 1738 - Uniform Resource Locators (URL), RFC 2396 - Uniform Resource Identifiers (URI): Generic Syntax",
    "status": "current",
    "description": "The URLs that this entity supports for transferring files. These define the transfer protocols and remote file names. etsysConfigMgmtFtp - As per rfc1738 ftp://<user>:<password>@<host>:<port>/<url-path> url-path: <cwd1>/<cwd2>/.../<cwdN>/<name>;type=<typecode> user defaults to anonymous, password to snmp@<domain-name>, port to 21, and type to ASCII. binary and image are both valid types which have the same meaning. domain-name would be the IP address or domain name of the managed entity. etsysConfigMgmtRcp - rcp://<user>@<host>:<port>/<cwd1>/<cwd2>/.../<cwdN>/<name> port defaults to 514. etsysConfigMgmtHttp - As per rfc1738 http://<host>:<port>/<path>?<searchpart> port defaults to 80. etsysConfigMgmtTftp - tftp://<host>:<port>/<cwd1>/<cwd2>/.../<cwdN>/<name> port defaults to 69. etsysConfigMgmtFile - As per rfc1738 file://<host>/<path> host can only be specified as localhost or the empty string. This will only be used to specify a file on the managed entity. This indicates that the managed entity supports some form of a user file system. etsysConfigMgmtBootP - bootp://<host> host specifies the default gateway, or bootp server that the bootp request should be directed to. etsysConfigMgmtScp - scp://<user>:<password>@<host>:<port>/<cwd1>/<cwd2>/.../<cwdN>/<name> host as defined in RFC1738. port defaults to 22."
  },
  "etsysConfigMgmtChangeSupportedOperations": {
    "name": "etsysConfigMgmtChangeSupportedOperations",
    "oid": "1.3.6.1.4.1.5624.1.2.16.2.5",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "ConfigMgmtOperations",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Configuration change operations that are supported on this managed entity. A managed entity should provide support only for the options that make sense given the capabilities of the entity and the desired level of manageability."
  },
  "etsysConfigMgmtChangeNextAvailableIndex": {
    "name": "etsysConfigMgmtChangeNextAvailableIndex",
    "oid": "1.3.6.1.4.1.5624.1.2.16.2.6",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 4294967295
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the numerically lowest available index within this entity, which may be used for the value of etsysConfigMgmtChangeIndex in the creation of a new entry in the etsysConfigMgmtChangeTable. An index is considered available if the index value falls within the range of 1 to etsysConfigMgmtChangeLimit and is not being used to index an existing entry in the etsysConfigMgmtChangeTable contained within this entity. A value of zero indicates that all of the entries in the etsysConfigMgmtChangeTable are currently in use. This value should only be considered a guideline for management creation of etsysConfigMgmtChangeTable entries, there is no requirement on management to create entries based upon this index value."
  },
  "etsysConfigMgmtChangeTable": {
    "name": "etsysConfigMgmtChangeTable",
    "oid": "1.3.6.1.4.1.5624.1.2.16.2.7",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table that describes a single configuration change request."
  },
  "etsysConfigMgmtChangeEntry": {
    "name": "etsysConfigMgmtChangeEntry",
    "oid": "1.3.6.1.4.1.5624.1.2.16.2.7.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "ENTERASYS-CONFIGURATION-MANAGEMENT-MIB",
        "object": "etsysConfigMgmtChangeIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry describing the configuration change request."
  },
  "etsysConfigMgmtChangeIndex": {
    "name": "etsysConfigMgmtChangeIndex",
    "oid": "1.3.6.1.4.1.5624.1.2.16.2.7.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 4294967295
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The index for this configuration change request."
  },
  "etsysConfigMgmtChangeURL": {
    "name": "etsysConfigMgmtChangeURL",
    "oid": "1.3.6.1.4.1.5624.1.2.16.2.7.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The URL of the image, configuration file, or server to use for the requested operation. Any password information MUST NOT be returned on a read. Any errors with the type or format of this object SHOULD be reported in the etsysConfigMgmtChangeErrorDescription object when the row is activated."
  },
  "etsysConfigMgmtChangeOperation": {
    "name": "etsysConfigMgmtChangeOperation",
    "oid": "1.3.6.1.4.1.5624.1.2.16.2.7.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ConfigMgmtOperations",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The operation or operations requested. The specification of any unsupported operations SHOULD cause the entire operation to fail immediately and an appropriate error description to be generated."
  },
  "etsysConfigMgmtChangeOperStatus": {
    "name": "etsysConfigMgmtChangeOperStatus",
    "oid": "1.3.6.1.4.1.5624.1.2.16.2.7.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "inactive": 1,
          "pending": 2,
          "running": 3,
          "success": 4,
          "failure": 5
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The operational state of the configuration request. inactive - Indicates that the RowStatus of this conceptual row is not in the `active` state. pending - Indicates that the configuration change described by this row is ready to run and waiting in a queue. running - Indicates that the configuration change described by this row is running. success - Indicates that the configuration change described by this row has successfully run to completion. failure - Indicates that the configuration change described by this row has failed to run to completion."
  },
  "etsysConfigMgmtChangeDelayTime": {
    "name": "etsysConfigMgmtChangeDelayTime",
    "oid": "1.3.6.1.4.1.5624.1.2.16.2.7.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "units": "seconds",
    "maxaccess": "read-create",
    "status": "current",
    "description": "The number of seconds that should elapse between the time that the RowStatus of this conceptual row is set to active and the request is queued for execution. On a read this object should return the time remaining before the request is queued."
  },
  "etsysConfigMgmtChangeEnqueuedTime": {
    "name": "etsysConfigMgmtChangeEnqueuedTime",
    "oid": "1.3.6.1.4.1.5624.1.2.16.2.7.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DateAndTime",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "0000000000000000",
        "format": "hex"
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The date and time, in device local time, when this change request was last enqueued for execution. The value '0000000000000000'H is returned if this table entry has not yet been queued."
  },
  "etsysConfigMgmtChangeCompletionTime": {
    "name": "etsysConfigMgmtChangeCompletionTime",
    "oid": "1.3.6.1.4.1.5624.1.2.16.2.7.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DateAndTime",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "0000000000000000",
        "format": "hex"
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The date and time, in device local time, when this change request was last completed. It should be reset to the default value when the RowStatus of this conceptual row is set to active. The value '0000000000000000'H is returned if this table entry has not yet run to completion."
  },
  "etsysConfigMgmtChangeBytesTransferred": {
    "name": "etsysConfigMgmtChangeBytesTransferred",
    "oid": "1.3.6.1.4.1.5624.1.2.16.2.7.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of bytes currently transferred. A value of -1 indicates that this feature is not supported for the protocol currently selected. This value is reset to its initial state when the etsysConfigMgmtRowStatus object is set to the active state."
  },
  "etsysConfigMgmtChangeValidationString": {
    "name": "etsysConfigMgmtChangeValidationString",
    "oid": "1.3.6.1.4.1.5624.1.2.16.2.7.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "A checksum, fingerprint, message-digest, or some other means to validate the integrity of the file."
  },
  "etsysConfigMgmtChangeErrorDescription": {
    "name": "etsysConfigMgmtChangeErrorDescription",
    "oid": "1.3.6.1.4.1.5624.1.2.16.2.7.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "",
        "format": "hex"
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object contains a descriptive error message if the requested transfer failed. Implementations must reset the error message to a zero-length string when the etsysConfigMgmtChangeRowStatus leaf is set to the active state."
  },
  "etsysConfigMgmtChangeRowStatus": {
    "name": "etsysConfigMgmtChangeRowStatus",
    "oid": "1.3.6.1.4.1.5624.1.2.16.2.7.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "A control that will allow one entry to be added, activated, deactivated, and removed from this table. When the value of this object is 'active' none of the other objects in this conceptual row can be modified. Setting this object to the 'active' state from the 'notInService' state will cause the requested configuration operation to be initiated. Once the requested configuration operation has completed, successfully or otherwise, this leaf will be set to the 'notInService' state by the managed entity. Setting this object to any other valid state from the 'active' state SHOULD cause the managed entity to cancel the requested operation at its earliest most rational opportunity. Setting this object to the 'active' state from the 'active' state SHOULD NOT have any affect. Conceptual rows that have been in the 'notInService' state for more than a device specific time period MAY be destroyed by the managed entity."
  },
  "etsysConfigMgmtGroups": {
    "name": "etsysConfigMgmtGroups",
    "oid": "1.3.6.1.4.1.5624.1.2.16.3.1",
    "class": "objectidentity"
  },
  "etsysConfigMgmtCompliances": {
    "name": "etsysConfigMgmtCompliances",
    "oid": "1.3.6.1.4.1.5624.1.2.16.3.2",
    "class": "objectidentity"
  },
  "etsysConfigMgmtStatusGroup": {
    "name": "etsysConfigMgmtStatusGroup",
    "oid": "1.3.6.1.4.1.5624.1.2.16.3.1.1",
    "class": "objectgroup",
    "objects": [
      {
        "module": "ENTERASYS-CONFIGURATION-MANAGEMENT-MIB",
        "object": "etsysConfigMgmtCurrentImageURL"
      },
      {
        "module": "ENTERASYS-CONFIGURATION-MANAGEMENT-MIB",
        "object": "etsysConfigMgmtCurrentConfigURL"
      },
      {
        "module": "ENTERASYS-CONFIGURATION-MANAGEMENT-MIB",
        "object": "etsysConfigMgmtPersistentStorageStatus"
      },
      {
        "module": "ENTERASYS-CONFIGURATION-MANAGEMENT-MIB",
        "object": "etsysConfigMgmtPersistentStorageCkSum"
      }
    ],
    "status": "current",
    "description": "Objects that provide some status information about the entity's current configuration."
  },
  "etsysConfigMgmtChangeGroup": {
    "name": "etsysConfigMgmtChangeGroup",
    "oid": "1.3.6.1.4.1.5624.1.2.16.3.1.2",
    "class": "objectgroup",
    "objects": [
      {
        "module": "ENTERASYS-CONFIGURATION-MANAGEMENT-MIB",
        "object": "etsysConfigMgmtChangeLimit"
      },
      {
        "module": "ENTERASYS-CONFIGURATION-MANAGEMENT-MIB",
        "object": "etsysConfigMgmtChangeCurrent"
      },
      {
        "module": "ENTERASYS-CONFIGURATION-MANAGEMENT-MIB",
        "object": "etsysConfigMgmtChangeCompleted"
      },
      {
        "module": "ENTERASYS-CONFIGURATION-MANAGEMENT-MIB",
        "object": "etsysConfigMgmtChangeSupportedURLs"
      },
      {
        "module": "ENTERASYS-CONFIGURATION-MANAGEMENT-MIB",
        "object": "etsysConfigMgmtChangeSupportedOperations"
      },
      {
        "module": "ENTERASYS-CONFIGURATION-MANAGEMENT-MIB",
        "object": "etsysConfigMgmtChangeNextAvailableIndex"
      },
      {
        "module": "ENTERASYS-CONFIGURATION-MANAGEMENT-MIB",
        "object": "etsysConfigMgmtChangeURL"
      },
      {
        "module": "ENTERASYS-CONFIGURATION-MANAGEMENT-MIB",
        "object": "etsysConfigMgmtChangeOperation"
      },
      {
        "module": "ENTERASYS-CONFIGURATION-MANAGEMENT-MIB",
        "object": "etsysConfigMgmtChangeOperStatus"
      },
      {
        "module": "ENTERASYS-CONFIGURATION-MANAGEMENT-MIB",
        "object": "etsysConfigMgmtChangeDelayTime"
      },
      {
        "module": "ENTERASYS-CONFIGURATION-MANAGEMENT-MIB",
        "object": "etsysConfigMgmtChangeEnqueuedTime"
      },
      {
        "module": "ENTERASYS-CONFIGURATION-MANAGEMENT-MIB",
        "object": "etsysConfigMgmtChangeCompletionTime"
      },
      {
        "module": "ENTERASYS-CONFIGURATION-MANAGEMENT-MIB",
        "object": "etsysConfigMgmtChangeBytesTransferred"
      },
      {
        "module": "ENTERASYS-CONFIGURATION-MANAGEMENT-MIB",
        "object": "etsysConfigMgmtChangeValidationString"
      },
      {
        "module": "ENTERASYS-CONFIGURATION-MANAGEMENT-MIB",
        "object": "etsysConfigMgmtChangeErrorDescription"
      },
      {
        "module": "ENTERASYS-CONFIGURATION-MANAGEMENT-MIB",
        "object": "etsysConfigMgmtChangeRowStatus"
      }
    ],
    "status": "current",
    "description": "Objects that provide a means to change the entity's configuration."
  },
  "etsysConfigMgmtCompliance": {
    "name": "etsysConfigMgmtCompliance",
    "oid": "1.3.6.1.4.1.5624.1.2.16.3.2.1",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "etsysConfigMgmtStatusGroup",
        "module": "ENTERASYS-CONFIGURATION-MANAGEMENT-MIB"
      },
      {
        "object": "etsysConfigMgmtChangeGroup",
        "module": "ENTERASYS-CONFIGURATION-MANAGEMENT-MIB"
      }
    ],
    "status": "current",
    "description": "The compliance statement for entities which implement the Enterasys Configuration Management MIB. Implementation of this MIB is based on individual product needs."
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/ENTERASYS-CONFIGURATION-MANAGEMENT-MIB",
      "Produced by pysmi-0.3.4 at Fri May 24 18:26:47 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "ENTERASYS-CONFIGURATION-MANAGEMENT-MIB"
  }
}