{
  "imports": {
    "class": "imports",
    "BRIDGE-MIB": [
      "dot1dBasePort"
    ],
    "ENTERASYS-MIB-NAMES": [
      "etsysModules"
    ],
    "ENTERASYS-UPN-TC-MIB": [
      "StationAddress",
      "StationAddressType"
    ],
    "IF-MIB": [
      "ifName",
      "ifAlias"
    ],
    "P-BRIDGE-MIB": [
      "EnabledStatus"
    ],
    "Q-BRIDGE-MIB": [
      "PortList",
      "VlanIndex"
    ],
    "SNMP-FRAMEWORK-MIB": [
      "SnmpAdminString"
    ],
    "SNMPv2-CONF": [
      "OBJECT-GROUP",
      "MODULE-COMPLIANCE",
      "NOTIFICATION-GROUP"
    ],
    "SNMPv2-SMI": [
      "OBJECT-IDENTITY",
      "Unsigned32",
      "NOTIFICATION-TYPE",
      "TimeTicks",
      "Counter32",
      "iso",
      "Gauge32",
      "MibIdentifier",
      "OBJECT-TYPE",
      "Integer32",
      "IpAddress",
      "MODULE-IDENTITY",
      "Bits",
      "Counter64"
    ],
    "SNMPv2-TC": [
      "StorageType",
      "RowStatus",
      "TruthValue",
      "DisplayString",
      "TEXTUAL-CONVENTION",
      "RowPointer"
    ]
  },
  "etsysPolicyProfileMIB": {
    "name": "etsysPolicyProfileMIB",
    "oid": "1.3.6.1.4.1.5624.1.2.6",
    "class": "moduleidentity",
    "revisions": [
      {
        "revision": "2010-08-09 15:11",
        "description": "Add controls for syslogEveryTime, profile visibility of syslog/trap statistics, egress-policy controls. ICMPv6 and ACL rule types added, tcp/udp rule types augmented to support IPv6 addresses."
      },
      {
        "revision": "2009-04-10 12:00",
        "description": "Added tri-state textual convention and modified the etsysPolicyRules group to use this convention for actions which previously used EnabledStatus. Added syslog, trap, and disable-port actions to the etsysPolicyProfileTable."
      },
      {
        "revision": "2009-04-01 13:36",
        "description": "Modified the capabilities group to support both OverwriteTci and Mirroring. A few other small corrections."
      },
      {
        "revision": "2008-02-19 14:29",
        "description": "Capability has been added to define a packet mirroring index for frames matching a policy profile or policy rule. Further clarification is included in DESCRIPTION field of the etsysPolicyProfileMirrorIndex and etsysPolicyRuleMirrorIndex objects."
      },
      {
        "revision": "2007-03-21 21:02",
        "description": "An additional scalar etsysPolicyRuleSylogExtendedFormat is added to configure enabling/disabling the addition of extended data to the rule-hit syslog messages. Further clarifications are included in DESCRIPTION field of the etsysPolicyRuleSylogExtendedFormat object."
      },
      {
        "revision": "2006-06-15 20:40",
        "description": "Grammar and typographical corrections."
      },
      {
        "revision": "2005-05-18 20:08",
        "description": "TEXTUAL-CONVENTION PolicyRFC3580MapRadiusResponseTC includes an additional option vlanTunnelAttributeWithPolicyProfile. An additional scalar etsysPolicyRFC3580MapInvalidMapping is added to detect EtsysPolicyRFC3580MapEntry discrepancies. Further clarifications are included in DESCRIPTION fields of the etsysPolicyRFC3580Map objects."
      },
      {
        "revision": "2005-03-28 15:35",
        "description": "Additional branch etsysPolicyNotifications properly contains trap information."
      },
      {
        "revision": "2005-03-14 21:34",
        "description": "etsysPolicyRuleStatsDroppedNotifications and etsysPolicyRuleSylogMachineReadableFormat now allow the managing entity to track missed syslog messages and to format the messages in hexadecimal. Additional capability table to detail policy rule type lengths in bits and bytes and the maximum number of rules of each rule type the agent supports. See the description of the PolicyClassificationRuleType textual convention for additional details relating to how rule-type-lengths are to be specified."
      },
      {
        "revision": "2004-08-11 15:17",
        "description": "Updated the range for etsysPolicyProfilePriority to (0..4095). Added objects and groups related to mapping RFC3580 vlan-tunnel-attributes to PolicyProfiles. Added the etsysPolicyRuleAutoClearOnProfile, etsysPolicyRuleStatsAutoClearInterval, and etsysPolicyRuleStatsAutoClearPorts, objects. Added etsysPolicyEnabledTable to the capabilities section, in addition to reporting capabilities, it allows one to disable policy on a given port."
      },
      {
        "revision": "2004-05-18 17:02",
        "description": "Added the etsysPolicyRuleStatsAutoClearOnLink leaf."
      },
      {
        "revision": "2004-04-02 20:35",
        "description": "Added the etsysPolicyRuleOperPid leaf to etsysPolicyRuleTable."
      },
      {
        "revision": "2004-03-25 18:03",
        "description": "Added capabilities objects, status for profile assignment override, dynamic profile summary list, and notification configuration for dynamic rules."
      },
      {
        "revision": "2004-02-03 22:00",
        "description": "Replaced StationIdentifierType with StationAddressType and StationIdentifier with StationAddress to match new revision of ENTERASYS-UPN-TC-MIB."
      },
      {
        "revision": "2004-02-03 15:33",
        "description": "Replaced StationIdentifierTypeTC with StationIdentifierType and moved it to the ENTERASYS-UPN-TC-MIB, and replaced InetAddress with StationIdentifier from the same MIB module."
      },
      {
        "revision": "2004-01-19 21:43",
        "description": "Added PolicyClassificationRuleType TEXTUAL-CONVENTION. Added the etsysPolicyProfileOverwriteTCI and etsysPolicyProfileRulePrecedence leaves to the EtsysPolicyProfileEntry. Added the etsysPolicyRules group for accounting of policy usage. Additionally, the range syntax of several objects has been clarified. The etsysPolicyClassificationGroup and the etsysPortPolicyProfileTable have been deprecated, as they have been replaced by the etsysPolicyRulesGroup."
      },
      {
        "revision": "2003-11-04 17:16",
        "description": "Added etsysPolicyMap object group in support of RFC 3580 and Enterasys Technical Standard TS-07."
      },
      {
        "revision": "2003-02-06 22:59",
        "description": "Added etsysDevicePolicyProfileDefault to provide managed entities, that cannot support complete policies on a per port basis, a global policy to augment what policies they can provide on a per port basis. Added etsysPolicyCapabilities to provide management agents a straight forward method to ascertain the capabilities of the managed entity."
      },
      {
        "revision": "2002-09-17 14:53",
        "description": "Added Port ID information in the Station table, for ease of cross reference."
      },
      {
        "revision": "2002-07-19 13:37",
        "description": "This version incorporates enhancements to support Station based policy provisioning, as well as other UPN related enhancements."
      },
      {
        "revision": "2001-06-11 20:00",
        "description": "This version modified the MODULE-IDENTITY statement to resolve an issue importing this MIB into some older MIB Tools. In the SEQUENCE for the etsysPortPolicyProfileTable the first object was incorrectly defined as etsysPortPolicyProfileIndex, this was corrected to read etsysPortPolicyProfileIndexType. Several misspelled words were corrected. Finally, the INDEX for the etsysPortPolicyProfileSummaryTable was corrected to index the table by policy index as well as the type of port for each entry in the table."
      },
      {
        "revision": "2001-01-09 00:00",
        "description": "The initial version of this MIB module."
      }
    ],
    "lastupdated": "201008091511Z",
    "organization": "Enterasys Networks, Inc",
    "contactinfo": "Postal: Enterasys Networks 50 Minuteman Rd. Andover, MA 01810-1008 USA Phone: +1 978 684 1000 E-mail: support@enterasys.com WWW: http://www.enterasys.com",
    "description": "This MIB module defines a portion of the SNMP enterprise MIBs under the Enterasys enterprise OID pertaining to the mapping of per user policy profiles for Enterasys network edge devices or access products."
  },
  "PolicyProfileIDTC": {
    "name": "PolicyProfileIDTC",
    "class": "textualconvention",
    "type": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 0
          },
          {
            "min": 1,
            "max": 65535
          }
        ]
      }
    },
    "status": "current",
    "description": "This textual convention maps out to the possible policyProfileIndex values. It also allows for a value of zero. A value of zero (0) indicates that the given port should not follow any policy profile."
  },
  "PortPolicyProfileIndexTypeTC": {
    "name": "PortPolicyProfileIndexTypeTC",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "ifIndex": 1,
          "dot1dBasePort": 2
        }
      }
    },
    "status": "current",
    "description": "This textual convention maps out to the possible port types which can be used to populate the etsysPortPolicyProfileTable, and of port IDs used in the etsysStationPolicyProfileTable."
  },
  "PolicyRFC3580MapRadiusResponseTC": {
    "name": "PolicyRFC3580MapRadiusResponseTC",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "policyProfile": 1,
          "vlanTunnelAttribute": 2,
          "vlanTunnelAttributeWithPolicyProfile": 3
        }
      }
    },
    "status": "current",
    "description": "This textual convention maps out to the possible, pertinent, successful, responses which may be received from the RADIUS server after a dynamic authentication attempt. PolicyProfile(1) is returned as a proprietary filter-id and has historically been used to assign a policy profile to the authenticated entity. VlanTunnelAttribute(2) is the response defined in RFC3580 and upon which further controls are applied by the etsysPolicyRFC3580Map group. A value of - vlanTunnelAttributeWithPolicyProfile(3) is an indication that both attributes are to be used."
  },
  "VlanList": {
    "name": "VlanList",
    "class": "textualconvention",
    "type": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 512,
            "max": 512
          }
        ]
      }
    },
    "status": "current",
    "description": "Each octet within this value specifies a set of eight VIDs, with the first octet specifying VID 1 through 8, the second octet specifying VID 9 through 16, etc. Within each octet, the most significant bit represents the lowest numbered VID, and the least significant bit represents the highest numbered VID. Thus, each VID is represented by a single bit within the value of this object. If that bit has a value of '1' then that VID is included in the set of VIDs; the VID is not included if its bit has a value of '0'. This OCTET STRING will always be 512 Octets in length to accommodate all possible VIDs between (1..4094). The default value of this object is a string of all zeros."
  },
  "PolicyClassificationRuleType": {
    "name": "PolicyClassificationRuleType",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "macSource": 1,
          "macDestination": 2,
          "ipxSource": 3,
          "ipxDestination": 4,
          "ipxSourcePort": 5,
          "ipxDestinationPort": 6,
          "ipxCos": 7,
          "ipxType": 8,
          "ip6Source": 9,
          "ip6Destination": 10,
          "ip6FlowLabel": 11,
          "ip4Source": 12,
          "ip4Destination": 13,
          "ipFragment": 14,
          "udpSourcePort": 15,
          "udpDestinationPort": 16,
          "tcpSourcePort": 17,
          "tcpDestinationPort": 18,
          "icmpTypeCode": 19,
          "ipTtl": 20,
          "ipTos": 21,
          "ipType": 22,
          "icmpTypeCodeV6": 23,
          "etherType": 25,
          "llcDsapSsap": 26,
          "vlanId": 27,
          "ieee8021dTci": 28,
          "acl": 30,
          "bridgePort": 31
        }
      }
    },
    "status": "current",
    "description": "Enumerates the possible types of classification rules which may be referenced in the etsysPolicyRuleTable. Each type has an implied length (in bytes) associated with it. Octet-strings defined as representing one of these types will be represented in Network-Byte-Order (Big Endian) if the native representation is other than octets. The managed entity MUST support sets in which the specified rule length is less than that specified by the value the entity reports in etsysPolicyRuleAttributeByteLength, so long as the associated etsysPolicyRulePrefixBits does not imply the existence of more etsysPolicyRuleData than is present (i.e. the specified length MUST be >= ((etsysPolicyRulePrefixBits+7)/8).) Additionally, the managed entity MUST return a PolicyClassificationRuleType which carries the number of octets specified by the associated etsysPolicyRuleAttributeByteLength, regardless of the number etsysPolicyRulePrefixBits. This yields a behavior in which, on some devices, a ip4Source rule may be supported with only 4 bytes of rule data (excluding the TCP/UDP source port information), while other devices may support the full syntax using all 6 bytes. macSource(1) The source MAC address in an Ethernet frame. Length is 6 bytes. macDestination(2) The destination MAC address in an Ethernet frame. Length is 6 bytes. ipxSource(3) The source address in an IPX header. Length is 4 bytes (Network prefix). ipxDestination(4) The destination address in an IPX header. Length is 4 bytes (Network prefix). ipxSourcePort(5) The source IPX port(socket) in an IPX header. Length is 2 bytes. ipxDestinationPort(6) The destination IPX port(socket) in an IPX header. Length is 2 bytes. ipxCos(7) The CoS(HopCount) field in an IPX header. Length is 1 byte. ipxType(8) The protocol type in an IPX header. Length is 1 byte. ip6Source(9) The source address in an IPv6 header, postfixed with the source port (for TCP/UDP frames). Length is 18 bytes for IPv6+TCP/UDP, or 16 bytes for IPv6. ip6Destination(10) The destination address in an IPv6 header, postfixed with the destination port (for TCP/UDP frames). Length is 18 bytes for IPv6+TCP/UDP, or 16 bytes for IPv6. ip6FlowLabel(11) The flow label field (traffic class and flow identifier) in an IPv6 header. Length is 3 bytes, as only the first 20 bits are valid and mask-able, only the data in the first 20 bits (the first five nibbles) is considered. ip4Source(12) The source address in an IPv4 header, postfixed with the source port (for TCP/UDP frames). Length is 6 bytes for IPv4+TCP/UDP, or 4 bytes for IPv4. ip4Destination(13) The destination address in an IPv4 header, postfixed with the destination port (for TCP/UDP frames). Length is 6 bytes for IPv4+TCP/UDP, or 4 bytes for IPv4. ipFragment(14) Truth value derived from the FLAGS and FRAGMENTATION_OFFSET fields of an IP header. If the MORE bit of the flags field is set, or the FRAGMENTATION_OFFSET is non-zero, the frame is fragmented. Length is 0 bytes (there is no data, only presence). udpSourcePort(15) The source UDP port(socket) in a UDP header, optionally postfixed with a source IP address. Length is 2 bytes for UDP, 6 bytes for UDP+IPv4, or 18 bytes for UDP+IPv6. udpDestinationPort(16) The destination UDP port(socket) in a UDP header, optionally postfixed with a destination IP address. Length is 2 bytes for UDP, 6 bytes for UDP+IPv4, or 18 bytes for UDP+IPv6. tcpSourcePort(17) The source TCP port(socket) in an TCP header, optionally postfixed with a source IPv4 address. Length is 2 bytes for TCP, 6 bytes for TCP+IPv4, or 18 bytes for TCP+IPv6. tcpDestinationPort(18) The destination TCP port(socket) in an TCP header, optionally postfixed with a destination IPv4 address. Length is 2 bytes for TCP, 6 bytes for TCP+IPv4, or 18 bytes for TCP+IPv6. icmpTypeCode(19) The Type and Code fields from an ICMP frame. These are encoded in 2 bytes, network-byte-order, Type in the first (left-most) byte, Code in the second byte. ipTtl(20) The TTL(HopCount) field in an IP header. Length is 1 byte. ipTos(21) The ToS(DSCP) field in an IP header. Length is 1 byte. ipType(22) The protocol type in an IP header. Length is 1 byte. icmpTypeCodeV6(23) The Type and Code fields from an ICMP frame. These are encoded in 2 bytes, network-byte-order, Type in the first (left-most) byte, Code in the second byte. For ICMPv6, which redefines the types and codes. etherType(25) The type field in an Ethernet II frame. Length is 2 bytes. llcDsapSsap(26) The DSAP/SSAP/CTRL field in an LLC encapsulated frame, includes SNAP encapsulated frames and the associated Ethernet II type field. Length is 5 bytes. vlanId(27) The 12 bit Virtual LAN ID field present in an 802.1D Tagged frame. Length is 2 bytes, the field is represented in the FIRST (left-most, big-endian) 12 bits of the 16 bit field. A vlanId of 1 would be encoded as 00-10, a vlanId of 4094 would be encoded as FF-E0, and a vlanId of 100 would be encoded as 06-40. ieee8021dTci(28) The entire 16 bit TCI field present in an 802.1D Tagged frame (include both VLAN ID and Priority bits. Length is 2 bytes. acl(30) A numbered ACL, represented by a 4 byte integer value. This is not maskable. bridgePort(31) The dot1dBasePort on which the frame was received. Length is 2 bytes."
  },
  "PolicyRulesSupported": {
    "name": "PolicyRulesSupported",
    "class": "textualconvention",
    "type": {
      "type": "Bits",
      "class": "type",
      "bits": {
        "macSource": 1,
        "macDestination": 2,
        "ipxSource": 3,
        "ipxDestination": 4,
        "ipxSourcePort": 5,
        "ipxDestinationPort": 6,
        "ipxCos": 7,
        "ipxType": 8,
        "ip6Source": 9,
        "ip6Destination": 10,
        "ip6FlowLabel": 11,
        "ip4Source": 12,
        "ip4Destination": 13,
        "ipFragment": 14,
        "udpSourcePort": 15,
        "udpDestinationPort": 16,
        "tcpSourcePort": 17,
        "tcpDestinationPort": 18,
        "icmpTypeCode": 19,
        "ipTtl": 20,
        "ipTos": 21,
        "ipType": 22,
        "icmpTypeCodeV6": 23,
        "etherType": 25,
        "llcDsapSsap": 26,
        "vlanId": 27,
        "ieee8021dTci": 28,
        "acl": 30,
        "bridgePort": 31
      }
    },
    "status": "current",
    "description": "Enumerates the possible types of classification rules which may be supported. macSource(1) The source MAC address in an Ethernet frame. macDestination(2) The destination MAC address in an Ethernet frame. ipxSource(3) The source address in an IPX header. ipxDestination(4) The destination address in an IPX header. ipxSourcePort(5) The source IPX port(socket) in an IPX header. ipxDestinationPort(6) The destination IPX port(socket) in an IPX header. ipxCos(7) The CoS(HopCount) field in an IPX header. ipxType(8) The protocol type in an IPX header. ip6Source(9) The source address in an IPv6 header, postfixed with the source port (for TCP/UDP frames). ip6Destination(10) The destination address in an IPv6 header, postfixed with the destination port (for TCP/UDP frames). ip6FlowLabel(11) The flow label field (traffic class and flow identifier) in an IPv6 header. ip4Source(12) The source address in an IPv4 header, postfixed with the source port (for TCP/UDP frames). ip4Destination(13) The destination address in an IPv4 header, postfixed with the destination port (for TCP/UDP frames). ipFragment(14) Truth value derived from the FLAGS and FRAGMENTATION_OFFSET fields of an IP header. If the MORE bit of the flags field is set, or the FRAGMENTATION_OFFSET is non-zero, the frame is fragmented. udpSourcePort(15) The source UDP port(socket) in a UDP header. udpDestinationPort(16) The destination UDP port(socket) in a UDP header. tcpSourcePort(17) The source TCP port(socket) in an TCP header. tcpDestinationPort(18) The destination TCP port(socket) in an TCP header. icmpTypeCode(19) The Type and Code fields from an ICMP frame. ipTtl(20) The TTL(HopCount) field in an IP header. ipTos(21) The ToS(DSCP) field in an IP header. ipType(22) The protocol type in an IP header. icmpTypeCodeV6(23) The Type and Code fields from an ICMPv6 frame. etherType(25) The type field in an Ethernet II frame. llcDsapSsap(26) The DSAP/SSAP/CTRL field in an LLC encapsulated frame, includes SNAP encapsulated frames and the associated Ethernet II type field. vlanId(27) The 12 bit Virtual LAN ID field present in an 802.1D Tagged frame. ieee8021dTci(28) The entire 16 bit TCI field present in an 802.1D Tagged frame (include both VLAN ID and Priority bits. acl(30) A number ACL list to which the frame is applied. bridgePort(31) The dot1dBasePort on which the frame was received."
  },
  "TriStateStatus": {
    "name": "TriStateStatus",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "enabled": 1,
          "disabled": 2,
          "prohibited": 3
        }
      }
    },
    "status": "current",
    "description": "A simple status value for the object. enabled(1) indicates the action will occur disabled(2) indicates no action will be asserted prohibited(3) indicates the action will be prevented from occurring This is useful (over and above the standard EnabledStatus TC) in the context of hierachical decision trees, whereby a decision to prevent an action may revoke another, lower precedent decision to take the action."
  },
  "etsysPolicyNotifications": {
    "name": "etsysPolicyNotifications",
    "oid": "1.3.6.1.4.1.5624.1.2.6.0",
    "class": "objectidentity"
  },
  "etsysPolicyProfile": {
    "name": "etsysPolicyProfile",
    "oid": "1.3.6.1.4.1.5624.1.2.6.1",
    "class": "objectidentity"
  },
  "etsysPolicyClassification": {
    "name": "etsysPolicyClassification",
    "oid": "1.3.6.1.4.1.5624.1.2.6.2",
    "class": "objectidentity"
  },
  "etsysPortPolicyProfile": {
    "name": "etsysPortPolicyProfile",
    "oid": "1.3.6.1.4.1.5624.1.2.6.3",
    "class": "objectidentity"
  },
  "etsysPolicyVlanEgress": {
    "name": "etsysPolicyVlanEgress",
    "oid": "1.3.6.1.4.1.5624.1.2.6.4",
    "class": "objectidentity"
  },
  "etsysStationPolicyProfile": {
    "name": "etsysStationPolicyProfile",
    "oid": "1.3.6.1.4.1.5624.1.2.6.5",
    "class": "objectidentity"
  },
  "etsysInvalidPolicyPolicy": {
    "name": "etsysInvalidPolicyPolicy",
    "oid": "1.3.6.1.4.1.5624.1.2.6.6",
    "class": "objectidentity"
  },
  "etsysDevicePolicyProfile": {
    "name": "etsysDevicePolicyProfile",
    "oid": "1.3.6.1.4.1.5624.1.2.6.8",
    "class": "objectidentity"
  },
  "etsysPolicyCapability": {
    "name": "etsysPolicyCapability",
    "oid": "1.3.6.1.4.1.5624.1.2.6.9",
    "class": "objectidentity"
  },
  "etsysPolicyMap": {
    "name": "etsysPolicyMap",
    "oid": "1.3.6.1.4.1.5624.1.2.6.10",
    "class": "objectidentity"
  },
  "etsysPolicyRules": {
    "name": "etsysPolicyRules",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11",
    "class": "objectidentity"
  },
  "etsysPolicyRFC3580Map": {
    "name": "etsysPolicyRFC3580Map",
    "oid": "1.3.6.1.4.1.5624.1.2.6.12",
    "class": "objectidentity"
  },
  "etsysPolicyRulePortHitNotification": {
    "name": "etsysPolicyRulePortHitNotification",
    "oid": "1.3.6.1.4.1.5624.1.2.6.0.1",
    "class": "notificationtype",
    "objects": [
      {
        "module": "IF-MIB",
        "object": "ifName"
      },
      {
        "module": "IF-MIB",
        "object": "ifAlias"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulePortHit"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileName"
      }
    ],
    "status": "current",
    "description": "This notification indicates that a policy rule has matched network traffic on a particular port."
  },
  "etsysPolicyProfileMaxEntries": {
    "name": "etsysPolicyProfileMaxEntries",
    "oid": "1.3.6.1.4.1.5624.1.2.6.1.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The maximum number of entries allowed in the etsysPolicyProfileTable."
  },
  "etsysPolicyProfileNumEntries": {
    "name": "etsysPolicyProfileNumEntries",
    "oid": "1.3.6.1.4.1.5624.1.2.6.1.2",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The current number of entries in the etsysPolicyProfileTable."
  },
  "etsysPolicyProfileLastChange": {
    "name": "etsysPolicyProfileLastChange",
    "oid": "1.3.6.1.4.1.5624.1.2.6.1.3",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TimeTicks",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The sysUpTime at which the etsysPolicyProfileTable was last modified."
  },
  "etsysPolicyProfileTableNextAvailableIndex": {
    "name": "etsysPolicyProfileTableNextAvailableIndex",
    "oid": "1.3.6.1.4.1.5624.1.2.6.1.4",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates the numerically lowest available index within this entity, which may be used for the value of etsysPolicyProfileIndex in the creation of a new entry in the etsysPolicyProfileTable. An index is considered available if the index value falls within the range of 1 to 65535 and is not being used to index an existing entry in the etsysPolicyProfileTable contained within this entity. This value should only be considered a guideline for management creation of etsysPolicyProfileEntries, there is no requirement on management to create entries based upon this index value."
  },
  "etsysPolicyProfileTable": {
    "name": "etsysPolicyProfileTable",
    "oid": "1.3.6.1.4.1.5624.1.2.6.1.5",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table containing policy profiles. A policy is a group of classification rules which may be applied on a per user basis, to ports or to stations."
  },
  "etsysPolicyProfileEntry": {
    "name": "etsysPolicyProfileEntry",
    "oid": "1.3.6.1.4.1.5624.1.2.6.1.5.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Conceptually defines a particular entry within the etsysPolicyProfileTable. Entries within this table MUST be considered non-volatile and MUST be maintained across entity resets."
  },
  "etsysPolicyProfileIndex": {
    "name": "etsysPolicyProfileIndex",
    "oid": "1.3.6.1.4.1.5624.1.2.6.1.5.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A unique arbitrary identifier for this Policy. Since a policy will be applied to a user regardless of his or her location in the network fabric policy names SHOULD be unique within the entire network fabric. Policy IDs and policy names MUST be unique within the scope of a single managed entity."
  },
  "etsysPolicyProfileName": {
    "name": "etsysPolicyProfileName",
    "oid": "1.3.6.1.4.1.5624.1.2.6.1.5.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 64
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Administratively assigned textual description of this Policy. This object MUST NOT be modifiable while this entry's RowStatus is active(1)."
  },
  "etsysPolicyProfileRowStatus": {
    "name": "etsysPolicyProfileRowStatus",
    "oid": "1.3.6.1.4.1.5624.1.2.6.1.5.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "reference": "RFC2579 (Textual Conventions for SMIv2)",
    "status": "current",
    "description": "This object allows for the dynamic creation and deletion of entries within the etsysPolicyProfileTable as well as the activation and deactivation of these entries. When this object's value is active(1) the corresponding row's etsysPolicyProfilePortVid, etsysPolicyProfilePriority, and all entries within the etsysPolicyClassificationTable indexed by this row's etsysPolicyProfileIndex are available to be applied to network access ports or stations on the managed entity. All ports corresponding to rows within the etsysPortPolicyProfileTable whose etsysPortPolicyProfileOperID is equal to the etsysPolicyProfileIndex, shall have the corresponding policy applied. Likewise, all stations corresponding to rows within the etsysStationPolicyProfileTable whose etsysStationPolicyProfileOperID is equal to the etsysPolicyProfileIndex, shall have the corresponding policy applied. The value of etsysPortPolicyProfileOperID for each such row in the etsysPortPolicyProfileTable will be equal to the etsysPortPolicyProfileAdminID, unless the authorization information from a source such as a RADIUS server indicates to the contrary. Refer to the specific objects within this MIB as well as well as RFC2674, the CTRON-PRIORITY-CLASSIFY-MIB, the CTRON-VLAN-CLASSIFY-MIB, and the CTRON-RATE-POLICING-MIB for a complete explanation of the application and behavior of these objects. When this object's value is set to notInService(2) this policy will not be applied to any rows within the etsysPortPolicyProfileTable. To allow policy profiles to be applied for security implementations, setting this object's value from active(1) to notInService(2) or destroy(6) SHALL fail if one or more instances of etsysPortPolicyProfileOperID or etsysStationPolicyProfileOperID currently reference this entry's associated policy due to a set by an underlying security protocol such as RADIUS. For network functionality and clarity, setting this object to destroy(6) SHALL fail if one or more instances of etsysPortPolicyProfileOperID or etsysStationPolicyProfileOperID currently references this entry's etsysPolicyProfileIndex. Refer to the RowStatus convention for further details on the behavior of this object."
  },
  "etsysPolicyProfilePortVidStatus": {
    "name": "etsysPolicyProfilePortVidStatus",
    "oid": "1.3.6.1.4.1.5624.1.2.6.1.5.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "EnabledStatus",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "disabled",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object defines whether a PVID override should be applied to ports which have this profile active. enabled(1) means that any port with this policy active will have this row's etsysPolicyProfilePortVid applied to untagged frames or priority-tagged frames received on this port. disabled(2) means that etsysPolicyProfilePortVid will not be applied. When this object is set to disabled(2) the value of etsysPolicyProfilePortVid has no meaning."
  },
  "etsysPolicyProfilePortVid": {
    "name": "etsysPolicyProfilePortVid",
    "oid": "1.3.6.1.4.1.5624.1.2.6.1.5.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 0
          },
          {
            "min": 1,
            "max": 4094
          },
          {
            "min": 4095,
            "max": 4095
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 1,
        "format": "decimal"
      }
    },
    "maxaccess": "read-create",
    "reference": "RFC2674 (Q-BRIDGE-MIB) - dot1qPortVlanTable",
    "status": "current",
    "description": "This object defines the PVID of this profile. If a port has an active policy and the policy's etsysPolicyProfilePortVidStatus is set to enabled(1), the etsysPolicyProfilePortVid will be applied to all untagged frames arriving on the port that do not match any of the policy classification rules. Note that the 802.1Q PVID will still exist from a management view but will NEVER be applied to traffic arriving on a port that has an active policy and enabled etsysPolicyProfilePortVid defined, since policy is applied to traffic arriving on the port prior to the assignment of a VLAN using the 802.1Q PVID. The behavior of an enabled etsysPolicyProfilePortVid on any associated port SHALL be identical to the behavior of the dot1qPvid upon that port. Note that two special, otherwise illegal, values of the etsysPolicyProfilePortVid are used in defining the default forwarding actions, to be used in conjunction with policy classification rules, and do not result in packet tagging: 0 Indicates that the default forwarding action is to drop all packets that do not match an explicit rule. 4095 Indicates that the default forwarding action is to forward any packets not matching any explicit rules."
  },
  "etsysPolicyProfilePriorityStatus": {
    "name": "etsysPolicyProfilePriorityStatus",
    "oid": "1.3.6.1.4.1.5624.1.2.6.1.5.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "EnabledStatus",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "disabled",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object defines whether a Class of Service should be applied to ports which have this profile active. enabled(1) means that any port with this policy active will have etsysPolicyProfilePriority applied to this port. disabled(2) means that etsysPolicyProfilePriority will not be applied. When this object is set to disabled(2) the value of etsysPolicyProfilePriority has no meaning."
  },
  "etsysPolicyProfilePriority": {
    "name": "etsysPolicyProfilePriority",
    "oid": "1.3.6.1.4.1.5624.1.2.6.1.5.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 4095
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "reference": "RFC2674 (P-BRIDGE-MIB) - dot1dPortPriorityTable",
    "status": "current",
    "description": "This object defines the default ingress Class of Service of this profile. If a port has an active policy and the policy's etsysPolicyProfilePriorityStatus is set to enabled(1), the etsysPolicyProfilePriority will be applied to all packets arriving on the port that do not match any of the policy classification rules. Note that dot1dPortDefaultUserPriority will still exist from a management view but will NEVER be applied to traffic arriving on a port that has an active policy and enabled etsysPolicyProfilePriority defined, since policy is applied to traffic arriving on the port prior to the assignment of a priority using dot1dPortDefaultUserPriority. The behavior of an enabled etsysPolicyProfilePriority on any associated port SHALL be identical to the behavior of the dot1dPortDefaultUserPriority upon that port."
  },
  "etsysPolicyProfileEgressVlans": {
    "name": "etsysPolicyProfileEgressVlans",
    "oid": "1.3.6.1.4.1.5624.1.2.6.1.5.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "VlanList",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The set of VLANs which are assigned by this policy to egress on ports for which this policy is active. Changes to a bit in this object affect the per-port per-VLAN Registrar control for Registration Fixed for the relevant GVRP state machine on each port for which this policy is active. A VLAN may not be added in this set if it is already a member of the set of VLANs in etsysPolicyProfileForbiddenVlans. This object is superseded on a per-port per-VLAN basis by any 'set' bits in dot1qVlanStaticEgressPorts and dot1qVlanForbiddenEgressPorts. The default value of this object is a string of zeros."
  },
  "etsysPolicyProfileForbiddenVlans": {
    "name": "etsysPolicyProfileForbiddenVlans",
    "oid": "1.3.6.1.4.1.5624.1.2.6.1.5.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "VlanList",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The set of VLANs which are prohibited by this policy to egress on ports for which this policy is active. Changes to this object that cause a port to be included or excluded affect the per-port per-VLAN Registrar control for Registration Forbidden for the relevant GVRP state machine on each port for which this policy is active. A VLAN may not be added in this set if it is already a member of the set of VLANs in etsysPolicyProfileEgressVlans. This object is superseded on a per-port per-VLAN basis by any 'set' bits in the dot1qVlanStaticEgressPorts and dot1qVlanForbiddenEgressPorts. The default value of this object is a string of zeros."
  },
  "etsysPolicyProfileUntaggedVlans": {
    "name": "etsysPolicyProfileUntaggedVlans",
    "oid": "1.3.6.1.4.1.5624.1.2.6.1.5.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "VlanList",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The set of VLANs which should transmit egress packets as untagged on ports for which this policy is active. This object is superseded on a per-port per-VLAN basis by any 'set' bits in dot1qVlanStaticUntaggedPorts."
  },
  "etsysPolicyProfileOverwriteTCI": {
    "name": "etsysPolicyProfileOverwriteTCI",
    "oid": "1.3.6.1.4.1.5624.1.2.6.1.5.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "EnabledStatus",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "disabled",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "If set, the information contained within the TCI field of inbound, tagged packets will not be used by the device after the ingress classification stage of packet relay. The net effect will be that the TCI information may be used to classify the packet, but will be overwritten (and ignored) by subsequent stages of packet relay."
  },
  "etsysPolicyProfileRulePrecedence": {
    "name": "etsysPolicyProfileRulePrecedence",
    "oid": "1.3.6.1.4.1.5624.1.2.6.1.5.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 255
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Each octet will contain a single value representing the rule type to be matched against, defined by the PolicyClassificationRuleType textual convention. When read, will return the currently operating rule matching precedence, ordered from first consulted (in the first octet) to last consulted (in the last octet). A set of a single octet of 0x00 will result in a reversion to the default precedence ordering. A set of any other values will result in the specified rule types being matched in the order specified, followed by the remaining rules, in default precedence order."
  },
  "etsysPolicyProfileVlanRFC3580Mappings": {
    "name": "etsysPolicyProfileVlanRFC3580Mappings",
    "oid": "1.3.6.1.4.1.5624.1.2.6.1.5.1.13",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "VlanList",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The set of VLANs which are currently being mapped onto this policy profile by the etsysPolicyRFC3580MapTable. This only refers to the mapping of vlan-tunnel-attributes returned from RADIUS in an RFC3580 context."
  },
  "etsysPolicyProfileMirrorIndex": {
    "name": "etsysPolicyProfileMirrorIndex",
    "oid": "1.3.6.1.4.1.5624.1.2.6.1.5.1.14",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": -1,
            "max": -1
          },
          {
            "min": 0,
            "max": 0
          },
          {
            "min": 1,
            "max": 255
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": -1,
        "format": "decimal"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "A reference to a packet mirror destination (defined elsewhere). A value of (-1) indicates no mirror is specified, but a mirror is not explicitly prohibitted. A value of (0) indicates that mirroring is explicitly prohibitted, unless a high precedent source (a rule) has specified a mirror."
  },
  "etsysPolicyProfileAuditSyslogEnable": {
    "name": "etsysPolicyProfileAuditSyslogEnable",
    "oid": "1.3.6.1.4.1.5624.1.2.6.1.5.1.15",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "EnabledStatus",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "disabled",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Enables the sending of a syslog message if no rule bound to this profile has prohibited it."
  },
  "etsysPolicyProfileAuditTrapEnable": {
    "name": "etsysPolicyProfileAuditTrapEnable",
    "oid": "1.3.6.1.4.1.5624.1.2.6.1.5.1.16",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "EnabledStatus",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "disabled",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Enables the sending of a SNMP NOTIFICATION if no rule bound to this profile has prohibited it."
  },
  "etsysPolicyProfileDisablePort": {
    "name": "etsysPolicyProfileDisablePort",
    "oid": "1.3.6.1.4.1.5624.1.2.6.1.5.1.17",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "EnabledStatus",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "disabled",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Will set the ifOperStatus of the port, on which the frame which used this profile was received, to disable, if if no rule bound to this profile has prohibited it."
  },
  "etsysPolicyProfileUsageList": {
    "name": "etsysPolicyProfileUsageList",
    "oid": "1.3.6.1.4.1.5624.1.2.6.1.5.1.18",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PortList",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "When read, a set bit indicates that this profile was used to send a syslog or trap message for corresponding port. When set, the native PortList will be bit-wise AND'ed with the set PortList, allowing the agent to clear the usage indication."
  },
  "etsysPolicyClassificationMaxEntries": {
    "name": "etsysPolicyClassificationMaxEntries",
    "oid": "1.3.6.1.4.1.5624.1.2.6.2.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The maximum number of entries allowed in the etsysPolicyClassificationTable."
  },
  "etsysPolicyClassificationNumEntries": {
    "name": "etsysPolicyClassificationNumEntries",
    "oid": "1.3.6.1.4.1.5624.1.2.6.2.2",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The current number of entries in the etsysPolicyClassificationTable."
  },
  "etsysPolicyClassificationLastChange": {
    "name": "etsysPolicyClassificationLastChange",
    "oid": "1.3.6.1.4.1.5624.1.2.6.2.3",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TimeTicks",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The sysUpTime at which the etsysPolicyClassificationTable was last modified."
  },
  "etsysPolicyClassificationTable": {
    "name": "etsysPolicyClassificationTable",
    "oid": "1.3.6.1.4.1.5624.1.2.6.2.4",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "reference": "CTRON-PRIORITY-CLASSIFY-MIB, CTRON-VLAN-CLASSIFY-MIB, CTRON-RATE-POLICING-MIB",
    "status": "deprecated",
    "description": "A table containing reference OIDs to entries within the classification tables. These classification tables include but may not be limited to: ctPriClassifyTable ctVlanClassifyTable ctRatePolicyingConfigTable This table is used to map a list of classification rules to an instance of the etsysPolicyProfileTable."
  },
  "etsysPolicyClassificationEntry": {
    "name": "etsysPolicyClassificationEntry",
    "oid": "1.3.6.1.4.1.5624.1.2.6.2.4.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileIndex",
        "implied": 0
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyClassificationIndex",
        "implied": 0
      }
    ],
    "status": "deprecated",
    "description": "Describes a particular entry within the etsysPolicyClassificationTable. Entries within this table MUST be considered non-volatile and MUST be maintained across entity resets."
  },
  "etsysPolicyClassificationIndex": {
    "name": "etsysPolicyClassificationIndex",
    "oid": "1.3.6.1.4.1.5624.1.2.6.2.4.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "deprecated",
    "description": "Administratively assigned unique value, greater than zero. Each etsysPolicyClassificationIndex instance MUST be unique within the scope of its associated etsysPolicyProfileIndex."
  },
  "etsysPolicyClassificationOID": {
    "name": "etsysPolicyClassificationOID",
    "oid": "1.3.6.1.4.1.5624.1.2.6.2.4.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowPointer",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "deprecated",
    "description": "This object follows the RowPointer textual convention and is an OID reference to a classification rule. This object MUST NOT be modifiable while this entry's etsysPolicyClassificationStatus object has a value of active(1)."
  },
  "etsysPolicyClassificationRowStatus": {
    "name": "etsysPolicyClassificationRowStatus",
    "oid": "1.3.6.1.4.1.5624.1.2.6.2.4.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "deprecated",
    "description": "The status of this row. When set to active(1) this entry's classification rule, as referenced by etsysPolicyClassificationOID, becomes one of its associated policy's set of rules. When this entry's associated policy, as defined by etsysPolicyProfileIndex, is active and assigned to a port through the etsysPortPolicyProfileTable or to a station through the etsysStationPolicyProfileTabbe, this classification rule will be applied to the port or station. The exact behavior of this application depends upon the classification rule. When this object is set to notInService(2) or notReady(3) this entry is not considered one of its associated policy's set of rules and this classification rule will not be applied. An entry MAY NOT be set to active(1) unless this row's etsysPolicyClassificationOID is set to a valid classification rule."
  },
  "etsysPolicyClassificationIngressList": {
    "name": "etsysPolicyClassificationIngressList",
    "oid": "1.3.6.1.4.1.5624.1.2.6.2.4.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PortList",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "The ports on which an active policy profile has defined this classification rule applies."
  },
  "etsysPortPolicyProfileLastChange": {
    "name": "etsysPortPolicyProfileLastChange",
    "oid": "1.3.6.1.4.1.5624.1.2.6.3.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TimeTicks",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "sysUpTime at which the etsysPortPolicyProfileTable was last modified."
  },
  "etsysPortPolicyProfileTable": {
    "name": "etsysPortPolicyProfileTable",
    "oid": "1.3.6.1.4.1.5624.1.2.6.3.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "deprecated",
    "description": "This table allows for a one to one mapping between a dot1dBasePort or an ifIndex and a Policy Profile."
  },
  "etsysPortPolicyProfileEntry": {
    "name": "etsysPortPolicyProfileEntry",
    "oid": "1.3.6.1.4.1.5624.1.2.6.3.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPortPolicyProfileIndexType",
        "implied": 0
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPortPolicyProfileIndex",
        "implied": 0
      }
    ],
    "status": "deprecated",
    "description": "Describes a particular entry within the etsysPortPolicyProfileTable. Entries within this table MUST be considered non-volatile and MUST be maintained across entity resets."
  },
  "etsysPortPolicyProfileIndexType": {
    "name": "etsysPortPolicyProfileIndexType",
    "oid": "1.3.6.1.4.1.5624.1.2.6.3.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PortPolicyProfileIndexTypeTC",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "deprecated",
    "description": "This object defines the specific type of port this entry represents."
  },
  "etsysPortPolicyProfileIndex": {
    "name": "etsysPortPolicyProfileIndex",
    "oid": "1.3.6.1.4.1.5624.1.2.6.3.2.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 2147483647
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "deprecated",
    "description": "An index value which represents a unique port of the type defined by this entry's etsysPortPolicyProfileIndexType."
  },
  "etsysPortPolicyProfileAdminID": {
    "name": "etsysPortPolicyProfileAdminID",
    "oid": "1.3.6.1.4.1.5624.1.2.6.3.2.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyProfileIDTC",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "deprecated",
    "description": "This object represents the desired Policy Profile for this dot1dBasePort or this ifIndex. Setting this object to any value besides zero (0) should, if possible, immediately place this entry's dot1dBasePort or ifIndex into the given Policy Profile. This object and etsysPortPolicyProfileOperID may not be the same if this object is set to a Policy (i.e. an instance of the etsysPolicyProfileTable) which is not in an active state or if the etsysPortPolicyProfileOperID has been set by an underlying security protocol such as RADIUS."
  },
  "etsysPortPolicyProfileOperID": {
    "name": "etsysPortPolicyProfileOperID",
    "oid": "1.3.6.1.4.1.5624.1.2.6.3.2.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyProfileIDTC",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "This object is the current policy which is being applied to this entry's dot1dBasePort. A value of zero(0) indicates there is no policy being applied to this dot1dBasePort or this ifIndex. If the value of this object has been set by an underlying security protocol such as RADIUS, sets to this entry's etsysPortPolicyProfileAdminID MUST NOT change the value of this object until such time as the security protocol releases this object by setting it to a value of zero (0)."
  },
  "etsysPortPolicyProfileSummaryTable": {
    "name": "etsysPortPolicyProfileSummaryTable",
    "oid": "1.3.6.1.4.1.5624.1.2.6.3.3",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table provides aggregate port information on a per policy, per port type basis."
  },
  "etsysPortPolicyProfileSummaryEntry": {
    "name": "etsysPortPolicyProfileSummaryEntry",
    "oid": "1.3.6.1.4.1.5624.1.2.6.3.3.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileIndex",
        "implied": 0
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPortPolicyProfileSummaryIndexType",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Conceptually defines a particular entry within the etsysPortPolicyProfileSummaryTable."
  },
  "etsysPortPolicyProfileSummaryIndexType": {
    "name": "etsysPortPolicyProfileSummaryIndexType",
    "oid": "1.3.6.1.4.1.5624.1.2.6.3.3.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PortPolicyProfileIndexTypeTC",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This object defines the specific type of port this entry represents."
  },
  "etsysPortPolicyProfileSummaryAdminID": {
    "name": "etsysPortPolicyProfileSummaryAdminID",
    "oid": "1.3.6.1.4.1.5624.1.2.6.3.3.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PortList",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "An aggregate list of all Ports currently supporting rules which assign this profileIndex through administrative means. Rules of this type have a valid etsysPolicyRuleResult2 action and a profileIndex of 0."
  },
  "etsysPortPolicyProfileSummaryOperID": {
    "name": "etsysPortPolicyProfileSummaryOperID",
    "oid": "1.3.6.1.4.1.5624.1.2.6.3.3.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PortList",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "An aggregate list of all Ports currently supporting rules which assign this profileIndex through either an administrative or dynamic means. The profileId which will be assigned operationally, as frames are handled are too be reported here."
  },
  "etsysPortPolicyProfileSummaryDynamicID": {
    "name": "etsysPortPolicyProfileSummaryDynamicID",
    "oid": "1.3.6.1.4.1.5624.1.2.6.3.3.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PortList",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "An aggregate list of all Ports currently supporting rules which assign this profileIndex through a dynamic means. For example the profileIndex returned via a successful 802.1X supplicant authentication."
  },
  "etsysStationPolicyProfileMaxEntries": {
    "name": "etsysStationPolicyProfileMaxEntries",
    "oid": "1.3.6.1.4.1.5624.1.2.6.5.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The maximum number of entries allowed in the etsysStationPolicyProfileTable. If this number is exceeded, based on stations connecting to the edge device, the oldest entries will be deleted."
  },
  "etsysStationPolicyProfileNumEntries": {
    "name": "etsysStationPolicyProfileNumEntries",
    "oid": "1.3.6.1.4.1.5624.1.2.6.5.2",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The current number of entries in the etsysStationPolicyProfileTable."
  },
  "etsysStationPolicyProfileLastChange": {
    "name": "etsysStationPolicyProfileLastChange",
    "oid": "1.3.6.1.4.1.5624.1.2.6.5.3",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TimeTicks",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "sysUpTime at which the etsysStationPolicyProfileTable was last modified."
  },
  "etsysStationPolicyProfileTable": {
    "name": "etsysStationPolicyProfileTable",
    "oid": "1.3.6.1.4.1.5624.1.2.6.5.4",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table allows for a one to one mapping between a station's identifying address and a Policy Profile."
  },
  "etsysStationPolicyProfileEntry": {
    "name": "etsysStationPolicyProfileEntry",
    "oid": "1.3.6.1.4.1.5624.1.2.6.5.4.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysStationPolicyProfileIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Describes a particular entry within the etsysStationPolicyProfileTable. Entries within this table MUST be considered non-volatile and MUST be maintained across entity resets."
  },
  "etsysStationPolicyProfileIndex": {
    "name": "etsysStationPolicyProfileIndex",
    "oid": "1.3.6.1.4.1.5624.1.2.6.5.4.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 2147483647
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "An index value which represents a unique station entry."
  },
  "etsysStationIdentifierType": {
    "name": "etsysStationIdentifierType",
    "oid": "1.3.6.1.4.1.5624.1.2.6.5.4.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "StationAddressType",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Indicates the type of station identifying address contained in etsysStationIdentifier."
  },
  "etsysStationIdentifier": {
    "name": "etsysStationIdentifier",
    "oid": "1.3.6.1.4.1.5624.1.2.6.5.4.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "StationAddress",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A value which represents a unique MAC Address, IP Address, or other identifying address for a station, or other logical and authenticatable sub-entity within a station, connected to a port."
  },
  "etsysStationPolicyProfileOperID": {
    "name": "etsysStationPolicyProfileOperID",
    "oid": "1.3.6.1.4.1.5624.1.2.6.5.4.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyProfileIDTC",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object is the current policy which is being applied to this entry's MAC Address. A value of zero(0) indicates there is no policy being applied to this MAC Address. The value of this object reflects either the setting from an underlying AAA service such as RADIUS, or the default setting based on the etsysPortPolicyProfileAdminID for the port on which the station is connected. This object and the corresponding etsysPortPolicyProfileAdminID will not be the same if this object has been set by an underlying security protocol such as RADIUS."
  },
  "etsysStationPolicyProfilePortType": {
    "name": "etsysStationPolicyProfilePortType",
    "oid": "1.3.6.1.4.1.5624.1.2.6.5.4.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PortPolicyProfileIndexTypeTC",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A textual convention that defines the specific type of port designator the corresponding entry represents."
  },
  "etsysStationPolicyProfilePortID": {
    "name": "etsysStationPolicyProfilePortID",
    "oid": "1.3.6.1.4.1.5624.1.2.6.5.4.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 2147483647
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A value which represents the physical port, of the type defined by this entry's etsysStationPolicyProfilePortType, on which the associated station entity is connected. This object is for convenience in cross referencing stations to ports."
  },
  "etsysInvalidPolicyAction": {
    "name": "etsysInvalidPolicyAction",
    "oid": "1.3.6.1.4.1.5624.1.2.6.6.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "applyDefaultPolicy": 1,
          "dropPackets": 2,
          "forwardPackets": 3
        }
      }
    },
    "default": {
      "default": {
        "value": "applyDefaultPolicy",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Specifies the action that the edge device should take if asked to apply an invalid or unknown policy. applyDefaultPolicy(1) - Ignore the result and search for the next policy assignment rule. dropPackets(2) - Block traffic. forwardPackets(3) - Forward traffic, as if no policy had been assigned (via 802.1D/Q rules). Although dropPackets(2) is the most secure option, it may not always be desirable."
  },
  "etsysInvalidPolicyCount": {
    "name": "etsysInvalidPolicyCount",
    "oid": "1.3.6.1.4.1.5624.1.2.6.6.2",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Increments to indicate the number of times the device has detected an invalid/unknown policy."
  },
  "etsysDevicePolicyProfileDefault": {
    "name": "etsysDevicePolicyProfileDefault",
    "oid": "1.3.6.1.4.1.5624.1.2.6.8.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 0
          },
          {
            "min": 1,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "If this value is non-zero, the value indicates the etsysPolicyProfileEntry (and its associated etsysPolicyClassificationTable entries) which should be used by the device if the device is incapable of using the profile (or specific parts of the profile) explicitly applied to an inbound frame. A value of zero indicates that no default profile is currently active."
  },
  "etsysPolicyCapabilities": {
    "name": "etsysPolicyCapabilities",
    "oid": "1.3.6.1.4.1.5624.1.2.6.9.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Bits",
      "class": "type",
      "bits": {
        "supportsVLANForwarding": 0,
        "supportsPriority": 1,
        "supportsPermit": 2,
        "supportsDeny": 3,
        "supportsDeviceLevelPolicy": 4,
        "supportsPrecedenceReordering": 5,
        "supportsTciOverwrite": 6,
        "supportsRulesTable": 7,
        "supportsRuleUseAccounting": 8,
        "supportsRuleUseNotification": 9,
        "supportsCoSTable": 10,
        "supportsLongestPrefixRules": 11,
        "supportsPortDisableAction": 12,
        "supportsRuleUseAutoClearOnLink": 13,
        "supportsRuleUseAutoClearOnInterval": 14,
        "supportsRuleUseAutoClearOnProfile": 15,
        "supportsPolicyRFC3580MapTable": 16,
        "supportsPolicyEnabledTable": 17,
        "supportsMirror": 18,
        "supportsEgressPolicy": 19
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A list of capabilities related to policies. A set bit, with the value 1, indicates support for the described functionality. A clear bit, with the value 0, indicates the described functionality is not supported."
  },
  "etsysPolicyDynaPIDRuleCapabilities": {
    "name": "etsysPolicyDynaPIDRuleCapabilities",
    "oid": "1.3.6.1.4.1.5624.1.2.6.9.2",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyRulesSupported",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A list of rule types which are supported by this device for the purpose of dynamically assigning a profile to the network traffic described by the bit. A set bit, with the value 1, indicates support for the described functionality. A clear bit, with the value 0, indicates the described functionality is not supported."
  },
  "etsysPolicyAdminPIDRuleCapabilities": {
    "name": "etsysPolicyAdminPIDRuleCapabilities",
    "oid": "1.3.6.1.4.1.5624.1.2.6.9.3",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyRulesSupported",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A list of rule types which are supported by this device for the purpose of administratively assigning a profile to the network traffic described by the bit. A set bit, with the value 1, indicates support for the described functionality. A clear bit, with the value 0, indicates the described functionality is not supported."
  },
  "etsysPolicyVlanRuleCapabilities": {
    "name": "etsysPolicyVlanRuleCapabilities",
    "oid": "1.3.6.1.4.1.5624.1.2.6.9.4",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyRulesSupported",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A list of rule types which are supported by this device for the purpose of assigning a VlanId to the network traffic described by the bit. A set bit, with the value 1, indicates support for the described functionality. A clear bit, with the value 0, indicates the described functionality is not supported."
  },
  "etsysPolicyCosRuleCapabilities": {
    "name": "etsysPolicyCosRuleCapabilities",
    "oid": "1.3.6.1.4.1.5624.1.2.6.9.5",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyRulesSupported",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A list of rule types which are supported by this device for the purpose of assigning a CoS to the network traffic described by the bit. A set bit, with the value 1, indicates support for the described functionality. A clear bit, with the value 0, indicates the described functionality is not supported."
  },
  "etsysPolicyDropRuleCapabilities": {
    "name": "etsysPolicyDropRuleCapabilities",
    "oid": "1.3.6.1.4.1.5624.1.2.6.9.6",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyRulesSupported",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A list of rule types which are supported by this device for the purpose of discarding the network traffic described by the bit. A set bit, with the value 1, indicates support for the described functionality. A clear bit, with the value 0, indicates the described functionality is not supported."
  },
  "etsysPolicyForwardRuleCapabilities": {
    "name": "etsysPolicyForwardRuleCapabilities",
    "oid": "1.3.6.1.4.1.5624.1.2.6.9.7",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyRulesSupported",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A list of rule types which are supported by this device for the purpose of forwarding the network traffic described by the bit. A set bit, with the value 1, indicates support for the described functionality. A clear bit, with the value 0, indicates the described functionality is not supported."
  },
  "etsysPolicySyslogRuleCapabilities": {
    "name": "etsysPolicySyslogRuleCapabilities",
    "oid": "1.3.6.1.4.1.5624.1.2.6.9.8",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyRulesSupported",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A list of rule types which are supported by this device for the purpose of issuing syslog messages when the rule is used to identify the network traffic described by the bit. A set bit, with the value 1, indicates support for the described functionality. A clear bit, with the value 0, indicates the described functionality is not supported."
  },
  "etsysPolicyTrapRuleCapabilities": {
    "name": "etsysPolicyTrapRuleCapabilities",
    "oid": "1.3.6.1.4.1.5624.1.2.6.9.9",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyRulesSupported",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A list of rule types which are supported by this device for the purpose of issuing an SNMP notify (trap) messages when the rule is used to identify the network traffic described by the bit. A set bit, with the value 1, indicates support for the described functionality. A clear bit, with the value 0, indicates the described functionality is not supported."
  },
  "etsysPolicyDisablePortRuleCapabilities": {
    "name": "etsysPolicyDisablePortRuleCapabilities",
    "oid": "1.3.6.1.4.1.5624.1.2.6.9.10",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyRulesSupported",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A list of rule types which are supported by this device for the purpose of disabling the ingress port identified when the rule matches the network traffic described by the bit. A set bit, with the value 1, indicates support for the described functionality. A clear bit, with the value 0, indicates the described functionality is not supported."
  },
  "etsysPolicySupportedPortList": {
    "name": "etsysPolicySupportedPortList",
    "oid": "1.3.6.1.4.1.5624.1.2.6.9.11",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "PortList",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The list ports which support policy profile assignment (i.e. the ports which _do_ policy). This object may be useful to management entities which desire to scope action to only those ports which support policy. A port which appears in this list, must support, at minimum, the assignment of a policy profile to all traffic ingressing the port."
  },
  "etsysPolicyEnabledTable": {
    "name": "etsysPolicyEnabledTable",
    "oid": "1.3.6.1.4.1.5624.1.2.6.9.12",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table allows for the configuration of policy profile assignment methods, per port, including the ability to disable policy profile assignment, per port. In addition, a ports capabilities, with respect to policy profile assignment are reported."
  },
  "etsysPolicyEnabledTableEntry": {
    "name": "etsysPolicyEnabledTableEntry",
    "oid": "1.3.6.1.4.1.5624.1.2.6.9.12.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "BRIDGE-MIB",
        "object": "dot1dBasePort",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Describes a particular entry within the etsysPolicyEnabledTable."
  },
  "etsysPolicyEnabledSupportedRuleTypes": {
    "name": "etsysPolicyEnabledSupportedRuleTypes",
    "oid": "1.3.6.1.4.1.5624.1.2.6.9.12.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyRulesSupported",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The list of rule types which the devices supports for the purpose of assigning policy profiles to network traffic ingressing this dot1dBasePort."
  },
  "etsysPolicyEnabledEnabledRuleTypes": {
    "name": "etsysPolicyEnabledEnabledRuleTypes",
    "oid": "1.3.6.1.4.1.5624.1.2.6.9.12.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyRulesSupported",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The list of rule types from which the device will assign policy profiles to network traffic ingressing this dot1dBasePort. Rules which have a type not enumerated here must not be used to assign policy profiles, but must still be used to interrogate the rule-set bound to the determined policy profile. A set of all cleared bits will effectively disable policy in the port."
  },
  "etsysPolicyEnabledEgressEnabled": {
    "name": "etsysPolicyEnabledEgressEnabled",
    "oid": "1.3.6.1.4.1.5624.1.2.6.9.12.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "EnabledStatus",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "disabled",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Controls the enabling and disabling the application of policy as packets egress the switching process on the dot1dBasePort specified in the indexing."
  },
  "etsysPolicyRuleAttributeTable": {
    "name": "etsysPolicyRuleAttributeTable",
    "oid": "1.3.6.1.4.1.5624.1.2.6.9.13",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table details each supported rule type attribute for rule data length in bytes, rule data length in bits, and the maximum number of rules that may use that type."
  },
  "etsysPolicyRuleAttributeTableEntry": {
    "name": "etsysPolicyRuleAttributeTableEntry",
    "oid": "1.3.6.1.4.1.5624.1.2.6.9.13.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleType",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Describes a particular entry within the etsysPolicyRuleAttributeTable."
  },
  "etsysPolicyRuleAttributeByteLength": {
    "name": "etsysPolicyRuleAttributeByteLength",
    "oid": "1.3.6.1.4.1.5624.1.2.6.9.13.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This rule type's maximum length, in bytes of the etsysPolicyRuleData. Devices supporting this object MUST allow sets for this rule data of any valid length up to and including the length value represented by this object. Management entities must also expect to read back the maximum data length for each type regardless of the length the data was set with."
  },
  "etsysPolicyRuleAttributeBitLength": {
    "name": "etsysPolicyRuleAttributeBitLength",
    "oid": "1.3.6.1.4.1.5624.1.2.6.9.13.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This rule type's maximum bit length for traffic data. This value also represents the maximum mask that may be used for rule data. The mask MUST NOT exceed the rule data size. Masks that exceed the data size shall be considered invalid and result in an SNMP set failure."
  },
  "etsysPolicyRuleAttributeMaxCreatable": {
    "name": "etsysPolicyRuleAttributeMaxCreatable",
    "oid": "1.3.6.1.4.1.5624.1.2.6.9.13.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "If this value is non-zero, the value indicates the maximum number of rules of this type the agent can support."
  },
  "etsysPolicyRuleTciOverwriteCapabilities": {
    "name": "etsysPolicyRuleTciOverwriteCapabilities",
    "oid": "1.3.6.1.4.1.5624.1.2.6.9.14",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyRulesSupported",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A list of rule types which are supported by this device for the purpose of overwriting the TCI in received packets described by the bit. A set bit, with the value 1, indicates support for the described functionality. A clear bit, with the value 0, indicates the described functionality is not supported."
  },
  "etsysPolicyRuleMirrorCapabilities": {
    "name": "etsysPolicyRuleMirrorCapabilities",
    "oid": "1.3.6.1.4.1.5624.1.2.6.9.15",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyRulesSupported",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A list of rule types which are supported by this device for the purpose of mirroring the network traffic described by the bit. A set bit, with the value 1, indicates support for the described functionality. A clear bit, with the value 0, indicates the described functionality is not supported."
  },
  "etsysPolicyMapMaxEntries": {
    "name": "etsysPolicyMapMaxEntries",
    "oid": "1.3.6.1.4.1.5624.1.2.6.10.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This has been obsoleted."
  },
  "etsysPolicyMapNumEntries": {
    "name": "etsysPolicyMapNumEntries",
    "oid": "1.3.6.1.4.1.5624.1.2.6.10.2",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This has been obsoleted."
  },
  "etsysPolicyMapLastChange": {
    "name": "etsysPolicyMapLastChange",
    "oid": "1.3.6.1.4.1.5624.1.2.6.10.3",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TimeTicks",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This has been obsoleted."
  },
  "etsysPolicyMapPvidOverRide": {
    "name": "etsysPolicyMapPvidOverRide",
    "oid": "1.3.6.1.4.1.5624.1.2.6.10.4",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "obsolete",
    "description": "This has been obsoleted."
  },
  "etsysPolicyMapUnknownPvidPolicy": {
    "name": "etsysPolicyMapUnknownPvidPolicy",
    "oid": "1.3.6.1.4.1.5624.1.2.6.10.5",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "denyAccess": 1,
          "applyDefaultPolicy": 2,
          "applyPvid": 3
        }
      }
    },
    "maxaccess": "read-write",
    "status": "obsolete",
    "description": "This has been obsoleted."
  },
  "etsysPolicyMapTable": {
    "name": "etsysPolicyMapTable",
    "oid": "1.3.6.1.4.1.5624.1.2.6.10.6",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "obsolete",
    "description": "This has been obsoleted."
  },
  "etsysPolicyMapEntry": {
    "name": "etsysPolicyMapEntry",
    "oid": "1.3.6.1.4.1.5624.1.2.6.10.6.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyMapIndex",
        "implied": 0
      }
    ],
    "status": "obsolete",
    "description": "This has been obsoleted."
  },
  "etsysPolicyMapIndex": {
    "name": "etsysPolicyMapIndex",
    "oid": "1.3.6.1.4.1.5624.1.2.6.10.6.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "obsolete",
    "description": "This has been obsoleted."
  },
  "etsysPolicyMapRowStatus": {
    "name": "etsysPolicyMapRowStatus",
    "oid": "1.3.6.1.4.1.5624.1.2.6.10.6.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "obsolete",
    "description": "This has been obsoleted."
  },
  "etsysPolicyMapStartVid": {
    "name": "etsysPolicyMapStartVid",
    "oid": "1.3.6.1.4.1.5624.1.2.6.10.6.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "obsolete",
    "description": "This has been obsoleted."
  },
  "etsysPolicyMapEndVid": {
    "name": "etsysPolicyMapEndVid",
    "oid": "1.3.6.1.4.1.5624.1.2.6.10.6.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "obsolete",
    "description": "This has been obsoleted."
  },
  "etsysPolicyMapPolicyIndex": {
    "name": "etsysPolicyMapPolicyIndex",
    "oid": "1.3.6.1.4.1.5624.1.2.6.10.6.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "obsolete",
    "description": "This has been obsoleted."
  },
  "etsysPolicyRulesMaxEntries": {
    "name": "etsysPolicyRulesMaxEntries",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The maximum number of entries allowed in the etsysPolicyRulesTable."
  },
  "etsysPolicyRulesNumEntries": {
    "name": "etsysPolicyRulesNumEntries",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.2",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The current number of entries in the etsysPolicyRulesTable."
  },
  "etsysPolicyRulesLastChange": {
    "name": "etsysPolicyRulesLastChange",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.3",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TimeTicks",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The sysUpTime at which the etsysPolicyRulesTable was last modified."
  },
  "etsysPolicyRulesAccountingEnable": {
    "name": "etsysPolicyRulesAccountingEnable",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.4",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "EnabledStatus",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "disabled",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Controls the collection of rule usage statistics. If disabled, no usage statistics are gathered and no auditing messages will be sent. When enabled, rule will gather usage statistics, and auditing messages will be sent, if enabled for a given rule."
  },
  "etsysPolicyRulesPortDisabledList": {
    "name": "etsysPolicyRulesPortDisabledList",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.5",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "PortList",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "A portlist containing bits representing the dot1dBridgePorts which have been disabled via the mechanism described in the etsysPolicyRuleDisablePort leaf. A set bit indicates a disabled port. Ports may be enabled by performing a set with the corresponding bit cleared. Bits which are set will be ignored during the set operation."
  },
  "etsysPolicyRuleTable": {
    "name": "etsysPolicyRuleTable",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.6",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table containing rules bound to individual policies. A Rule is comprised of three components, a unique description of the network traffic, an associated list of actions, and an associated list of accounting and auditing controls and information. The unique description of the network traffic, defined by a PolicyClassificationRuleType together with a length, matching data and a relevant bits field, port type, and port number (port number zero is reserved to mean any port), and scoped by a etsysPolicyProfileIndex, is used as the table index."
  },
  "etsysPolicyRuleEntry": {
    "name": "etsysPolicyRuleEntry",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.6.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleProfileIndex",
        "implied": 0
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleType",
        "implied": 0
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleData",
        "implied": 0
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulePrefixBits",
        "implied": 0
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulePortType",
        "implied": 0
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulePort",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Describes a particular entry within the etsysPolicyRuleTable. Entries within this table MUST be considered non-volatile and MUST be maintained across entity resets."
  },
  "etsysPolicyRuleProfileIndex": {
    "name": "etsysPolicyRuleProfileIndex",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.6.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 0
          },
          {
            "min": 1,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The etsysPolicyProfileIndex for which the rule is defined. A value of zero(0) has special meaning in that it scopes rules which are used to determine the Policy Profile to which the frame belongs. See the etsysPolicyRuleResult1 and etsysPolicyRuleResult2 descriptions for specifics of how the results of a rule hit differ when the etsysPolicyRuleProfileIndex is zero."
  },
  "etsysPolicyRuleType": {
    "name": "etsysPolicyRuleType",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.6.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyClassificationRuleType",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The type of network traffic reference by the etsysPolicyRuleData."
  },
  "etsysPolicyRuleData": {
    "name": "etsysPolicyRuleData",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.6.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 64
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The data pattern to match against, as defined by the etsysPolicyRuleType, encoded in network-byte order."
  },
  "etsysPolicyRulePrefixBits": {
    "name": "etsysPolicyRulePrefixBits",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.6.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 0
          },
          {
            "min": 1,
            "max": 2048
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The relevant number of bits defined by the etsysPolicyRuleData, to be used when matching against a frame, relevant bits are specified in longest-prefix-first style (left to right). A value of zero carries the special meaning of all bits are relevant."
  },
  "etsysPolicyRulePortType": {
    "name": "etsysPolicyRulePortType",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.6.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PortPolicyProfileIndexTypeTC",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The port number on which the rule will be applied. Zero(0) is a special case, indicating that the rule should be applied to all ports."
  },
  "etsysPolicyRulePort": {
    "name": "etsysPolicyRulePort",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.6.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 0
          },
          {
            "min": 1,
            "max": 2147483647
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The port number on which the rule will be applied. Zero(0) is a special case, indicating that the rule should be applied to all ports."
  },
  "etsysPolicyRuleRowStatus": {
    "name": "etsysPolicyRuleRowStatus",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.6.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status of this row. When set to active(1) this entry's classification rule, as referenced by etsysPolicyRulesOID, becomes one of its associated policy's set of rules. When this entry's associated policy, as defined by etsysPolicyRuleProfileIndex, is active and assigned to a port through the etsysPortPolicyProfileTable or to a station through the etsysStationPolicyProfileTabbe, this classification rule will be applied to the port or station. The exact behavior of this application depends upon the classification rule. When this object is set to notInService(2) or notReady(3) this entry is not considered one of its associated policy's set of rules and this classification rule will not be applied."
  },
  "etsysPolicyRuleStorageType": {
    "name": "etsysPolicyRuleStorageType",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.6.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "StorageType",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "nonVolatile",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The storage type of this row. When set to volatile(1) this entry's classification rule, as referenced by etsysPolicyRulesOID, will be removed (if present) from non-volatile storage. Rows created dynamically by the device will typically report this as their default storage type. When set to nonVolatile(1) this entry's classification rule, as referenced by etsysPolicyRulesOID, will be added to non- volatile storage. This is the default value for rows created as the result of external management. Values of other(0), permanent(4), and readOnly(5) may not be set, although they may be returned for rows created by the device."
  },
  "etsysPolicyRuleUsageList": {
    "name": "etsysPolicyRuleUsageList",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.6.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PortList",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "When read, a set bit indicates that this rule was used to classify traffic on the corresponding port. When set, the native PortList will be bit-wise AND'ed with the set PortList, allowing the agent to clear the usage indication."
  },
  "etsysPolicyRuleResult1": {
    "name": "etsysPolicyRuleResult1",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.6.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": -1,
            "max": -1
          },
          {
            "min": 0,
            "max": 0
          },
          {
            "min": 1,
            "max": 4094
          },
          {
            "min": 4095,
            "max": 4095
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": -1,
        "format": "decimal"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "If the etsysPolicyRuleProfileIndex is 0 then this field is read-only and defines the profile ID which will assigned to frames matching this rule. This is the dynamically assigned value and may differ from the administratively configured value. If the etsysPolicyRuleProfileIndex is not 0 then this field is read-create and defines the VLAN ID with which to mark a frame matching this PolicyRule. Note that three special, otherwise illegal, values of the etsysPolicyRuleVlan are used in defining the forwarding action. -1 Indicates that no VLAN or forwarding behavior modification is desired. A rule will not be matched against for the purpose of determining a marking VID if this value is set. 0 Indicates that the default forwarding action is to drop the packets matching this rule. 4095 Indicates that the default forwarding action is to forward any packets matching this rule."
  },
  "etsysPolicyRuleResult2": {
    "name": "etsysPolicyRuleResult2",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.6.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": -1,
            "max": -1
          },
          {
            "min": 0,
            "max": 4095
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": -1,
        "format": "decimal"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "If the etsysPolicyRuleProfileIndex is 0 then this field is read-create and defines the profile ID which the managing entity desires assigned to frames matching this rule. This is the administrative value and may differ from the dynamically assigned active value. If the etsysPolicyRuleProfileIndex is not 0 then this field is The CoS with which to mark a frame matching this PolicyRule. Note that one special, otherwise illegal, values of the etsysPolicyRuleCoS are used in defining the forwarding action. -1 Indicates that no CoS or forwarding behavior modification is desired. A rule will not be matched against for the purpose of determining a CoS if this value is set."
  },
  "etsysPolicyRuleAuditSyslogEnable": {
    "name": "etsysPolicyRuleAuditSyslogEnable",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.6.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TriStateStatus",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "disabled",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Controls the sending of a syslog message when a bit in the etsysPolicyRuleUsageList transitions from 0 to 1."
  },
  "etsysPolicyRuleAuditTrapEnable": {
    "name": "etsysPolicyRuleAuditTrapEnable",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.6.1.13",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TriStateStatus",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "disabled",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Controls the sending of an SNMP NOTIFICATION when a bit in the etsysPolicyRuleUsageList transitions from 0 to 1."
  },
  "etsysPolicyRuleDisablePort": {
    "name": "etsysPolicyRuleDisablePort",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.6.1.14",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TriStateStatus",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "disabled",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Controls the disabling of a port (ifOperStatus of the corresponding ifIndex will be down) when a bit in the etsysPolicyRuleUsageList transitions from 0 to 1. When set to enabled, the corresponding ifIndex will be disabled upon the transition."
  },
  "etsysPolicyRuleOperPid": {
    "name": "etsysPolicyRuleOperPid",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.6.1.15",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": -1,
            "max": -1
          },
          {
            "min": 0,
            "max": 4095
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": -1,
        "format": "decimal"
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "If the etsysPolicyRuleProfileIndex is 0 then this field contains the currently applied profile ID for frames matching this rule. This may be either the administratively applied value or the dynamically applied value. If the etsysPolicyRuleProfileIndex is not 0, then this object does not exist and will not be returned. Note that one special, otherwise illegal, values of the etsysPolicyRuleCoS are used in defining the forwarding action. -1 Indicates that no profile ID is being applied by this rule."
  },
  "etsysPolicyRuleOverwriteTCI": {
    "name": "etsysPolicyRuleOverwriteTCI",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.6.1.16",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TriStateStatus",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "disabled",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "If set, the information contained within the TCI field of inbound, tagged packets will not be used by the device after the ingress classification stage of packet relay. The net effect will be that the TCI information may be used to classify the packet, but will be overwritten (and ignored) by subsequent stages of packet relay."
  },
  "etsysPolicyRuleMirrorIndex": {
    "name": "etsysPolicyRuleMirrorIndex",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.6.1.17",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": -1,
            "max": -1
          },
          {
            "min": 0,
            "max": 0
          },
          {
            "min": 1,
            "max": 255
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": -1,
        "format": "decimal"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "A reference to a packet mirror destination (defined elsewhere). A value of (-1) indicates no mirror is specified, but a mirror is not explicitly prohibitted. A value of (0) indicates that mirroring is explicitly prohibitted, unless a high precedent rule has specified a mirror."
  },
  "etsysPolicyRulePortTable": {
    "name": "etsysPolicyRulePortTable",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.7",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The purpose of this table is to provide an agent the ability to easily determine which rules have been used on a given bridge port. A row will only be present when the rule which the instancing describes has been used. The agent may remove a row (and clear the used status) by setting the etsysPolicyRulePortHit leaf to False. PolicyClassificationRuleType together with a length, matching data and a relevant bits field, port type, and port number (port number zero is reserved to mean any port), scoped by a etsysPolicyRuleProfileIndex, and preceded by a dot1dBasePort is used as the table index."
  },
  "etsysPolicyRulePortEntry": {
    "name": "etsysPolicyRulePortEntry",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.7.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "BRIDGE-MIB",
        "object": "dot1dBasePort",
        "implied": 0
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleProfileIndex",
        "implied": 0
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleType",
        "implied": 0
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleData",
        "implied": 0
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulePrefixBits",
        "implied": 0
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulePortType",
        "implied": 0
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulePort",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "."
  },
  "etsysPolicyRulePortHit": {
    "name": "etsysPolicyRulePortHit",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.7.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Every row will report a value of True, indicating that the Rule described by the instancing was used on the given port. An agent may be set this leaf to False to clear remove the row and clear the Rule Use bit for the specified Rule, on the given bridgePort."
  },
  "etsysPolicyRuleDynamicProfileAssignmentOverride": {
    "name": "etsysPolicyRuleDynamicProfileAssignmentOverride",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.8",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "If true, administratively assigned profile assignment rules override dynamically assigned profiles assignments for a given rule. If false, the dynamically assigned value (typically created by a successful authentication attempt) overrides the administratively configured value. The agent may optionally implement this leaf as read-only."
  },
  "etsysPolicyRuleDefaultDynamicSyslogStatus": {
    "name": "etsysPolicyRuleDefaultDynamicSyslogStatus",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.9",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TriStateStatus",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "disabled",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "If enabled(1), rules dynamically created will set etsysPolicyRuleAuditSyslogEnable to enabled. If disabled(2) a dynamically created rule will have etsysPolicyRuleAuditSyslogEnable set to disabled. The agent may optionally implement this leaf as read-only."
  },
  "etsysPolicyRuleDefaultDynamicTrapStatus": {
    "name": "etsysPolicyRuleDefaultDynamicTrapStatus",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.10",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TriStateStatus",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "disabled",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "If enabled(1), rules dynamically created will set etsysPolicyRuleAuditTrapEnable to enabled. If disabled(2) a dynamically created rule will have etsysPolicyRuleAuditTrapEnable set to disabled. The agent may optionally implement this leaf as read-only."
  },
  "etsysPolicyRuleStatsAutoClearOnLink": {
    "name": "etsysPolicyRuleStatsAutoClearOnLink",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.11",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "EnabledStatus",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "disabled",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "If set to enabled(1), when operstatus up is detected on any port the agent will clear the rule usage information associated with that port. This ability is further scoped to the list of ports defined by etsysPolicyRuleStatsAutoClearPorts. This leaf is optional and will have no effect on an agent which has rule use accounting disabled or does not support rule use accounting. By default, the rule use accounting information will not be modified by operstatus transitions."
  },
  "etsysPolicyRuleStatsAutoClearInterval": {
    "name": "etsysPolicyRuleStatsAutoClearInterval",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.12",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 0
          },
          {
            "min": 1,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The interval at which the device will automatically clear rule usage statistics, in minutes. This ability is disabled (usage statistics will not be automatically cleared) if set to zero(0). This ability is further scoped to the list of ports defined by etsysPolicyRuleStatsAutoClearPorts. This leaf is optional and will have no effect on an agent which has rule use accounting disabled or does not support rule use accounting."
  },
  "etsysPolicyRuleStatsAutoClearPorts": {
    "name": "etsysPolicyRuleStatsAutoClearPorts",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.13",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "PortList",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The list ports on which rule usage statistics will be cleared by one of the AutoClear actions (etsysPolicyRuleStatsAutoClearInterval, etsysPolicyRuleStatsAutoClearOnProfile, or etsysPolicyRuleStatsAutoClearOnLink). By default, no ports will be set in this list. This leaf is optional, unless the agent claims support for one of the other 'autoclear' objects, and will have no effect on an agent which has rule use accounting disabled or does not support rule use accounting."
  },
  "etsysPolicyRuleStatsAutoClearOnProfile": {
    "name": "etsysPolicyRuleStatsAutoClearOnProfile",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.14",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "EnabledStatus",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "disabled",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "If set to enabled(1), when a rule assigning a PolicyProfile (whose etsysPolicyRuleProfileIndex is zero(0)) is activated, all the rule usage bits associated with the rules bound to the PolicyProfile specified by the etsysPolicyRuleOperPid and the port specified by the etsysPolicyRulePort are cleared (if there is no port specified or no valid etsysPolicyRuleProfileIndex specified, then no action follows). This ability is further scoped to the list of ports defined by etsysPolicyRuleStatsAutoClearPorts. This leaf is optional and will have no effect on an agent which has rule use accounting disabled or does not support rule use accounting. By default, the rule use accounting information will not be modified by the creation or activation of PolicyProfile assignment rules."
  },
  "etsysPolicyRuleStatsDroppedNotifications": {
    "name": "etsysPolicyRuleStatsDroppedNotifications",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.15",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A count of the number of times the agent has dropped notification (syslog or trap) of a etsysPolicyRuleUsageList bit transition. A management entity might use this leaf as an indication to read the etsysPolicyRuleUsageList objects for important rules. This count should be kept to the best of the device's ability, and explicitly does not cover notifications discarded by the network."
  },
  "etsysPolicyRuleSylogMachineReadableFormat": {
    "name": "etsysPolicyRuleSylogMachineReadableFormat",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.16",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "EnabledStatus",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "disabled",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "If enabled, the device should format rule usage messages so that they might be processed by a machine (scripting backend, etc). If disabled, the messages should be formatted for human consumption."
  },
  "etsysPolicyRuleSylogExtendedFormat": {
    "name": "etsysPolicyRuleSylogExtendedFormat",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.17",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "EnabledStatus",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "disabled",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "If enabled, the device should provide additional information in rule-hit syslog messages. This information MAY include what actions may have been initiated by the rule (if any) or data mined from the packet which matched the rule."
  },
  "etsysPolicyRuleSylogEveryTime": {
    "name": "etsysPolicyRuleSylogEveryTime",
    "oid": "1.3.6.1.4.1.5624.1.2.6.11.18",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "EnabledStatus",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "disabled",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "If enabled, the device will syslog on every rule hit (or profile hit) which specifies SYSLOG as the action, instead of only when the associated bit in the etsysPolicyProfileUsageList or the etsysPolicyRuleUsageList is clear. It should be noted that this may cause MANY messages to be generated."
  },
  "etsysPolicyRFC3580MapResolveReponseConflict": {
    "name": "etsysPolicyRFC3580MapResolveReponseConflict",
    "oid": "1.3.6.1.4.1.5624.1.2.6.12.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyRFC3580MapRadiusResponseTC",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "policyProfile",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Indicates which field to use in the application of the RADIUS response in the event that both the proprietary filter-id indicating a policy profile and the standard (RFC3580) vlan- tunnel-attribute are present. If policyProfile(1) is selected, then the filter-id will be used, if vlanTunnelAttribute(2) is selected, then the vlan-tunnel-attribute will be used (and the policy-map will be applied, if present). A value of vlanTunnelAttributeWithPolicyProfile(3) indicates that both attributes should be applied, in the following manner: the policyProfile should be enforced, with the exception of the etsysPolicyProfilePortVid (if present), the returned vlan-tunnel-attribute will be used in its place. In this case, the policy-map will be ignored (as the policyProfile was explicitly assigned). VLAN classification rules will still be applied, as defined by the assigned policyProfile. Modifications of this value will not effect the current status of any users currently authenticated. The new state will be applied to new, successful authentications. The current status of current authentication may be modified through the individual agents or through the ENTERASYS-MULTI-AUTH-MIB, if supported."
  },
  "etsysPolicyRFC3580MapLastChange": {
    "name": "etsysPolicyRFC3580MapLastChange",
    "oid": "1.3.6.1.4.1.5624.1.2.6.12.2",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TimeTicks",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The value of sysUpTime when the etsysPolicyRFC3580MapTable was last modified."
  },
  "etsysPolicyRFC3580MapTableDefault": {
    "name": "etsysPolicyRFC3580MapTableDefault",
    "oid": "1.3.6.1.4.1.5624.1.2.6.12.3",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "If read as True, then the etsysPolicyRFC3580MapTable is in the default state (no mappings have been created), if False, then non-default mappings exist. If set to True, then the etsysPolicyRFC3580MapTable will be put into the default state (no mappings will exist). A set to False is not valid and MUST fail."
  },
  "etsysPolicyRFC3580MapTable": {
    "name": "etsysPolicyRFC3580MapTable",
    "oid": "1.3.6.1.4.1.5624.1.2.6.12.4",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table containing VLAN ID to policy mappings. A policy is a group of classification rules which may be applied on a per user basis, to ports or to stations."
  },
  "etsysPolicyRFC3580MapEntry": {
    "name": "etsysPolicyRFC3580MapEntry",
    "oid": "1.3.6.1.4.1.5624.1.2.6.12.4.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRFC3580MapVlanId",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Conceptually defines a particular entry within the etsysPolicyRFC3580MapTable. Entries within this table MUST be considered non-volatile and MUST be maintained across entity resets."
  },
  "etsysPolicyRFC3580MapVlanId": {
    "name": "etsysPolicyRFC3580MapVlanId",
    "oid": "1.3.6.1.4.1.5624.1.2.6.12.4.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "VlanIndex",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "reference": "IEEE 802.1X RADIUS Usage Guidelines (RFC 3580)",
    "status": "current",
    "description": "The VlanIndex which will map to the policy profile specified by the etsysPolicyRFC3580MapPolicyIndex of this row. This will be used to map the VLAN returned by value from the Tunnel- Private-Group-ID RADIUS attribute."
  },
  "etsysPolicyRFC3580MapPolicyIndex": {
    "name": "etsysPolicyRFC3580MapPolicyIndex",
    "oid": "1.3.6.1.4.1.5624.1.2.6.12.4.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyProfileIDTC",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 0
          },
          {
            "min": 1,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "reference": "IEEE 802.1X RADIUS Usage Guidelines (RFC 3580)",
    "status": "current",
    "description": "The index of a Policy Profle as defined in the etsysPolicyProfileTable. A value of 0 indicates that the row is functionally non- operational (no mapping exists). Devices which support the ENTERASYS-VLAN-AUTHORIZATION-MIB, and for which the value of etsysVlanAuthorizationEnable is Enabled and the value of etsysVlanAuthorizationStatus is Enabled on the port referenced by the authorization request, should then use the VlanIndex provisioned (e.g. from the Tunnel-Private-Group-ID RADIUS attribute) as defined by RFC3580, otherwise, the device should treat the result as if no matching Policy Profile had been found (e.g. as a simple success). In the case where a Policy Profile is already being applied to the referenced station, but no mapping exists, the device MUST treat the Tunnel-Private-Group-ID as an override to the etsysPolicyProfilePortVid defined by that profile (any matched classification rules which explicit provision a VLAN MUST still override both the etsysPolicyProfilePortVid and the Tunnel-Private-Group-ID.) A non-zero value of this object indicates that the VlanIndex provisioned (e.g. from the Tunnel-Private-Group-ID RADIUS attribute) should be mapped to a Policy Profile as defined in the etsysPolicyProfileTable, and that policy applied as if the Policy name had been provisioned instead (e.g, in the Filter-ID RADIUS attribute). If the mapping references a non-existent row of the etsysPolicyProfileTable, or the referenced row has a etsysPolicyProfileRowStatus value other than Active, the device MUST behave as if the mapping did not exist (apply the vlan-tunnel-attribute). The etsysPolicyRFC3580MapInvalidMapping MUST then be incremented."
  },
  "etsysPolicyRFC3580MapInvalidMapping": {
    "name": "etsysPolicyRFC3580MapInvalidMapping",
    "oid": "1.3.6.1.4.1.5624.1.2.6.12.5",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Increments to indicate the number of times the device has detected an invalid/unknown EtsysPolicyRFC3580MapEntry (i.e. one that references an in-active or non-existent etsysPolicyProfile)."
  },
  "etsysPolicyProfileConformance": {
    "name": "etsysPolicyProfileConformance",
    "oid": "1.3.6.1.4.1.5624.1.2.6.7",
    "class": "objectidentity"
  },
  "etsysPolicyProfileGroups": {
    "name": "etsysPolicyProfileGroups",
    "oid": "1.3.6.1.4.1.5624.1.2.6.7.1",
    "class": "objectidentity"
  },
  "etsysPolicyProfileCompliances": {
    "name": "etsysPolicyProfileCompliances",
    "oid": "1.3.6.1.4.1.5624.1.2.6.7.2",
    "class": "objectidentity"
  },
  "etsysPolicyProfileGroup": {
    "name": "etsysPolicyProfileGroup",
    "oid": "1.3.6.1.4.1.5624.1.2.6.7.1.1",
    "class": "objectgroup",
    "objects": [
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileMaxEntries"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileNumEntries"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileLastChange"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileTableNextAvailableIndex"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileName"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileRowStatus"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfilePortVidStatus"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfilePortVid"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfilePriorityStatus"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfilePriority"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileEgressVlans"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileForbiddenVlans"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileUntaggedVlans"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileOverwriteTCI"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileRulePrecedence"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileVlanRFC3580Mappings"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects providing Policy Profile Creation."
  },
  "etsysPolicyClassificationGroup": {
    "name": "etsysPolicyClassificationGroup",
    "oid": "1.3.6.1.4.1.5624.1.2.6.7.1.2",
    "class": "objectgroup",
    "objects": [
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyClassificationMaxEntries"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyClassificationNumEntries"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyClassificationLastChange"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyClassificationOID"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyClassificationRowStatus"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyClassificationIngressList"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects providing a mapping between a set of Classification Rules and a Policy Profile."
  },
  "etsysPortPolicyProfileGroup": {
    "name": "etsysPortPolicyProfileGroup",
    "oid": "1.3.6.1.4.1.5624.1.2.6.7.1.3",
    "class": "objectgroup",
    "objects": [
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPortPolicyProfileLastChange"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPortPolicyProfileAdminID"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPortPolicyProfileOperID"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPortPolicyProfileSummaryAdminID"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPortPolicyProfileSummaryOperID"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects providing a mapping from a specific port to a Policy Profile instance. Only the read-only portions of this group are now current. They are listed under etsysPortPolicyProfileGroup2."
  },
  "etsysStationPolicyProfileGroup": {
    "name": "etsysStationPolicyProfileGroup",
    "oid": "1.3.6.1.4.1.5624.1.2.6.7.1.5",
    "class": "objectgroup",
    "objects": [
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysStationPolicyProfileMaxEntries"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysStationPolicyProfileNumEntries"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysStationPolicyProfileLastChange"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysStationIdentifierType"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysStationIdentifier"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysStationPolicyProfileOperID"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysStationPolicyProfilePortType"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysStationPolicyProfilePortID"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing a mapping from a specific station to a Policy Profile instance."
  },
  "etsysInvalidPolicyPolicyGroup": {
    "name": "etsysInvalidPolicyPolicyGroup",
    "oid": "1.3.6.1.4.1.5624.1.2.6.7.1.6",
    "class": "objectgroup",
    "objects": [
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysInvalidPolicyAction"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysInvalidPolicyCount"
      }
    ],
    "status": "current",
    "description": "A collection of objects that help to define a mapping from logical authorization services outcomes to access control and policy actions."
  },
  "etsysDevicePolicyProfileGroup": {
    "name": "etsysDevicePolicyProfileGroup",
    "oid": "1.3.6.1.4.1.5624.1.2.6.7.1.7",
    "class": "objectgroup",
    "objects": [
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysDevicePolicyProfileDefault"
      }
    ],
    "status": "current",
    "description": "An object that provides a device level supplemental policy for entities that are not able to apply portions of the profile definition uniquely on individual ports."
  },
  "etsysPolicyCapabilitiesGroup": {
    "name": "etsysPolicyCapabilitiesGroup",
    "oid": "1.3.6.1.4.1.5624.1.2.6.7.1.8",
    "class": "objectgroup",
    "objects": [
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyVlanRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyCosRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyDropRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyForwardRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyDynaPIDRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyAdminPIDRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicySyslogRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyTrapRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyDisablePortRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicySupportedPortList"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyEnabledSupportedRuleTypes"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyEnabledEnabledRuleTypes"
      }
    ],
    "status": "deprecated",
    "description": "An object that indicates the capabilities of the managed entity with respect to Policy Profiles."
  },
  "etsysPolicyMapGroup": {
    "name": "etsysPolicyMapGroup",
    "oid": "1.3.6.1.4.1.5624.1.2.6.7.1.9",
    "class": "objectgroup",
    "objects": [
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyMapMaxEntries"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyMapNumEntries"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyMapLastChange"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyMapPvidOverRide"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyMapUnknownPvidPolicy"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyMapRowStatus"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyMapStartVid"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyMapEndVid"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyMapPolicyIndex"
      }
    ],
    "status": "obsolete",
    "description": "This object group has been obsoleted."
  },
  "etsysPolicyRulesGroup": {
    "name": "etsysPolicyRulesGroup",
    "oid": "1.3.6.1.4.1.5624.1.2.6.7.1.10",
    "class": "objectgroup",
    "objects": [
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulesMaxEntries"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulesNumEntries"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulesLastChange"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulesAccountingEnable"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulesPortDisabledList"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleRowStatus"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleStorageType"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleUsageList"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleResult1"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleResult2"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleAuditSyslogEnable"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleAuditTrapEnable"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleDisablePort"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleOperPid"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulePortHit"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleDynamicProfileAssignmentOverride"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleDefaultDynamicSyslogStatus"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleDefaultDynamicTrapStatus"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleStatsAutoClearOnLink"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleStatsAutoClearInterval"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleStatsAutoClearPorts"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleStatsAutoClearOnProfile"
      }
    ],
    "status": "deprecated",
    "description": "An object that indicates the capabilities of the managed entity with respect to Policy Profiles."
  },
  "etsysPortPolicyProfileGroup2": {
    "name": "etsysPortPolicyProfileGroup2",
    "oid": "1.3.6.1.4.1.5624.1.2.6.7.1.11",
    "class": "objectgroup",
    "objects": [
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPortPolicyProfileSummaryAdminID"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPortPolicyProfileSummaryOperID"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPortPolicyProfileSummaryDynamicID"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing a mapping from a specific port to a Policy Profile instance."
  },
  "etsysPolicyRFC3580MapGroup": {
    "name": "etsysPolicyRFC3580MapGroup",
    "oid": "1.3.6.1.4.1.5624.1.2.6.7.1.12",
    "class": "objectgroup",
    "objects": [
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRFC3580MapResolveReponseConflict"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRFC3580MapLastChange"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRFC3580MapTableDefault"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRFC3580MapPolicyIndex"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRFC3580MapInvalidMapping"
      }
    ],
    "status": "current",
    "description": "An object group that provides support for mapping between RFC 3580 style VLAN-policy and Enterasys UPN-policy based on named roles."
  },
  "etsysPolicyCapabilitiesGroup2": {
    "name": "etsysPolicyCapabilitiesGroup2",
    "oid": "1.3.6.1.4.1.5624.1.2.6.7.1.13",
    "class": "objectgroup",
    "objects": [
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyVlanRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyCosRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyDropRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyForwardRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyDynaPIDRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyAdminPIDRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicySyslogRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyTrapRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyDisablePortRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicySupportedPortList"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyEnabledSupportedRuleTypes"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyEnabledEnabledRuleTypes"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleAttributeByteLength"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleAttributeBitLength"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleAttributeMaxCreatable"
      }
    ],
    "status": "deprecated",
    "description": "An object that indicates the capabilities of the managed entity with respect to Policy Profiles and defines the characteristics of policy rule data by rule type."
  },
  "etsysPolicyRulesGroup2": {
    "name": "etsysPolicyRulesGroup2",
    "oid": "1.3.6.1.4.1.5624.1.2.6.7.1.14",
    "class": "objectgroup",
    "objects": [
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulesMaxEntries"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulesNumEntries"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulesLastChange"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulesAccountingEnable"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulesPortDisabledList"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleRowStatus"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleStorageType"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleUsageList"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleResult1"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleResult2"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleAuditSyslogEnable"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleAuditTrapEnable"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleDisablePort"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleOperPid"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulePortHit"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleDynamicProfileAssignmentOverride"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleDefaultDynamicSyslogStatus"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleDefaultDynamicTrapStatus"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleStatsAutoClearOnLink"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleStatsAutoClearInterval"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleStatsAutoClearPorts"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleStatsAutoClearOnProfile"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleStatsDroppedNotifications"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleSylogMachineReadableFormat"
      }
    ],
    "status": "deprecated",
    "description": "********* THIS GROUP IS DEPRECATED ********** An object that indicates the capabilities of the managed entity with respect to Policy Profiles."
  },
  "etsysPolicyRulePortHitNotificationGroup": {
    "name": "etsysPolicyRulePortHitNotificationGroup",
    "oid": "1.3.6.1.4.1.5624.1.2.6.7.1.15",
    "class": "notificationgroup",
    "objects": [
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulePortHitNotification"
      }
    ],
    "status": "current",
    "description": "An object group that provides support for traps sent from the etsysPolicyRulePortHit event."
  },
  "etsysPolicyRulesGroup3": {
    "name": "etsysPolicyRulesGroup3",
    "oid": "1.3.6.1.4.1.5624.1.2.6.7.1.16",
    "class": "objectgroup",
    "objects": [
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulesMaxEntries"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulesNumEntries"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulesLastChange"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulesAccountingEnable"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulesPortDisabledList"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleRowStatus"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleStorageType"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleUsageList"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleResult1"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleResult2"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleAuditSyslogEnable"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleAuditTrapEnable"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleDisablePort"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleOperPid"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulePortHit"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleDynamicProfileAssignmentOverride"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleDefaultDynamicSyslogStatus"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleDefaultDynamicTrapStatus"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleStatsAutoClearOnLink"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleStatsAutoClearInterval"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleStatsAutoClearPorts"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleStatsAutoClearOnProfile"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleStatsDroppedNotifications"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleSylogMachineReadableFormat"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleSylogExtendedFormat"
      }
    ],
    "status": "deprecated",
    "description": "An object that indicates the capabilities of the managed entity with respect to Policy Profiles."
  },
  "etsysPolicyRulesGroup4": {
    "name": "etsysPolicyRulesGroup4",
    "oid": "1.3.6.1.4.1.5624.1.2.6.7.1.17",
    "class": "objectgroup",
    "objects": [
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulesMaxEntries"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulesNumEntries"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulesLastChange"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulesAccountingEnable"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulesPortDisabledList"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleRowStatus"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleStorageType"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleUsageList"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleResult1"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleResult2"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleAuditSyslogEnable"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleAuditTrapEnable"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleDisablePort"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleOperPid"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulePortHit"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleDynamicProfileAssignmentOverride"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleDefaultDynamicSyslogStatus"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleDefaultDynamicTrapStatus"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleStatsAutoClearOnLink"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleStatsAutoClearInterval"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleStatsAutoClearPorts"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleStatsAutoClearOnProfile"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleStatsDroppedNotifications"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleSylogMachineReadableFormat"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleSylogExtendedFormat"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleOverwriteTCI"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleMirrorIndex"
      }
    ],
    "status": "current",
    "description": "An object that indicates the capabilities of the managed entity with respect to Policy Profiles."
  },
  "etsysPolicyCapabilitiesGroup3": {
    "name": "etsysPolicyCapabilitiesGroup3",
    "oid": "1.3.6.1.4.1.5624.1.2.6.7.1.18",
    "class": "objectgroup",
    "objects": [
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyVlanRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyCosRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyDropRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyForwardRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyDynaPIDRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyAdminPIDRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicySyslogRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyTrapRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyDisablePortRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicySupportedPortList"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyEnabledSupportedRuleTypes"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyEnabledEnabledRuleTypes"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleAttributeByteLength"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleAttributeBitLength"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleAttributeMaxCreatable"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleTciOverwriteCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleMirrorCapabilities"
      }
    ],
    "status": "deprecated",
    "description": "An object that indicates the capabilities of the managed entity with respect to Policy Profiles and defines the characteristics of policy rule data by rule type."
  },
  "etsysPolicyProfileGroup2": {
    "name": "etsysPolicyProfileGroup2",
    "oid": "1.3.6.1.4.1.5624.1.2.6.7.1.19",
    "class": "objectgroup",
    "objects": [
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileMaxEntries"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileNumEntries"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileLastChange"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileTableNextAvailableIndex"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileName"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileRowStatus"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfilePortVidStatus"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfilePortVid"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfilePriorityStatus"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfilePriority"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileEgressVlans"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileForbiddenVlans"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileUntaggedVlans"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileOverwriteTCI"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileRulePrecedence"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileVlanRFC3580Mappings"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileMirrorIndex"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileAuditSyslogEnable"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileAuditTrapEnable"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileDisablePort"
      }
    ],
    "status": "deprecated",
    "description": "A collection of objects providing Policy Profile Creation."
  },
  "etsysPolicyRulesGroup5": {
    "name": "etsysPolicyRulesGroup5",
    "oid": "1.3.6.1.4.1.5624.1.2.6.7.1.20",
    "class": "objectgroup",
    "objects": [
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulesMaxEntries"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulesNumEntries"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulesLastChange"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulesAccountingEnable"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulesPortDisabledList"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleRowStatus"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleStorageType"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleUsageList"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleResult1"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleResult2"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleAuditSyslogEnable"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleAuditTrapEnable"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleDisablePort"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleOperPid"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRulePortHit"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleDynamicProfileAssignmentOverride"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleDefaultDynamicSyslogStatus"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleDefaultDynamicTrapStatus"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleStatsAutoClearOnLink"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleStatsAutoClearInterval"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleStatsAutoClearPorts"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleStatsAutoClearOnProfile"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleStatsDroppedNotifications"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleSylogMachineReadableFormat"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleSylogExtendedFormat"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleSylogEveryTime"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleOverwriteTCI"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleMirrorIndex"
      }
    ],
    "status": "current",
    "description": "An object that indicates the capabilities of the managed entity with respect to Policy Profiles."
  },
  "etsysPolicyCapabilitiesGroup4": {
    "name": "etsysPolicyCapabilitiesGroup4",
    "oid": "1.3.6.1.4.1.5624.1.2.6.7.1.21",
    "class": "objectgroup",
    "objects": [
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyVlanRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyCosRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyDropRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyForwardRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyDynaPIDRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyAdminPIDRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicySyslogRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyTrapRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyDisablePortRuleCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicySupportedPortList"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyEnabledSupportedRuleTypes"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyEnabledEnabledRuleTypes"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyEnabledEgressEnabled"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleAttributeByteLength"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleAttributeBitLength"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleAttributeMaxCreatable"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleTciOverwriteCapabilities"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyRuleMirrorCapabilities"
      }
    ],
    "status": "current",
    "description": "An object that indicates the capabilities of the managed entity with respect to Policy Profiles and defines the characteristics of policy rule data by rule type."
  },
  "etsysPolicyProfileGroup3": {
    "name": "etsysPolicyProfileGroup3",
    "oid": "1.3.6.1.4.1.5624.1.2.6.7.1.22",
    "class": "objectgroup",
    "objects": [
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileMaxEntries"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileNumEntries"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileLastChange"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileTableNextAvailableIndex"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileName"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileRowStatus"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfilePortVidStatus"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfilePortVid"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfilePriorityStatus"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfilePriority"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileEgressVlans"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileForbiddenVlans"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileUntaggedVlans"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileOverwriteTCI"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileRulePrecedence"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileVlanRFC3580Mappings"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileMirrorIndex"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileAuditSyslogEnable"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileAuditTrapEnable"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileDisablePort"
      },
      {
        "module": "ENTERASYS-POLICY-PROFILE-MIB",
        "object": "etsysPolicyProfileUsageList"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing Policy Profile Creation."
  },
  "etsysPolicyProfileCompliance": {
    "name": "etsysPolicyProfileCompliance",
    "oid": "1.3.6.1.4.1.5624.1.2.6.7.2.1",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "etsysPolicyProfileGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysPortPolicyProfileGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysPolicyClassificationGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysStationPolicyProfileGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysInvalidPolicyPolicyGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for devices that support Policy Profiles. This compliance statement was deprecated to add mandatory support for the etsysPolicyCapabilitiesGroup and conditionally mandatory support for the etsysDevicePolicyProfileGroup."
  },
  "etsysPolicyProfileCompliance2": {
    "name": "etsysPolicyProfileCompliance2",
    "oid": "1.3.6.1.4.1.5624.1.2.6.7.2.2",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "etsysPolicyProfileGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysPortPolicyProfileGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysPolicyCapabilitiesGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysPolicyClassificationGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysStationPolicyProfileGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysInvalidPolicyPolicyGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysDevicePolicyProfileGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysPolicyRFC3580MapGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for devices that support Policy Profiles. This compliance state was deprecated to remove the conditional support of the etsysPolicyClassificationGroup, and add support for the etsysPolicyRFC3580MapGroup and the etsysPolicyRulesGroup."
  },
  "etsysPolicyProfileCompliance3": {
    "name": "etsysPolicyProfileCompliance3",
    "oid": "1.3.6.1.4.1.5624.1.2.6.7.2.3",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "etsysPolicyProfileGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysPortPolicyProfileGroup2",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysPolicyCapabilitiesGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysStationPolicyProfileGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysInvalidPolicyPolicyGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysDevicePolicyProfileGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysPolicyRFC3580MapGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysPolicyRulesGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for devices that support Policy Profiles."
  },
  "etsysPolicyProfileCompliance4": {
    "name": "etsysPolicyProfileCompliance4",
    "oid": "1.3.6.1.4.1.5624.1.2.6.7.2.4",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "etsysPolicyProfileGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysPortPolicyProfileGroup2",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysPolicyCapabilitiesGroup2",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysStationPolicyProfileGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysInvalidPolicyPolicyGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysDevicePolicyProfileGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysPolicyRFC3580MapGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysPolicyRulesGroup2",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysPolicyRulePortHitNotificationGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for devices that support Policy Profiles."
  },
  "etsysPolicyProfileCompliance5": {
    "name": "etsysPolicyProfileCompliance5",
    "oid": "1.3.6.1.4.1.5624.1.2.6.7.2.5",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "etsysPolicyProfileGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysPortPolicyProfileGroup2",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysPolicyCapabilitiesGroup2",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysStationPolicyProfileGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysInvalidPolicyPolicyGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysDevicePolicyProfileGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysPolicyRFC3580MapGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysPolicyRulesGroup3",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysPolicyRulePortHitNotificationGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      }
    ],
    "status": "deprecated",
    "description": "The compliance statement for devices that support Policy Profiles."
  },
  "etsysPolicyProfileCompliance6": {
    "name": "etsysPolicyProfileCompliance6",
    "oid": "1.3.6.1.4.1.5624.1.2.6.7.2.6",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "etsysPolicyProfileGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysPortPolicyProfileGroup2",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysPolicyCapabilitiesGroup3",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysStationPolicyProfileGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysInvalidPolicyPolicyGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysDevicePolicyProfileGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysPolicyRFC3580MapGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysPolicyRulesGroup4",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysPolicyRulePortHitNotificationGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      }
    ],
    "status": "current",
    "description": "The compliance statement for devices that support Policy Profiles."
  },
  "etsysPolicyProfileCompliance7": {
    "name": "etsysPolicyProfileCompliance7",
    "oid": "1.3.6.1.4.1.5624.1.2.6.7.2.7",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "etsysPolicyProfileGroup3",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysPortPolicyProfileGroup2",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysPolicyCapabilitiesGroup4",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysStationPolicyProfileGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysInvalidPolicyPolicyGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysDevicePolicyProfileGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysPolicyRFC3580MapGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysPolicyRulesGroup5",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      },
      {
        "object": "etsysPolicyRulePortHitNotificationGroup",
        "module": "ENTERASYS-POLICY-PROFILE-MIB"
      }
    ],
    "status": "current",
    "description": "The compliance statement for devices that support Policy Profiles."
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/ENTERASYS-POLICY-PROFILE-MIB",
      "Produced by pysmi-0.3.4 at Fri May 24 18:28:28 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "ENTERASYS-POLICY-PROFILE-MIB"
  }
}