{
  "imports": {
    "class": "imports",
    "HCNUM-TC": [
      "CounterBasedGauge64"
    ],
    "HUAWEI-3COM-OID-MIB": [
      "h3cEpon"
    ],
    "IF-MIB": [
      "ifIndex"
    ],
    "SNMPv2-CONF": [
      "OBJECT-GROUP",
      "MODULE-COMPLIANCE",
      "NOTIFICATION-GROUP"
    ],
    "SNMPv2-SMI": [
      "OBJECT-TYPE",
      "MibIdentifier",
      "MODULE-IDENTITY",
      "Bits",
      "mib-2",
      "Gauge32",
      "Unsigned32",
      "IpAddress",
      "Integer32",
      "iso",
      "Counter32",
      "TimeTicks",
      "Counter64",
      "NOTIFICATION-TYPE",
      "OBJECT-IDENTITY"
    ],
    "SNMPv2-TC": [
      "DisplayString",
      "TEXTUAL-CONVENTION",
      "MacAddress",
      "DateAndTime"
    ]
  },
  "h3cEfmOamMIB": {
    "name": "h3cEfmOamMIB",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3",
    "class": "moduleidentity",
    "revisions": [
      {
        "revision": "2004-10-24 00:00",
        "description": "Initial version, published as RFC XXXX."
      }
    ],
    "lastupdated": "200410240000Z",
    "organization": "IETF Ethernet Interfaces and Hub MIB Working Group",
    "contactinfo": "WG Charter: http://www.ietf.org/html.charters/hubmib-charter.html Mailing lists: General Discussion: hubmib@ietf.org To Subscribe: hubmib-requests@ietf.org In Body: subscribe your_email_address Chair: Dan Romascanu, Avaya Tel: +972-3-645-8414 Email: dromasca@avaya.com Editor: Matt Squire Hatteras Networks Tel: +1-919-991-5460 Fax: +1-919-991-0743 E-mail: msquire@hatterasnetworks.com ",
    "description": "The MIB module for managing the new Ethernet OAM features introduced by the Ethernet in the First Mile task force (IEEE 802.3ah). The functionality presented here is based on IEEE 802.3ah [802.3ah], released in October, 2004. In particular, this MIB focused on the changes to Clause 30 of the draft that are not specific to any physical layer. These changes are primarily reflected in the new OAM features developed under this project, that can be applied to any Ethernet like interface. The OAM features are described in Clause 57 of [802.3ah]. This mib is excerpted from the draft files directly,only changed the object name,added the h3c as prefix. The following reference is used throughout this MIB module: [802.3ah] refers to: IEEE Std 802.3ah-2004: 'Draft amendment to - Information technology - Telecommunications and information exchange between systems - Local and metropolitan are networks - Specific requirements - Part 3: Carrier sense multiple access with collision detection (CSMA/CD) access method and physical layer specifications - Media Access Control Parameters, Physical Layers and Management Parameters for subscriber access networks', October 2004. [802-2001] refers to: 'IEEE Standard for LAN/MAN (Local Area Network/Metropolitan Area Network): Overview and Architecture', IEEE 802, June 2001. Copyright (c) The Internet Society (2004). This version of this MIB module is part of RFC XXXX; See the RFC itself for full legal notices. "
  },
  "h3cDot3OamMIB": {
    "name": "h3cDot3OamMIB",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1",
    "class": "objectidentity"
  },
  "h3cDot3OamConformance": {
    "name": "h3cDot3OamConformance",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.2",
    "class": "objectidentity"
  },
  "Dot3Oui": {
    "name": "Dot3Oui",
    "class": "textualconvention",
    "type": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 3,
            "max": 3
          }
        ]
      }
    },
    "status": "current",
    "description": "24-bit Organizationally Unique Identifier. Information on OUIs can be found in IEEE 802-2001 [802-2001] Clause 9."
  },
  "h3cDot3OamTable": {
    "name": "h3cDot3OamTable",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Primary controls and status for the OAM capabilities of an Ethernet like interface. There will be one row in this table for each Ethernet like interface in the system that supports the Ethernet OAM functions defined in [802.3ah]."
  },
  "h3cDot3OamEntry": {
    "name": "h3cDot3OamEntry",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry in the table, containing information on the Ethernet OAM function for a single Ethernet like interface."
  },
  "h3cDot3OamAdminState": {
    "name": "h3cDot3OamAdminState",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "disabled": 1,
          "enabled": 2
        }
      }
    },
    "maxaccess": "read-write",
    "reference": "[802.3ah], 30.3.6.1.2",
    "status": "current",
    "description": "This object is used to provision the default administrative OAM mode for this interface. This object represents the desired state of OAM for this interface. The h3cDot3OamAdminState always starts in the disabled(1) state until an explicity management action or configuration information retained by the system causes a transition to the enabled(2) state. Note that the value of this object is ignored when the interface is not operating in full-duplex mode. OAM is not supported on half-duplex links. "
  },
  "h3cDot3OamOperStatus": {
    "name": "h3cDot3OamOperStatus",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "disabled": 1,
          "linkfault": 2,
          "passiveWait": 3,
          "activeSendLocal": 4,
          "sendLocalAndRemote": 5,
          "sendLocalAndRemoteOk": 6,
          "oamPeeringLocallyRejected": 7,
          "oamPeeringRemotelyRejected": 8,
          "operational": 9
        }
      }
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.4, 30.3.6.1.10, 30.3.6.1.11",
    "status": "current",
    "description": "At initialization and failure conditions, two OAM entities on the same full-duplex Ethernet link begin a discovery phase to determine what OAM capabilities may be used on that link. The progress of this initialization is controlled by the OAM sublayer. This value is always disabled(1) if OAM is disabled on this interface via the h3cDot3OamAdminState. If the link has detected a fault and is transmitting OAMPDUs with a link fault indication, the value is linkFault(2). The passiveWait(3) state is returned only by OAM entities in passive mode (h3cDot3OamMode) and reflects the state in which the OAM entity is waiting to see if the peer device is OAM capable. The activeSendLocal(4) is used by active mode devices (h3cDot3OamMode) and reflects the OAM entity actively trying to discover whether the peer has OAM capability but has not yet made that determination. The state sendLocalAndRemote(5) reflects that the local OAM entity has discovered the peer but has not yet accepted or rejected the configuration of the peer. The local device can, for whatever reason, decide that the peer device is unacceptable and decline OAM peering. If the local OAM entity rejects the peer OAM entity, the state becomes oamPeeringLocallyRejected(7). If the OAM peering is allowed by the local device, the state moves to sendLocalAndRemoteOk(6). Note that both the sendLocalAndRemote(5) and oamPeeringLocallyRejected(7) states fall within the state SEND_LOCAL_REMOTE of the Discovery state diagram [802.3ah, Figure 57-5], with the difference being whether the local OAM client has actively rejected the peering or has just not indicated any decision yet. Whether a peering decision has been made is indicated via the local flags field in the OAMPDU (reflected in the aOAMLocalFlagsField of 30.3.6.1.10). If the remote OAM entity rejects the peering, the state becomes oamPeeringRemotelyRejected(8). Note that both the sendLocalAndRemoteOk(6) and oamPeeringRemotelyRejected(8) states fall within the state SEND_LOCAL_REMOTE_OK of the Discovery state diagram [802.3ah, Figure 57-5], with the difference being whether the remote OAM client has rejected the peering or has just not yet decided. This is indicated via the remote flags field in the OAM PDU (reflected in the aOAMRemoteFlagsField of 30.3.6.1.11). When the local OAM entity learns that both it and the remote OAM entity have accepted the peering, the state moves to operational(9) corresponding to the SEND_ANY state of the Discovery state diagram [802.3ah, Figure 57-5]. "
  },
  "h3cDot3OamMode": {
    "name": "h3cDot3OamMode",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "active": 1,
          "passive": 2
        }
      }
    },
    "maxaccess": "read-write",
    "reference": "[802.3ah], 30.3.6.1.3",
    "status": "current",
    "description": "This object configures the mode of OAM operation for this Ethernet like interface. OAM on Ethernet interfaces may be in 'active' mode or 'passive' mode. These two modes differ in that active mode provides additional capabilities to initiate monitoring activities with the remote OAM peer entity, while passive mode generally waits for the peer to initiate OAM actions with it. As an example, an active OAM entity can put the remote OAM entity in a loopback state, where a passive OAM entity cannot. Changing this value results in incrementing the configuration revision field of locally generated OAMPDUs (30.3.6.1.12) and potentially re-doing the OAM discovery process if the h3cDot3OamOperStatus was already operational(9). "
  },
  "h3cDot3OamMaxOamPduSize": {
    "name": "h3cDot3OamMaxOamPduSize",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 64,
            "max": 1522
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.8",
    "status": "current",
    "description": "The largest OAMPDU that the OAM entity supports. OAM entities exchange maximum OAMPDU sizes and negotiate to use the smaller of the two maximum OAMPDU sizes between the peers. This value is determined by the local implementation. "
  },
  "h3cDot3OamConfigRevision": {
    "name": "h3cDot3OamConfigRevision",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.12",
    "status": "current",
    "description": "The configuration revision of the OAM entity as reflected in the latest OAMPDU sent by the OAM entity. The config revision is used by OAM entities to indicate configuration changes have occured which might require the peer OAM entity to re-evaluate whether the peering is allowed. See local_satisfied in [802.3ah, 57.3.1.2]. "
  },
  "h3cDot3OamFunctionsSupported": {
    "name": "h3cDot3OamFunctionsSupported",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Bits",
      "class": "type",
      "bits": {
        "unidirectionalSupport": 0,
        "loopbackSupport": 1,
        "eventSupport": 2,
        "variableSupport": 3
      }
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.6",
    "status": "current",
    "description": "The OAM functions supported on this Ethernet like interface. OAM consists of separate functional sets beyond the basic discovery process which is always required. These functional groups can be supported independently by any implementation. These values are communicated to the peer via the local configuration field of Information OAMPDUs. "
  },
  "h3cDot3OamPeerTable": {
    "name": "h3cDot3OamPeerTable",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Information about the OAM peer for a particular Ethernet like interface. OAM entities communicate with a single OAM peer entity on full-duplex Ethernet links on which OAM is enabled and operating properly. In certain states, the OAM peer information is not available. Whether peer information is available is communicated via the h3cDot3OamPeerStatus object. When this object is inactive, all other information in the row is to be considered invalid. "
  },
  "h3cDot3OamPeerEntry": {
    "name": "h3cDot3OamPeerEntry",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry in the table, containing information on the peer OAM entity for a single Ethernet like interface. Note that there is at most one OAM peer for each Ethernet like interface. There is exactly one row in this table for each Ethernet like interface supporting OAM. "
  },
  "h3cDot3OamPeerStatus": {
    "name": "h3cDot3OamPeerStatus",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "active": 1,
          "inactive": 2
        }
      }
    },
    "maxaccess": "read-only",
    "reference": "N/A",
    "status": "current",
    "description": "This object indicates whether the information in this row should be considered valid. When active(1), the information is valid and represents the current peer of the OAM entity. When inactive(2), the information in this row is invalid. A value of inactive(2) is returned if the h3cDot3OamOperStatus is disabled, passiveWait, or activeSendLocal. For all other values of h3cDot3OamOperStatus, a value of active(1) is returned. "
  },
  "h3cDot3OamPeerMacAddress": {
    "name": "h3cDot3OamPeerMacAddress",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.2.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "MacAddress",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.5.",
    "status": "current",
    "description": "The MAC address of the peer OAM entity. The MAC address is derived from the most recently received OAMPDU. This value is initialized to all zeros (0x000000000000). This value is invalid if the h3cDot3OamPeerStatus is inactive. An OAMPDU is indicated by a valid frame with (1) destination MAC address equal to that of the reserved MAC address for Slow Protocols (See 43B of [802.3ah]), (2) a lengthOrType field equal to the reserved type for Slow Protocols, (3) and a Slow Protocols subtype equal to that of the subtype reserved for OAM. "
  },
  "h3cDot3OamPeerVendorOui": {
    "name": "h3cDot3OamPeerVendorOui",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.2.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Dot3Oui",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.16.",
    "status": "current",
    "description": "The OUI of the OAM peer as reflected in the latest Information OAMPDU received with a Local Information TLV. The OUI can be used to identify the vendor of the remote OAM entity. This value is initialized to all zeros (0x000000). This value is considered invalid if the h3cDot3OamPeerStatus is inactive. An Information OAMPDU is indicated by a valid frame with (1) destination MAC address equal to that of the reserved MAC address for Slow Protocols (See 43B of [802.3ah]), (2) a lengthOrType field equal to the reserved type for Slow Protocols, (3) a Slow Protocols subtype equal to that of the subtype reserved for OAM, (4) a OAM code that equals the code reserved for Information OAMPDUs. "
  },
  "h3cDot3OamPeerVendorInfo": {
    "name": "h3cDot3OamPeerVendorInfo",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.2.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.17.",
    "status": "current",
    "description": "The Vendor Info of the OAM peer as reflected in the latest Information OAMPDU received with a Local Information TLV. The vendor information field is within the Local Information TLV, and can be used to determine additional information about the peer entity. The format of the vendor information is unspecified within the 32-bit field. This value is intialized to all zeros (0x00000000). This value is invalid if the h3cDot3OamPeerStatus is inactive. An Information OAMPDU is indicated by a valid frame with (1) destination MAC address equal to that of the reserved MAC address for Slow Protocols (See 43B of [802.3ah]), (2) a lengthOrType field equal to the reserved type for Slow Protocols, (3) a Slow Protocols subtype equal to that of the subtype reserved for OAM, and (4) a OAM code that equals the code reserved for Information OAMPDUs. "
  },
  "h3cDot3OamPeerMode": {
    "name": "h3cDot3OamPeerMode",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.2.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "active": 1,
          "passive": 2,
          "unknown": 3
        }
      }
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.7.",
    "status": "current",
    "description": "The mode of the OAM peer as reflected in the latest Information OAMPDU received with a Local Information TLV. The mode of the peer can be determined from the Configuration field in the Local Information TLV of the last Information OAMPDU received from the peer. This value is initialized to unknown(3), and is not valid if the h3cDot3OamPeerStatus is inactive. An Information OAMPDU is indicated by a valid frame with (1) destination MAC address equal to that of the reserved MAC address for Slow Protocols (See 43B of [802.3ah]), (2) a lengthOrType field equal to the reserved type for Slow Protocols, (3) a Slow Protocols subtype equal to that of the subtype reserved for OAM, and (4) a OAM code that equals the code reserved for Information OAMPDUs. "
  },
  "h3cDot3OamPeerMaxOamPduSize": {
    "name": "h3cDot3OamPeerMaxOamPduSize",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.2.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 64,
            "max": 1522
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.9.",
    "status": "current",
    "description": "The maximum size of OAMPDU supported by the peer as reflected in the latest Information OAMPDU received with a Local Information TLV. Ethernet OAM on this interface must not use OAMPDUs that exceed this size. The maximum OAMPDU size can be determined from the PDU Configuration field of the Local Information TLV of the last Information OAMPDU received from the peer. This value is initialized to 64, and is invalid if the h3cDot3OamPeerStatus is inactive. An Information OAMPDU is indicated by a valid frame with (1) destination MAC address equal to that of the reserved MAC address for Slow Protocols (See 43B of [802.3ah]), (2) a lengthOrType field equal to the reserved type for Slow Protocols, (3) a Slow Protocols subtype equal to that of the subtype reserved for OAM, and (4) a OAM code that equals the code reserved for Information OAMPDUs. "
  },
  "h3cDot3OamPeerConfigRevision": {
    "name": "h3cDot3OamPeerConfigRevision",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.2.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.13.",
    "status": "current",
    "description": "The configuration revision of the OAM peer as reflected in the latest OAMPDU. This attribute is changed by the peer whenever it has a local configuration change for Ethernet OAM this interface. This value is initialized to all zeros (0x00000000), and is invalid if the h3cDot3OamPeerStatus is inactive. The configuration revision can be determined from the Revision field of the Local Information TLV of the most recently received Information OAMPDU with a Local Information TLV. An Information OAMPDU is indicated by a valid frame with (1) destination MAC address equal to that of the reserved MAC address for Slow Protocols (See 43B of [802.3ah]), (2) a lengthOrType field equal to the reserved type for Slow Protocols, (3) a Slow Protocols subtype equal to that of the subtype reserved for OAM, and (4) a OAM code that equals the code reserved for Information OAMPDUs. "
  },
  "h3cDot3OamPeerFunctionsSupported": {
    "name": "h3cDot3OamPeerFunctionsSupported",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.2.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Bits",
      "class": "type",
      "bits": {
        "unidirectionalSupport": 0,
        "loopbackSupport": 1,
        "eventSupport": 2,
        "variableSupport": 3
      }
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], REFERENCE 30.3.6.1.7.",
    "status": "current",
    "description": "The OAM functions supported on this Ethernet like interface. OAM consists of separate functionality sets above the basic discovery process. This value indicates the capabilities of the peer OAM entity with respect to these functions. This value is initialized so all bits are clear, and is invalid if the h3cDot3OamPeerStatus is inactive. The capbilities of the OAM peer can be determined from the configuration field of the Local Information TLV of the most recently received Information OAMPDU with a Local Information TLV. An Information OAMPDU is indicated by a valid frame with (1) destination MAC address equal to that of the reserved MAC address for Slow Protocols (See 43B of [802.3ah]), (2) a lengthOrType field equal to the reserved type for Slow Protocols, (3) a Slow Protocols subtype equal to that of the subtype reserved for OAM, and (4) a OAM code that equals the code reserved for Information OAMPDUs. "
  },
  "h3cDot3OamLoopbackTable": {
    "name": "h3cDot3OamLoopbackTable",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.3",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains methods to control the loopback state of the local link as well as indicating the status of the loopback function. Loopback can be used to place the remote OAM entity in a state where every received frame (except OAMPDUs) are echoed back over the same interface on which they were received. In this state, at the remote entity, 'normal' traffic is disabled as only the looped back frames are transmitted on the interface. Loopback is thus an intrusive operation that prohibits normal data flow and should be used accordingly. "
  },
  "h3cDot3OamLoopbackEntry": {
    "name": "h3cDot3OamLoopbackEntry",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.3.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry in the table, containing information on the loopback status for a single Ethernet like interface. There is an entry in this table for every Ethernet like interface on which supports OAM and loopback function within OAM (as indicated in h3cDot3OamFunctionsSupported). "
  },
  "h3cDot3OamLoopbackCommand": {
    "name": "h3cDot3OamLoopbackCommand",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.3.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "noLoopback": 1,
          "startRemoteLoopback": 2,
          "stopRemoteLoopback": 3
        }
      }
    },
    "maxaccess": "read-write",
    "reference": "[802.3ah], 57.2.11",
    "status": "current",
    "description": "This attribute initiates or terminates remote loopback with an OAM peer. Writing startRemoteLoopback(2) to this attribute cause the local OAM client to send a loopback OAMPDU to the OAM peer with the loopback enable flags set. Writing stopRemoteLoopback(3) to this attribute will cause the local OAM client to send a loopback OAMPDU to the OAM peer with the loopback enable flags cleared. Writing noLoopback to this attribute has no effect. Writes to this attribute are ignored unless the OAM status of this interface is 'operational' (h3cDot3OamOperStatus). The attribute always returns noLoopback on a read. To determine the loopback status, use the attribute h3cDot3OamLoopbackStatus. "
  },
  "h3cDot3OamLoopbackStatus": {
    "name": "h3cDot3OamLoopbackStatus",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.3.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "noLoopback": 1,
          "initiatingLoopback": 2,
          "remoteLoopback": 3,
          "terminatingLoopback": 4,
          "localLoopback": 5,
          "unknown": 6
        }
      }
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], REFERENCE 57.2.11, 30.3.61.14, 30.3.6.1.15",
    "status": "current",
    "description": "The loopback status of the OAM entity. This status is determined by a combination of the local parser and multiplexer states, the remote parser and multiplexer states, as well as by the actions of the local OAM client. When operating in normal mode with no loopback in progress, the status reads noLoopback(1). If the OAM client has sent an Loopback OAMPDU and is waiting for a response, where the local parser and multiplexer states are DISCARD (see [802.3ah, 57.2.11.1]), the status is 'initiatingLoopback'. In this case, the local OAM entity has yet to receive any acknowledgement that the remote OAM entity has received its loopback command request. If the local OAM client knows that the remote OAM entity is in loopback mode (via the remote state information as described in [802.3ah, 57.2.11.1, 30.3.6.1.15]), the status is remoteLoopback(3). If the local OAM client is in the process of terminating the remote loopback [802.3ah, 57.2.11.3, 30.3.6.1.14], with its local multiplexer and parser states in DISCARD, the status is terminatingLoopback(4). If the remote OAM client has put the local OAM entity in loopback mode as indicated by its local parser state, the status is localLoopback(5). The unknown(6) status indicates the parser and multiplexer combination is unexpected. This status may be returned if the OAM loopback is in a transition state but should not persist. The values of this attribute correspond to the following values of the local and remote parser and multiplexer states. value LclPrsr LclMux RmtPrsr RmtMux noLoopback FWD FWD FWD FWD initLoopback DISCARD DISCARD FWD FWD rmtLoopback DISCARD FWD LPBK DISCARD tmtngLoopback DISCARD DISCARD LPBK DISCARD lclLoopback LPBK DISCARD DISCARD FWD unknown *** any other combination *** "
  },
  "h3cDot3OamLoopbackIgnoreRx": {
    "name": "h3cDot3OamLoopbackIgnoreRx",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.3.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "ignore": 1,
          "process": 2
        }
      }
    },
    "maxaccess": "read-write",
    "reference": "[802.3ah], REFERENCE 57.2.11, 30.3.61.14, 30.3.6.1.15",
    "status": "current",
    "description": "Since OAM loopback is a distruptive operation (user traffic does not pass), this attribute provides a mechanism to provide controls over whether received OAM loopback commands are processed or ignored. When the value is ignore(1), received loopback commands are ignored. When the value is process(2), OAM loopback commands are processed. The default value is to ignore loopback commands (ignore(1)). The attribute has no meaning if the local OAM entity does not support the loopback function (as defined in h3cDot3OamFunctionsSupported). "
  },
  "h3cDot3OamStatsTable": {
    "name": "h3cDot3OamStatsTable",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.4",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Statistics for the OAM function on a particular Ethernet like interface."
  },
  "h3cDot3OamStatsEntry": {
    "name": "h3cDot3OamStatsEntry",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.4.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry in the table, containing statistics information on the Ethernet OAM function for a single Ethernet like interface."
  },
  "h3cDot3OamInformationTx": {
    "name": "h3cDot3OamInformationTx",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.4.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.20.",
    "status": "current",
    "description": "A count of the number of Information OAMPDUs transmitted on this interface. An Information OAMPDU is indicated by a valid frame with (1) destination MAC address equal to that of the reserved MAC address for Slow Protocols (See 43B of [802.3ah]), (2) a lengthOrType field equal to the reserved type for Slow Protocols, (3) a Slow Protocols subtype equal to that of the subtype reserved for OAM, and (4) an OAMPDU code equals the OAM Information code. Discontinuities of this counter can occur at re-initialization of the management system, and at other times as indicated by the value of the ifCounterDiscontinuityTime. "
  },
  "h3cDot3OamInformationRx": {
    "name": "h3cDot3OamInformationRx",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.4.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.21.",
    "status": "current",
    "description": "A count of the number of Information OAMPDUs received on this interface. An Information OAMPDU is indicated by a valid frame with (1) destination MAC address equal to that of the reserved MAC address for Slow Protocols (See 43B of [802.3ah]), (2) a lengthOrType field equal to the reserved type for Slow Protocols, (3) a Slow Protocols subtype equal to that of the subtype reserved for OAM, and (4) an OAMPDU code equals the OAM Information code. Discontinuities of this counter can occur at re-initialization of the management system, and at other times as indicated by the value of the ifCounterDiscontinuityTime. "
  },
  "h3cDot3OamUniqueEventNotificationTx": {
    "name": "h3cDot3OamUniqueEventNotificationTx",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.4.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.22.",
    "status": "current",
    "description": "A count of the number of unique Event OAMPDUs transmitted on this interface. Event notifications may be sent in duplicate to increase the probability of successfully being received, given the possiblity that a frame may be lost in transit. An Event Notification OAMPDU is indicated by a valid frame with (1) destination MAC address equal to that of the reserved MAC address for Slow Protocols (See 43B of [802.3ah]), (2) a lengthOrType field equal to the reserved type for Slow Protocols, (3) a Slow Protocols subtype equal to that of the subtype reserved for OAM, and (4) an OAMPDU code equals the OAM Event code. A unique Event Notification OAMPDU is indicated as an Event Notification OAMPDU with a Sequence Number field that is distinct from the previously transmitted Event Notification OAMPDU Sequence Number. Discontinuities of this counter can occur at re-initialization of the management system, and at other times as indicated by the value of the ifCounterDiscontinuityTime. "
  },
  "h3cDot3OamUniqueEventNotificationRx": {
    "name": "h3cDot3OamUniqueEventNotificationRx",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.4.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.24.",
    "status": "current",
    "description": "A count of the number of unique Event OAMPDUs received on this interface. Event notification OAMPDUs may be sent in duplicate to increase the probability of successfully being received, given the possiblity that a frame may be lost in transit. An Event Notification OAMPDU is indicated by a valid frame with (1) destination MAC address equal to that of the reserved MAC address for Slow Protocols (See 43B of [802.3ah]), (2) a lengthOrType field equal to the reserved type for Slow Protocols, (3) a Slow Protocols subtype equal to that of the subtype reserved for OAM, and (4) an OAMPDU code equals the OAM Event code. A unique Event Notification OAMPDU is indicated as an Event Notification OAMPDU with a Sequence Number field that is distinct from the previously received Event Notification OAMPDU Sequence Number. Discontinuities of this counter can occur at re-initialization of the management system, and at other times as indicated by the value of the ifCounterDiscontinuityTime. "
  },
  "h3cDot3OamDuplicateEventNotificationTx": {
    "name": "h3cDot3OamDuplicateEventNotificationTx",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.4.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.23.",
    "status": "current",
    "description": "A count of the number of duplicate Event OAMPDUs transmitted on this interface. Event notification OAMPDUs may be sent in duplicate to increase the probability of successfully being received, given the possiblity that a frame may be lost in transit. An Event Notification OAMPDU is indicated by a valid frame with (1) destination MAC address equal to that of the reserved MAC address for Slow Protocols (See 43B of [802.3ah]), (2) a lengthOrType field equal to the reserved type for Slow Protocols, (3) a Slow Protocols subtype equal to that of the subtype reserved for OAM, and (4) an OAMPDU code equals the OAM Event code. A duplicate Event Notification OAMPDU is indicated as an Event Notification OAMPDU with a Sequence Number field that is identical to the previously transmitted Event Notification OAMPDU Sequence Number. Discontinuities of this counter can occur at re-initialization of the management system, and at other times as indicated by the value of the ifCounterDiscontinuityTime. "
  },
  "h3cDot3OamDuplicateEventNotificationRx": {
    "name": "h3cDot3OamDuplicateEventNotificationRx",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.4.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.25.",
    "status": "current",
    "description": "A count of the number of duplicate Event OAMPDUs received on this interface. Event notification OAMPDUs may be sent in duplicate to increase the probability of successfully being received, given the possiblity that a frame may be lost in transit. An Event Notification OAMPDU is indicated by a valid frame with (1) destination MAC address equal to that of the reserved MAC address for Slow Protocols (See 43B of [802.3ah]), (2) a lengthOrType field equal to the reserved type for Slow Protocols, (3) a Slow Protocols subtype equal to that of the subtype reserved for OAM, and (4) an OAMPDU code equals the OAM Event code. A duplicate Event Notification OAMPDU is indicated as an Event Notification OAMPDU with a Sequence Number field that is identical to the previously received Event Notification OAMPDU Sequence Number. Discontinuities of this counter can occur at re-initialization of the management system, and at other times as indicated by the value of the ifCounterDiscontinuityTime. "
  },
  "h3cDot3OamLoopbackControlTx": {
    "name": "h3cDot3OamLoopbackControlTx",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.4.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.26.",
    "status": "current",
    "description": "A count of the number of Loopback Control OAMPDUs transmitted on this interface. An Loopback Conrol OAMPDU is indicated by a valid frame with (1) destination MAC address equal to that of the reserved MAC address for Slow Protocols (See 43B of [802.3ah]), (2) a lengthOrType field equal to the reserved type for Slow Protocols, (3) a Slow Protocols subtype equal to that of the subtype reserved for OAM, and (4) an OAMPDU code equals the OAM Loopback Control code. Discontinuities of this counter can occur at re-initialization of the management system, and at other times as indicated by the value of the ifCounterDiscontinuityTime. "
  },
  "h3cDot3OamLoopbackControlRx": {
    "name": "h3cDot3OamLoopbackControlRx",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.4.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.27.",
    "status": "current",
    "description": "A count of the number of Loopback Control OAMPDUs transmitted on this interface. An Loopback Control OAMPDU is indicated by a valid frame with (1) destination MAC address equal to that of the reserved MAC address for Slow Protocols (See 43B of [802.3ah]), (2) a lengthOrType field equal to the reserved type for Slow Protocols, (3) a Slow Protocols subtype equal to that of the subtype reserved for OAM, and (4) an OAMPDU code equals the OAM Loopback Control code. Discontinuities of this counter can occur at re-initialization of the management system, and at other times as indicated by the value of the ifCounterDiscontinuityTime. "
  },
  "h3cDot3OamVariableRequestTx": {
    "name": "h3cDot3OamVariableRequestTx",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.4.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.28.",
    "status": "current",
    "description": "A count of the number of Variable Request OAMPDUs transmitted on this interface. An Variable Request OAMPDU is indicated by a valid frame with (1) destination MAC address equal to that of the reserved MAC address for Slow Protocols (See 43B of [802.3ah]), (2) a lengthOrType field equal to the reserved type for Slow Protocols, (3) a Slow Protocols subtype equal to that of the subtype reserved for OAM, and (4) an OAMPDU code equals the OAM Variable Request code. Discontinuities of this counter can occur at re-initialization of the management system, and at other times as indicated by the value of the ifCounterDiscontinuityTime. "
  },
  "h3cDot3OamVariableRequestRx": {
    "name": "h3cDot3OamVariableRequestRx",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.4.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.29.",
    "status": "current",
    "description": "A count of the number of Variable Request OAMPDUs received on this interface. An Variable Request OAMPDU is indicated by a valid frame with (1) destination MAC address equal to that of the reserved MAC address for Slow Protocols (See 43B of [802.3ah]), (2) a lengthOrType field equal to the reserved type for Slow Protocols, (3) a Slow Protocols subtype equal to that of the subtype reserved for OAM, and (4) an OAMPDU code equals the OAM Variable Request code. Discontinuities of this counter can occur at re-initialization of the management system, and at other times as indicated by the value of the ifCounterDiscontinuityTime. "
  },
  "h3cDot3OamVariableResponseTx": {
    "name": "h3cDot3OamVariableResponseTx",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.4.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.30.",
    "status": "current",
    "description": "A count of the number of Variable Response OAMPDUs transmitted on this interface. An Variable Response OAMPDU is indicated by a valid frame with (1) destination MAC address equal to that of the reserved MAC address for Slow Protocols (See 43B of [802.3ah]), (2) a lengthOrType field equal to the reserved type for Slow Protocols, (3) a Slow Protocols subtype equal to that of the subtype reserved for OAM, and (4) an OAMPDU code equals the OAM Variable Response code. Discontinuities of this counter can occur at re-initialization of the management system, and at other times as indicated by the value of the ifCounterDiscontinuityTime. "
  },
  "h3cDot3OamVariableResponseRx": {
    "name": "h3cDot3OamVariableResponseRx",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.4.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.31.",
    "status": "current",
    "description": "A count of the number of Variable Response OAMPDUs received on this interface. An Variable Response OAMPDU is indicated by a valid frame with (1) destination MAC address equal to that of the reserved MAC address for Slow Protocols (See 43B of [802.3ah]), (2) a lengthOrType field equal to the reserved type for Slow Protocols, (3) a Slow Protocols subtype equal to that of the subtype reserved for OAM, and (4) an OAMPDU code equals the OAM Variable Response code. Discontinuities of this counter can occur at re-initialization of the management system, and at other times as indicated by the value of the ifCounterDiscontinuityTime. "
  },
  "h3cDot3OamOrgSpecificTx": {
    "name": "h3cDot3OamOrgSpecificTx",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.4.1.13",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.32.",
    "status": "current",
    "description": "A count of the number of Organization Specific OAMPDUs transmitted on this interface. An Organization Specific OAMPDU is indicated by a valid frame with (1) destination MAC address equal to that of the reserved MAC address for Slow Protocols (See 43B of [802.3ah]), (2) a lengthOrType field equal to the reserved type for Slow Protocols, (3) a Slow Protocols subtype equal to that of the subtype reserved for OAM, and (4) an OAMPDU code equals the OAM Organization Specific code. Discontinuities of this counter can occur at re-initialization of the management system, and at other times as indicated by the value of the ifCounterDiscontinuityTime. "
  },
  "h3cDot3OamOrgSpecificRx": {
    "name": "h3cDot3OamOrgSpecificRx",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.4.1.14",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.33.",
    "status": "current",
    "description": "A count of the number of Organization Specific OAMPDUs received on this interface. An Organization Specific OAMPDU is indicated by a valid frame with (1) destination MAC address equal to that of the reserved MAC address for Slow Protocols (See 43B of [802.3ah]), (2) a lengthOrType field equal to the reserved type for Slow Protocols, (3) a Slow Protocols subtype equal to that of the subtype reserved for OAM, and (4) an OAMPDU code equals the OAM Organization Specific code. Discontinuities of this counter can occur at re-initialization of the management system, and at other times as indicated by the value of the ifCounterDiscontinuityTime. "
  },
  "h3cDot3OamUnsupportedCodesTx": {
    "name": "h3cDot3OamUnsupportedCodesTx",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.4.1.15",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.18.",
    "status": "current",
    "description": "A count of the number of OAMPDUs transmitted on this interface with an unsupported op-code. An unsupported opcode OAMPDU is indicated by a valid frame with (1) destination MAC address equal to that of the reserved MAC address for Slow Protocols (See 43B of [802.3ah]), (2) a lengthOrType field equal to the reserved type for Slow Protocols, (3) a Slow Protocols subtype equal to that of the subtype reserved for OAM, and (4) an OAMPDU code equals the opcode for a function that is not supported by the device. Discontinuities of this counter can occur at re-initialization of the management system, and at other times as indicated by the value of the ifCounterDiscontinuityTime. "
  },
  "h3cDot3OamUnsupportedCodesRx": {
    "name": "h3cDot3OamUnsupportedCodesRx",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.4.1.16",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.19.",
    "status": "current",
    "description": "A count of the number of OAMPDUs received on this interface with an unsupported op-code. An unsupported opcode OAMPDU is indicated by a valid frame with (1) destination MAC address equal to that of the reserved MAC address for Slow Protocols (See 43B of [802.3ah]), (2) a lengthOrType field equal to the reserved type for Slow Protocols, (3) a Slow Protocols subtype equal to that of the subtype reserved for OAM, and (4) an OAMPDU code equals the opcode for a function that is not supported by the device. Discontinuities of this counter can occur at re-initialization of the management system, and at other times as indicated by the value of the ifCounterDiscontinuityTime. "
  },
  "h3cDot3OamFramesLostDueToOam": {
    "name": "h3cDot3OamFramesLostDueToOam",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.4.1.17",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.46.",
    "status": "current",
    "description": "A count of the number of frames that were dropped by the OAM multiplexer. Since the OAM mulitplexer has multiple inputs and a single output, there may be cases where frames are dropped due to transmit resource contention. This counter is incremented whenever a frame is dropped by the OAM layer. When this counter is incremented, no other counters in this MIB are incremented. Discontinuities of this counter can occur at re-initialization of the management system, and at other times as indicated by the value of the ifCounterDiscontinuityTime. "
  },
  "h3cDot3OamEventConfigTable": {
    "name": "h3cDot3OamEventConfigTable",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.5",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Ethernet OAM includes the ability to generate and receive event notifications to indicate various link problems. This table contains the mechanisms to configure the thresholds to generate the standard Ethernet OAM events. These events are: - Errored Symbol Period Event. Generated when the number of symbol errors exceeds a threshold within a given window defined by a number of symbols (e.g. 1,000 symbols out of 1,000,000 had errors). - Errored Frame Period Event. Generated when the number of frame errors exceeds a threshold within a given window defined by a number of frames (e.g. 10 frames out of 1000 had errors). - Errored Frame Event. Generated when the number of frame errors exceeds a threshold within a given window defined by a period of time (e.g. 10 frames in 1 second had errors). - Errored Frame Seconds Summary Event. Generated when the number of errored frame seconds exceeds a threshold within a given time period (e.g. 10 errored frame seconds within the last 100 seconds). An errored frame second is defined as a 1 second interval which had >0 frame errors. "
  },
  "h3cDot3OamEventConfigEntry": {
    "name": "h3cDot3OamEventConfigEntry",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.5.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Event configuration information is available for every Ethernet like interface that supports OAM and the event function of OAM as indicated in the h3cDot3OamFunctionsSupported attribute. Event configuration controls when the local management entity sends Event Notification OAMPDUs to its OAM peer. "
  },
  "h3cDot3OamErrSymPeriodWindowHi": {
    "name": "h3cDot3OamErrSymPeriodWindowHi",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.5.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "maxaccess": "read-write",
    "reference": "[802.3ah], 30.3.6.1.34",
    "status": "current",
    "description": "The two objects h3cDot3OamErrSymPeriodWindowHi and h3cDot3OamErrSymPeriodLo together form an unsigned 64-bit integer representing the number of symbols over which this threshold event is defined. This is defined as h3cDot3OamErrSymPeriodWindow = ((2^32)*h3cDot3OamErrSymPeriodWindowHi) + h3cDot3OamErrSymPeriodWindowLo If h3cDot3OamErrSymPeriodThreshold symbol errors occur within a window of h3cDot3OamErrSymPeriodWindow symbols, an Event Notification OAMPDU should be generated with an Errored Symbol Period Event TLV indicating the threshold has been crossed in this window. "
  },
  "h3cDot3OamErrSymPeriodWindowLo": {
    "name": "h3cDot3OamErrSymPeriodWindowLo",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.5.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "maxaccess": "read-write",
    "reference": "[802.3ah], 30.3.6.1.34",
    "status": "current",
    "description": "The two objects h3cDot3OamErrSymPeriodWindowHi and h3cDot3OamErrSymPeriodWindowLo together form an unsigned 64-bit integer representing the number of symbols over which this threshold event is defined. This is defined as h3cDot3OamErrSymPeriodWindow = ((2^32)*h3cDot3OamErrSymPeriodWindowHi) + h3cDot3OamErrSymPeriodWindowLo If h3cDot3OamErrSymPeriodThreshold symbol errors occur within a window of h3cDot3OamErrSymPeriodWindow symbols, an Event Notification OAMPDU should be generated with an Errored Symbol Period Event TLV indicating the threshold has been crossed in this window. "
  },
  "h3cDot3OamErrSymPeriodThresholdHi": {
    "name": "h3cDot3OamErrSymPeriodThresholdHi",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.5.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "maxaccess": "read-write",
    "reference": "[802.3ah], 30.3.6.1.34",
    "status": "current",
    "description": "The two objects h3cDot3OamErrSymPeriodThresholdHi and h3cDot3OamErrSymPeriodThresholdLo together form an unsigned 64-bit integer representing the number of symbol errors that must occur within a given window to cause this event. This is defined as h3cDot3OamErrSymPeriodThreshold = ((2^32) * h3cDot3OamErrSymPeriodThresholdHi) + h3cDot3OamErrSymPeriodThresholdLo If h3cDot3OamErrSymPeriodThreshold symbol errors occur within a window of h3cDot3OamErrSymPeriodWindow symbols, an Event Notification OAMPDU should be generated with an Errored Symbol Period Event TLV indicating the threshold has been crossed in this window. "
  },
  "h3cDot3OamErrSymPeriodThresholdLo": {
    "name": "h3cDot3OamErrSymPeriodThresholdLo",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.5.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "maxaccess": "read-write",
    "reference": "[802.3ah], 30.3.6.1.34",
    "status": "current",
    "description": "The two objects h3cDot3OamErrSymPeriodThresholdHi and h3cDot3OamErrSymPeriodThresholdLo together form an unsigned 64-bit integer representing the number of symbol errors that must occur within a given window to cause this event. This is defined as h3cDot3OamErrSymPeriodThreshold = ((2^32) * h3cDot3OamErrSymPeriodThresholdHi) + h3cDot3OamErrSymPeriodThresholdLo If h3cDot3OamErrSymPeriodThreshold symbol errors occur within a window of h3cDot3OamErrSymPeriodWindow symbols, an Event Notification OAMPDU should be generated with an Errored Symbol Period Event TLV indicating the threshold has been crossed in this window. "
  },
  "h3cDot3OamErrSymPeriodEvNotifEnable": {
    "name": "h3cDot3OamErrSymPeriodEvNotifEnable",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.5.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "enabled": 1,
          "disabled": 2
        }
      }
    },
    "maxaccess": "read-write",
    "reference": "N/A",
    "status": "current",
    "description": "Indicates whether the occurence of Errored Symbol Period Events should result in Event Notification OAMPDUs generated by the OAM layer. By default, this object should have the value enabled(1) for Ethernet like interfaces that support OAM. If the OAM layer does not support event notifications (as indicated via the h3cDot3OamFunctionsSupported attribute), this value is ignored. "
  },
  "h3cDot3OamErrFramePeriodWindow": {
    "name": "h3cDot3OamErrFramePeriodWindow",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.5.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "maxaccess": "read-write",
    "reference": "[802.3ah], 30.3.6.1.38",
    "status": "current",
    "description": "The number of frames over which the threshold is defined. If h3cDot3OamErrFramePeriodThreshold frame errors occur within a window of h3cDot3OamErrFramePeriodWindow frames, an Event Notification OAMPDU should be generated with an Errored Frame Period Event TLV indicating the threshold has been crossed in this window. "
  },
  "h3cDot3OamErrFramePeriodThreshold": {
    "name": "h3cDot3OamErrFramePeriodThreshold",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.5.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "maxaccess": "read-write",
    "reference": "[802.3ah], 30.3.6.1.38",
    "status": "current",
    "description": "The number of frame errors that must occur for this event to be triggered. If h3cDot3OamErrFramePeriodThreshold frame errors occur within a window of h3cDot3OamErrFramePeriodWindow frames, an Event Notification OAMPDU should be generated with an Errored Frame Period Event TLV indicating the threshold has been crossed in this window. "
  },
  "h3cDot3OamErrFramePeriodEvNotifEnable": {
    "name": "h3cDot3OamErrFramePeriodEvNotifEnable",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.5.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "enabled": 1,
          "disabled": 2
        }
      }
    },
    "maxaccess": "read-write",
    "reference": "N/A",
    "status": "current",
    "description": "Indicates whether the occurence of an Errored Frame Period Event should result in an Event Notification OAMPDU generated by the OAM layer. By default, this object should have the value enabled(1) for Ethernet like interfaces that support OAM. If the OAM layer does not support event notifications (as indicated via the h3cDot3OamFunctionsSupported attribute), this value is ignored. "
  },
  "h3cDot3OamErrFrameWindow": {
    "name": "h3cDot3OamErrFrameWindow",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.5.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "maxaccess": "read-write",
    "reference": "[802.3ah], 30.3.6.1.36",
    "status": "current",
    "description": "The amount of time (in 100ms increments) over which the threshold is defined. If h3cDot3OamErrFrameThreshold frame errors occur within a window of h3cDot3OamErrFrameWindow seconds (measured in tenths of seconds), an Event Notification OAMPDU should be generated with an Errored Frame Event TLV indicating the threshold has been crossed in this window. "
  },
  "h3cDot3OamErrFrameThreshold": {
    "name": "h3cDot3OamErrFrameThreshold",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.5.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "maxaccess": "read-write",
    "reference": "[802.3ah], 30.3.6.1.36",
    "status": "current",
    "description": "The number of frame errors that must occur for this event to be triggered. If h3cDot3OamErrFrameThreshold frame errors occur within a window of h3cDot3OamErrFrameWindow (in tenths of seconds), an Event Notification OAMPDU should be generated with an Errored Frame Event TLV indicating the threshold has been crossed in this window. "
  },
  "h3cDot3OamErrFrameEvNotifEnable": {
    "name": "h3cDot3OamErrFrameEvNotifEnable",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.5.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "enabled": 1,
          "disabled": 2
        }
      }
    },
    "maxaccess": "read-write",
    "reference": "N/A",
    "status": "current",
    "description": "Indicates whether the occurence of an Errored Frame Event should result in an Event Notification OAMPDU generated by the OAM layer. By default, this object should have the value enabled(1) for Ethernet like interfaces that support OAM. If the OAM layer does not support event notifications (as indicated via the h3cDot3OamFunctionsSupported attribute), this value is ignored. "
  },
  "h3cDot3OamErrFrameSecsSummaryWindow": {
    "name": "h3cDot3OamErrFrameSecsSummaryWindow",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.5.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 100,
            "max": 9000
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "reference": "[802.3ah], 30.3.6.1.40",
    "status": "current",
    "description": "The amount of time (in 100ms intervals) over which the threshold is defined. If h3cDot3OamErrFrameSecsSummaryThreshold frame errors occur within a window of h3cDot3OamErrFrameSecsSummaryWindow (in tenths of seconds), an Event Notification OAMPDU should be generated with an Errored Frame Seconds Summary Event TLV indicating the threshold has been crossed in this window. "
  },
  "h3cDot3OamErrFrameSecsSummaryThreshold": {
    "name": "h3cDot3OamErrFrameSecsSummaryThreshold",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.5.1.13",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 900
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "reference": "[802.3ah], 30.3.6.1.40",
    "status": "current",
    "description": "The number of errored frame seconds that must occur for this event to be triggered. If h3cDot3OamErrFrameSecsSummaryThreshold frame errors occur within a window of h3cDot3OamErrFrameSecsSummaryWindow (in tenths of seconds), an Event Notification OAMPDU should be generated with an Errored Frame Seconds Summary Event TLV indicating the threshold has been crossed in this window. "
  },
  "h3cDot3OamErrFrameSecsEvNotifEnable": {
    "name": "h3cDot3OamErrFrameSecsEvNotifEnable",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.5.1.14",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "enabled": 1,
          "disabled": 2
        }
      }
    },
    "maxaccess": "read-write",
    "reference": "N/A",
    "status": "current",
    "description": "Indicates whether the occurence of an Errored Frame Seconds Summary Event should result in an Event Notification OAMPDU generated by the OAM layer. By default, this object should have the value enabled(1) for Ethernet like interfaces that support OAM. If the OAM layer does not support event notifications (as indicated via the h3cDot3OamFunctionsSupported attribute), this value is ignored."
  },
  "h3cDot3OamEventLogTable": {
    "name": "h3cDot3OamEventLogTable",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.6",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table records a history of the events that have occurred at the Ethernet OAM level. These events can include locally detected events, which may result in locally generated OAMPDUs, and remotely detected events, which are detected by the OAM peer entity and signaled to the local entity via Ethernet OAM. Ethernet OAM events can be signaled by Event Notification OAMPDUs or by the flags field in any OAMPDU. "
  },
  "h3cDot3OamEventLogEntry": {
    "name": "h3cDot3OamEventLogEntry",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.6.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamEventLogIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An entry in the h3cDot3OamEventLogTable."
  },
  "h3cDot3OamEventLogIndex": {
    "name": "h3cDot3OamEventLogIndex",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.6.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "reference": "N/A",
    "status": "current",
    "description": "An arbitrary integer for identifiying individual events within the event log. "
  },
  "h3cDot3OamEventLogTimestamp": {
    "name": "h3cDot3OamEventLogTimestamp",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.6.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DateAndTime",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "N/A",
    "status": "current",
    "description": "The date and time that this event instance occurred. "
  },
  "h3cDot3OamEventLogOui": {
    "name": "h3cDot3OamEventLogOui",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.6.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Dot3Oui",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "N/A",
    "status": "current",
    "description": "The OUI of the entity defining the object type. All IEEE 802.3 defined events (as appearing in [802.3ah] except for the Organizationally Unique Event TLVs) use the IEEE 802.3 OUI of 0x0180C2. Organizations defining their own Event Notification TLVs include their OUI in the Event Notification TLV which gets reflected here. "
  },
  "h3cDot3OamEventLogType": {
    "name": "h3cDot3OamEventLogType",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.6.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.10 and 57.5.3.",
    "status": "current",
    "description": "The type of event that generated this entry in the event log. When the OUI is the IEEE 802.3 OUI of 0x0180C2, the following event types are defined: erroredSymbolEvent(1), erroredFramePeriodEvent (2), erroredFrameEvent(3), erroredFrameSecondsEvent(4), linkFault(256), dyingGaspEvent(257), criticalLinkEvent(258) The first four are considered threshold crossing events as they are generated when a metric exceeds a given value within a specified window. The other three are not threshold crossing events. When the OUI is not 0x0180C2, then some other organization has defined the event space. If event subtyping is known to the implementation, it may be reflected here. Otherwise, this value should return all Fs (0xFFFFFFFF). "
  },
  "h3cDot3OamEventLogLocation": {
    "name": "h3cDot3OamEventLogLocation",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.6.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "local": 1,
          "remote": 2
        }
      }
    },
    "maxaccess": "read-only",
    "reference": "N/A",
    "status": "current",
    "description": "Whether this event occurred locally, or was received from the OAM peer via Ethernet OAM."
  },
  "h3cDot3OamEventLogWindowHi": {
    "name": "h3cDot3OamEventLogWindowHi",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.6.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.37 and 57.5.3.2.",
    "status": "current",
    "description": "If the event represents a threshold crossing event, the two objects h3cDot3OamEventWindowHi and h3cDot3OamEventWindowLo form an unsigned 64-bit integer yielding the window over which the value was measured for the threshold crossing event (e.g. 5, when 11 occurrences happened in 5 seconds while the threshold was 10). The two objects are combined as: h3cDot3OamEventLogWindow = ((2^32) * h3cDot3OamEventLogWindowHi) + h3cDot3OamEventLogWindowLo Otherwise, this value is returned as all F's (0xFFFFFFFF) and adds no useful information. "
  },
  "h3cDot3OamEventLogWindowLo": {
    "name": "h3cDot3OamEventLogWindowLo",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.6.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.37 and 57.5.3.2.",
    "status": "current",
    "description": "If the event represents a threshold crossing event, the two objects h3cDot3OamEventWindowHi and h3cDot3OamEventWindowLo form an unsigned 64-bit integer yielding the window over which the value was measured for the threshold crossing event (e.g. 5, when 11 occurrences happened in 5 seconds while the threshold was 10). The two objects are combined as: h3cDot3OamEventLogWindow = ((2^32) * h3cDot3OamEventLogWindowHi) + h3cDot3OamEventLogWindowLo Otherwise, this value is returned as all F's (0xFFFFFFFF) and adds no useful information. "
  },
  "h3cDot3OamEventLogThresholdHi": {
    "name": "h3cDot3OamEventLogThresholdHi",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.6.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.37 and 57.5.3.2.",
    "status": "current",
    "description": "If the event represents a threshold crossing event, the two objects h3cDot3OamEventThresholdHi and h3cDot3OamEventThresholdLo form an unsigned 64-bit integer yielding the value that was crossed for the threshold crossing event (e.g. 10, when 11 occurrences happened in 5 seconds while the threshold was 10). The two objects are combined as: h3cDot3OamEventLogThreshold = ((2^32) * h3cDot3OamEventLogThresholdHi) + h3cDot3OamEventLogThresholdLo Otherwise, this value is returned as all F's (0xFFFFFFFF) and adds no useful information. "
  },
  "h3cDot3OamEventLogThresholdLo": {
    "name": "h3cDot3OamEventLogThresholdLo",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.6.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.37 and 57.5.3.2.",
    "status": "current",
    "description": "If the event represents a threshold crossing event, the two objects h3cDot3OamEventThresholdHi and h3cDot3OamEventThresholdLo form an unsigned 64-bit integer yielding the value that was crossed for the threshold crossing event (e.g. 10, when 11 occurrences happened in 5 seconds while the threshold was 10). The two objects are combined as: h3cDot3OamEventLogThreshold = ((2^32) * h3cDot3OamEventLogThresholdHi) + h3cDot3OamEventLogThresholdLo Otherwise, this value is returned as all F's (0xFFFFFFFF) and adds no useful information. "
  },
  "h3cDot3OamEventLogValue": {
    "name": "h3cDot3OamEventLogValue",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.6.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CounterBasedGauge64",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.37 and 57.5.3.2.",
    "status": "current",
    "description": "If the event represents a threshold crossing event, this value indicates the value of the parameter within the given window that generated this event (e.g. 11, when 11 occurrences happened in 5 seconds while the threshold was 10). Otherwise, this value is returned as all F's (0xFFFFFFFFFFFFFFFF) and adds no useful information. "
  },
  "h3cDot3OamEventLogRunningTotal": {
    "name": "h3cDot3OamEventLogRunningTotal",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.6.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "CounterBasedGauge64",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.37 and 57.5.3.2.",
    "status": "current",
    "description": "This value respresents the total number of times this occurence has happened since the last reset (e.g. 3253, when 3253 symbol errors have occurred since the last reset, which has resulted in 51 symbol error threshold crossing events since the last reset). "
  },
  "h3cDot3OamEventLogEventTotal": {
    "name": "h3cDot3OamEventLogEventTotal",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.6.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "reference": "[802.3ah], 30.3.6.1.37 and 57.5.3.2.",
    "status": "current",
    "description": "This value respresents the total number of times one or more of these occurences have resulted in an event (e.g. 51 when 3253 symbol errors have occurred since the last reset, which has resulted in 51 symbol error threshold crossing events since the last reset). "
  },
  "h3cDot3OamTraps": {
    "name": "h3cDot3OamTraps",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.7",
    "class": "objectidentity"
  },
  "h3cDot3OamTrapsPrefix": {
    "name": "h3cDot3OamTrapsPrefix",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.7.0",
    "class": "objectidentity"
  },
  "h3cDot3OamThresholdEvent": {
    "name": "h3cDot3OamThresholdEvent",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.7.0.1",
    "class": "notificationtype",
    "objects": [
      {
        "module": "IF-MIB",
        "object": "ifIndex"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamEventLogTimestamp"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamEventLogOui"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamEventLogType"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamEventLogLocation"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamEventLogWindowHi"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamEventLogWindowLo"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamEventLogThresholdHi"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamEventLogThresholdLo"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamEventLogValue"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamEventLogRunningTotal"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamEventLogEventTotal"
      }
    ],
    "status": "current",
    "description": "A h3cDot3OamThresholdEvent notification is sent when a local or remote threshold crossing event is detected. A local threshold crossing event is detected by the local entity, while a remote threshold crossing event is detected by the reception of an Ethernet OAM Event Notification OAMPDU indicating a threshold event. This notification should not be sent more than once per second. The management entity should periodically check h3cDot3OamEventLogTable to detect any missed events."
  },
  "h3cDot3OamNonThresholdEvent": {
    "name": "h3cDot3OamNonThresholdEvent",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.1.7.0.2",
    "class": "notificationtype",
    "objects": [
      {
        "module": "IF-MIB",
        "object": "ifIndex"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamEventLogTimestamp"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamEventLogOui"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamEventLogType"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamEventLogLocation"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamEventLogEventTotal"
      }
    ],
    "status": "current",
    "description": "A h3cDot3OamNonThresholdEvent notification is sent when a local or remote non-threshold crossing event is detected. A local event is detected by the local entity, while a remote event is detected by the reception of an Ethernet OAM Event Notification OAMPDU indicating a non-threshold crossing event. This notification should not be sent more than once per second. The management entity should periodically check h3cDot3OamEventLogTable to detect any missed events."
  },
  "h3cDot3OamGroups": {
    "name": "h3cDot3OamGroups",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.2.1",
    "class": "objectidentity"
  },
  "h3cDot3OamCompliances": {
    "name": "h3cDot3OamCompliances",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.2.2",
    "class": "objectidentity"
  },
  "h3cDot3OamCompliance": {
    "name": "h3cDot3OamCompliance",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.2.2.1",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "h3cDot3OamControlGroup",
        "module": "H3C-EFM-COMMON-MIB"
      },
      {
        "object": "h3cDot3OamPeerGroup",
        "module": "H3C-EFM-COMMON-MIB"
      },
      {
        "object": "h3cDot3OamStatsBaseGroup",
        "module": "H3C-EFM-COMMON-MIB"
      },
      {
        "object": "h3cDot3OamLoopbackGroup",
        "module": "H3C-EFM-COMMON-MIB"
      },
      {
        "object": "h3cDot3OamErrSymbolPeriodEventGroup",
        "module": "H3C-EFM-COMMON-MIB"
      },
      {
        "object": "h3cDot3OamErrFramePeriodEventGroup",
        "module": "H3C-EFM-COMMON-MIB"
      },
      {
        "object": "h3cDot3OamErrFrameEventGroup",
        "module": "H3C-EFM-COMMON-MIB"
      },
      {
        "object": "h3cDot3OamErrFrameSecsSummaryEventGroup",
        "module": "H3C-EFM-COMMON-MIB"
      },
      {
        "object": "h3cDot3OamEventLogGroup",
        "module": "H3C-EFM-COMMON-MIB"
      },
      {
        "object": "h3cDot3OamNotificationGroup",
        "module": "H3C-EFM-COMMON-MIB"
      }
    ],
    "status": "current",
    "description": "The compliance statement for managed entities supporting OAM on Ethernet like interfaces. "
  },
  "h3cDot3OamControlGroup": {
    "name": "h3cDot3OamControlGroup",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.2.1.1",
    "class": "objectgroup",
    "objects": [
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamAdminState"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamOperStatus"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamMode"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamMaxOamPduSize"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamConfigRevision"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamFunctionsSupported"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing the abilities, configuration, and status of an Ethernet OAM entity. "
  },
  "h3cDot3OamPeerGroup": {
    "name": "h3cDot3OamPeerGroup",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.2.1.2",
    "class": "objectgroup",
    "objects": [
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamPeerStatus"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamPeerMacAddress"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamPeerVendorOui"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamPeerVendorInfo"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamPeerMode"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamPeerFunctionsSupported"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamPeerMaxOamPduSize"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamPeerConfigRevision"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing the abilities, configuration, and status of a peer Ethernet OAM entity. "
  },
  "h3cDot3OamStatsBaseGroup": {
    "name": "h3cDot3OamStatsBaseGroup",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.2.1.3",
    "class": "objectgroup",
    "objects": [
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamInformationTx"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamInformationRx"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamUniqueEventNotificationTx"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamUniqueEventNotificationRx"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamDuplicateEventNotificationTx"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamDuplicateEventNotificationRx"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamLoopbackControlTx"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamLoopbackControlRx"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamVariableRequestTx"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamVariableRequestRx"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamVariableResponseTx"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamVariableResponseRx"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamOrgSpecificTx"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamOrgSpecificRx"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamUnsupportedCodesTx"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamUnsupportedCodesRx"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamFramesLostDueToOam"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing the statistics for the number of various transmit and recieve events for OAM on an Ethernet like interface. Note that all of these counters must be supported even if the related function (as described in h3cDot3OamFunctionsSupported) is not supported. "
  },
  "h3cDot3OamLoopbackGroup": {
    "name": "h3cDot3OamLoopbackGroup",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.2.1.4",
    "class": "objectgroup",
    "objects": [
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamLoopbackCommand"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamLoopbackStatus"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamLoopbackIgnoreRx"
      }
    ],
    "status": "current",
    "description": "A collection of objects for controlling the OAM remote loopback function. "
  },
  "h3cDot3OamErrSymbolPeriodEventGroup": {
    "name": "h3cDot3OamErrSymbolPeriodEventGroup",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.2.1.5",
    "class": "objectgroup",
    "objects": [
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamErrSymPeriodWindowHi"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamErrSymPeriodWindowLo"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamErrSymPeriodThresholdHi"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamErrSymPeriodThresholdLo"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamErrSymPeriodEvNotifEnable"
      }
    ],
    "status": "current",
    "description": "A collection of objects for configuring the thresholds for an Errored Symbol Period Event. Each [802.3ah] defined Event Notification TLV has its own conformance group because each event can be implemented independently of any other. "
  },
  "h3cDot3OamErrFramePeriodEventGroup": {
    "name": "h3cDot3OamErrFramePeriodEventGroup",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.2.1.6",
    "class": "objectgroup",
    "objects": [
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamErrFramePeriodWindow"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamErrFramePeriodThreshold"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamErrFramePeriodEvNotifEnable"
      }
    ],
    "status": "current",
    "description": "A collection of objects for configuring the thresholds for an Errored Frame Period Event. Each [802.3ah] defined Event Notification TLV has its own conformance group because each event can be implemented independently of any other. "
  },
  "h3cDot3OamErrFrameEventGroup": {
    "name": "h3cDot3OamErrFrameEventGroup",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.2.1.7",
    "class": "objectgroup",
    "objects": [
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamErrFrameWindow"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamErrFrameThreshold"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamErrFrameEvNotifEnable"
      }
    ],
    "status": "current",
    "description": "A collection of objects for configuring the thresholds for an Errored Frame Event. Each [802.3ah] defined Event Notification TLV has its own conformance group because each event can be implemented independently of any other. "
  },
  "h3cDot3OamErrFrameSecsSummaryEventGroup": {
    "name": "h3cDot3OamErrFrameSecsSummaryEventGroup",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.2.1.8",
    "class": "objectgroup",
    "objects": [
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamErrFrameSecsSummaryWindow"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamErrFrameSecsSummaryThreshold"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamErrFrameSecsEvNotifEnable"
      }
    ],
    "status": "current",
    "description": "A collection of objects for configuring the thresholds for an Errored Frame Seconds Summary Event. Each [802.3ah] defined Event Notification TLV has its own conformance group because each event can be implemented independently of any other. "
  },
  "h3cDot3OamEventLogGroup": {
    "name": "h3cDot3OamEventLogGroup",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.2.1.9",
    "class": "objectgroup",
    "objects": [
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamEventLogTimestamp"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamEventLogOui"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamEventLogType"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamEventLogLocation"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamEventLogWindowHi"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamEventLogWindowLo"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamEventLogThresholdHi"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamEventLogThresholdLo"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamEventLogValue"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamEventLogRunningTotal"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamEventLogEventTotal"
      }
    ],
    "status": "current",
    "description": "A collection of objects for configuring the thresholds for an Errored Frame Seconds Summary Event and maintaining the event information. "
  },
  "h3cDot3OamNotificationGroup": {
    "name": "h3cDot3OamNotificationGroup",
    "oid": "1.3.6.1.4.1.2011.10.2.42.3.2.1.10",
    "class": "notificationgroup",
    "objects": [
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamThresholdEvent"
      },
      {
        "module": "H3C-EFM-COMMON-MIB",
        "object": "h3cDot3OamNonThresholdEvent"
      }
    ],
    "status": "current",
    "description": "A collection of notifications used by Ethernet OAM to signal to a management entity that local or remote events have occured on a specified Ethernet link."
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/H3C-EFM-COMMON-MIB",
      "Produced by pysmi-0.3.4 at Fri May 24 19:04:48 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "H3C-EFM-COMMON-MIB"
  }
}