{
  "imports": {
    "class": "imports",
    "SNMPv2-CONF": [
      "MODULE-COMPLIANCE",
      "NOTIFICATION-GROUP"
    ],
    "SNMPv2-SMI": [
      "Gauge32",
      "IpAddress",
      "Counter64",
      "MODULE-IDENTITY",
      "Counter32",
      "Integer32",
      "iso",
      "Unsigned32",
      "NOTIFICATION-TYPE",
      "TimeTicks",
      "mib-2",
      "OBJECT-TYPE",
      "MibIdentifier",
      "Bits",
      "OBJECT-IDENTITY"
    ],
    "SNMPv2-TC": [
      "DisplayString",
      "TEXTUAL-CONVENTION"
    ]
  },
  "ianaEnergyRelationMIB": {
    "name": "ianaEnergyRelationMIB",
    "oid": "1.3.6.1.2.1.232",
    "class": "moduleidentity",
    "revisions": [
      {
        "revision": "2015-02-09 00:00",
        "description": "Initial version of this MIB as published in RFC 7461."
      }
    ],
    "lastupdated": "201502090000Z",
    "organization": "IANA",
    "contactinfo": " Internet Assigned Numbers Authority Postal: ICANN 12025 Waterfront Dr., Suite 300 Los Angeles, CA 90094 United States Tel: +1-310-301-5800 EMail: iana&iana.org",
    "description": "Copyright (c) 2015 IETF Trust and the persons identified as authors of the code. All rights reserved. Redistribution and use in source and binary forms, with or without modification, is permitted pursuant to, and subject to the license terms contained in, the Simplified BSD License set forth in Section 4.c of the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info). This MIB module defines a TEXTUAL-CONVENTION that describes the relationships between Energy Objects. The initial version of this MIB module was published in RFC 7461; for full legal notices see the RFC itself."
  },
  "IANAEnergyRelationship": {
    "name": "IANAEnergyRelationship",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "poweredBy": 1,
          "powering": 2,
          "meteredBy": 3,
          "metering": 4,
          "aggregatedBy": 5,
          "aggregating": 6
        }
      }
    },
    "status": "current",
    "description": "An enumerated value specifying the type of relationship between an Energy Object A, on which the relationship is specified, with the Energy Object B, identified by the UUID. The enumeration 'poweredBy' is applicable if Energy Object A is poweredBy Energy Object B. The enumeration 'powering' is applicable if Energy Object A is powering Energy Object B. The enumeration 'meteredBy' is applicable if Energy Object A is meteredBy Energy Object B. The enumeration 'metering' is applicable if Energy Object A is metering Energy Object B. The enumeration 'aggregatedBy' is applicable if Energy Object A is aggregatedBy Energy Object B. The enumeration 'aggregating' is applicable if Energy Object A is aggregating Energy Object B."
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/IANA-ENERGY-RELATION-MIB",
      "Produced by pysmi-0.3.4 at Fri May 24 18:26:15 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "IANA-ENERGY-RELATION-MIB"
  }
}