{
  "imports": {
    "class": "imports",
    "ENTITY-MIB": [
      "entPhysicalDescr",
      "PhysicalIndex"
    ],
    "HOST-RESOURCES-MIB": [
      "KBytes"
    ],
    "IF-MIB": [
      "InterfaceIndexOrZero"
    ],
    "Juniper-MIBs": [
      "juniMibs"
    ],
    "Juniper-TC": [
      "JuniEnable",
      "JuniTimeFilter"
    ],
    "SNMPv2-CONF": [
      "NOTIFICATION-GROUP",
      "OBJECT-GROUP",
      "MODULE-COMPLIANCE"
    ],
    "SNMPv2-SMI": [
      "OBJECT-TYPE",
      "MibIdentifier",
      "Counter32",
      "IpAddress",
      "Integer32",
      "OBJECT-IDENTITY",
      "NOTIFICATION-TYPE",
      "Gauge32",
      "TimeTicks",
      "Bits",
      "iso",
      "MODULE-IDENTITY",
      "Counter64",
      "Unsigned32"
    ],
    "SNMPv2-TC": [
      "DateAndTime",
      "DisplayString",
      "TruthValue",
      "TEXTUAL-CONVENTION"
    ]
  },
  "juniSystemMIB": {
    "name": "juniSystemMIB",
    "oid": "1.3.6.1.4.1.4874.2.2.2",
    "class": "moduleidentity",
    "revisions": [
      {
        "revision": "2010-03-12 13:45",
        "description": "Added environment trap for sfps thresholds"
      },
      {
        "revision": "2008-06-11 11:01",
        "description": "Added es2Lm10s support."
      },
      {
        "revision": "2008-05-05 12:41",
        "description": "Add ISSU Support for ERX-1440."
      },
      {
        "revision": "2007-05-07 10:12",
        "description": "Add ISSU support."
      },
      {
        "revision": "2006-12-18 21:25",
        "description": "Add LM10 Access Support."
      },
      {
        "revision": "2006-11-24 09:13",
        "description": "Add suppot for ES2 primary modules SRP-120 and SFM-120 for E120."
      },
      {
        "revision": "2006-05-18 08:31",
        "description": "Add last 5 seconds, 1 minute and 5 minutes avergae CPU utilzation support."
      },
      {
        "revision": "2006-01-06 18:17",
        "description": "Add LM10 Access Support."
      },
      {
        "revision": "2005-12-16 07:21",
        "description": "Changed maximum value of juniSystemHighMemUtilThreshold from 100 to 99 and maximum value of juniSystemAbatedMemUtilThreshold from 99 to 98."
      },
      {
        "revision": "2005-11-18 22:30",
        "description": "Add CPU utilization statitics table support."
      },
      {
        "revision": "2005-09-15 14:14",
        "description": "Add LM10 Uplink Support."
      },
      {
        "revision": "2005-08-19 17:48",
        "description": "Add Ge8 support."
      },
      {
        "revision": "2005-07-29 17:48",
        "description": "conform to REX Naming Document, renamed various ES2 module types and deleted ones that didn't belong."
      },
      {
        "revision": "2005-05-18 18:10",
        "description": "Updated JuniSystemModuleType TC and created JuniSystemSlotLevel TC."
      },
      {
        "revision": "2005-05-04 18:10",
        "description": "Added GE-HDE support."
      },
      {
        "revision": "2005-01-31 18:13",
        "description": "Added KByte memory capacity object to notification."
      },
      {
        "revision": "2004-12-31 10:13",
        "description": "Updated for second generation E-series router."
      },
      {
        "revision": "2004-12-29 10:10",
        "description": "Updated SystemTimingSelector TC and related timing objects."
      },
      {
        "revision": "2004-05-25 18:13",
        "description": "Added support for the Fe8 FX IOA."
      },
      {
        "revision": "2004-01-07 22:46",
        "description": "Added support for the second generation E-series hardware architecture."
      },
      {
        "revision": "2003-11-24 20:59",
        "description": "Added Hybrid Primary Module and Hybrid IOA modules. Added GE2 Primary Module and GE2 IOA module."
      },
      {
        "revision": "2003-11-24 19:39",
        "description": "Added resource utilization notification enable/disable. Added KByte memory capacilty object."
      },
      {
        "revision": "2003-07-22 14:10",
        "description": "Added ERX-310 support."
      },
      {
        "revision": "2003-01-27 21:22",
        "description": "Replaced Unisphere names with Juniper names. Added resource utilization notification support."
      },
      {
        "revision": "2002-10-17 21:01",
        "description": "Initial version of this MIB module."
      }
    ],
    "lastupdated": "200806111101Z",
    "organization": "Juniper Networks, Inc.",
    "contactinfo": " Juniper Networks, Inc. Postal: 10 Technology Park Drive Westford, MA 01886-3146 USA Tel: +1 978 589 5800 Email: mib@Juniper.net",
    "description": "The MIB objects for managing a Juniper E-series (JUNOSe) system. This MIB complements the ENTITY-MIB.entPhysicalTable by providing the system's physical information in a format that is more user friendly and provides additional elements not found in the Entity MIB, including state information, parameters for configuring the system and additional notifications. There are two families of E-series hardware systems supported by this MIB: ERX - first generation E-series systems ES2 - second generation E-series systems "
  },
  "JuniSystemModuleType": {
    "name": "JuniSystemModuleType",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "unknown": 0,
          "erxSrp": 1,
          "erxCt3": 2,
          "erxOc3": 3,
          "erxUt3Atm": 4,
          "erxUt3Frame": 5,
          "erxUe3Atm": 6,
          "erxUe3Frame": 7,
          "erxCe1": 8,
          "erxCt1": 9,
          "erxDpfe": 10,
          "erxOc12Pos": 11,
          "erxOc12Atm": 12,
          "erxOc3Pos": 13,
          "erxOc3Atm": 14,
          "erxGe": 15,
          "erxFe8": 16,
          "erxOc3oc12Pos": 17,
          "erxOc3oc12Atm": 18,
          "erxCoc3oc12": 19,
          "erxCoc3": 20,
          "erxCoc12": 21,
          "erxOc12Server": 22,
          "erxHssi": 23,
          "erxGeFe": 24,
          "erxCt3P12": 25,
          "erxV35": 26,
          "erxUt3f12": 27,
          "erxUe3f12": 28,
          "erxCoc12F3": 29,
          "erxCoc3F3": 30,
          "erxCocxF3": 31,
          "erxVts": 32,
          "erxOc48": 33,
          "erxUt3Atm4": 34,
          "erxHybrid": 35,
          "erxOc3AtmGe": 36,
          "erxOc3AtmPos": 37,
          "erxGe2": 38,
          "erxGeHde": 39,
          "erxSrpIoa": 1024,
          "erxCt1Ioa": 1025,
          "erxCe1Ioa": 1026,
          "erxCe1TIoa": 1027,
          "erxCt3Ioa": 1028,
          "erxE3Ioa": 1029,
          "erxOc3Mm2Ioa": 1030,
          "erxOc3Sm2Ioa": 1031,
          "erxOc3Mm4Ioa": 1032,
          "erxOc3SmIr4Ioa": 1033,
          "erxOc3SmLr4Ioa": 1034,
          "erxCOc3Mm4Ioa": 1035,
          "erxCOc3SmIr4Ioa": 1036,
          "erxCOc3SmLr4Ioa": 1037,
          "erxOc12Mm1Ioa": 1038,
          "erxOc12SmIr1Ioa": 1039,
          "erxOc12SmLr1Ioa": 1040,
          "erxCOc12Mm1Ioa": 1041,
          "erxCOc12SmIr1Ioa": 1042,
          "erxCOc12SmLr1Ioa": 1043,
          "erxFe2Ioa": 1044,
          "erxFe8Ioa": 1045,
          "erxGeMm1Ioa": 1046,
          "erxGeSm1Ioa": 1047,
          "erxHssiIoa": 1048,
          "erxCt3P12Ioa": 1049,
          "erxV35Ioa": 1050,
          "erxGeSfpIoa": 1051,
          "erxUe3P12Ioa": 1052,
          "erxT3Atm4Ioa": 1053,
          "erxCOc12Mm1ApsIoa": 1054,
          "erxCOc12SmIr1ApsIoa": 1055,
          "erxCOc12SmLr1ApsIoa": 1056,
          "erxOc12Mm1ApsIoa": 1057,
          "erxOc12SmIr1ApsIoa": 1058,
          "erxOc12SmLr1ApsIoa": 1059,
          "erxCOc12AtmPosMm1Ioa": 1060,
          "erxCOc12AtmPosSmIr1Ioa": 1061,
          "erxCOc12AtmPosSmLr1Ioa": 1062,
          "erxCOc12AtmPosMm1ApsIoa": 1063,
          "erxCOc12AtmPosSmIr1ApsIoa": 1064,
          "erxCOc12AtmPosSmLr1ApsIoa": 1065,
          "erxT1E1RedundantIoa": 1066,
          "erxT3E3RedundantIoa": 1067,
          "erxCt3RedundantIoa": 1068,
          "erxOcxRedundantIoa": 1069,
          "erxCOcxRedundantIoa": 1070,
          "erxOc3Mm4ApsIoa": 1071,
          "erxOc3SmIr4ApsIoa": 1072,
          "erxOc3SmLr4ApsIoa": 1073,
          "erxOc48Ioa": 1074,
          "erxOc3Atm2Ge1Ioa": 1075,
          "erxOc3Atm2Pos2Ioa": 1076,
          "erxGe2Ioa": 1077,
          "erxFe8FxIoa": 1078,
          "erxGe8Ioa": 1079,
          "e320Srp100": 2048,
          "e320Sfm100": 2049,
          "es2Lm4": 2050,
          "es2Lm10Uplink": 2051,
          "es2Lm10": 2052,
          "e320Srp320": 2053,
          "e320Sfm320": 2054,
          "es2Lm10s": 2055,
          "e320SrpIoa": 3072,
          "es2Ge4S1Ioa": 3073,
          "es2Oc48Stm16PosS1Ioa": 3074,
          "es2ServiceS1Ioa": 3075,
          "es2Oc3Stm1x8AtmS1Ioa": 3076,
          "es2RedundancyS1Ioa": 3077,
          "es2Oc12Stm4x2PosS1Ioa": 3078,
          "es2Oc12Stm4x2AtmS1Ioa": 3079,
          "es2dash10GeS1Ioa": 3080,
          "es2Ge8S1Ioa": 3081,
          "es2dash10GePrS2Ioa": 3082,
          "es2Ge20S2Ioa": 3083,
          "e120Srp120": 4096,
          "e120Sfm120": 4097
        }
      }
    },
    "status": "current",
    "description": "The 'personality' type of a module found in an E-series system. Some primary modules (e.g., line cards) have only one personality; that is they only accept one personality of other level modules (e.g. I/O adapters) in the same slot and are always configured in the same way. Other modules are multi-personality and will behave differently depending on the other level modules they are operating with, and therefore cannot be configured without knowing the other level module type(s). Type values in this table include both. Types that are multi-personality are noted by [MP] and types that are personality-only are noted by [PO]. Use the ENTITY-MIB to deretmine the actual hardware type of a module with personality-only type. unknown Unknown module type ERX primary modules: erxSrp ERX Switch/Route Processor erxCt3 ERX 3 port Channelized T3 erxOc3 ERX 2 port OC3 SONET/SDH erxUt3Atm ERX 3 port Unchannelized T3 ATM erxUt3Frame ERX 3 port Unchannelized T3 Frame erxUe3Atm ERX 3 port Unchannelized E3 ATM erxUe3Frame ERX 3 port Uncahnnelized E3 Frame erxCe1 ERX 20 port Channelized E1 erxCt1 ERX 24 port Channelized T1 erxDpfe ERX 2 port Fast Ethernet erxOc12Pos ERX 1 port OC12 POS erxOc12Atm ERX 1 port OC12 ATM erxOc3Pos ERX 4 port OC3 POS erxOc3Atm ERX 4 port OC3 ATM erxGe ERX 1 port Gigabit Ethernet [PO] erxFe8 ERX 8 port Fast Ethernet [PO] erxOc3oc12Pos ERX OC3/OC12 POS [MP] erxOc3oc12Atm ERX OC3/OC12 ATM [MP] erxCoc3oc12 ERX Channelized OC3/OC12 [MP] erxCoc3 ERX 4 port Channelized OC3 [PO] erxCoc12 ERX 1 port Channelized OC12 [PO] erxOc12Server ERX 1 port OC12 Tunnel Server erxHssi ERX 3 port High Speed Serial Interface erxGeFe ERX Gigabit Ethernet / Fast Ethernet [MP] erxCt3P12 ERX 12 port Channelized T3 erxV35 ERX 16 port X.21/V.35 erxUt3f12 ERX 12 port Unchannelized T3 Frame [PO] erxUe3f12 ERX 12 port Unchannelized E3 Frame [PO] erxCoc12F3 ERX 1 port OC12 channelized to T3/E3 [PO] erxCoc3F3 ERX 4 port OC3 channelized to T3/E3 [PO] erxCocxF3 ERX OC3/OC12 channelized to T3/E3 [MP] erxVts ERX Virtual Tunnel Server erxOc48 ERX 1 port OC48 SONET/SDH erxUt3Atm4 ERX 4 port Unchannelized T3/E3 ATM [PO] erxHybrid ERX ATM / POS / Gigabit Ethernet Hybrid [MP] erxOc3AtmGe ERX 2 port OC3 ATM 1 port Gigabit Ethernet [PO] erxOc3AtmPos ERX 2 port OC3 ATM 2 port OC3 POS [PO] erxGe2 ERX 2 port Gigabit Ethernet erxGeHde ERX 2/8 port Gigabit Ethernet ERX I/O adapter (IOA) modules: erxSrpIoa ERX Switch/Route Processor IOA erxCt1Ioa ERX 24 port channelized T1/J1 IOA erxCe1Ioa ERX 20 port channelized E1 IOA erxCe1TIoa ERX 20 port channelized E1 Telco IOA erxCt3Ioa ERX 3 port channelized T3/E3 IOA erxE3Ioa ERX 3 port E3 IOA erxOc3Mm2Ioa ERX 2 port OC3 multi-mode IOA erxOc3Sm2Ioa ERX 2 port OC3 single-mode IOA erxOc3Mm4Ioa ERX 4 port OC3 multi-mode IOA erxOc3SmIr4Ioa ERX 4 port OC3 single-mode intermediate-reach IOA erxOc3SmLr4Ioa ERX 4 port OC3 single-mode long-reach IOA erxCOc3Mm4Ioa ERX 4 port channelized OC3 multi-mode IOA erxCOc3SmIr4Ioa ERX 4 port channelized OC3 single-mode intermediate-reach IOA erxCOc3SmLr4Ioa ERX 4 port channelized OC3 single-mode long-reach IOA erxOc12Mm1Ioa ERX 1 port OC12 multi-mode IOA erxOc12SmIr1Ioa ERX 1 port OC12 single-mode intermediate-reach IOA erxOc12SmLr1Ioa ERX 1 port OC12 single-mode long-reach IOA erxCOc12Mm1Ioa ERX 1 port channelized OC12 multi-mode IOA erxCOc12SmIr1Ioa ERX 1 port channelized OC12 single-mode intermediate-reach IOA erxCOc12SmLr1Ioa ERX 1 port channelized OC12 single-mode long-reach IOA erxFe2Ioa ERX 2 port 10/100 Fast Ethernet IOA erxFe8Ioa ERX 8 port 10/100 Fast Ethernet IOA erxGeMm1Ioa ERX 1 port Gigabit Ethernet multi-mode IOA erxGeSm1Ioa ERX 1 port Gigabit Ethernet single-mode IOA erxHssiIoa ERX 3 port High Speed Serial Interface IOA erxCt3P12Ioa ERX 12 port channelized and unchannelized T3 IOA erxV35Ioa ERX 16 port X2.1/V3.5 IOA erxGeSfpIoa ERX 1 port Gigabit Ethernet SFP IOA erxUe3P12Ioa ERX 12 port unchannelized E3 IOA erxT3Atm4Ioa ERX 4 port T3 ATM IOA erxCOc12Mm1ApsIoa ERX 1 port channelized OC12 multi-mode APS (1+1) IOA erxCOc12SmIr1ApsIoa ERX 1 port channelized OC12 single-mode intermediate-reach APS (1+1) IOA erxCOc12SmLr1ApsIoa ERX 1 port channelized OC12 single-mode long-reach APS (1+1) IOA erxOc12Mm1ApsIoa ERX 1 port OC12 multi-mode APS (1+1) IOA erxOc12SmIr1ApsIoa ERX 1 port OC12 single-mode intermediate-reach APS (1+1) IOA erxOc12SmLr1ApsIoa ERX 1 port OC12 single-mode long-reach APS (1+1) IOA erxCOc12AtmPosMm1Ioa ERX 1 port channelized OC12 multi-mode ATM/POS IOA erxCOc12AtmPosSmIr1Ioa ERX 1 port channelized OC12 single-mode intermediate-reach ATM/POS IOA erxCOc12AtmPosSmLr1Ioa ERX 1 port channelized OC12 single-mode long-reach ATM/POS IOA erxCOc12AtmPosMm1ApsIoa ERX 1 port channelized OC12 multi-mode ATM/POS APS (1+1) IOA erxCOc12AtmPosSmIr1ApsIoa ERX 1 port channelized OC12 single-mode intermediate-reach ATM/POS APS (1+1) IOA erxCOc12AtmPosSmLr1ApsIoa ERX 1 port channelized OC12 single-mode long-reach ATM/POS APS (1+1) IOA erxT1E1RedundantIoa ERX T1/E1 redundant midplane spare IOA erxT3E3RedundantIoa ERX T3/E3 redundant midplane spare IOA erxCt3RedundantIoa ERX channelized T3 redundant midplane spare IOA erxOcxRedundantIoa ERX OC3/OC12 redundant midplane spare IOA erxCOcxRedundantIoa ERX channelized OC3/OC12 redundant midplane spare IOA erxOc3Mm4ApsIoa ERX 4 port OC3 multi-mode APS (1+1) IOA erxOc3SmIr4ApsIoa ERX 4 port OC3 single-mode intermediate-reach APS (1+1) IOA erxOc3SmLr4ApsIoa ERX 4 port OC3 single-mode long-reach APS (1+1) IOA erxOc48Ioa ERX 1 port OC48/STM16 IOA erxOc3Atm2Ge1Ioa ERX 2 port OC3 ATM 1 port GE IOA erxOc3Atm2Pos2Ioa ERX 2 port OC3 ATM 2 port OC3 POS IOA erxGe2Ioa ERX 2 port Gigabit Ethernet IOA erxFe8FxIoa ERX 8 port 100 Fast Ethernet SFP IOA erxGe8Ioa ERX 8 port Gigabit Ethernet IOA ES2 primary modules: e320Srp100 ES2 100Gb System Route Processor with integrated fabric slice e320Sfm100 ES2 100Gb Switch Fabric Slice es2Lm4 ES2 4Gb (series 1) Line Module(LM). es2Lm10Uplink ES2 10Gb (series 2) Uplink Line Module(LM). es2Lm10 ES2 10Gb (series 3) Line Module(LM). e320Srp320 ES2 320Gb System Route Processor with integrated fabric slice e320Sfm320 ES2 320Gb Switch Fabric Slice es2Lm10s ES2 10Gb (series 4) Line Module(LM). ES2 I/O adapter (IOA) modules: e320SrpIoa ES2 system resource processor IOA es2Ge4S1Ioa ES2 4 port Gigabit Ethernet S1 IOA es2Oc48Stm16PosS1Ioa ES2 OC48/STM16 POS S1 IOA es2ServiceS1Ioa ES2 Service S1 IOA es2Oc3Stm1x8AtmS1Ioa ES2 OC3/STM1-8 ATM S1 IOA es2RedundancyS1Ioa ES2 Redundancy S1 IOA es2Oc12Stm4x2PosS1Ioa ES2 OC12/STM4-2 POS S1 IOA es2Oc12Stm4x2AtmS1Ioa ES2 OC12/STM4-2 ATM S1 IOA es2dash10GeS1Ioa ES2 10GE-1 SR S1 IOA es2Ge8S1Ioa ES2 8 port Gigabit Ethernet S1 IOA es2dash10GePrS2Ioa ES2 10GE-1 Port Redundancy S2 IOA es2Ge20S2Ioa ES2 20 port Gigabit Ethernet S2 IOA ES2 primary modules for E120: e120Srp120 ES2 120Gb System Route Processor with integrated fabric slice e120Sfm120 ES2 120Gb Switch Fabric Slice"
  },
  "JuniSystemSlotLevel": {
    "name": "JuniSystemSlotLevel",
    "class": "textualconvention",
    "type": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 4
          }
        ]
      }
    },
    "status": "current",
    "description": "The relative position of a module or sub-module 'container' within a slot. The upper limit of valid values is juniSystemMaxModulesPerSlot. A module or sub-module in the lowest numbered level for a particular slot is considered to be the 'primary' module for that slot. For the first generation E-series (ERX) platform family: level 1 - SRP or line card module level 2 - I/O adapter module For the second generation E-series platform family: level 1 - Forwarding module or SRP sub-module level 2 - Switch fabric slice (SFS) sub-module or module level 3 - Bay 0 I/O adapter level 4 - Bay 1 I/O adapter "
  },
  "JuniSystemSlotType": {
    "name": "JuniSystemSlotType",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "noSlot": 0,
          "erxSrpSlot": 1,
          "erxLcmSlot": 2,
          "erxSrpIoaSlot": 3,
          "erxLcIoaSlot": 4,
          "es2SrpSlot": 16,
          "es2SfsSlot": 17,
          "es2FmSlot": 18,
          "es2SrpIoaSlot": 19,
          "es2FIoaSlot": 20
        }
      }
    },
    "status": "current",
    "description": "The type of 'container' for holding a module or sub-module found in an E-series chassis. The slot type may be for a 'sub-module' where there are multiple logical functions on a single hardware module. For example, the second generation SRP hardware module (slot 6 or 7 on an E320) contains both a System Resource Processor (SRP) sub-module (level 1 position) and a Switch Fabric Slice (SFS) sub-module (level 2 position). noSlot The slot does not exist ERX system slot types: erxSrpSlot ERX switch/route processor module slot erxLcmSlot ERX line card module slot erxSrpIoaSlot ERX switch/route processor I/O adapter slot erxLcIoaSlot ERX line card I/O adapter slot Second generation E-series (ES2) system slot types: es2SrpSlot ES2 system resource processor sub-module slot es2SfsSlot ES2 switch fabric module or sub-module slot es2FmSlot ES2 forwarding module slot es2SrpIoaSlot ES2 system resource processor I/O adapter slot es2FIoaSlot ES2 forwarding I/O adapter slot "
  },
  "JuniSystemTimingSelector": {
    "name": "JuniSystemTimingSelector",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "primary": 1,
          "secondary": 2,
          "tertiary": 3,
          "error": 4
        }
      }
    },
    "status": "current",
    "description": "The system timing selector. primary - the primary timing selector secondary - the secondary timing selector tertiary - the tertiary timing selector error - the error in timing selector"
  },
  "JuniSystemLocationType": {
    "name": "JuniSystemLocationType",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "system": 1,
          "slot": 2
        }
      }
    },
    "status": "current",
    "description": "The location information class that is used to understand the encoding of the associated location instance information. An object with this syntax is always paired with an object that uses the JuniSystemLocation syntax. system - all resources on the system slot - all resources associated with a particular slot "
  },
  "JuniSystemLocation": {
    "name": "JuniSystemLocation",
    "class": "textualconvention",
    "type": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 16
          }
        ]
      }
    },
    "status": "current",
    "description": "The location instance information that is encoded according to the rules for the associated location information class. An object with this syntax is always paired with an object that uses the JuniSystemLocationType syntax. system - a zero length string: { ''H } slot - a single octet (see juniSystemSlotNumber) "
  },
  "JuniSystemTaskName": {
    "name": "JuniSystemTaskName",
    "class": "textualconvention",
    "type": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 100
          }
        ]
      }
    },
    "displayhint": "100a",
    "status": "current",
    "description": "Name of the task. Represents textual information taken from the NVT ASCII character set. The character repertoire of the string is restricted to printable, non-whitespace characters (codes 33 through 126).",
    "reference": "RFC 854: NVT ASCII character set."
  },
  "juniSystemTrap": {
    "name": "juniSystemTrap",
    "oid": "1.3.6.1.4.1.4874.2.2.2.0",
    "class": "objectidentity"
  },
  "juniSystemObjects": {
    "name": "juniSystemObjects",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1",
    "class": "objectidentity"
  },
  "juniSystemConformance": {
    "name": "juniSystemConformance",
    "oid": "1.3.6.1.4.1.4874.2.2.2.2",
    "class": "objectidentity"
  },
  "juniSystemGeneral": {
    "name": "juniSystemGeneral",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.1",
    "class": "objectidentity"
  },
  "juniSystemSubsystem": {
    "name": "juniSystemSubsystem",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.2",
    "class": "objectidentity"
  },
  "juniSystemModule": {
    "name": "juniSystemModule",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3",
    "class": "objectidentity"
  },
  "juniSystemPort": {
    "name": "juniSystemPort",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.4",
    "class": "objectidentity"
  },
  "juniSystemTiming": {
    "name": "juniSystemTiming",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.5",
    "class": "objectidentity"
  },
  "juniSystemFabric": {
    "name": "juniSystemFabric",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.6",
    "class": "objectidentity"
  },
  "juniSystemNvs": {
    "name": "juniSystemNvs",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.7",
    "class": "objectidentity"
  },
  "juniSystemPower": {
    "name": "juniSystemPower",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.8",
    "class": "objectidentity"
  },
  "juniSystemTemperature": {
    "name": "juniSystemTemperature",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.9",
    "class": "objectidentity"
  },
  "juniSystemUtilization": {
    "name": "juniSystemUtilization",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.10",
    "class": "objectidentity"
  },
  "juniSystemIssu": {
    "name": "juniSystemIssu",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.11",
    "class": "objectidentity"
  },
  "juniSystemSwVersion": {
    "name": "juniSystemSwVersion",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.1.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Version identification of currently executing system-wide operational software."
  },
  "juniSystemSwBuildDate": {
    "name": "juniSystemSwBuildDate",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.1.2",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Build date of currently executing system-wide operational software version."
  },
  "juniSystemMemUtilPct": {
    "name": "juniSystemMemUtilPct",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.1.3",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": -1,
            "max": 100
          }
        ]
      }
    },
    "units": "percent",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Percentage of memory utilization on the primary system processor. A value of -1 indicates the utilization is unknown."
  },
  "juniSystemMemCapacity": {
    "name": "juniSystemMemCapacity",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.1.4",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": -1,
            "max": 2147483647
          }
        ]
      }
    },
    "units": "bytes",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The total memory capacity in bytes of the primary system processor. If the memory capacity is greater than 2147483647, a -1 value is returned, and the actual memory capacity (in number of bytes divided by 1024) is returned in juniSystemMemKBytesCapacity."
  },
  "juniSystemMemKBytesCapacity": {
    "name": "juniSystemMemKBytesCapacity",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.1.23",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "KBytes",
      "class": "type"
    },
    "units": "KBytes",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The total memory capacity in kilo-bytes (1024 bytes) of the primary system processor."
  },
  "juniSystemHighMemUtilThreshold": {
    "name": "juniSystemHighMemUtilThreshold",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.1.5",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 99
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 85,
        "format": "decimal"
      }
    },
    "units": "percent",
    "maxaccess": "read-write",
    "status": "current",
    "description": "The value of memory utilization in the primary system processor, where, if reached for the first time after a high memory threshold reset, a high memory utilization event notification will be sent to the management entity on this system. A high memory threshold reset occurs when the system is initialized (booted) or the memory utilization falls below the value in juniSystemAbatedMemUtilThreshold. The value of this object must always be greater than the value of juniSystemAbatedMemUtilThreshold."
  },
  "juniSystemAbatedMemUtilThreshold": {
    "name": "juniSystemAbatedMemUtilThreshold",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.1.6",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 98
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 75,
        "format": "decimal"
      }
    },
    "units": "percent",
    "maxaccess": "read-write",
    "status": "current",
    "description": "The value of memory utilization in the primary system processor that is used to determine when to send an abated memory utilization event notification to the management entity on this system. The abated memory utilization event occurs if a high memory threshold reset has not occurred since the last high memory threshold event, and then the memory utilization falls to or below the value of this object. The abated memory utilization event then triggers a high memory threshold reset. The value of this object must always be less than the value of juniSystemHighMemUtilThreshold."
  },
  "juniSystemBootConfigControl": {
    "name": "juniSystemBootConfigControl",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.1.7",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "file": 0,
          "fileOnce": 1,
          "factoryDefaults": 2,
          "runningConfiguration": 3
        }
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "System boot configuration control: file - On a system reboot use the configuration settings specified by the juniSystemBootConfigFile. The juniSystemBootConfigControl and juniSystemBootConfigFile must be specified together in the same set request PDU. fileOnce - On the next system reboot use the configuration settings specified by the juniSystemBootConfigFile. Do not continue to use this file after using it once; on subsequent reboots use the running configuration. The juniSystemBootConfigControl and juniSystemBootConfigFile must be specified together in the same set request PDU. factoryDefaults - On the next system reboot use the factory default settings. On subsequent reboots use the running configuration. runningConfiguration - On a system reboot use the current configuration settings."
  },
  "juniSystemBootBackupConfigControl": {
    "name": "juniSystemBootBackupConfigControl",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.1.8",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "file": 0,
          "factoryDefaults": 1,
          "none": 2
        }
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "System boot backup configuration control is used to determine the configuration to be used when the boot logic chooses backup mode: file - On a system reboot in backup mode use the configuration settings specified by the juniSystemBootBackupConfigFile. If this option is specified, juniSystemBootBackupConfigFile, juniSystemBootBackupReleaseFile and this object must be specified together in the same set request PDU. factoryDefaults - On a system reboot in backup mode use the factory default configuration settings. If this option is specified, juniSystemBootBackupReleaseFile and this object must be specified together in the same set request PDU. none - Disallow the boot logic from using the backup release file and configuration (i.e., disable backup mode)."
  },
  "juniSystemBootForceBackupControl": {
    "name": "juniSystemBootForceBackupControl",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.1.9",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "off": 0,
          "on": 1
        }
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "System boot force backup control: off - On the next system reboot do not force the boot logic to choose backup mode. on - On the next system reboot force the boot logic to choose backup mode. Attempting to set this object to on(1) while the juniSystemBootBackupConfigControl is set to none(2) will result in an error."
  },
  "juniSystemBootAutoRevertControl": {
    "name": "juniSystemBootAutoRevertControl",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.1.10",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "default": 0,
          "never": 1,
          "set": 2
        }
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The system boot auto-revert control is used to determine when the boot logic should choose backup mode based of the reboot history: default - Use the default auto-revert tolerances: 3 reboots in 30 minutes. never - Never auto-revert to backup mode. set - Use the auto-revert tolerances specified by juniSystemBootAutoRevertCountTolerance and juniSystemBootAutoRevertTimeTolerance, which must be specified in the same PDU as this object when this value is specified."
  },
  "juniSystemBootAutoRevertCountTolerance": {
    "name": "juniSystemBootAutoRevertCountTolerance",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.1.11",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 4294967294
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The auto-revert reboot count tolerance, used in conjunction with the value of juniSystemBootAutoRevertTimeTolerance when juniSystemBootAutoRevertControl is set to set(2) in the same PDU. For example, if this object is set to 4 and juniSystemBootAutoRevertTimeTolerance is set to 1200, then the boot logic will choose backup mode if 4 system reboots occur within 20 minutes. This object cannot be set to zero, but may contain a zero value when juniSystemBootAutoRevertControl is set to never(1)."
  },
  "juniSystemBootAutoRevertTimeTolerance": {
    "name": "juniSystemBootAutoRevertTimeTolerance",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.1.12",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 4294967294
          }
        ]
      }
    },
    "units": "seconds",
    "maxaccess": "read-write",
    "status": "current",
    "description": "The auto-revert reboot time tolerance, used in conjunction with the value of juniSystemBootAutoRevertCountTolerance when juniSystemBootAutoRevertControl is set to set(2) in the same PDU. This object cannot be set to zero, but will contain a zero value when juniSystemBootAutoRevertControl is set to never(1)."
  },
  "juniSystemBootReleaseFile": {
    "name": "juniSystemBootReleaseFile",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.1.13",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The system-wide boot release file name, with extension '.rel'. On a set operation, if there is no file found with the name specified, then an error is returned."
  },
  "juniSystemBootConfigFile": {
    "name": "juniSystemBootConfigFile",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.1.14",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The system-wide boot configuration file name. This object and the juniSystemBootConfigControl object set to file(0) or fileOnce(1) must be specified together in the same set request PDU. If juniSystemBootConfigControl is file(0), only file names with extension '.cnf' are allowed. If juniSystemBootConfigControl is fileOnce(1), only file names with extensions '.cnf' or '.scr' are allowed. On a set operation, if the extension is not appropriate or there is no file found with the name specified, then an error is returned. If juniSystemBootConfigControl is not set to file(0) or fileOnce(1) then a get operation for this object will return a zero-length string."
  },
  "juniSystemBootBackupReleaseFile": {
    "name": "juniSystemBootBackupReleaseFile",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.1.15",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The system-wide backup boot release file name, with extension '.rel'. A zero-length string indicates that there is no backup release file so the primary release file (juniSystemBootReleaseFile) will be used. On a set operation if there is no file found with the name specified, then an error is returned. The juniSystemBootBackupConfigControl object with a valid value other than none(2) must be specified together with this object in the same set request PDU, and if the juniSystemBootBackupConfigControl is set to file(0) then a valid juniSystemBootBackupConfigFile must also be included in the set request PDU."
  },
  "juniSystemBootBackupConfigFile": {
    "name": "juniSystemBootBackupConfigFile",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.1.16",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The system-wide backup boot configuration file name, with extension '.cnf'. The juniSystemBootBackupReleaseFile object, the juniSystemBootBackupConfigControl object set to file(0), and this object must be specified together in the same set request PDU. On a set operation, if there is no file found with the name specified, then an error is returned. If juniSystemBootBackupConfigControl is not set to file(0) then a get operation for this object will return a zero-length string."
  },
  "juniSystemRedundancyRevertControl": {
    "name": "juniSystemRedundancyRevertControl",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.1.17",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "off": 0,
          "immediate": 1,
          "timeOfDay": 2
        }
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Global control for reverting primary modules back from their active redundant spare modules: off - Disable global reverts of redundant modules. immediate - All redundant module pairs are to revert as soon as the primary module is ready to enter the online state. timeOfDay - All redundant module pairs are to revert at the time specified by juniSystemRevertTimeOfDay, relative to midnight based on the system clock time. This object must be set concurrently with juniSystemRevertTimeOfDay when this value is specified. Note that this only applies to modules that have juniSystemModuleRedundancySupport set to true(1)."
  },
  "juniSystemRedundancyRevertTimeOfDay": {
    "name": "juniSystemRedundancyRevertTimeOfDay",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.1.18",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 86399
          }
        ]
      }
    },
    "units": "seconds",
    "maxaccess": "read-write",
    "status": "current",
    "description": "The number of seconds past midnight local time on any given day at which time redundant slot reverts are allowed to occur. This object must be set concurrently with juniSystemRevertControl { timeOfDay }."
  },
  "juniSystemSubsystemTable": {
    "name": "juniSystemSubsystemTable",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.2.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Table of subsystems. A subsystem supports a 'family' of module types; that is, each module type is supported by a particular software subsystem. For example, the ERX channelized T1 line card (CT1-FULL) is supported by the 'ct1' subsystem."
  },
  "juniSystemSubsystemEntry": {
    "name": "juniSystemSubsystemEntry",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.2.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemSubsystemIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A table entry containing information pertaining to a subsystem. Subsystem information takes precedence over system-wide information, but not over individual module information."
  },
  "juniSystemSubsystemIndex": {
    "name": "juniSystemSubsystemIndex",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.2.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 255
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Arbitrary subsystem identification number."
  },
  "juniSystemSubsystemName": {
    "name": "juniSystemSubsystemName",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.2.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The name of the subsystem."
  },
  "juniSystemSubsystemBootReleaseFile": {
    "name": "juniSystemSubsystemBootReleaseFile",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.2.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The boot release file name for this subsystem, with extension '.rel'. If a file name is specified (a non-zero-length string), then this release file takes precedence over the system-wide boot release file (juniSystemBootReleaseFile) just for modules of the type specified by the subsystem name. On a set operation, if there is no file that matches the name specified, then an inconsistentValue error will be returned. Setting this object to a zero-length string deconfigures the subsystem-specific backup release file."
  },
  "juniSystemSubsystemBootBackupReleaseFile": {
    "name": "juniSystemSubsystemBootBackupReleaseFile",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.2.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The backup boot release file name for this subsystem, with extension '.rel'. If a file name is specified (a non-zero-length string), then this release file takes precedence over the system-wide boot backup release file (juniSystemBootBackupReleaseFile) just for modules of the type specified by the subsystem name. This object cannot be set unless the system has a backup file, which means that juniSystemBootBackupReleaseFile must contain a file name (a non-zero-length string). On a set operation, if there is no file that matches the name specified, then an inconsistentValue error will be returned. Setting this object to a zero-length string deconfigures the subsystem-specific backup release file."
  },
  "juniSystemMaxSlotNumber": {
    "name": "juniSystemMaxSlotNumber",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 255
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The highest number assigned to a slot in the system. In a particular hardware model, module slots have fixed numbers assigned to them, even though in some instances there may be no actual slots associated with a particular number. In all cases there is a maximum slot number that will never be exceeded: 2 for ERX-3xx models 6 for ERX-7xx models 13 for ERX-14xx models 16 for E320 models Note that slot numbers are zero-based."
  },
  "juniSystemMaxModulesPerSlot": {
    "name": "juniSystemMaxModulesPerSlot",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.2",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 255
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The maximum number of modules and sub-modules (different levels) that can be associated with a slot number in the system. This value is constant for a particular hardware platform family. The number of levels is 2 for a first generation E-series (ERX) platform and is 4 for a second generation E-series platform. For the first generation E-series (ERX) platform family: level 1 - SRP or line card module level 2 - I/O adapter module For the second generation E-series platform family: level 1 - Forwarding module or SRP sub-module level 2 - Switch fabric slice (SFS) sub-module or module level 3 - Bay 0 I/O adapter level 4 - Bay 1 I/O adapter "
  },
  "juniSystemSlotTable": {
    "name": "juniSystemSlotTable",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.3",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table of system module slot physical container configuration information."
  },
  "juniSystemSlotEntry": {
    "name": "juniSystemSlotEntry",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.3.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemSlotNumber",
        "implied": 0
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemSlotLevel",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A table entry describing the physical status of a system module slot container, which is designated by its slot and level positions. There is an entry in this table for all index pairs from { 0, 1 } to the maximum for each index, { juniSystemMaxSlotNumber, juniSystemMaxModulesPerSlot }, even if there is no corresponding module slot container in the system. A request for an index value outside this range will result in a 'no such' response."
  },
  "juniSystemSlotNumber": {
    "name": "juniSystemSlotNumber",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.3.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 255
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The slot number. The actual upper limit of valid values is juniSystemMaxSlotNumber. Note that slot numbers are zero-based."
  },
  "juniSystemSlotLevel": {
    "name": "juniSystemSlotLevel",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.3.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "JuniSystemSlotLevel",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The relative position of a module or sub-module 'container' within a slot."
  },
  "juniSystemSlotStatus": {
    "name": "juniSystemSlotStatus",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.3.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "unknown": 0,
          "noSlotContainer": 1,
          "empty": 2,
          "moduleNotPresent": 3,
          "modulePresent": 4
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The status of the module slot container. unknown - The existence of a container cannot be determined noSlotContainer - The physical container does not exist empty - No module is present and no configuration information is available for this container moduleNotPresent - A module is configured but it is not currently in its container modulePresent - A module is inserted in the container "
  },
  "juniSystemSlotType": {
    "name": "juniSystemSlotType",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.3.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "JuniSystemSlotType",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The category of modules that can be configured for the container."
  },
  "juniSystemModuleTable": {
    "name": "juniSystemModuleTable",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.4",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table of system module and sub-module information. In this table, a module refers to a physical module (board) or a sub-module. A physical board may contain a single module or multiple sub-modules. For example, an ERX line card is a single module and appears as single entry in this table. An I/O adapter is a module that doesn't provide any operaitonal state information and it also appears as a single entry in this table. A second generation E-series SRP/SFS hardware module contains two sub-modules, each with its own operational state information: a System Resource Processor (SRP) sub-module and a Switch Fabric Slice (SFS) sub-module, which appear as two separate entries in this table, one for each sub-module."
  },
  "juniSystemModuleEntry": {
    "name": "juniSystemModuleEntry",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.4.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemSlotNumber",
        "implied": 0
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemSlotLevel",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A table entry that provides information about a specific system module or sub-module in a particular module location. There are only entries in this table for module locations that report a juniSystemSlotStatus of moduleNotPresent(3) or modulePresent(4)."
  },
  "juniSystemModuleOperStatus": {
    "name": "juniSystemModuleOperStatus",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.4.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "unknown": 0,
          "notPresent": 1,
          "disabled": 2,
          "hardwareError": 3,
          "booting": 4,
          "initializing": 5,
          "online": 6,
          "standby": 7,
          "inactive": 8,
          "notResponding": 9
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The current operational status of the module (or sub-module): unknown - The status of the module cannot be determined notPresent - No hardware is currently present but there was a module previously configured in this position (see juniSystemModuleExpectedType); juniSystemModuleCurrentType is unknown(0) disabled - Disable for the reason specified in juniSystemModuleDisableReason hardwareError - Not operational due to a hardware failure booting - In the process of booting initializing - In the process of initialing online - Fully operational standby - In redundant standby mode inactive - In redundant inactive mode notResponding - Unable to communicate with the rest of the system "
  },
  "juniSystemModuleDisableReason": {
    "name": "juniSystemModuleDisableReason",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.4.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "none": 0,
          "unknown": 1,
          "assessing": 2,
          "admin": 3,
          "typeMismatch": 4,
          "fabricLimit": 5,
          "imageError": 6
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Indicates the condition causing the module (or sub-module) to be disabled: none - Value when the module is not disabled unknown - Unknown reason for disablement assessing - The module content is being assessed (transient initialization state) admin - The module is administratively disabled typeMismatch - The current module personality conflicts with configuration associated with a different (expected) module personality that previously occupied the slot fabricLimit - Module resource requirements exceed available fabric capacity imageError - Software image for the module is missing or invalid"
  },
  "juniSystemModuleLastChange": {
    "name": "juniSystemModuleLastChange",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.4.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TimeTicks",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The value of sysUpTime when the value of juniSystemModuleOperStatus last changed."
  },
  "juniSystemModuleCurrentType": {
    "name": "juniSystemModuleCurrentType",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.4.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "JuniSystemModuleType",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The personality of this module based on the combination of modules that are currently inserted in the slot. This could be different from the personality reported in juniSystemModuleExpectedType, in which case it may be necessary to set juniSystemModuleControl for the module in the primary level to 'flush' before the set of modules in this slot can be made operational."
  },
  "juniSystemModuleExpectedType": {
    "name": "juniSystemModuleExpectedType",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.4.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "JuniSystemModuleType",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The personality for this module position based on the combination of modules that were inserted in this slot when it was last configured. The value of this object will be different than the value of juniSystemModuleCurrentType when the value of juniSystemModuleOperStatus is disabled(2) and the value of juniSystemModuleDisableReason is typeMismatch(4). After one or more modules is removed from a slot, configuration information associated with the slot (its 'personality') may persist, inhibiting the operation of a different combination of modules in the slot (when new modules are inserted) until juniSystemModuleControl for the slot's primary module is set to flush(1)."
  },
  "juniSystemModuleDescr": {
    "name": "juniSystemModuleDescr",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.4.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 63
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Textual description of the expected module in this slot."
  },
  "juniSystemModuleSlotSpan": {
    "name": "juniSystemModuleSlotSpan",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.4.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 255
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of slot positions that the expected module spans. Most modules are only one slot wide, but some require extra space or backplane resources. These modules are identified as being in the lower numbered slot and spanning across the higher numbered slot(s)."
  },
  "juniSystemModulePortCount": {
    "name": "juniSystemModulePortCount",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.4.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of physical ports supported by the expected module type in this slot."
  },
  "juniSystemModuleSerialNumber": {
    "name": "juniSystemModuleSerialNumber",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.4.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 10
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The serial number of the expected module in this slot. The serial number of the current module may be found in this module's entPhysicalSerialNum. A serial number is for a hardware board, so if there is more than one sub-module on a board, their serial numbers will all be the same."
  },
  "juniSystemModuleAssemblyPartNumber": {
    "name": "juniSystemModuleAssemblyPartNumber",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.4.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 10
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The part number of the expected module in this slot. The part number of the current module may be found in this module's entPhysicalModelName. A part number is for a hardware board, so if there is more than one sub-module on a board, their part numbers will all be the same."
  },
  "juniSystemModuleAssemblyRev": {
    "name": "juniSystemModuleAssemblyRev",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.4.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 3
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The revision level of the expected module in this slot. The revision level of the current module may be found in this module's entPhysicalHardwareRev. A revision level is for a hardware board, so if there is more than one sub-module on a board, their revision levels will all be the same."
  },
  "juniSystemModulePhysicalIndex": {
    "name": "juniSystemModulePhysicalIndex",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.4.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PhysicalIndex",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The entPhysicalIndex value assigned to the module. The ENTITY-MIB.entPhysicalTable contains additional information about this module that can be retrieved using this index. An entPhysicalIndex is for a hardware board, so if there is more than one sub-module on a board, their entPhysicalIndex values will all be the same."
  },
  "juniSystemModuleSoftwareSupport": {
    "name": "juniSystemModuleSoftwareSupport",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.4.1.13",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "An indicator as to whether this module or sub-module has operational state information that can be managed. If the value of this object is true(1), then there is an entry for this module or sub-module in the juniSystemModuleSoftwareTable."
  },
  "juniSystemModuleRedundancySupport": {
    "name": "juniSystemModuleRedundancySupport",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.4.1.14",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "An indicator as to whether this module or sub-module is part of a redundancy group. If the value of this object is true(1), then there is an entry for this module or sub-module in the juniSystemModuleRedundancyTable."
  },
  "juniSystemModuleLevelSpan": {
    "name": "juniSystemModuleLevelSpan",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.4.1.15",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 255
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of level positions that the expected module spans. Most modules are only one level 'high', but some require extra space or backplane resources. These modules are identified as being in the lower numbered level and spanning across the higher numbered level(s)."
  },
  "juniSystemModuleSoftwareTable": {
    "name": "juniSystemModuleSoftwareTable",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.5",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table of system module software information. This includes the version of the software running on the particular module, the running software's use of the modules resources and the modules operational state. Some module types don't contain loadable software (they execute 'firmware') but include support for some of the objects in this table. For example, the E320 SFS (es2Sfs) modules only support juniSystemModuleAdminStatus and juniSystemModuleControl. Appropriate 'default' values are returned for the other objects. Some module types don't contain any software related information (e.g., ERX I/O adapters do not) in which case their value of juniSystemModuleSoftwareSupport will be false and there will not be a corresponding entry in this table."
  },
  "juniSystemModuleSoftwareEntry": {
    "name": "juniSystemModuleSoftwareEntry",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.5.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemSlotNumber",
        "implied": 0
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemSlotLevel",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A table entry that provides software information about a specific system module in a particular slot location."
  },
  "juniSystemModuleSoftwareVersion": {
    "name": "juniSystemModuleSoftwareVersion",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.5.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Version identification of the currently executing operational software on this module. If the module is in a state where the software version is not known (e.g., module type mismatch), then the value of this object will be a zero-length string."
  },
  "juniSystemModuleCpuUtilPct": {
    "name": "juniSystemModuleCpuUtilPct",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.5.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": -1,
            "max": 100
          }
        ]
      }
    },
    "units": "percent",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Last available module CPU utilization percentage. A value of -1 indicates the utilization is unknown. This value is calculated over a 5 second period."
  },
  "juniSystemModuleMemUtilPct": {
    "name": "juniSystemModuleMemUtilPct",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.5.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": -1,
            "max": 100
          }
        ]
      }
    },
    "units": "percent",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Percentage of module memory utilization. A value of -1 indicates the utilization is unknown."
  },
  "juniSystemModuleAdminStatus": {
    "name": "juniSystemModuleAdminStatus",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.5.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "JuniEnable",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Provides administrative control to enable/disable the module. This object is read-only for certain types of modules."
  },
  "juniSystemModuleControl": {
    "name": "juniSystemModuleControl",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.5.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "noOperation": 0,
          "flush": 1,
          "reset": 2,
          "resetBackup": 3
        }
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Administrative control of this slot: noOperation - Setting this value has no effect. flush - Flushes the configuration associated with a module type that previously occupied this slot. Used to explicitly confirm that the slot is now empty, or contains a different card type. The module must be disabled when this value is asserted. See the description for juniSystemModuleDisableReason. reset - Resets the module. resetBackup - Resets the module using the backup release file. Get operations on this variable always return noOperation. Module types that do not support these operations simply ignore them."
  },
  "juniSystemModuleBootReleaseFile": {
    "name": "juniSystemModuleBootReleaseFile",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.5.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The boot release file name for this slot, with extension '.rel'. If a file name is specified (not a zero-length string), then this release file takes precedence over the subsystem boot release file (juniSystemSubsystemBootReleaseFile) and the system-wide boot release file (juniSystemBootReleaseFile) for just the module in this slot. Some module types (e.g., ERX SRP modules) don't allow this object to be set. On a set operation, if there is no file that matches the name specified, then an inconsistentValue error will be returned. Setting this object to a zero-length string deconfigures the slot-specific primary release file."
  },
  "juniSystemModuleBootBackupReleaseFile": {
    "name": "juniSystemModuleBootBackupReleaseFile",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.5.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The backup boot release file name for this slot, with extension '.rel'. If a file name is specified (a non-zero-length string), then this release file takes precedence over the subsystem boot backup release file (juniSystemSubsystemBootBackupReleaseFile) and the system-wide boot backup release file (juniSystemBootBackupReleaseFile) for just the module in this slot. This object cannot be set unless the system has a backup file, which mean that juniSystemBootBackupReleaseFile must contain a file name (a non-zero-length string). Some module types (e.g., ERX SRP modules) don't allow this object to be set. On a set operation, if there is no file that matches the name specified, then an inconsistentValue error will be returned. Setting this object to a zero-length string deconfigures the slot-specific backup release file."
  },
  "juniSystemModuleCpuFiveSecUtilPct": {
    "name": "juniSystemModuleCpuFiveSecUtilPct",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.5.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": -1,
            "max": 100
          }
        ]
      }
    },
    "units": "percent",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Percentage of average CPU utilization for the last five sec for this module. A value of -1 indicates the utilization is unknown."
  },
  "juniSystemModuleCpuOneMinAvgPct": {
    "name": "juniSystemModuleCpuOneMinAvgPct",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.5.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": -1,
            "max": 100
          }
        ]
      }
    },
    "units": "percent",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Percentage of average CPU utilization for the last one minute for this module. A value of -1 indicates the utilization is unknown."
  },
  "juniSystemModuleCpuFiveMinAvgPct": {
    "name": "juniSystemModuleCpuFiveMinAvgPct",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.5.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": -1,
            "max": 100
          }
        ]
      }
    },
    "units": "percent",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Percentage of average CPU utilization for the last five minutes for this module. A value of -1 indicates the utilization is unknown."
  },
  "juniSystemModuleRedundancyTable": {
    "name": "juniSystemModuleRedundancyTable",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.6",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table of system module redundancy information. Note that modules that do not support redundancy information will not appear in this table."
  },
  "juniSystemModuleRedundancyEntry": {
    "name": "juniSystemModuleRedundancyEntry",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.6.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemSlotNumber",
        "implied": 0
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemSlotLevel",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A table entry that provides information about a specific system module in a particular slot location."
  },
  "juniSystemModuleRedundancyGroupId": {
    "name": "juniSystemModuleRedundancyGroupId",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.6.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Identifies the redundancy group as derived from hardware settings."
  },
  "juniSystemModuleRedundancySpare": {
    "name": "juniSystemModuleRedundancySpare",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.6.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "True only if this module is a spare redundant module."
  },
  "juniSystemModuleRedundancyAssociatedSlot": {
    "name": "juniSystemModuleRedundancyAssociatedSlot",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.6.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "If this module is a primary redundant module, then the module at the same slot level with the slot number identified by this variable is the spare module that serves as this module's backup. If this module is an active spare redundant module, then the module in the slot identified by this variable is the primary module for which this module is the spare. If this module is an inactive spare redundant module, then the value of this object is the slot number of the spare itself (the same value as the first index)."
  },
  "juniSystemModuleRedundancyLockout": {
    "name": "juniSystemModuleRedundancyLockout",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.6.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "JuniEnable",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Provides administrative control to enable/disable redundancy protection for the module in this slot."
  },
  "juniSystemModuleRedundancyRevertControl": {
    "name": "juniSystemModuleRedundancyRevertControl",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.6.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "off": 0,
          "immediate": 1,
          "timeAndDate": 2
        }
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Per-module control for reverting a primary module back from its active redundant spare module: off - Disable reverting to the primary module. immediate - Revert as soon as this primary module is ready to enter the online state. timeAndDate - Revert to this primary module at time specified by juniSystemModuleRedundancyRevertTime, provided it is in the inactive state. This control only applies to primary modules; spare modules can only be set to off(0)."
  },
  "juniSystemModuleRedundancyRevertTime": {
    "name": "juniSystemModuleRedundancyRevertTime",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.3.6.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DateAndTime",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 8,
            "max": 8
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The date and time associated with the timeAndDate (delayed) revert operation. Only the local format for DateAndTime is supported. On a set operation, if the time specified is prior to the current time, then an inconsistent value error is returned.This object must be set concurrently with juniSystemModuleRedundancyRevertControl { timeAndDate(2) }."
  },
  "juniSystemPortTable": {
    "name": "juniSystemPortTable",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.4.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Table of system physical I/O ports. The information in this table reflects the ports for the expected module type in each slot; in event of a module mismatch, this table permits navigation of the existing configuration of the expected module type."
  },
  "juniSystemPortEntry": {
    "name": "juniSystemPortEntry",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.4.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemSlotNumber",
        "implied": 0
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemSlotLevel",
        "implied": 0
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemPortNumber",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A table entry describing a physical port of the system."
  },
  "juniSystemPortNumber": {
    "name": "juniSystemPortNumber",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.4.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 255
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Port number of this physical port, relative to the slot in which it resides. Each physical port is uniquely distinguished by its slot number, slot level and port number. Port numbers are zero-based."
  },
  "juniSystemPortIfIndex": {
    "name": "juniSystemPortIfIndex",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.4.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InterfaceIndexOrZero",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The ifIndex of the Interfaces MIB ifTable entry corresponding to this physical port; if zero, the ifIndex is unknown or does not exist."
  },
  "juniSystemPortPhysicalIndex": {
    "name": "juniSystemPortPhysicalIndex",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.4.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PhysicalIndex",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The entPhysicalIndex value assigned to this port. This index may be use to retrieve other information about the port, such as description and type, from the ENTITY-MIB.entPhysicalTable."
  },
  "juniSystemAdminTimingSource": {
    "name": "juniSystemAdminTimingSource",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.5.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "JuniSystemTimingSelector",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The administrative timing source for the system. This variable is used to select the desired timing source to be either primary, secondary or tertiary. Setting this variable will cause the system to change to the specified timing source, provided it is currently available. Setting this value to error(4) is not allowed. The system periodically monitors the status of the three timing sources. If the systems current timing source fails, the system will automatically downgrade to the next timing source. If the system is configured to automatically upgrade (juniSystemTimingAutoUpgrade is set to enable(1)) the system will switch back to the timing source indicated by this variable when it becomes available. A timing source failure can be detected by comparing the operational and administrative timing sources. If they are not equal, the system has swapped timing sources because the administratively set timing source is in the error state."
  },
  "juniSystemOperTimingSource": {
    "name": "juniSystemOperTimingSource",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.5.2",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "JuniSystemTimingSelector",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The operational timing source for the system. The system periodically monitors the status of three timing sources, primary, secondary and tertiary. If the systems current timing source fails, the system will automatically downgrade to the next timing source. If the system is configured to automatically upgrade (juniSystemTimingAutoUpgrade is set to enable(1)) the system will switch back to the higher timing source when it becomes available."
  },
  "juniSystemTimingAutoUpgrade": {
    "name": "juniSystemTimingAutoUpgrade",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.5.3",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "JuniEnable",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "enable",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This object controls the automatic timing selector upgrade. Setting this object to disable(0) will prevent automatic upgrade to the next highest timing selector. Setting this object to enable(1) will enable the automatic upgrade of timing selectors."
  },
  "juniSystemTimingSelectorTable": {
    "name": "juniSystemTimingSelectorTable",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.5.4",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Table of system timing selectors. This table only contains entries for the primary, secondary and tertiary selecors."
  },
  "juniSystemTimingSelectorEntry": {
    "name": "juniSystemTimingSelectorEntry",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.5.4.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemTimingSelectorIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A table entry describing a system timing selector."
  },
  "juniSystemTimingSelectorIndex": {
    "name": "juniSystemTimingSelectorIndex",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.5.4.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "JuniSystemTimingSelector",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The system timing selector index associated with this entry. There are valid indexes for selector types primary(1), secondary(2), tertiary(3)."
  },
  "juniSystemTimingSourceType": {
    "name": "juniSystemTimingSourceType",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.5.4.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "timingInterfaceIfIndex": 1,
          "timingInternal": 2,
          "timingLine": 3
        }
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The system timing source type for this entry. This object must be set to timingInterfaceIfIndex(1) when setting the juniSystemTimingSourceIfIndex object or timingLine(3) when setting the juniSystemTimingSourceLine object. Also, if the value of this object is set to timingInternal(2), no other objects should be set, otherwise the agent will return an error."
  },
  "juniSystemTimingSourceIfIndex": {
    "name": "juniSystemTimingSourceIfIndex",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.5.4.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InterfaceIndexOrZero",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The ifIndex of the interface selected as the system timing source. If the juniSystemTimingSourceType object is not timingInterfaceIfIndex(1), then reading this object will return a zero value. The agent will not accept a set to this object unless the juniSystemTimingSourceType object is set to timingInterfaceIfIndex(1)."
  },
  "juniSystemTimingSourceLine": {
    "name": "juniSystemTimingSourceLine",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.5.4.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "timingSourceLineUndefined": 0,
          "timingSourceLineE1PortA": 1,
          "timingSourceLineE1PortB": 2,
          "timingSourceLineT1PortA": 3,
          "timingSourceLineT1PortB": 4
        }
      }
    },
    "default": {
      "default": {
        "value": "timingSourceLineUndefined",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The line type timing source for this entry. If the juniSystemTimingSourceType object is not timingLine(3), then reading this object will return timingSourceLineUndefined(0). The agent will not accept a set to this object unless the juniSystemTimingSourceType object is set to timingLine(3). Attempting to set this object to timingSourceLineUndefined(0) will always return an inconsistantValue error. Attempting to set this object to a value that is not supported on the type of system running the agent will result in an inconsistantValue error."
  },
  "juniSystemTimingWorkingStatus": {
    "name": "juniSystemTimingWorkingStatus",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.5.4.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "timingStatusOk": 1,
          "timingStatusError": 2,
          "timingStatusUnknown": 3
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The status associated with the working (normal) source of this system timing working selector."
  },
  "juniSystemTimingProtectedStatus": {
    "name": "juniSystemTimingProtectedStatus",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.5.4.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "timingStatusOk": 1,
          "timingStatusError": 2,
          "timingStatusUnknown": 3,
          "sourceNotProtected": 4
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The status associated with the protected (backup) source of this system timing selector. If the system doesn't support protected timing sources, then sourceNotProtected(4) will be returned."
  },
  "juniSystemFabricSpeed": {
    "name": "juniSystemFabricSpeed",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.6.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "units": "gigabits per second",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The speed of switching fabric, in gigabits per second."
  },
  "juniSystemFabricRev": {
    "name": "juniSystemFabricRev",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.6.2",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 10
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The fabric revision number. If unknown, a zero-length string is reported."
  },
  "juniSystemNvsCount": {
    "name": "juniSystemNvsCount",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.7.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 255
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of non-volatile storage (NVS) 'flash' cards in the system."
  },
  "juniSystemNvsTable": {
    "name": "juniSystemNvsTable",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.7.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table of NVS status information."
  },
  "juniSystemNvsEntry": {
    "name": "juniSystemNvsEntry",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.7.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemNvsIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A table entry that provides the status information for a NVS flash card."
  },
  "juniSystemNvsIndex": {
    "name": "juniSystemNvsIndex",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.7.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 255
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The index number of the NVS flash card. There is an entry in this table for all values of this index in the range of 1 to the value of juniSystemNvsCount."
  },
  "juniSystemNvsStatus": {
    "name": "juniSystemNvsStatus",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.7.2.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "notPresent": 0,
          "writeProtected": 1,
          "volumeError": 2,
          "nearCapacity": 3,
          "ok": 4,
          "noConfigSpace": 5
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The status of non-volatile storage (NVS): notPresent - The SRP or the flash card is not accessible. writeProtected - NVS is write-protected. volumeError - Status poll of NVS failed. nearCapacity - Utilization exceeds 85% of NVS capacity. ok - NVS is fully operational with ample capacity. noConfigSpace - Utilization exceeds the ability to save the running configuration."
  },
  "juniSystemNvsCapacity": {
    "name": "juniSystemNvsCapacity",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.7.2.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "units": "megabytes",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The capacity of NVS storage in megabytes."
  },
  "juniSystemNvsUtilPct": {
    "name": "juniSystemNvsUtilPct",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.7.2.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": -1,
            "max": 100
          }
        ]
      }
    },
    "units": "percent",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The percentage of NVS storage used. A value of -1 indicates NVS utilization is unknown."
  },
  "juniSystemNvsPhysicalIndex": {
    "name": "juniSystemNvsPhysicalIndex",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.7.2.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PhysicalIndex",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The entPhysicalIndex value assigned to this NVS flash card. This index may be use to retrieve other information about the NVS flash card, such as description and type, from the ENTITY-MIB.entPhysicalTable."
  },
  "juniSystemPowerCount": {
    "name": "juniSystemPowerCount",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.8.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 255
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of power elements in the system."
  },
  "juniSystemPowerTable": {
    "name": "juniSystemPowerTable",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.8.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table of status variables for the system power elements."
  },
  "juniSystemPowerEntry": {
    "name": "juniSystemPowerEntry",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.8.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemPowerIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A table entry describing status of a system power element."
  },
  "juniSystemPowerIndex": {
    "name": "juniSystemPowerIndex",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.8.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 255
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The index number of the power element. There is an entry in this table for all values of this index in the range of 1 to the value of juniSystemPowerCount."
  },
  "juniSystemPowerStatus": {
    "name": "juniSystemPowerStatus",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.8.2.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "notPresent": 0,
          "inactive": 1,
          "good": 2,
          "failed": 3,
          "sensorFailed": 4,
          "unknown": 5
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The status of the power element: notPresent - The power element is removed from the chassis. inactive - No power is available from this element. good - Power is available from this element. failed - The power element is not working. sensorFailed - The power element sensor has failed. unknown - The status of the power element is not availiable."
  },
  "juniSystemPowerPhysicalIndex": {
    "name": "juniSystemPowerPhysicalIndex",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.8.2.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PhysicalIndex",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The entPhysicalIndex value assigned to this power element. This index may be use to retrieve other information about the power element, such as description and type, from the ENTITY-MIB.entPhysicalTable."
  },
  "juniSystemFanCount": {
    "name": "juniSystemFanCount",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.9.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 255
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The maximum number of fan subsystems that may be present in the system. This is a fixed number for each product type."
  },
  "juniSystemFanTable": {
    "name": "juniSystemFanTable",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.9.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table of status of the system's fan subsystems."
  },
  "juniSystemFanEntry": {
    "name": "juniSystemFanEntry",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.9.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemFanIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A table entry describing status of a fan subsystem."
  },
  "juniSystemFanIndex": {
    "name": "juniSystemFanIndex",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.9.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 255
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The index number of the fan subsystem. This is a number in the range of 1 to the value of juniSystemFanCount."
  },
  "juniSystemFanStatus": {
    "name": "juniSystemFanStatus",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.9.2.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "failed": 0,
          "ok": 1,
          "warning": 2
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Status of fan subsystem. failed - The fan subsystem has a critical failure, or has been removed, and is now non-operational. ok - All components are operational. warning - The fan subsystem has a non-critical failure."
  },
  "juniSystemFanPhysicalIndex": {
    "name": "juniSystemFanPhysicalIndex",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.9.2.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PhysicalIndex",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The entPhysicalIndex value assigned to this fan subsystem. This index may be use to retrieve other information about the fan subsystem, such as description and type, from the ENTITY-MIB.entPhysicalTable."
  },
  "juniSystemTempCount": {
    "name": "juniSystemTempCount",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.9.3",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The maximum number of possible temperature sensors in the system."
  },
  "juniSystemTempTable": {
    "name": "juniSystemTempTable",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.9.4",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table of status of the system's temperature sensors."
  },
  "juniSystemTempEntry": {
    "name": "juniSystemTempEntry",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.9.4.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemTempIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A table entry describing status of a temperature sensor. Sensors are located throughout the system. The ENTITY_MIB.entPhysicalTable provides detailed information about the location of each sensor. The index for a table entry is fixed based on a product-specific algorithm that uses the maximum number of sensors that may be on any module type associated with each of the available slots. This means that entries for sensors associated with empty slots and the 'extra' sensors on modules that have less than the maximum number of sensors for the slot type will have a notPresent status."
  },
  "juniSystemTempIndex": {
    "name": "juniSystemTempIndex",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.9.4.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "An arbitrary number to uniquely identify the temperature sensor."
  },
  "juniSystemTempStatus": {
    "name": "juniSystemTempStatus",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.9.4.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "unknown": 0,
          "failed": 1,
          "tooLow": 2,
          "nominal": 3,
          "tooHigh": 4,
          "tooLowWarning": 5,
          "tooHighWarning": 6
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The status of a temperature sensor: unknown - sensor is not present or is not accessible failed - sensor is broken tooLow - temperature is below nominal range nominal - temperature is within nominal range tooHigh - temperature is above nominal range tooLowWarning - temperature is near the nominal lower limit tooHighWarning - temperature is near the nominal upper limit "
  },
  "juniSystemTempValue": {
    "name": "juniSystemTempValue",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.9.4.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type"
    },
    "units": "degrees Celsius",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The temperature measured by this sensor in degrees Celsius. This measurement is valid only if the value of the corresponding juniSystemTempStatus is tooLow, nominal or tooHigh."
  },
  "juniSystemTempPhysicalIndex": {
    "name": "juniSystemTempPhysicalIndex",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.9.4.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 2147483647
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The entPhysicalIndex value assigned to this temperature sensor. If the temperature sensor is not present this object will return a value of 0. For non-zero values this index may be used to retrieve other information about the temperature sensor from the ENTITY-MIB.entPhysicalTable, such as description and location."
  },
  "juniSystemTempProtectionStatus": {
    "name": "juniSystemTempProtectionStatus",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.9.5",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "off": 0,
          "monitoring": 1,
          "inHoldOff": 2,
          "activatedHoldOffExpired": 3,
          "activatedTempTooHigh": 4
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Thermal Protection status: off - No thermal protection. monitoring - Monitoring. inHoldOff - Hold off time has begun. activatedHoldOffExpired - Hold off time has expired; the system is in thermal protection mode. activatedTempTooHigh - The temperature is too high, the system is in thermal protection mode."
  },
  "juniSystemTempProtectionHoldOffTime": {
    "name": "juniSystemTempProtectionHoldOffTime",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.9.6",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 1200
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 150,
        "format": "decimal"
      }
    },
    "units": "seconds",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The time, in seconds, before the system enters Thermal Protection mode after a critical thermal failure is detected."
  },
  "juniSystemTempProtectionHoldOffTimeRemaining": {
    "name": "juniSystemTempProtectionHoldOffTimeRemaining",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.9.7",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 1200
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 150,
        "format": "decimal"
      }
    },
    "units": "seconds",
    "maxaccess": "read-only",
    "status": "current",
    "description": "The time remaining, in seconds, before the system enters Thermal Protection mode while the ThermalProtectionStatus is set to inHoldOff. The value decrements every second until it reaches zero, and the status changes to activatedHoldOffExpired. When ThermalProtectionStatus is not inHoldOff or activatedHoldOffExpired, the value is set to the hold off time."
  },
  "juniSystemUtilizationTable": {
    "name": "juniSystemUtilizationTable",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.10.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table of status of the utilization of system resources. It is an implementation option as to which resources (if any) are supported in this table. It is also an implementation option as to whether the threshold objects are supported for a particular instance."
  },
  "juniSystemUtilizationEntry": {
    "name": "juniSystemUtilizationEntry",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.10.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemUtilizationResourceType",
        "implied": 0
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemUtilizationResourceSubType",
        "implied": 0
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemUtilizationLocationType",
        "implied": 0
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemUtilizationLocation",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A table entry describing the status of the utilization of a system resource."
  },
  "juniSystemUtilizationResourceType": {
    "name": "juniSystemUtilizationResourceType",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.10.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "interface": 1,
          "memory": 2
        }
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This index identifies a type of enumerated value that is used for the juniSystemUtilizationResourceSubType. See the DESCRIPTION for juniSystemUtilizationResourceSubType for the mapping of Type to SubType enumeration and the corresponding units of measure used for each type of resource."
  },
  "juniSystemUtilizationResourceSubType": {
    "name": "juniSystemUtilizationResourceSubType",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.10.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This index uses an enumerated value that is different for each value of juniSystemUtilizationResourceType. The following table shows the mapping of Type to SubType enumeration and the corresponding units of measure used for each type of resource. Type SubType Units -----------+-------------------------------+---------------------------- interface Juniper-UNI-IF-MIB.juniIfType number of interfaces memory SNMPv2-TC.StorageType HOST-RESOURCES-MIB.KBytes "
  },
  "juniSystemUtilizationLocationType": {
    "name": "juniSystemUtilizationLocationType",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.10.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "JuniSystemLocationType",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This index element identifies the format of the location information so that the juniSystemUtilizationLocation index element can be properly interpreted."
  },
  "juniSystemUtilizationLocation": {
    "name": "juniSystemUtilizationLocation",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.10.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "JuniSystemLocation",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This index is used to specify the resource instance based on its location. Its value is interpreted based on the location type identified by the juniSystemUtilizationLocationType index element."
  },
  "juniSystemUtilizationMaxCapacity": {
    "name": "juniSystemUtilizationMaxCapacity",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.10.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The maximum number of units of the resource the system can support. See the DESCRIPTION of juniSystemUtilizationResourceSubType for what constitutes a unit of value for this object. Note that for some resources this value may not always be achievable due to other resource constraints."
  },
  "juniSystemUtilizationCurrentValue": {
    "name": "juniSystemUtilizationCurrentValue",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.10.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The current number of units of the resource in the system. See the DESCRIPTION for juniSystemUtilizationResourceSubType for what constitutes a unit of value for this object. Note that some resource types may have instances that do not consume any limited resources and therefore are not included in this count (e.g. IP loopback interfaces do not consume routing resources and therefore don't have a capacity limit, whereas 'external' IP interfaces do)."
  },
  "juniSystemUtilizationThresholdRising": {
    "name": "juniSystemUtilizationThresholdRising",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.10.1.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The threshold value (risingVal), which, in conjunction with juniSystemUtilizationHoldDownTime (holdTime) and juniSystemUtilizationThresholdFalling (fallingVal), is used to decide when to trigger an event indicating that the resource utilization, juniSystemUtilizationCurrentValue (currentVal), is approaching or has reached its maximum capacity, juniSystemUtilizationMaxCapacity (maxVal). See the DESCRIPTION for juniSystemUtilizationResourceSubType for what constitutes a unit of value for this object. The value of fallingVal must be less than the value of this object. This object provides one element in the formula used to determine when to send a utilization notification. If the currentVal rises to equal the risingVal and no other utilization event (either rising or falling) has been triggered within the holdTime, or if the holdTime for a falling threshold notification expires and the currentVal is at or above the risingVal, then and only then is a rising threshold utilization notification sent. The following pseudo-code states the algorithm more precisely. When the resource is created or initialized ( currentVal == 0 ): lastTrapType = none; lastTrapTime = 0; When currentVal increments (increases): if ( currentVal == risingVal && lastTrapTime + holdTime <= currentTime ) { triggerUtilizationTrapRising(); lastTrapType = rising; lastTrapTime = currentTime; } When currentVal decrements (decreases): if ( currentVal == fallingVal && lastTrapTime + holdTime <= currentTime ) { triggerUtilizationTrapFalling(); lastTrapType = falling; lastTrapTime = currentTime; } When the rising threshold value is modified: if ( currentVal < oldRisingVal && currentVal >= newRisingVal && lastTrapTime + holdTime <= currentTime ) triggerUtilizationTrapRising(); lastTrapType = rising; lastTrapTime = currentTime; } When the falling threshold value is modified: if ( currentVal > oldFallingVal && currentVal <= newFallingVal && lastTrapTime + holdTime <= currentTime ) triggerUtilizationTrapFalling(); lastTrapType = falling; lastTrapTime = currentTime; } When a hold-down time expires (lastTrapTime + holdTime == currentTime): switch ( lastTrapType ) { case rising: if ( currentVal <= fallingVal ) { triggerUtilizationTrapFalling(); lastTrapType = falling; lastTrapTime = currentTime; } else { lastTrapType = none; } break; case falling: if ( currentVal >= risingVal ) { triggerUtilizationTrapRising(); lastTrapType = rising; lastTrapTime = currentTime; } else { lastTrapType = none; } break; } "
  },
  "juniSystemUtilizationThresholdFalling": {
    "name": "juniSystemUtilizationThresholdFalling",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.10.1.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The threshold value (fallingVal), which, in conjunction with juniSystemUtilizationHoldDownTime (holdTime) and juniSystemUtilizationThresholdRising (risingVal), is used to decide when to trigger an event indicating that the resource utilization, juniSystemUtilizationCurrentValue (currentVal), has fallen to or below this level after having exceeded this value. See the DESCRIPTION for juniSystemUtilizationResourceSubType for what constitutes a unit of value for this object. The value of this object must be less than the value of risingVal. This object provides one element in the formula used to determine when to send a utilization notification. If the currentVal falls to equal the fallingVal and no other utilization event (either rising or falling) has been triggered within the holdTime, or if the holdTime for a rising threshold notification expires and the currentVal is at or below the fallingVal, then and only then is a falling threshold utilization notification sent. The pseudo-code in the juniSystemUtilizationThresholdRising DESCRIPTION states the algorithm more precisely."
  },
  "juniSystemUtilizationHoldDownTime": {
    "name": "juniSystemUtilizationHoldDownTime",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.10.1.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type"
    },
    "units": "seconds",
    "maxaccess": "read-write",
    "status": "current",
    "description": "The hold-down time (holdTime) used in conjunction with juniSystemUtilizationThresholdRising (risingVal) and juniSystemUtilizationThresholdFalling (fallingVal) to decide when to trigger an event indicating that the resource utilization, juniSystemUtilizationCurrentValue (currentVal), has reached or surpassed one of the thresholds. This object provides one element in the formula used to determine when to send a utilization notification. If the resource utilization increases to the rising threshold value but a prior rising or falling utilization event has been triggered within this hold-down time then no rising threshold utilization notification may be sent at that time. If the resource utilization decreases to the falling threshold value but a prior rising or falling utilization event has been triggered within this hold-down time then no falling threshold utilization notification may be sent at that time. However, if the end of a hold-down period for a rising threshold utilization notification is reached and the current value is at or below the falling threshold value, then a falling threshold notification is sent and the hold-down timer is restarted. Likewise, if the end of a hold-down period for a falling threshold utilization notification is reached and the current value is at or above the rising threshold value, then a rising threshold notification is sent and the hold-down timer is restarted. The pseudo-code in the juniSystemUtilizationThresholdRising DESCRIPTION states the algorithm more precisely."
  },
  "juniSystemCpuUtilizationTable": {
    "name": "juniSystemCpuUtilizationTable",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.10.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A table of status of the cpu utilization by various tasks."
  },
  "juniSystemCpuUtilizationEntry": {
    "name": "juniSystemCpuUtilizationEntry",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.10.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemCpuUtilizationTimeMark",
        "implied": 0
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemCpuUtilizationTaskName",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A table entry describing cpu utilization of a particular task."
  },
  "juniSystemCpuUtilizationTimeMark": {
    "name": "juniSystemCpuUtilizationTimeMark",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.10.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "JuniTimeFilter",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "reference": "Refer to RFC 2021 for the definition of the TimeFilter, its usage and implementation notes.",
    "status": "current",
    "description": "A TimeFilter for this task profile entry. Allows GetNext and GetBulk to find task profile rows which have changed since a specified value of sysUptime."
  },
  "juniSystemCpuUtilizationTaskName": {
    "name": "juniSystemCpuUtilizationTaskName",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.10.2.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "JuniSystemTaskName",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Task name associated with this task profile entry."
  },
  "juniSystemCpuUtilizationInvoked": {
    "name": "juniSystemCpuUtilizationInvoked",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.10.2.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Number of times task associated with this task profile entry being invoked."
  },
  "juniSystemCpuUtilizationInvokationPerSec": {
    "name": "juniSystemCpuUtilizationInvokationPerSec",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.10.2.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Rate of invokation for the task associated with this task profile entry."
  },
  "juniSystemCpuUtilizationTotalRunningTime": {
    "name": "juniSystemCpuUtilizationTotalRunningTime",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.10.2.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type"
    },
    "units": "milli Seconds",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Total running time for the task associated with this task profile entry."
  },
  "juniSystemCpuUtilizationPercentageRunningTime": {
    "name": "juniSystemCpuUtilizationPercentageRunningTime",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.10.2.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 100
          }
        ]
      }
    },
    "units": "percent",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Percentage running time for the task associated with this task profile entry."
  },
  "juniSystemCpuUtilizationAverageTimePerInvokation": {
    "name": "juniSystemCpuUtilizationAverageTimePerInvokation",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.10.2.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type"
    },
    "units": "micro Seconds",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Average running time per invokation for the task associated with this task profile entry."
  },
  "juniSystemCpuUtilizationFiveSecondUtilization": {
    "name": "juniSystemCpuUtilizationFiveSecondUtilization",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.10.2.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 100
          }
        ]
      }
    },
    "units": "percent",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Utilization in terms of percentage during the five seconds measurement interval for the task associated with this task profile entry."
  },
  "juniSystemCpuUtilizationOneMinuteUtilization": {
    "name": "juniSystemCpuUtilizationOneMinuteUtilization",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.10.2.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 100
          }
        ]
      }
    },
    "units": "percent",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Utilization in terms of percentage during the one minute measurement interval for the task associated with this task profile entry."
  },
  "juniSystemCpuUtilizationFiveMinuteUtilization": {
    "name": "juniSystemCpuUtilizationFiveMinuteUtilization",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.10.2.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 100
          }
        ]
      }
    },
    "units": "percent",
    "maxaccess": "read-only",
    "status": "current",
    "description": "Utilization in terms of percentage during the five minutes measurement interval for the task associated with this task profile entry."
  },
  "juniSystemCpuUtilizationNumberOfInstances": {
    "name": "juniSystemCpuUtilizationNumberOfInstances",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.10.2.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Number of instances consolidated for CPU utilization calculation in this task profile entry."
  },
  "juniSystemIssuState": {
    "name": "juniSystemIssuState",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.11.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "idle": 1,
          "initializing": 2,
          "initialized": 3,
          "upgrading": 4,
          "stopping": 5
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The state of the system with respect to ISSU upgrade: idle - ISSU is currently idle initializing - ISSU initialization is in-progress initialized - ISSU has successfully initialized upgrading - ISSU is currently upgrading to the new armed release stopping - ISSU is currently in the process of stopping This object is supported on the second generation E-series platform family (E320 & E120) in JUNOSe 9.0 and subsequent system releases. This object is also supported on ERX-1440 in JUNOSe 9.2 and subsequent system releases."
  },
  "juniSystemIssuRunningReleaseFile": {
    "name": "juniSystemIssuRunningReleaseFile",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.11.2",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The currently running release file name, with extension '.rel'. The system was booted last time with this release file. This object is supported on the second generation E-series platform family (E320 & E120) in JUNOSe 9.0 and subsequent system releases. This object is also supported on ERX-1440 in JUNOSe 9.2 and subsequent system releases."
  },
  "juniSystemIssuArmedReleaseFile": {
    "name": "juniSystemIssuArmedReleaseFile",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.11.3",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 128
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The currently armed release file name, with extension '.rel'. The system will be booted with this release file, after ISSU (if it is not aborted). This object is supported on the second generation E-series platform family (E320 & E120) in JUNOSe 9.0 and subsequent system releases. This object is also supported on ERX-1440 in JUNOSe 9.2 and subsequent system releases."
  },
  "juniSystemIssuStatus": {
    "name": "juniSystemIssuStatus",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.11.4",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "ok": 1,
          "warning": 2,
          "error": 3
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The status of the system with respect to ISSU upgrade. ok - no error or warning found warning - at least one upgrade warning found, upgrade is possible error - at least one upgrade error found, upgrade is not possible This object is supported on the second generation E-series platform family (E320 & E120) in JUNOSe 9.0 and subsequent system releases. This object is also supported on ERX-1440 in JUNOSe 9.2 and subsequent system releases."
  },
  "juniSystemIssuCriteriaTable": {
    "name": "juniSystemIssuCriteriaTable",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.11.5",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A Table of criteria for an ISSU initialization. This table will be empty for unsupported platforms. These objects are supported on the second generation E-series platform family (E320 & E120) in JUNOSe 9.0 and subsequent system releases. This object is also supported on ERX-1440 in JUNOSe 9.2 and subsequent system releases."
  },
  "juniSystemIssuCriteriaEntry": {
    "name": "juniSystemIssuCriteriaEntry",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.11.5.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemIssuCriteriaIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A table entry describing the criteria for an ISSU initialization."
  },
  "juniSystemIssuCriteriaIndex": {
    "name": "juniSystemIssuCriteriaIndex",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.11.5.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 255
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The index associated with an entry of the system ISSU Criteria Table."
  },
  "juniSystemIssuCriteriaDescription": {
    "name": "juniSystemIssuCriteriaDescription",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.11.5.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 255
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "To initialize ISSU, few criteria need to be met. If these criteria were not met, ISSU cannot be initialized. This object provides the criteria details."
  },
  "juniSystemIssuCriteriaStatus": {
    "name": "juniSystemIssuCriteriaStatus",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.11.5.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "yes": 1,
          "no": 2,
          "conditional": 3
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "To initialize ISSU, few criteria need to be met. If these criteria were not met, ISSU cannot be initialized. This object indicates whether a criteria has met. It will be conditional when that the user can choose to accept the consequences of proceeding with ISSU with non-ideal operating conditions."
  },
  "juniSystemMemUtilTrapEnable": {
    "name": "juniSystemMemUtilTrapEnable",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.1.19",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Controls the sending of primary system processor memory utilization events. Setting the value of this object to true(1) will cause system memory utilization event notifications, if they occur, to be sent to the management entity on this system. Setting the value of this object to false(2) will disable memory utilization event notifications."
  },
  "juniSystemReloadSlotNumber": {
    "name": "juniSystemReloadSlotNumber",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.1.20",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 255
          }
        ]
      }
    },
    "maxaccess": "accessible-for-notify",
    "status": "current",
    "description": "In a juniSystemReloadCommand notification, this object indicates the number of the slot that is being reloaded. Note that slot numbers are zero-based."
  },
  "juniSystemUtilizationThresholdDirection": {
    "name": "juniSystemUtilizationThresholdDirection",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.1.21",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "rising": 1,
          "falling": 2
        }
      }
    },
    "maxaccess": "accessible-for-notify",
    "status": "current",
    "description": "The type of resource utilization notification being sent. See the DESCRIPTIONs for the juniSystemUtilizationTable elements for details on what conditions trigger a resource utilization notification."
  },
  "juniSystemUtilizationTrapEnable": {
    "name": "juniSystemUtilizationTrapEnable",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.1.22",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "true",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "Controls the sending of system resource utilization threshold notifications. Setting the value of this object to true(1) will allow resource utilization threshold event notifications, if they occur, to be sent to the management entity on this system. Setting the value of this object to false(2) will disable resource utilization threshold utilization event notifications."
  },
  "juniSystemPortSfpPowerThresholdIfIndex": {
    "name": "juniSystemPortSfpPowerThresholdIfIndex",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.1.24",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "maxaccess": "accessible-for-notify",
    "status": "current",
    "description": "interface phy-uid."
  },
  "juniSystemPortSfpPowerThresholdValue": {
    "name": "juniSystemPortSfpPowerThresholdValue",
    "oid": "1.3.6.1.4.1.4874.2.2.2.1.1.25",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 16
          }
        ]
      }
    },
    "maxaccess": "accessible-for-notify",
    "status": "current",
    "description": "represents power tx/rx max/min threshold value of sfp. currently displays 1.0000 for trap raised, 0.0000 for trap cleared"
  },
  "juniSystemHighMemUtil": {
    "name": "juniSystemHighMemUtil",
    "oid": "1.3.6.1.4.1.4874.2.2.2.0.1",
    "class": "notificationtype",
    "objects": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemMemCapacity"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemMemUtilPct"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemAbatedMemUtilThreshold"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemHighMemUtilThreshold"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemMemKBytesCapacity"
      }
    ],
    "status": "current",
    "description": "Report system memory utilization has met the conditions of juniSystemHighMemUtilThreshold. If the memory capacity is greater than 2147483647, a -1 value is returned in juniSystemMemCapacity, and the actual memory capacity in units of 1024 bytes is returned in juniSystemMemKBytesCapacity."
  },
  "juniSystemAbatedMemUtil": {
    "name": "juniSystemAbatedMemUtil",
    "oid": "1.3.6.1.4.1.4874.2.2.2.0.2",
    "class": "notificationtype",
    "objects": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemMemCapacity"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemMemUtilPct"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemAbatedMemUtilThreshold"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemHighMemUtilThreshold"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemMemKBytesCapacity"
      }
    ],
    "status": "current",
    "description": "Reports system memory utilization has met the conditions of juniSystemAbatedMemUtilThreshold. If the memory capacity is greater than 2147483647, a -1 value is returned in juniSystemMemCapacity, and the actual memory capacity in units of 1024 bytes is returned in juniSystemMemKBytesCapacity."
  },
  "juniSystemModuleOperStatusChange": {
    "name": "juniSystemModuleOperStatusChange",
    "oid": "1.3.6.1.4.1.4874.2.2.2.0.3",
    "class": "notificationtype",
    "objects": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleCurrentType"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleAdminStatus"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleOperStatus"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleDisableReason"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleDescr"
      }
    ],
    "status": "current",
    "description": "Reports a status change for a module. This trap is generated on a transition into a stable state (online or disabled) or on a transition out of online. If redundancy is supported for the module (juniSystemModuleRedundancySupported is true(1)), then the juniSystemModuleSpareServer and juniSystemModuleAssociatedSlot objects are also included in the notification."
  },
  "juniSystemPowerStatusChange": {
    "name": "juniSystemPowerStatusChange",
    "oid": "1.3.6.1.4.1.4874.2.2.2.0.4",
    "class": "notificationtype",
    "objects": [
      {
        "module": "ENTITY-MIB",
        "object": "entPhysicalDescr"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemPowerStatus"
      }
    ],
    "status": "current",
    "description": "Reports a change in the status of a power element."
  },
  "juniSystemFanStatusChange": {
    "name": "juniSystemFanStatusChange",
    "oid": "1.3.6.1.4.1.4874.2.2.2.0.5",
    "class": "notificationtype",
    "objects": [
      {
        "module": "ENTITY-MIB",
        "object": "entPhysicalDescr"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemFanStatus"
      }
    ],
    "status": "current",
    "description": "Reports a transition between the three states of the fan subsystem. When the fan subsystem transitions to the failed state the Thermal Protection hold off time begins."
  },
  "juniSystemTempStatusChange": {
    "name": "juniSystemTempStatusChange",
    "oid": "1.3.6.1.4.1.4874.2.2.2.0.6",
    "class": "notificationtype",
    "objects": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemTempStatus"
      }
    ],
    "status": "current",
    "description": "Reports a change in the temperature status. When the status transitions to the tooHigh state the system enters Thermal Protection mode."
  },
  "juniSystemTempProtectionStatusChange": {
    "name": "juniSystemTempProtectionStatusChange",
    "oid": "1.3.6.1.4.1.4874.2.2.2.0.7",
    "class": "notificationtype",
    "objects": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemTempProtectionStatus"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemTempProtectionHoldOffTimeRemaining"
      }
    ],
    "status": "current",
    "description": "Notification about changes in the state of Thermal Protection. This notification is sent when the tempProtectionStatus changes. It is also sent when the holdOffTimeRemaining is 50% of the holdOffTime."
  },
  "juniSystemReloadCommand": {
    "name": "juniSystemReloadCommand",
    "oid": "1.3.6.1.4.1.4874.2.2.2.0.8",
    "class": "notificationtype",
    "status": "current",
    "description": "Notification indicating that a slot or the entire system is about to restart due to a system console reload command. If the reload is only on an individual slot then the following object is included in the notification: juniSystemReloadSlotNumber "
  },
  "juniSystemUtilizationThreshold": {
    "name": "juniSystemUtilizationThreshold",
    "oid": "1.3.6.1.4.1.4874.2.2.2.0.9",
    "class": "notificationtype",
    "objects": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemUtilizationThresholdDirection"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemUtilizationMaxCapacity"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemUtilizationCurrentValue"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemUtilizationThresholdRising"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemUtilizationThresholdFalling"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemUtilizationHoldDownTime"
      }
    ],
    "status": "current",
    "description": "Notification indicating that a system resource's utilization has met the conditions of juniSystemUtilizationThresholdDirection. See the DESCRIPTIONs for the juniSystemUtilizationTable elements for details on what conditions trigger a resource utilization notification."
  },
  "juniSystemIssuStateChange": {
    "name": "juniSystemIssuStateChange",
    "oid": "1.3.6.1.4.1.4874.2.2.2.0.10",
    "class": "notificationtype",
    "objects": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemIssuState"
      }
    ],
    "status": "current",
    "description": "Notification about changes in the status, in case of ISSU upgrade. This notification is sent when the juniSystemIssuState changes. The trap parameter will indicate the current value of the juniSystemIssuState. This notification is supported on the second generation E-series platform family (E320 & E120) from 9.0 release onwards. This object is also supported on ERX-1440 in JUNOSe 9.2 and subsequent system releases."
  },
  "juniSystemPortSfpTxMaxPowerThreshold": {
    "name": "juniSystemPortSfpTxMaxPowerThreshold",
    "oid": "1.3.6.1.4.1.4874.2.2.2.0.11",
    "class": "notificationtype",
    "objects": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemPortSfpPowerThresholdIfIndex"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemPortSfpPowerThresholdValue"
      }
    ],
    "status": "current",
    "description": "Notification says that trap raised/cleared is with respect to link sfp's tx-max power threshold"
  },
  "juniSystemPortSfpTxMinPowerThreshold": {
    "name": "juniSystemPortSfpTxMinPowerThreshold",
    "oid": "1.3.6.1.4.1.4874.2.2.2.0.12",
    "class": "notificationtype",
    "objects": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemPortSfpPowerThresholdIfIndex"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemPortSfpPowerThresholdValue"
      }
    ],
    "status": "current",
    "description": "Notification says that trap raised/cleared is with respect to link sfp's tx-min power threshold"
  },
  "juniSystemPortSfpRxMaxPowerThreshold": {
    "name": "juniSystemPortSfpRxMaxPowerThreshold",
    "oid": "1.3.6.1.4.1.4874.2.2.2.0.13",
    "class": "notificationtype",
    "objects": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemPortSfpPowerThresholdIfIndex"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemPortSfpPowerThresholdValue"
      }
    ],
    "status": "current",
    "description": "Notification says that trap raised/cleared is with respect to link sfp's rx-max power threshold"
  },
  "juniSystemPortSfpRxMinPowerThreshold": {
    "name": "juniSystemPortSfpRxMinPowerThreshold",
    "oid": "1.3.6.1.4.1.4874.2.2.2.0.14",
    "class": "notificationtype",
    "objects": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemPortSfpPowerThresholdIfIndex"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemPortSfpPowerThresholdValue"
      }
    ],
    "status": "current",
    "description": "Notification says that trap raised/cleared is with respect to link sfp's rx-min power threshold"
  },
  "juniSystemCompliances": {
    "name": "juniSystemCompliances",
    "oid": "1.3.6.1.4.1.4874.2.2.2.2.1",
    "class": "objectidentity"
  },
  "juniSystemGroups": {
    "name": "juniSystemGroups",
    "oid": "1.3.6.1.4.1.4874.2.2.2.2.2",
    "class": "objectidentity"
  },
  "juniSystemCompliance": {
    "name": "juniSystemCompliance",
    "oid": "1.3.6.1.4.1.4874.2.2.2.2.1.1",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "juniSystemGeneralGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemSubsystemGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemModuleGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemPortGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemTimingGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemFabricGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemNvsGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemPowerGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemTemperatureGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemNotificationObjectsGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemNotificationGroup",
        "module": "Juniper-System-MIB"
      }
    ],
    "status": "obsolete",
    "description": "Obsolete compliance statement for entities that implement the Juniper E-series System MIB. This statement became obsolete when system resource utilization support was added."
  },
  "juniSystemCompliance2": {
    "name": "juniSystemCompliance2",
    "oid": "1.3.6.1.4.1.4874.2.2.2.2.1.2",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "juniSystemGeneralGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemSubsystemGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemModuleGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemPortGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemTimingGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemFabricGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemNvsGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemPowerGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemTemperatureGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemUtilizationGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemNotificationObjectsGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemNotificationGroup2",
        "module": "Juniper-System-MIB"
      }
    ],
    "status": "obsolete",
    "description": "Obsolete compliance statement for entities that implement the Juniper E-series System MIB. This statement became obsolete when the system resource utilization trap enabled and the KByte memory capacilty objects were added."
  },
  "juniSystemCompliance3": {
    "name": "juniSystemCompliance3",
    "oid": "1.3.6.1.4.1.4874.2.2.2.2.1.3",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "juniSystemGeneralGroup2",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemSubsystemGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemModuleGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemPortGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemTimingGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemFabricGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemNvsGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemPowerGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemTemperatureGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemUtilizationGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemNotificationObjectsGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemNotificationGroup2",
        "module": "Juniper-System-MIB"
      }
    ],
    "status": "obsolete",
    "description": "Obsolete compliance statement for entities that implement the Juniper E-series System MIB. This statement became obsolete when the module level span object was added."
  },
  "juniSystemCompliance4": {
    "name": "juniSystemCompliance4",
    "oid": "1.3.6.1.4.1.4874.2.2.2.2.1.4",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "juniSystemGeneralGroup2",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemSubsystemGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemModuleGroup2",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemPortGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemTimingGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemFabricGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemNvsGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemPowerGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemTemperatureGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemUtilizationGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemNotificationObjectsGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemNotificationGroup2",
        "module": "Juniper-System-MIB"
      }
    ],
    "status": "obsolete",
    "description": "Obsolete compliance statement for entities that implement the Juniper E-series System MIB."
  },
  "juniSystemCompliance5": {
    "name": "juniSystemCompliance5",
    "oid": "1.3.6.1.4.1.4874.2.2.2.2.1.5",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "juniSystemGeneralGroup2",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemSubsystemGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemModuleGroup2",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemPortGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemTimingGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemFabricGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemNvsGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemPowerGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemTemperatureGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemUtilizationGroup2",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemNotificationObjectsGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemNotificationGroup2",
        "module": "Juniper-System-MIB"
      }
    ],
    "status": "obsolete",
    "description": "Obsolete compliance statement for entities that implement the Juniper E-series System MIB."
  },
  "juniSystemCompliance6": {
    "name": "juniSystemCompliance6",
    "oid": "1.3.6.1.4.1.4874.2.2.2.2.1.6",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "juniSystemGeneralGroup2",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemSubsystemGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemModuleGroup3",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemPortGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemTimingGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemFabricGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemNvsGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemPowerGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemTemperatureGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemUtilizationGroup2",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemNotificationObjectsGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemNotificationGroup2",
        "module": "Juniper-System-MIB"
      }
    ],
    "status": "obsolete",
    "description": "The compliance statement for entities that implement the Juniper E-series System MIB."
  },
  "juniSystemCompliance7": {
    "name": "juniSystemCompliance7",
    "oid": "1.3.6.1.4.1.4874.2.2.2.2.1.7",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "juniSystemGeneralGroup2",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemSubsystemGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemModuleGroup3",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemPortGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemTimingGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemFabricGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemNvsGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemPowerGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemTemperatureGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemUtilizationGroup2",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemNotificationObjectsGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemIssuGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemNotificationGroup3",
        "module": "Juniper-System-MIB"
      }
    ],
    "status": "obsolete",
    "description": "The compliance statement for entities that implement the Juniper E-series System MIB."
  },
  "juniSystemCompliance8": {
    "name": "juniSystemCompliance8",
    "oid": "1.3.6.1.4.1.4874.2.2.2.2.1.8",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "juniSystemGeneralGroup2",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemSubsystemGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemModuleGroup3",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemPortGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemTimingGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemFabricGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemNvsGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemPowerGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemTemperatureGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemUtilizationGroup2",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemNotificationObjectsGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemIssuGroup",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemNotificationGroup3",
        "module": "Juniper-System-MIB"
      },
      {
        "object": "juniSystemNotificationGroup4",
        "module": "Juniper-System-MIB"
      }
    ],
    "status": "current",
    "description": "The compliance statement for entities that implement the Juniper E-series System MIB."
  },
  "juniSystemGeneralGroup": {
    "name": "juniSystemGeneralGroup",
    "oid": "1.3.6.1.4.1.4874.2.2.2.2.2.1",
    "class": "objectgroup",
    "objects": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemSwVersion"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemSwBuildDate"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemMemUtilPct"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemMemCapacity"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemHighMemUtilThreshold"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemAbatedMemUtilThreshold"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemMemUtilTrapEnable"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemBootConfigControl"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemBootBackupConfigControl"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemBootForceBackupControl"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemBootAutoRevertControl"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemBootAutoRevertCountTolerance"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemBootAutoRevertTimeTolerance"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemBootReleaseFile"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemBootConfigFile"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemBootBackupReleaseFile"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemBootBackupConfigFile"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemRedundancyRevertControl"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemRedundancyRevertTimeOfDay"
      }
    ],
    "status": "obsolete",
    "description": "Obsolete collection of management objects providing system-wide software status and control information in a Juniper E-series product. This group became obsolete when the system resource utilization threshold trap enable/disable and the KByte memory capacilty objects were added."
  },
  "juniSystemSubsystemGroup": {
    "name": "juniSystemSubsystemGroup",
    "oid": "1.3.6.1.4.1.4874.2.2.2.2.2.2",
    "class": "objectgroup",
    "objects": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemSubsystemName"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemSubsystemBootReleaseFile"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemSubsystemBootBackupReleaseFile"
      }
    ],
    "status": "current",
    "description": "A collection of management objects providing subsystem software control information in a Juniper E-series product."
  },
  "juniSystemModuleGroup": {
    "name": "juniSystemModuleGroup",
    "oid": "1.3.6.1.4.1.4874.2.2.2.2.2.3",
    "class": "objectgroup",
    "objects": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemMaxSlotNumber"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemMaxModulesPerSlot"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemSlotStatus"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemSlotType"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleOperStatus"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleDisableReason"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleLastChange"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleCurrentType"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleExpectedType"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleDescr"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleSlotSpan"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModulePortCount"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleSerialNumber"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleAssemblyPartNumber"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleAssemblyRev"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModulePhysicalIndex"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleSoftwareSupport"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleRedundancySupport"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleSoftwareVersion"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleCpuUtilPct"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleMemUtilPct"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleAdminStatus"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleControl"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleBootReleaseFile"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleBootBackupReleaseFile"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleRedundancyGroupId"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleRedundancySpare"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleRedundancyAssociatedSlot"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleRedundancyLockout"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleRedundancyRevertControl"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleRedundancyRevertTime"
      }
    ],
    "status": "obsolete",
    "description": "Obsolete collection of management objects that provide system module information in a Juniper E-series product. This group became obsolete when the module level span object was added."
  },
  "juniSystemPortGroup": {
    "name": "juniSystemPortGroup",
    "oid": "1.3.6.1.4.1.4874.2.2.2.2.2.4",
    "class": "objectgroup",
    "objects": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemPortPhysicalIndex"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemPortIfIndex"
      }
    ],
    "status": "current",
    "description": "A collection of management objects providing physical I/O port information in a Juniper E-series product."
  },
  "juniSystemTimingGroup": {
    "name": "juniSystemTimingGroup",
    "oid": "1.3.6.1.4.1.4874.2.2.2.2.2.5",
    "class": "objectgroup",
    "objects": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemAdminTimingSource"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemOperTimingSource"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemTimingAutoUpgrade"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemTimingSourceType"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemTimingSourceIfIndex"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemTimingSourceLine"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemTimingWorkingStatus"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemTimingProtectedStatus"
      }
    ],
    "status": "current",
    "description": "A collection of management objects providing system timing source information in a Juniper E-series product."
  },
  "juniSystemFabricGroup": {
    "name": "juniSystemFabricGroup",
    "oid": "1.3.6.1.4.1.4874.2.2.2.2.2.6",
    "class": "objectgroup",
    "objects": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemFabricSpeed"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemFabricRev"
      }
    ],
    "status": "current",
    "description": "A collection of management objects providing system fabric information in a Juniper E-series product."
  },
  "juniSystemNvsGroup": {
    "name": "juniSystemNvsGroup",
    "oid": "1.3.6.1.4.1.4874.2.2.2.2.2.7",
    "class": "objectgroup",
    "objects": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemNvsCount"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemNvsPhysicalIndex"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemNvsStatus"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemNvsCapacity"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemNvsUtilPct"
      }
    ],
    "status": "current",
    "description": "A collection of management objects providing system non-volatile storage (NVS) information in a Juniper E-series product."
  },
  "juniSystemPowerGroup": {
    "name": "juniSystemPowerGroup",
    "oid": "1.3.6.1.4.1.4874.2.2.2.2.2.8",
    "class": "objectgroup",
    "objects": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemPowerCount"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemPowerPhysicalIndex"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemPowerStatus"
      }
    ],
    "status": "current",
    "description": "A collection of management objects providing system power element information in a Juniper E-series product."
  },
  "juniSystemTemperatureGroup": {
    "name": "juniSystemTemperatureGroup",
    "oid": "1.3.6.1.4.1.4874.2.2.2.2.2.9",
    "class": "objectgroup",
    "objects": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemFanCount"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemFanPhysicalIndex"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemFanStatus"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemTempCount"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemTempStatus"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemTempValue"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemTempPhysicalIndex"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemTempProtectionStatus"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemTempProtectionHoldOffTime"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemTempProtectionHoldOffTimeRemaining"
      }
    ],
    "status": "current",
    "description": "A collection of management objects providing system temperature control information in a Juniper E-series product."
  },
  "juniSystemNotificationObjectsGroup": {
    "name": "juniSystemNotificationObjectsGroup",
    "oid": "1.3.6.1.4.1.4874.2.2.2.2.2.10",
    "class": "objectgroup",
    "objects": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemReloadSlotNumber"
      }
    ],
    "status": "current",
    "description": "A collection of management objects providing system information for notification in a Juniper E-series product."
  },
  "juniSystemNotificationGroup": {
    "name": "juniSystemNotificationGroup",
    "oid": "1.3.6.1.4.1.4874.2.2.2.2.2.11",
    "class": "notificationgroup",
    "objects": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemHighMemUtil"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemAbatedMemUtil"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleOperStatusChange"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemPowerStatusChange"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemFanStatusChange"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemTempStatusChange"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemTempProtectionStatusChange"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemReloadCommand"
      }
    ],
    "status": "obsolete",
    "description": "Obsolete collection of notifications for system events in a Juniper E-series product. This group became obsolete when the system resource utilization notification was added."
  },
  "juniSystemUtilizationGroup": {
    "name": "juniSystemUtilizationGroup",
    "oid": "1.3.6.1.4.1.4874.2.2.2.2.2.12",
    "class": "objectgroup",
    "objects": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemUtilizationMaxCapacity"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemUtilizationCurrentValue"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemUtilizationThresholdRising"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemUtilizationThresholdFalling"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemUtilizationHoldDownTime"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemUtilizationThresholdDirection"
      }
    ],
    "status": "obsolete",
    "description": "Obsolete collection of management objects providing system resource utilization information and notification control for a Juniper E-series product."
  },
  "juniSystemNotificationGroup2": {
    "name": "juniSystemNotificationGroup2",
    "oid": "1.3.6.1.4.1.4874.2.2.2.2.2.13",
    "class": "notificationgroup",
    "objects": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemHighMemUtil"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemAbatedMemUtil"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleOperStatusChange"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemPowerStatusChange"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemFanStatusChange"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemTempStatusChange"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemTempProtectionStatusChange"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemReloadCommand"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemUtilizationThreshold"
      }
    ],
    "status": "obsolete",
    "description": "A collection of notifications for system events in a Juniper E-series product."
  },
  "juniSystemGeneralGroup2": {
    "name": "juniSystemGeneralGroup2",
    "oid": "1.3.6.1.4.1.4874.2.2.2.2.2.14",
    "class": "objectgroup",
    "objects": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemSwVersion"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemSwBuildDate"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemMemUtilPct"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemMemCapacity"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemMemKBytesCapacity"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemHighMemUtilThreshold"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemAbatedMemUtilThreshold"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemMemUtilTrapEnable"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemUtilizationTrapEnable"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemBootConfigControl"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemBootBackupConfigControl"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemBootForceBackupControl"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemBootAutoRevertControl"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemBootAutoRevertCountTolerance"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemBootAutoRevertTimeTolerance"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemBootReleaseFile"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemBootConfigFile"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemBootBackupReleaseFile"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemBootBackupConfigFile"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemRedundancyRevertControl"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemRedundancyRevertTimeOfDay"
      }
    ],
    "status": "current",
    "description": "A collection of management objects providing system-wide software status and control information in a Juniper E-series product."
  },
  "juniSystemModuleGroup2": {
    "name": "juniSystemModuleGroup2",
    "oid": "1.3.6.1.4.1.4874.2.2.2.2.2.15",
    "class": "objectgroup",
    "objects": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemMaxSlotNumber"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemMaxModulesPerSlot"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemSlotStatus"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemSlotType"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleOperStatus"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleDisableReason"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleLastChange"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleCurrentType"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleExpectedType"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleDescr"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleSlotSpan"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModulePortCount"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleSerialNumber"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleAssemblyPartNumber"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleAssemblyRev"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModulePhysicalIndex"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleSoftwareSupport"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleRedundancySupport"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleLevelSpan"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleSoftwareVersion"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleCpuUtilPct"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleMemUtilPct"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleAdminStatus"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleControl"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleBootReleaseFile"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleBootBackupReleaseFile"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleRedundancyGroupId"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleRedundancySpare"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleRedundancyAssociatedSlot"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleRedundancyLockout"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleRedundancyRevertControl"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleRedundancyRevertTime"
      }
    ],
    "status": "obsolete",
    "description": "A collection of management objects that provide system module information in a Juniper E-series product."
  },
  "juniSystemUtilizationGroup2": {
    "name": "juniSystemUtilizationGroup2",
    "oid": "1.3.6.1.4.1.4874.2.2.2.2.2.16",
    "class": "objectgroup",
    "objects": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemUtilizationMaxCapacity"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemUtilizationCurrentValue"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemUtilizationThresholdRising"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemUtilizationThresholdFalling"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemUtilizationHoldDownTime"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemUtilizationThresholdDirection"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemCpuUtilizationTaskName"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemCpuUtilizationInvoked"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemCpuUtilizationInvokationPerSec"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemCpuUtilizationTotalRunningTime"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemCpuUtilizationPercentageRunningTime"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemCpuUtilizationAverageTimePerInvokation"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemCpuUtilizationFiveSecondUtilization"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemCpuUtilizationOneMinuteUtilization"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemCpuUtilizationFiveMinuteUtilization"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemCpuUtilizationNumberOfInstances"
      }
    ],
    "status": "current",
    "description": "A collection of management objects providing system resource utilization information and notification control for a Juniper E-series product."
  },
  "juniSystemModuleGroup3": {
    "name": "juniSystemModuleGroup3",
    "oid": "1.3.6.1.4.1.4874.2.2.2.2.2.17",
    "class": "objectgroup",
    "objects": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemMaxSlotNumber"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemMaxModulesPerSlot"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemSlotStatus"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemSlotType"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleOperStatus"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleDisableReason"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleLastChange"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleCurrentType"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleExpectedType"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleDescr"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleSlotSpan"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModulePortCount"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleSerialNumber"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleAssemblyPartNumber"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleAssemblyRev"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModulePhysicalIndex"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleSoftwareSupport"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleRedundancySupport"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleLevelSpan"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleSoftwareVersion"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleCpuUtilPct"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleMemUtilPct"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleAdminStatus"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleControl"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleBootReleaseFile"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleBootBackupReleaseFile"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleCpuFiveSecUtilPct"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleCpuOneMinAvgPct"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleCpuFiveMinAvgPct"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleRedundancyGroupId"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleRedundancySpare"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleRedundancyAssociatedSlot"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleRedundancyLockout"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleRedundancyRevertControl"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleRedundancyRevertTime"
      }
    ],
    "status": "current",
    "description": "A collection of management objects that provide system module information in a Juniper E-series product."
  },
  "juniSystemIssuGroup": {
    "name": "juniSystemIssuGroup",
    "oid": "1.3.6.1.4.1.4874.2.2.2.2.2.18",
    "class": "objectgroup",
    "objects": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemIssuState"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemIssuArmedReleaseFile"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemIssuRunningReleaseFile"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemIssuStatus"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemIssuCriteriaDescription"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemIssuCriteriaStatus"
      }
    ],
    "status": "current",
    "description": "A collection of management objects that provide ISSU related information in a Juniper E-series product."
  },
  "juniSystemNotificationGroup3": {
    "name": "juniSystemNotificationGroup3",
    "oid": "1.3.6.1.4.1.4874.2.2.2.2.2.19",
    "class": "notificationgroup",
    "objects": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemHighMemUtil"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemAbatedMemUtil"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleOperStatusChange"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemPowerStatusChange"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemFanStatusChange"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemTempStatusChange"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemTempProtectionStatusChange"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemReloadCommand"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemUtilizationThreshold"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemIssuStateChange"
      }
    ],
    "status": "obsolete",
    "description": "A collection of notifications for system events in a Juniper E-series product."
  },
  "juniSystemNotificationGroup4": {
    "name": "juniSystemNotificationGroup4",
    "oid": "1.3.6.1.4.1.4874.2.2.2.2.2.20",
    "class": "notificationgroup",
    "objects": [
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemHighMemUtil"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemAbatedMemUtil"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemModuleOperStatusChange"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemPowerStatusChange"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemFanStatusChange"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemTempStatusChange"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemTempProtectionStatusChange"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemReloadCommand"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemUtilizationThreshold"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemIssuStateChange"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemPortSfpTxMaxPowerThreshold"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemPortSfpTxMinPowerThreshold"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemPortSfpRxMaxPowerThreshold"
      },
      {
        "module": "Juniper-System-MIB",
        "object": "juniSystemPortSfpRxMinPowerThreshold"
      }
    ],
    "status": "current",
    "description": "A collection of notifications for system events in a Juniper E-series product."
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/Juniper-System-MIB",
      "Produced by pysmi-0.3.4 at Fri May 24 20:17:43 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "Juniper-System-MIB"
  }
}