{
  "imports": {
    "class": "imports",
    "Juniper-Agents": [
      "juniAgents"
    ],
    "SNMPv2-CONF": [
      "NOTIFICATION-GROUP",
      "MODULE-COMPLIANCE",
      "AGENT-CAPABILITIES"
    ],
    "SNMPv2-SMI": [
      "TimeTicks",
      "Counter32",
      "MibIdentifier",
      "Gauge32",
      "NOTIFICATION-TYPE",
      "Counter64",
      "OBJECT-TYPE",
      "IpAddress",
      "Bits",
      "iso",
      "OBJECT-IDENTITY",
      "Unsigned32",
      "MODULE-IDENTITY",
      "Integer32"
    ],
    "SNMPv2-TC": [
      "DisplayString",
      "TEXTUAL-CONVENTION"
    ]
  },
  "juniBgpAgent": {
    "name": "juniBgpAgent",
    "oid": "1.3.6.1.4.1.4874.5.2.4",
    "class": "moduleidentity",
    "revisions": [
      {
        "revision": "2007-05-11 05:17",
        "description": "Juniper-BGP-MIB: Added support for BGP conditional advertisement"
      },
      {
        "revision": "2003-12-18 15:28",
        "description": "Juniper-BGP-MIB: Added support for route-map option in default-information originate and neighbor ... default-originate. Added support for IP profiles and IP service-profiles to be used by BGP when creating IP dynamic interfaces over MPLS tunnels. BGP4-V2-MIB-JUNIPER: Implemented an experimental version of the Internet draft BGP4 MIB extentions (version 2) based on draft-ietf-idr-bgp4-mibv2-03.txt."
      },
      {
        "revision": "2003-12-18 14:27",
        "description": "Juniper-BGP-MIB: Added support for send-label. Added support for carrier's carrier feature for BGP/MPLS VPN. Added support for reconvergence after loss of MPLS next-hop."
      },
      {
        "revision": "2003-07-09 21:35",
        "description": "Juniper-BGP-MIB: Added support for maximum-paths eiBGP. Added support for bgpIpV6. Replaced VRF distance objects with address family distance objects. Changed default values for VRF maximum paths. Obsoleted storage heap size objects. Added support for leaked flag attribute of the BGP route."
      },
      {
        "revision": "2002-11-06 16:33",
        "description": "Juniper-BGP-MIB: Replaced Unisphere names with Juniper names. Added support for neighbor site-of-origin and peer leniency."
      },
      {
        "revision": "2002-09-05 12:56",
        "description": "Juniper-BGP-MIB: Added support for four-octet AS-numbers, dynamic capability negotiation, iBGP multipath, confederation peers filter-list, and peer and peer-group address family maximum prefix strict flags. Replaced Route MPLS label object with separate in and out objects. Deprecated support for two-octet AS-numbers. Obsoleted rsBgpEqualCostLimit."
      },
      {
        "revision": "2002-09-04 17:56",
        "description": "BGP4-MIB: Added full support for RFC1657 and draft-ietf-idr-bgp4-mib-07. Juniper-BGP-MIB: Added support for BGP internal redistribute. Obsoleted juniBgpStorageInitialHistoryRoutePoolSize and juniBgpStorageMaxHistoryRoutePoolSize. Added the ability to unconfigure BGP attributes from the MIB."
      },
      {
        "revision": "2002-03-01 17:51",
        "description": "Juniper-BGP-MIB: Added support for adding unicast BGP routes into a multicast view."
      },
      {
        "revision": "2002-01-23 13:16",
        "description": "Juniper-BGP-MIB: Added support for peer and peer-group local-as."
      },
      {
        "revision": "2001-12-04 16:09",
        "description": "Juniper-BGP-MIB: Replaced the BGP route congiguration group with new tables containing the original route destination as an additional index."
      },
      {
        "revision": "2001-12-03 18:48",
        "description": "The initial release of this management information module. Juniper-BGP-MIB: Added support for BGP default IPv4 unicast."
      }
    ],
    "lastupdated": "200705110517Z",
    "organization": "Juniper Networks, Inc.",
    "contactinfo": " Juniper Networks, Inc. Postal: 10 Technology Park Drive Westford, MA 01886-3146 USA Tel: +1 978 589 5800 E-mail: mib@Juniper.net",
    "description": "The agent capabilities definitions for the BGP component of the SNMP agent in the Juniper E-series family of products."
  },
  "juniBgpAgentV1": {
    "name": "juniBgpAgentV1",
    "oid": "1.3.6.1.4.1.4874.5.2.4.1",
    "class": "agentcapabilities",
    "productrelease": "Version 1 of the BGP component of the JUNOSe SNMP agent.  This version\n        of the BGP component was supported in JUNOSe 3.0 and 3.1 system\n        releases.",
    "status": "obsolete",
    "description": "The MIB supported by the SNMP agent for the BGP application in JUNOSe. These capabilities became obsolete when a new object was added to the general configuration group."
  },
  "juniBgpAgentV2": {
    "name": "juniBgpAgentV2",
    "oid": "1.3.6.1.4.1.4874.5.2.4.2",
    "class": "agentcapabilities",
    "productrelease": "Version 2 of the BGP component of the JUNOSe SNMP agent.  This version\n        of the BGP component was supported in JUNOSe 3.2 system releases.",
    "status": "obsolete",
    "description": "The MIB supported by the SNMP agent for the BGP application in JUNOSe. These capabilities became obsolete when the BGP route congiguration group was replaced with new tables containing the original route destination as an additional index."
  },
  "juniBgpAgentV3": {
    "name": "juniBgpAgentV3",
    "oid": "1.3.6.1.4.1.4874.5.2.4.3",
    "class": "agentcapabilities",
    "productrelease": "Version 3 of the BGP component of the JUNOSe SNMP agent.  This version\n        of the BGP component was supported in JUNOSe 3.3 system release.",
    "status": "obsolete",
    "description": "The MIB supported by the SNMP agent for the BGP application in JUNOSe. These capabilities became obsolete when the peer and peer-group local-as support was added."
  },
  "juniBgpAgentV4": {
    "name": "juniBgpAgentV4",
    "oid": "1.3.6.1.4.1.4874.5.2.4.4",
    "class": "agentcapabilities",
    "productrelease": "Version 4 of the BGP component of the JUNOSe SNMP agent.  This version\n        of the BGP component was supported in JUNOSe 3.4 system releases.",
    "status": "obsolete",
    "description": "The MIB supported by the SNMP agent for the BGP application in JUNOSe. These capabilities became obsolete when support was added for adding unicast BGP routes into a multicast view."
  },
  "juniBgpAgentV5": {
    "name": "juniBgpAgentV5",
    "oid": "1.3.6.1.4.1.4874.5.2.4.5",
    "class": "agentcapabilities",
    "productrelease": "Version 5 of the BGP component of the JUNOSe SNMP agent.  This version\n        of the BGP component was supported in JUNOSe 3.5 and subseguent 3.x\n        system releases.",
    "status": "obsolete",
    "description": "The MIB supported by the SNMP agent for the BGP application in JUNOSe. These capabilities became obsolete when support was added for the standard BGP4-MIB and for BGP internal redistribute."
  },
  "juniBgpAgentV6": {
    "name": "juniBgpAgentV6",
    "oid": "1.3.6.1.4.1.4874.5.2.4.6",
    "class": "agentcapabilities",
    "productrelease": "Version 6 of the BGP component of the JUNOSe SNMP agent.  This version\n        of the BGP component was supported in JUNOSe 4.0 system releases.",
    "status": "obsolete",
    "description": "The MIBs supported by the SNMP agent for the BGP application in JUNOSe. These capabilities became obsolete when support was added to the Juniper-BGP-MIB for four-octet AS-numbers, dynamic capability negotiation, iBGP multipath and confederation peers filter-list."
  },
  "juniBgpAgentV7": {
    "name": "juniBgpAgentV7",
    "oid": "1.3.6.1.4.1.4874.5.2.4.7",
    "class": "agentcapabilities",
    "productrelease": "Version 7 of the BGP component of the JUNOSe SNMP agent.  This version\n        of the BGP component was supported in JUNOSe 4.1 system releases.",
    "status": "obsolete",
    "description": "The MIBs supported by the SNMP agent for the BGP application in JUNOSe. These capabilities became obsolete when support was added to the Juniper-BGP-MIB for neighbor site-of-origin and peer leniency."
  },
  "juniBgpAgentV8": {
    "name": "juniBgpAgentV8",
    "oid": "1.3.6.1.4.1.4874.5.2.4.8",
    "class": "agentcapabilities",
    "productrelease": "Version 8 of the BGP component of the JUNOSe SNMP agent.  This version\n        of the BGP component was supported in JUNOSe 5.0 system releases.",
    "status": "obsolete",
    "description": "The MIBs supported by the SNMP agent for the BGP application in JUNOSe. These capabilities became obsolete when support was added to the Juniper-BGP-MIB for several new features."
  },
  "juniBgpAgentV9": {
    "name": "juniBgpAgentV9",
    "oid": "1.3.6.1.4.1.4874.5.2.4.9",
    "class": "agentcapabilities",
    "productrelease": "Version 9 of the BGP component of the JUNOSe SNMP agent.  This version\n        of the BGP component was supported in JUNOSe 5.1 system releases.",
    "status": "obsolete",
    "description": "The MIBs supported by the SNMP agent for the BGP application in JUNOSe. These capabilities became obsolete when support was added to the Juniper-BGP-MIB for send-label, carrier's carrier feature for BGP/MPLS VPN and reconvergence after loss of MPLS next-hop."
  },
  "juniBgpAgentV10": {
    "name": "juniBgpAgentV10",
    "oid": "1.3.6.1.4.1.4874.5.2.4.10",
    "class": "agentcapabilities",
    "productrelease": "Version 10 of the BGP component of the JUNOSe SNMP agent.  This version\n        of the BGP component was supported in JUNOSe 5.2 system releases.",
    "status": "obsolete",
    "description": "The MIBs supported by the SNMP agent for the BGP application in JUNOSe. These capabilities became obsolete when support was added to the Juniper-BGP-MIB for route-map option in default-information originate and neighbor ... default-originate, and when support was added for the new dynamic capability negotiation draft."
  },
  "juniBgpAgentV11": {
    "name": "juniBgpAgentV11",
    "oid": "1.3.6.1.4.1.4874.5.2.4.11",
    "class": "agentcapabilities",
    "productrelease": "Version 11 of the BGP component of the JUNOSe SNMP agent.  This version\n        of the BGP component is supported in JUNOSe 5.3 and subsequent system\n        releases.",
    "status": "obsolete",
    "description": "The MIB supported by the SNMP agent for the BGP application in JUNOSe. These capabilities became obsolete when support was added to the Juniper-BGP-MIB for BGP conditional advertisement."
  },
  "juniBgpAgentV12": {
    "name": "juniBgpAgentV12",
    "oid": "1.3.6.1.4.1.4874.5.2.4.12",
    "class": "agentcapabilities",
    "productrelease": "Version 12 of the BGP component of the JUNOSe SNMP agent.  This version\n        of the BGP component is supported in JUNOSe 9.0 and subsequent system\n        releases.",
    "status": "current",
    "description": "The MIB supported by the SNMP agent for the BGP application in JUNOSe."
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/Juniper-BGP-CONF",
      "Produced by pysmi-0.3.4 at Fri May 24 20:14:48 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "Juniper-BGP-CONF"
  }
}