{
  "imports": {
    "class": "imports",
    "Juniper-Agents": [
      "juniAgents"
    ],
    "SNMPv2-CONF": [
      "AGENT-CAPABILITIES",
      "NOTIFICATION-GROUP",
      "MODULE-COMPLIANCE"
    ],
    "SNMPv2-SMI": [
      "OBJECT-IDENTITY",
      "MibIdentifier",
      "iso",
      "Gauge32",
      "MODULE-IDENTITY",
      "Counter64",
      "TimeTicks",
      "Integer32",
      "IpAddress",
      "Unsigned32",
      "OBJECT-TYPE",
      "NOTIFICATION-TYPE",
      "Counter32",
      "Bits"
    ],
    "SNMPv2-TC": [
      "DisplayString",
      "TEXTUAL-CONVENTION"
    ]
  },
  "juniRadiusClientAgent": {
    "name": "juniRadiusClientAgent",
    "oid": "1.3.6.1.4.1.4874.5.2.35",
    "class": "moduleidentity",
    "revisions": [
      {
        "revision": "2009-02-10 15:20",
        "description": "Added rsRadiusClientIncludeIpv6AccountingInAcctStop. Added rsRadiusClientIncludeDelegatedIpv6PrefixInAcctStart, rsRadiusClientIncludeDelegatedIpv6PrefixInAcctStop, rsRadiusClientIncludeFramedIpv6PoolInAcctStart, rsRadiusClientIncludeFramedIpv6PoolInAcctStop, rsRadiusClientIncludeFramedIpv6RouteInAcctStart, rsRadiusClientIncludeFramedIpv6RouteInAcctStop, rsRadiusClientIncludeIpv6LocalInterfaceInAcctStart, rsRadiusClientIncludeIpv6LocalInterfaceInAcctStop, rsRadiusClientIncludeIpv6NdRaPrefixInAcctStart, rsRadiusClientIncludeIpv6NdRaPrefixInAcctStop, rsRadiusClientIncludeIpv6PrimaryDnsInAcctStart, rsRadiusClientIncludeIpv6PrimaryDnsInAcctStop, rsRadiusClientIncludeIpv6SecondaryDnsInAcctStart, rsRadiusClientIncludeIpv6SecondaryDnsInAcctStop, rsRadiusClientIncludeIpv6VirtualRouterInAcctStart, rsRadiusClientIncludeIpv6VirtualRouterInAcctStop."
      },
      {
        "revision": "2007-12-14 15:00",
        "description": "Added rsRadiusClientIncludeDownStreamCalculatedQosRateInAccessReq, rsRadiusClientIncludeUpStreamCalculatedQosRateInAccessReq, rsRadiusClientIncludeDownStreamCalculatedQosRateInAcctStart, rsRadiusClientIncludeUpStreamCalculatedQosRateInAcctStart, rsRadiusClientIncludeDownStreamCalculatedQosRateInAcctStop, rsRadiusClientIncludeUpStreamCalculatedQosRateInAcctStop."
      },
      {
        "revision": "2007-09-18 18:22",
        "description": "Added rsRadiusClientIncludeInterfaceIdInAcctStart, rsRadiusClientIncludeIpv6PrefixInAcctStart, rsRadiusClientIncludeInterfaceIdInAcctStop, rsRadiusClientIncludeIpAddrInAcctStop, rsRadiusClientIncludeIpv6PrefixInAcctStop."
      },
      {
        "revision": "2007-04-10 01:03",
        "description": "Added rsRadiusClientIncludeL2cAccessLoopCircuitIdInAccessReq, rsRadiusClientIncludeL2cAccessAggrCircuitIdBinaryInAccessReq, rsRadiusClientIncludeL2cAccessAggrCircuitIdAsciiInAccessReq, rsRadiusClientIncludeL2cActualDataRateUstrInAccessReq, rsRadiusClientIncludeL2cActualDataRateDstrInAccessReq, rsRadiusClientIncludeL2cMinimumDataRateUstrInAccessReq, rsRadiusClientIncludeL2cMinimumDataRateDstrInAccessReq, rsRadiusClientIncludeL2cAttainDataRateUstrInAccessReq, rsRadiusClientIncludeL2cAttainDataRateDstrInAccessReq, rsRadiusClientIncludeL2cMaximumDataRateUstrInAccessReq, rsRadiusClientIncludeL2cMaximumDataRateDstrInAccessReq, rsRadiusClientIncludeL2cMinLowPowerDataRateUstrInAccessReq, rsRadiusClientIncludeL2cMinLowPowerDataRateDstrInAccessReq, rsRadiusClientIncludeL2cMaxInterleavingDelayUstrInAccessReq, rsRadiusClientIncludeL2cActInterleavingDelayUstrInAccessReq, rsRadiusClientIncludeL2cMaxInterleavingDelayDstrInAccessReq, rsRadiusClientIncludeL2cActInterleavingDelayDstrInAccessReq, rsRadiusClientIncludeL2cDslLineStateInAccessReq, rsRadiusClientIncludeL2cDslTypeInAccessReq, rsRadiusClientIncludeL2cAccessLoopCircuitIdInAcctStart, rsRadiusClientIncludeL2cAccessAggrCircuitIdBinaryInAcctStart, rsRadiusClientIncludeL2cAccessAggrCircuitIdAsciiInAcctStart, rsRadiusClientIncludeL2cActualDataRateUstrInAcctStart, rsRadiusClientIncludeL2cActualDataRateDstrInAcctStart, rsRadiusClientIncludeL2cMinimumDataRateUstrInAcctStart, rsRadiusClientIncludeL2cMinimumDataRateDstrInAcctStart, rsRadiusClientIncludeL2cAttainDataRateUstrInAcctStart, rsRadiusClientIncludeL2cAttainDataRateDstrInAcctStart, rsRadiusClientIncludeL2cMaximumDataRateUstrInAcctStart, rsRadiusClientIncludeL2cMaximumDataRateDstrInAcctStart, rsRadiusClientIncludeL2cMinLowPowerDataRateUstrInAcctStart, rsRadiusClientIncludeL2cMinLowPowerDataRateDstrInAcctStart, rsRadiusClientIncludeL2cMaxInterleavingDelayUstrInAcctStart, rsRadiusClientIncludeL2cActInterleavingDelayUstrInAcctStart, rsRadiusClientIncludeL2cMaxInterleavingDelayDstrInAcctStart, rsRadiusClientIncludeL2cActInterleavingDelayDstrInAcctStart, rsRadiusClientIncludeL2cDslLineStateInAcctStart, rsRadiusClientIncludeL2cDslTypeInAcctStart, rsRadiusClientIncludeL2cAccessLoopCircuitIdInAcctStop, rsRadiusClientIncludeL2cAccessAggrCircuitIdBinaryInAcctStop, rsRadiusClientIncludeL2cAccessAggrCircuitIdAsciiInAcctStop, rsRadiusClientIncludeL2cActualDataRateUstrInAcctStop, rsRadiusClientIncludeL2cActualDataRateDstrInAcctStop, rsRadiusClientIncludeL2cMinimumDataRateUstrInAcctStop, rsRadiusClientIncludeL2cMinimumDataRateDstrInAcctStop, rsRadiusClientIncludeL2cAttainDataRateUstrInAcctStop, rsRadiusClientIncludeL2cAttainDataRateDstrInAcctStop, rsRadiusClientIncludeL2cMaximumDataRateUstrInAcctStop, rsRadiusClientIncludeL2cMaximumDataRateDstrInAcctStop, rsRadiusClientIncludeL2cMinLowPowerDataRateUstrInAcctStop, rsRadiusClientIncludeL2cMinLowPowerDataRateDstrInAcctStop, rsRadiusClientIncludeL2cMaxInterleavingDelayUstrInAcctStop, rsRadiusClientIncludeL2cActInterleavingDelayUstrInAcctStop, rsRadiusClientIncludeL2cMaxInterleavingDelayDstrInAcctStop, rsRadiusClientIncludeL2cActInterleavingDelayDstrInAcctStop, rsRadiusClientIncludeL2cDslLineStateInAcctStop, rsRadiusClientIncludeL2cDslTypeInAcctStop allowing to control generation and format of decoded L2C Attributes."
      },
      {
        "revision": "2006-02-17 22:00",
        "description": "Added new objects BRAS group to allow inclusion of DSL Forum attributes into radius requests."
      },
      {
        "revision": "2006-01-12 22:00",
        "description": "Added new objects BRAS group to allow inclusion of L2C information, L2C up and down stream data into radius requests."
      },
      {
        "revision": "2004-12-06 02:32",
        "description": "Added new objects BRAS group to allow inclusion of interface description into radius requests."
      },
      {
        "revision": "2004-12-03 22:12",
        "description": "Added a new object to the BRAS group to allow override of nas-ip-address and nas-identifier from authentication router. Added new objects to the BRAS group to allow override of nas-port-id and calling-station-id with PPPoE Remote Circuit Id."
      },
      {
        "revision": "2003-12-18 21:03",
        "description": "A new object was added to the BRAS group to indicate which RADIUS attributes should be included or excluded from RADIUS packets."
      },
      {
        "revision": "2003-05-21 19:18",
        "description": "Added new accounting counters."
      },
      {
        "revision": "2003-03-10 19:51",
        "description": "Added new configuration objects."
      },
      {
        "revision": "2003-01-27 18:36",
        "description": "Replaced Unisphere names with Juniper names. Added objects to ignore attributes from the access-accept RADIUS packets. Added objects for RADIUS trap enable/disable control and detailed accounting statistics. Added notifications for available RADIUS servers."
      },
      {
        "revision": "2002-11-21 19:26",
        "description": "Added notifications for unavailable RADIUS servers."
      },
      {
        "revision": "2001-10-19 14:44",
        "description": "New objects were added to the BRAS group to indicate which RADIUS attributes should be included or excluded from RADIUS packets."
      },
      {
        "revision": "2001-10-16 20:45",
        "description": "A new object was added to the BRAS group."
      },
      {
        "revision": "2001-09-07 12:35",
        "description": "The initial release of this management information module."
      }
    ],
    "lastupdated": "200902101520Z",
    "organization": "Juniper Networks, Inc.",
    "contactinfo": " Juniper Networks, Inc. Postal: 10 Technology Park Drive Westford, MA 01886-3146 USA Tel: +1 978 589 5800 E-mail: mib@Juniper.net",
    "description": "The agent capabilities definitions for the Remote Authentication Dial In User Service (RADIUS) Client component of the SNMP agent in the Juniper E-series family of products."
  },
  "juniRadiusClientDynamicAgent": {
    "name": "juniRadiusClientDynamicAgent",
    "oid": "1.3.6.1.4.1.4874.5.2.35.1",
    "class": "objectidentity",
    "status": "current",
    "description": "The registration group of agent capabilities for RADIUS Client application which provides complete dynamic interface support in addition to basic authentication for CLI access."
  },
  "juniRadiusClientDynamicAgentV1": {
    "name": "juniRadiusClientDynamicAgentV1",
    "oid": "1.3.6.1.4.1.4874.5.2.35.1.1",
    "class": "agentcapabilities",
    "productrelease": "Version 1 of the RADIUS Client dynamic interface component of the\n        JUNOSe SNMP agent.  This version of the RADIUS Client component was\n        supported in JUNOSe 1.x system releases.",
    "status": "obsolete",
    "description": "The MIB supported by the SNMP agent for the RADIUS Client dynamic interface application in JUNOSe. These capabilities became obsolete when a new object was added."
  },
  "juniRadiusClientDynamicAgentV2": {
    "name": "juniRadiusClientDynamicAgentV2",
    "oid": "1.3.6.1.4.1.4874.5.2.35.1.2",
    "class": "agentcapabilities",
    "productrelease": "Version 2 of the RADIUS Client dynamic interface component of the\n        JUNOSe SNMP agent.  This version of the RADIUS Client component was\n        supported in JUNOSe 2.x system releases.",
    "status": "obsolete",
    "description": "The MIB supported by the SNMP agent for the RADIUS Client dynamic interface application in JUNOSe. These capabilities became obsolete when new objects were added."
  },
  "juniRadiusClientDynamicAgentV3": {
    "name": "juniRadiusClientDynamicAgentV3",
    "oid": "1.3.6.1.4.1.4874.5.2.35.1.3",
    "class": "agentcapabilities",
    "productrelease": "Version 3 of the RADIUS Client dynamic interface component of the\n        JUNOSe SNMP agent.  This version of the RADIUS Client component was\n        supported in JUNOSe 3.0 system release.",
    "status": "obsolete",
    "description": "The MIB supported by the SNMP agent for the RADIUS Client dynamic interface application in JUNOSe. These capabilities became obsolete when new B-RAS objects were added."
  },
  "juniRadiusClientDynamicAgentV4": {
    "name": "juniRadiusClientDynamicAgentV4",
    "oid": "1.3.6.1.4.1.4874.5.2.35.1.4",
    "class": "agentcapabilities",
    "productrelease": "Version 4 of the RADIUS Client dynamic interface component of the\n        JUNOSe SNMP agent.  This version of the RADIUS Client component was\n        supported in JUNOSe 3.1 system release.",
    "status": "obsolete",
    "description": "The MIB supported by the SNMP agent for the RADIUS Client dynamic interface application in JUNOSe. These capabilities became obsolete when new objects were added."
  },
  "juniRadiusClientDynamicAgentV5": {
    "name": "juniRadiusClientDynamicAgentV5",
    "oid": "1.3.6.1.4.1.4874.5.2.35.1.5",
    "class": "agentcapabilities",
    "productrelease": "Version 5 of the RADIUS Client dynamic interface component of the\n        JUNOSe SNMP agent.  This version of the RADIUS Client component was\n        supported in JUNOSe 3.2 system release.",
    "status": "obsolete",
    "description": "The MIB supported by the SNMP agent for the RADIUS Client dynamic interface application in JUNOSe. These capabilities became obsolete when a new object was added to the BRAS group."
  },
  "juniRadiusClientDynamicAgentV6": {
    "name": "juniRadiusClientDynamicAgentV6",
    "oid": "1.3.6.1.4.1.4874.5.2.35.1.6",
    "class": "agentcapabilities",
    "productrelease": "Version 6 of the RADIUS Client dynamic interface component of the\n        JUNOSe SNMP agent.  This version of the RADIUS Client component was\n        supported in JUNOSe 3.3 and subsequent 3.x system releases.",
    "status": "obsolete",
    "description": "The MIB supported by the SNMP agent for the RADIUS Client dynamic interface application in JUNOSe. These capabilities became obsolete when new objects were added to indicate which RADIUS attributes should be included or excluded from RADIUS packets."
  },
  "juniRadiusClientDynamicAgentV7": {
    "name": "juniRadiusClientDynamicAgentV7",
    "oid": "1.3.6.1.4.1.4874.5.2.35.1.7",
    "class": "agentcapabilities",
    "productrelease": "Version 7 of the RADIUS Client dynamic interface component of the\n        JUNOSe SNMP agent.  This version of the RADIUS Client component was\n        supported in JUNOSe 4.0 system releases.",
    "status": "obsolete",
    "description": "The MIB supported by the SNMP agent for the RADIUS Client dynamic interface application in JUNOSe. These capabilities became obsolete when notifications for unavailable RADIUS servers were added."
  },
  "juniRadiusClientDynamicAgentV8": {
    "name": "juniRadiusClientDynamicAgentV8",
    "oid": "1.3.6.1.4.1.4874.5.2.35.1.8",
    "class": "agentcapabilities",
    "productrelease": "Version 8 of the RADIUS Client dynamic interface component of the\n        JUNOSe SNMP agent.  This version of the RADIUS Client component was\n        supported in JUNOSe 4.1 system releases.",
    "status": "obsolete",
    "description": "The MIB supported by the SNMP agent for the RADIUS Client dynamic interface application in JUNOSe. These capabilities became obsolete when attribute-ignore objects were added to the B-RAS group and RADIUS accounting and authentication servers available traps were added."
  },
  "juniRadiusClientDynamicAgentV9": {
    "name": "juniRadiusClientDynamicAgentV9",
    "oid": "1.3.6.1.4.1.4874.5.2.35.1.9",
    "class": "agentcapabilities",
    "productrelease": "Version 9 of the RADIUS Client dynamic interface component of the\n        JUNOSe SNMP agent.  This version of the RADIUS Client component was\n        supported in JUNOSe 5.0 system releases.",
    "status": "obsolete",
    "description": "The MIB supported by the SNMP agent for the RADIUS Client dynamic interface application in JUNOSe. These capabilities became obsolete when new B-RAS configuration objects were added."
  },
  "juniRadiusClientDynamicAgentV10": {
    "name": "juniRadiusClientDynamicAgentV10",
    "oid": "1.3.6.1.4.1.4874.5.2.35.1.10",
    "class": "agentcapabilities",
    "productrelease": "Version 10 of the RADIUS Client dynamic interface component of the\n        JUNOSe SNMP agent.  This version of the RADIUS Client component was\n        supported in JUNOSe 5.1 system releases.",
    "status": "obsolete",
    "description": "The MIB supported by the SNMP agent for the RADIUS Client dynamic interface application in JUNOSe. These capabilities became obsolete when new accounting counters were added."
  },
  "juniRadiusClientDynamicAgentV11": {
    "name": "juniRadiusClientDynamicAgentV11",
    "oid": "1.3.6.1.4.1.4874.5.2.35.1.11",
    "class": "agentcapabilities",
    "productrelease": "Version 11 of the RADIUS Client dynamic interface component of the\n        JUNOSe SNMP agent.  This version of the RADIUS Client component was\n        supported in JUNOSe 5.2 system releases.",
    "status": "obsolete",
    "description": "The MIB supported by the SNMP agent for the RADIUS Client dynamic interface application in JUNOSe. These capabilities became obsolete when a new B-RAS object was added."
  },
  "juniRadiusClientDynamicAgentV12": {
    "name": "juniRadiusClientDynamicAgentV12",
    "oid": "1.3.6.1.4.1.4874.5.2.35.1.12",
    "class": "agentcapabilities",
    "productrelease": "Version 12 of the RADIUS Client dynamic interface component of the\n        JUNOSe SNMP agent.  These capabilities became obsolete when a new\n        B-RAS object was added.",
    "status": "obsolete",
    "description": "The MIB supported by the SNMP agent for the RADIUS Client dynamic interface application in JUNOSe."
  },
  "juniRadiusClientDynamicAgentV13": {
    "name": "juniRadiusClientDynamicAgentV13",
    "oid": "1.3.6.1.4.1.4874.5.2.35.1.13",
    "class": "agentcapabilities",
    "productrelease": "Version 13 of the RADIUS Client dynamic interface component of the\n        JUNOSe SNMP agent.  This version of the RADIUS Client component is\n        supported in JUNOSe 6.1 and subsequent system releases.",
    "status": "obsolete",
    "description": "The MIB supported by the SNMP agent for the RADIUS Client dynamic interface application in JUNOSe."
  },
  "juniRadiusClientDynamicAgentV14": {
    "name": "juniRadiusClientDynamicAgentV14",
    "oid": "1.3.6.1.4.1.4874.5.2.35.1.14",
    "class": "agentcapabilities",
    "productrelease": "Version 14 of the RADIUS Client dynamic interface component of the\n        JUNOSe SNMP agent.  This version of the RADIUS Client component is\n        supported in JUNOSe 6.1 and subsequent system releases.",
    "status": "obsolete",
    "description": "The MIB supported by the SNMP agent for the RADIUS Client dynamic interface application in JUNOSe."
  },
  "juniRadiusClientDynamicAgentV15": {
    "name": "juniRadiusClientDynamicAgentV15",
    "oid": "1.3.6.1.4.1.4874.5.2.35.1.15",
    "class": "agentcapabilities",
    "productrelease": "Version 15 of the RADIUS Client dynamic interface component of the\n        JUNOSe SNMP agent.  This version of the RADIUS Client component is\n        supported in JUNOSe 6.1 and subsequent system releases.",
    "status": "obsolete",
    "description": "The MIB supported by the SNMP agent for the RADIUS Client dynamic interface application in JUNOSe."
  },
  "juniRadiusClientDynamicAgentV16": {
    "name": "juniRadiusClientDynamicAgentV16",
    "oid": "1.3.6.1.4.1.4874.5.2.35.1.16",
    "class": "agentcapabilities",
    "productrelease": "Version 16 of the RADIUS Client dynamic interface component of the\n        JUNOSe SNMP agent.  This version of the RADIUS Client component is\n        supported in JUNOSe 7.2 and subsequent system releases.",
    "status": "obsolete",
    "description": "The MIB supported by the SNMP agent for the RADIUS Client dynamic interface application in JUNOSe."
  },
  "juniRadiusClientDynamicAgentV17": {
    "name": "juniRadiusClientDynamicAgentV17",
    "oid": "1.3.6.1.4.1.4874.5.2.35.1.17",
    "class": "agentcapabilities",
    "productrelease": "Version 17 of the RADIUS Client dynamic interface component of the\n        JUNOSe SNMP agent.  This version of the RADIUS Client component is\n        supported in JUNOSe 7.3 and subsequent system releases.",
    "status": "obsolete",
    "description": "The MIB supported by the SNMP agent for the RADIUS Client dynamic interface application in JUNOSe."
  },
  "juniRadiusClientDynamicAgentV18": {
    "name": "juniRadiusClientDynamicAgentV18",
    "oid": "1.3.6.1.4.1.4874.5.2.35.1.18",
    "class": "agentcapabilities",
    "productrelease": "Version 18 of the RADIUS Client dynamic interface component of the\n        JUNOSe SNMP agent.  This version of the RADIUS Client component is\n        supported in JUNOSe 8.1.2 and subsequent system releases.",
    "status": "obsolete",
    "description": "The MIB supported by the SNMP agent for the RADIUS Client dynamic interface application in JUNOSe."
  },
  "juniRadiusClientDynamicAgentV19": {
    "name": "juniRadiusClientDynamicAgentV19",
    "oid": "1.3.6.1.4.1.4874.5.2.35.1.19",
    "class": "agentcapabilities",
    "productrelease": "Version 19 of the RADIUS Client dynamic interface component of the\n        JUNOSe SNMP agent.  This version of the RADIUS Client component is\n        supported in JUNOSe 8.2.2 and subsequent system releases.",
    "status": "obsolete",
    "description": "The MIB supported by the SNMP agent for the RADIUS Client dynamic interface application in JUNOSe."
  },
  "juniRadiusClientDynamicAgentV20": {
    "name": "juniRadiusClientDynamicAgentV20",
    "oid": "1.3.6.1.4.1.4874.5.2.35.1.20",
    "class": "agentcapabilities",
    "productrelease": "Version 20 of the RADIUS Client dynamic interface component of the\n        JUNOSe SNMP agent.  This version of the RADIUS Client component is\n        supported in JUNOSe 9.1 and subsequent system releases.",
    "status": "obsolete",
    "description": "The MIB supported by the SNMP agent for the RADIUS Client dynamic interface application in JUNOSe."
  },
  "juniRadiusClientDynamicAgentV21": {
    "name": "juniRadiusClientDynamicAgentV21",
    "oid": "1.3.6.1.4.1.4874.5.2.35.1.21",
    "class": "agentcapabilities",
    "productrelease": "Version 21 of the RADIUS Client dynamic interface component of the\n        JUNOSe SNMP agent.  This version of the RADIUS Client component is\n        supported in JUNOSe 10.2 and subsequent system releases.",
    "status": "obsolete",
    "description": "The MIB supported by the SNMP agent for the RADIUS Client dynamic interface application in JUNOSe."
  },
  "juniRadiusClientDynamicAgentV22": {
    "name": "juniRadiusClientDynamicAgentV22",
    "oid": "1.3.6.1.4.1.4874.5.2.35.1.22",
    "class": "agentcapabilities",
    "productrelease": "Version 22 of the RADIUS Client dynamic interface component of the\n        JUNOSe SNMP agent.  This version of the RADIUS Client component is\n        supported in JUNOSe 10.2 and subsequent system releases.",
    "status": "current",
    "description": "The MIB supported by the SNMP agent for the RADIUS Client dynamic interface application in JUNOSe."
  },
  "juniRadiusClientBasicAgent": {
    "name": "juniRadiusClientBasicAgent",
    "oid": "1.3.6.1.4.1.4874.5.2.35.2",
    "class": "objectidentity",
    "status": "current",
    "description": "The registration group of agent capabilities for the RADIUS Client application which only provides basic authentication for CLI access to JUNOSe."
  },
  "juniRadiusClientBasicAgentV1": {
    "name": "juniRadiusClientBasicAgentV1",
    "oid": "1.3.6.1.4.1.4874.5.2.35.2.1",
    "class": "agentcapabilities",
    "productrelease": "Version 1 of the basic authentication RADIUS Client component of the\n        JUNOSe SNMP agent.  This version of the RADIUS Client component is\n        supported in JUNOSe 3.2 and subsequent system releases.",
    "status": "current",
    "description": "The MIB supported by the SNMP agent for the RADIUS Client basic authentication application which only supports basic authentication for remote CLI access in JUNOSe."
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/Juniper-RADIUS-CLIENT-CONF",
      "Produced by pysmi-0.3.4 at Fri May 24 20:17:13 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "Juniper-RADIUS-CLIENT-CONF"
  }
}