{
  "imports": {
    "class": "imports",
    "SNMPv2-CONF": [
      "NOTIFICATION-GROUP",
      "MODULE-COMPLIANCE"
    ],
    "SNMPv2-SMI": [
      "Bits",
      "Counter32",
      "OBJECT-TYPE",
      "OBJECT-IDENTITY",
      "Counter64",
      "Unsigned32",
      "MibIdentifier",
      "TimeTicks",
      "MODULE-IDENTITY",
      "iso",
      "Integer32",
      "IpAddress",
      "mib-2",
      "NOTIFICATION-TYPE",
      "Gauge32"
    ],
    "SNMPv2-TC": [
      "TEXTUAL-CONVENTION",
      "DisplayString"
    ]
  },
  "langTagTcMIB": {
    "name": "langTagTcMIB",
    "oid": "1.3.6.1.2.1.165",
    "class": "moduleidentity",
    "revisions": [
      {
        "revision": "2007-11-09 00:00",
        "description": "Initial revision, published as RFC 5131. Copyright (C) The IETF Trust (2007). This version of this MIB module is part of RFC 5131; see the RFC itself for full legal notices."
      }
    ],
    "lastupdated": "200711090000Z",
    "organization": "IETF Operations and Management (OPS) Area",
    "contactinfo": "EMail: ops-area@ietf.org Home page: http://www.ops.ietf.org/",
    "description": "This MIB module defines a textual convention for representing BCP 47 language tags."
  },
  "LangTag": {
    "name": "LangTag",
    "class": "textualconvention",
    "type": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 0
          },
          {
            "min": 2,
            "max": 63
          }
        ]
      }
    },
    "displayhint": "1a",
    "status": "current",
    "description": "A language tag, constructed in accordance with BCP 47. Only lowercase characters are allowed. The purpose of this restriction is to provide unique language tags for use as indexes. BCP 47 recommends case conventions for user interfaces, but objects using this TEXTUAL-CONVENTION MUST use only lowercase. Values MUST be well-formed language tags, in conformance with the definition of well-formed tags in BCP 47. An implementation MAY further limit the values it accepts to those permitted by a 'validating' processor, as defined in BCP 47. In theory, BCP 47 language tags are of unlimited length. The language tag described in this TEXTUAL-CONVENTION is of limited length. The analysis of language tag lengths in BCP 47 confirms that this limit will not pose a problem in practice. In particular, this length is greater than the minimum requirements set out in Section 4.3.1. A zero-length language tag is not a valid language tag. This can be used to express 'language tag absent' where required, for example, when used as an index field.",
    "reference": "RFC 4646 BCP 47"
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/LANGTAG-TC-MIB",
      "Produced by pysmi-0.3.4 at Fri May 24 20:08:23 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "LANGTAG-TC-MIB"
  }
}