{
  "imports": {
    "class": "imports",
    "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB": [
      "mscLp",
      "mscLpIndex"
    ],
    "Nortel-MsCarrier-MscPassport-StandardTextualConventionsMIB": [
      "RowStatus",
      "Integer32",
      "StorageType",
      "DisplayString"
    ],
    "Nortel-MsCarrier-MscPassport-UsefulDefinitionsMIB": [
      "mscPassportMIBs"
    ],
    "SNMPv2-CONF": [
      "MODULE-COMPLIANCE",
      "NOTIFICATION-GROUP"
    ],
    "SNMPv2-SMI": [
      "Gauge32",
      "NOTIFICATION-TYPE",
      "MibIdentifier",
      "Bits",
      "Counter32",
      "iso",
      "Integer32",
      "MODULE-IDENTITY",
      "OBJECT-IDENTITY",
      "Unsigned32",
      "OBJECT-TYPE",
      "TimeTicks",
      "IpAddress",
      "Counter64"
    ],
    "SNMPv2-TC": [
      "DisplayString",
      "TEXTUAL-CONVENTION"
    ]
  },
  "externalTimingE1MIB": {
    "name": "externalTimingE1MIB",
    "oid": "1.3.6.1.4.1.562.36.2.2.152",
    "class": "objectidentity"
  },
  "mscLpEE1": {
    "name": "mscLpEE1",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.29",
    "class": "objectidentity"
  },
  "mscLpEE1RowStatusTable": {
    "name": "mscLpEE1RowStatusTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.29.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This entry controls the addition and deletion of mscLpEE1 components."
  },
  "mscLpEE1RowStatusEntry": {
    "name": "mscLpEE1RowStatusEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.29.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-ExternalTimingE1MIB",
        "object": "mscLpEE1Index",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "A single entry in the table represents a single mscLpEE1 component."
  },
  "mscLpEE1RowStatus": {
    "name": "mscLpEE1RowStatus",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.29.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "This variable is used as the basis for SNMP naming of mscLpEE1 components. These components can be added and deleted."
  },
  "mscLpEE1ComponentName": {
    "name": "mscLpEE1ComponentName",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.29.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This variable provides the component's string name for use with the ASCII Console Interface"
  },
  "mscLpEE1StorageType": {
    "name": "mscLpEE1StorageType",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.29.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "StorageType",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This variable represents the storage type value for the mscLpEE1 tables."
  },
  "mscLpEE1Index": {
    "name": "mscLpEE1Index",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.29.1.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 1
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This variable represents the index for the mscLpEE1 tables."
  },
  "mscLpEE1OperStatusTable": {
    "name": "mscLpEE1OperStatusTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.29.14",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This group includes the Operational Status attribute. This attribute defines the current operational state of this component."
  },
  "mscLpEE1OperStatusEntry": {
    "name": "mscLpEE1OperStatusEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.29.14.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-ExternalTimingE1MIB",
        "object": "mscLpEE1Index",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "An entry in the mscLpEE1OperStatusTable."
  },
  "mscLpEE1SnmpOperStatus": {
    "name": "mscLpEE1SnmpOperStatus",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.29.14.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "up": 1,
          "down": 2,
          "testing": 3
        }
      }
    },
    "default": {
      "default": {
        "value": "up",
        "format": "enum"
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "The current state of the interface. The up state indicates the interface is operational and capable of forwarding packets. The down state indicates the interface is not operational, thus unable to forward packets. testing state indicates that no operational packets can be passed."
  },
  "mscLpEE1StateTable": {
    "name": "mscLpEE1StateTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.29.15",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This group contains the three OSI State attributes and the six OSI Status attributes. The descriptions generically indicate what each attribute implies about the component. Note that not all the values and state combinations described here are supported by every component which uses this group. For component-specific information and the valid state combinations, refer to NTP 241- 7001-150, Passport Operations and Maintenance Guide."
  },
  "mscLpEE1StateEntry": {
    "name": "mscLpEE1StateEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.29.15.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-ExternalTimingE1MIB",
        "object": "mscLpEE1Index",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "An entry in the mscLpEE1StateTable."
  },
  "mscLpEE1AdminState": {
    "name": "mscLpEE1AdminState",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.29.15.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "locked": 0,
          "unlocked": 1,
          "shuttingDown": 2
        }
      }
    },
    "default": {
      "default": {
        "value": "unlocked",
        "format": "enum"
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates the OSI Administrative State of the component. The value locked indicates that the component is administratively prohibited from providing services for its users. A Lock or Lock - force command has been previously issued for this component. When the value is locked, the value of usageState must be idle. The value shuttingDown indicates that the component is administratively permitted to provide service to its existing users only. A Lock command was issued against the component and it is in the process of shutting down. The value unlocked indicates that the component is administratively permitted to provide services for its users. To enter this state, issue an Unlock command to this component. The OSI Status attributes, if supported by the component, may provide more details, qualifying the state of the component."
  },
  "mscLpEE1OperationalState": {
    "name": "mscLpEE1OperationalState",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.29.15.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "disabled": 0,
          "enabled": 1
        }
      }
    },
    "default": {
      "default": {
        "value": "disabled",
        "format": "enum"
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates the OSI Operational State of the component. The value enabled indicates that the component is available for operation. Note that if adminState is locked, it would still not be providing service. The value disabled indicates that the component is not available for operation. For example, something is wrong with the component itself, or with another component on which this one depends. If the value is disabled, the usageState must be idle. The OSI Status attributes, if supported by the component, may provide more details, qualifying the state of the component."
  },
  "mscLpEE1UsageState": {
    "name": "mscLpEE1UsageState",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.29.15.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "idle": 0,
          "active": 1,
          "busy": 2
        }
      }
    },
    "default": {
      "default": {
        "value": "idle",
        "format": "enum"
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates the OSI Usage State of the component. The value idle indicates that the component is not currently in use. The value active indicates that the component is in use and has spare capacity to provide for additional users. The value busy indicates that the component is in use and has no spare operating capacity for additional users at this time. The OSI Status attributes, if supported by the component, may provide more details, qualifying the state of the component."
  },
  "mscLpEE1AvailabilityStatus": {
    "name": "mscLpEE1AvailabilityStatus",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.29.15.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 2,
            "max": 2
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "If supported by the component, this attribute indicates the OSI Availability status of the component. Note that, even though it is defined as a multi-valued set, at most one value is shown to the user. When no values are in the set, this indicates that either the attribute is not supported or that none of the status conditions described below are present. The value inTest indicates that the resource is undergoing a test procedure. If adminState is locked or shuttingDown, the normal users are precluded from using the resource and controlStatus is reservedForTest. Tests that do not exclude additional users can be present in any operational or administrative state but the reservedForTest condition should not be present. The value failed indicates that the component has an internal fault that prevents it from operating. The operationalState is disabled. The value dependency indicates that the component cannot operate because some other resource on which it depends is unavailable. The operationalState is disabled. The value powerOff indicates the resource requires power to be applied and it is not powered on. The operationalState is disabled. The value offLine indicates the resource requires a routine operation (either manual, automatic, or both) to be performed to place it on-line and make it available for use. The operationalState is disabled. The value offDuty indicates the resource is inactive in accordance with a predetermined time schedule. In the absence of other disabling conditions, the operationalState is enabled or disabled. The value degraded indicates the service provided by the component is degraded in some way, such as in speed or operating capacity. However, the resource remains available for service. The operationalState is enabled. The value notInstalled indicates the resource is not present. The operationalState is disabled. The value logFull is not used. Description of bits: inTest(0) failed(1) powerOff(2) offLine(3) offDuty(4) dependency(5) degraded(6) notInstalled(7) logFull(8)"
  },
  "mscLpEE1ProceduralStatus": {
    "name": "mscLpEE1ProceduralStatus",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.29.15.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 1
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "If supported by the component, this attribute indicates the OSI Procedural status of the component. Note that, even though it is defined as a multi-valued set, at most one value is shown to the user. When no values are in the set, this indicates that either the attribute is not supported or that none of the status conditions described below are present. The value initializationRequired indicates (for a resource which doesn't initialize autonomously) that initialization is required before it can perform its normal functions, and this procedure has not been initiated. The operationalState is disabled. The value notInitialized indicates (for a resource which does initialize autonomously) that initialization is required before it can perform its normal functions, and this procedure has not been initiated. The operationalState may be enabled or disabled. The value initializing indicates that initialization has been initiated but is not yet complete. The operationalState may be enabled or disabled. The value reporting indicates the resource has completed some processing operation and is notifying the results. The operationalState is enabled. The value terminating indicates the component is in a termination phase. If the resource doesn't reinitialize autonomously, operationalState is disabled; otherwise it is enabled or disabled. Description of bits: initializationRequired(0) notInitialized(1) initializing(2) reporting(3) terminating(4)"
  },
  "mscLpEE1ControlStatus": {
    "name": "mscLpEE1ControlStatus",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.29.15.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 1
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "If supported by the component, this attribute indicates the OSI Control status of the component. Note that, even though it is defined as a multi-valued set, at most one value is shown to the user. When no values are in the set, this indicates that either the attribute is not supported or that none of the status conditions described below are present. The value subjectToTest indicates the resource is available but tests may be conducted simultaneously at unpredictable times, which may cause it to exhibit unusual characteristics. The value partOfServicesLocked indicates that part of the service is restricted from users of a resource. The adminState is unlocked. The value reservedForTest indicates that the component is administratively unavailable because it is undergoing a test procedure. The adminState is locked. The value suspended indicates that the service has been administratively suspended. Description of bits: subjectToTest(0) partOfServicesLocked(1) reservedForTest(2) suspended(3)"
  },
  "mscLpEE1AlarmStatus": {
    "name": "mscLpEE1AlarmStatus",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.29.15.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 1
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "If supported by the component, this attribute indicates the OSI Alarm status of the component. Note that, even though it is defined as a multi-valued set, at most one value is shown to the user. When no values are in the set, this indicates that either the attribute is not supported or that none of the status conditions described below are present. The value underRepair indicates the component is currently being repaired. The operationalState is enabled or disabled. The value critical indicates one or more critical alarms are outstanding against the component. Other, less severe, alarms may also be outstanding. The operationalState is enabled or disabled. The value major indicates one or more major alarms are outstanding against the component. Other, less severe, alarms may also be outstanding. The operationalState is enabled or disabled. The value minor indicates one or more minor alarms are outstanding against the component. Other, less severe, alarms may also be outstanding. The operationalState is enabled or disabled. The value alarmOutstanding generically indicates that an alarm of some severity is outstanding against the component. Description of bits: underRepair(0) critical(1) major(2) minor(3) alarmOutstanding(4)"
  },
  "mscLpEE1StandbyStatus": {
    "name": "mscLpEE1StandbyStatus",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.29.15.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "hotStandby": 0,
          "coldStandby": 1,
          "providingService": 2,
          "notSet": 15
        }
      }
    },
    "default": {
      "default": {
        "value": "notSet",
        "format": "enum"
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "If supported by the component, this attribute indicates the OSI Standby status of the component. The value notSet indicates that either the attribute is not supported or that none of the status conditions described below are present. Note that this is a non-standard value, used because the original specification indicated this attribute was set-valued and thus, did not provide a value to indicate that none of the other three are applicable. The value hotStandby indicates that the resource is not providing service but will be immediately able to take over the role of the resource to be backed up, without initialization activity, and containing the same information as the resource to be backed up. The value coldStandby indicates the resource is a backup for another resource but will not be immediately able to take over the role of the backed up resource and will require some initialization activity. The value providingService indicates that this component, as a backup resource, is currently backing up another resource."
  },
  "mscLpEE1UnknownStatus": {
    "name": "mscLpEE1UnknownStatus",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.29.15.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "false": 0,
          "true": 1
        }
      }
    },
    "default": {
      "default": {
        "value": "false",
        "format": "enum"
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates the OSI Unknown status of the component. The value false indicates that all of the other OSI State and Status attribute values can be considered accurate. The value true indicates that the actual state of the component is not known for sure."
  },
  "mscLpEE1OperTable": {
    "name": "mscLpEE1OperTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.29.16",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This group contains the common operational data for EE1 and EDS1 components."
  },
  "mscLpEE1OperEntry": {
    "name": "mscLpEE1OperEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.29.16.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-ExternalTimingE1MIB",
        "object": "mscLpEE1Index",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "An entry in the mscLpEE1OperTable."
  },
  "mscLpEE1LosAlarm": {
    "name": "mscLpEE1LosAlarm",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.29.16.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "on": 0,
          "off": 1
        }
      }
    },
    "default": {
      "default": {
        "value": "off",
        "format": "enum"
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates whether a LOS (Loss of Signal) alarm state has been entered. A LOS alarm is declared after LOS defects have been observed and accumulated for a period of 2 seconds +/- 0.5 second . A LOS defect is detected upon observing all zeros for 150 ms . If the LOS defects are intermittently occurring, the LOS defect accumulator is decremented at a rate of 1/10 of the incrementing rate (alarm integration ratio of 1/10), with all measurements based on a 200 ms polling cycle. The port goes into an operational state of disabled until the LOS alarm state is cleared. The LOS alarm state is cleared when LOS defects are absent for 10 seconds +/- 0.5 second."
  },
  "mscLpEE1LofAlarm": {
    "name": "mscLpEE1LofAlarm",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.29.16.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "on": 0,
          "off": 1
        }
      }
    },
    "default": {
      "default": {
        "value": "off",
        "format": "enum"
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates whether a LOF (Loss of Frame) alarm state has been entered. The LOF alarm state is entered when LOF defects (for DS1: 2 out of 5 framing bits in error; for E1: 3 consecutive frame alignment patterns in error) have been detected for 3 seconds +/- 0.5 second . If the LOF defects are intermittently occurring, the LOF defect accumulator is decremented at a rate of 1/10 of the incrementing rate (alarm integration ratio of 1/10), with all measurements based on a 200 ms polling cycle. The port goes into an operational state of disabled until the LOF alarm state is cleared. The condition is cleared when framing has been achieved for 10 seconds +/- 0.5 second."
  },
  "mscLpEE1RxAisAlarm": {
    "name": "mscLpEE1RxAisAlarm",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.29.16.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "on": 0,
          "off": 1
        }
      }
    },
    "default": {
      "default": {
        "value": "off",
        "format": "enum"
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates whether an AIS (Alarm Indication Signal) alarm has been entered. The AIS Alarm state is entered when AIS defects have been observed and accumulated for 2.5 seconds +/- 0.5 second. An AIS defect is detected after having received less than 3 zeros in a 2048 bit period. If the AIS defects are intermittently occurring, the AIS defect accumulator is decremented at a rate of 1/ 10 of the incrementing rate (alarm integration ratio of 1/10), with all measurement based on a 200 ms polling cycle. The port goes into an operational state of disabled for the duration of an AIS alarm state. The AIS alarm state is cleared when AIS defects are absent for 10 seconds +/- 0.5 second."
  },
  "externalTimingE1Group": {
    "name": "externalTimingE1Group",
    "oid": "1.3.6.1.4.1.562.36.2.2.152.1",
    "class": "objectidentity"
  },
  "externalTimingE1GroupCA": {
    "name": "externalTimingE1GroupCA",
    "oid": "1.3.6.1.4.1.562.36.2.2.152.1.1",
    "class": "objectidentity"
  },
  "externalTimingE1GroupCA02": {
    "name": "externalTimingE1GroupCA02",
    "oid": "1.3.6.1.4.1.562.36.2.2.152.1.1.3",
    "class": "objectidentity"
  },
  "externalTimingE1GroupCA02A": {
    "name": "externalTimingE1GroupCA02A",
    "oid": "1.3.6.1.4.1.562.36.2.2.152.1.1.3.2",
    "class": "objectidentity"
  },
  "externalTimingE1Capabilities": {
    "name": "externalTimingE1Capabilities",
    "oid": "1.3.6.1.4.1.562.36.2.2.152.3",
    "class": "objectidentity"
  },
  "externalTimingE1CapabilitiesCA": {
    "name": "externalTimingE1CapabilitiesCA",
    "oid": "1.3.6.1.4.1.562.36.2.2.152.3.1",
    "class": "objectidentity"
  },
  "externalTimingE1CapabilitiesCA02": {
    "name": "externalTimingE1CapabilitiesCA02",
    "oid": "1.3.6.1.4.1.562.36.2.2.152.3.1.3",
    "class": "objectidentity"
  },
  "externalTimingE1CapabilitiesCA02A": {
    "name": "externalTimingE1CapabilitiesCA02A",
    "oid": "1.3.6.1.4.1.562.36.2.2.152.3.1.3.2",
    "class": "objectidentity"
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/Nortel-MsCarrier-MscPassport-ExternalTimingE1MIB",
      "Produced by pysmi-0.3.4 at Fri May 24 20:47:20 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "Nortel-MsCarrier-MscPassport-ExternalTimingE1MIB"
  }
}