{
  "imports": {
    "class": "imports",
    "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB": [
      "mscLpIndex",
      "mscLp",
      "mscLpEngIndex",
      "mscLpEng"
    ],
    "Nortel-MsCarrier-MscPassport-StandardTextualConventionsMIB": [
      "Gauge32",
      "RowStatus",
      "Unsigned32",
      "DisplayString",
      "Integer32",
      "StorageType"
    ],
    "Nortel-MsCarrier-MscPassport-TextualConventionsMIB": [
      "FixedPoint1",
      "NonReplicated"
    ],
    "Nortel-MsCarrier-MscPassport-UsefulDefinitionsMIB": [
      "mscPassportMIBs"
    ],
    "SNMPv2-CONF": [
      "MODULE-COMPLIANCE",
      "NOTIFICATION-GROUP"
    ],
    "SNMPv2-SMI": [
      "iso",
      "NOTIFICATION-TYPE",
      "Gauge32",
      "MODULE-IDENTITY",
      "MibIdentifier",
      "IpAddress",
      "OBJECT-IDENTITY",
      "TimeTicks",
      "Counter32",
      "Counter64",
      "Unsigned32",
      "Integer32",
      "OBJECT-TYPE",
      "Bits"
    ],
    "SNMPv2-TC": [
      "DisplayString",
      "TEXTUAL-CONVENTION"
    ]
  },
  "atmBaseMIB": {
    "name": "atmBaseMIB",
    "oid": "1.3.6.1.4.1.562.36.2.2.63",
    "class": "objectidentity"
  },
  "mscLpArc": {
    "name": "mscLpArc",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.19",
    "class": "objectidentity"
  },
  "mscLpArcRowStatusTable": {
    "name": "mscLpArcRowStatusTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.19.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "obsolete",
    "description": "This entry controls the addition and deletion of mscLpArc components."
  },
  "mscLpArcRowStatusEntry": {
    "name": "mscLpArcRowStatusEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.19.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpArcIndex",
        "implied": 0
      }
    ],
    "status": "obsolete",
    "description": "A single entry in the table represents a single mscLpArc component."
  },
  "mscLpArcRowStatus": {
    "name": "mscLpArcRowStatus",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.19.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "obsolete",
    "description": "This variable is used as the basis for SNMP naming of mscLpArc components. These components can be added and deleted."
  },
  "mscLpArcComponentName": {
    "name": "mscLpArcComponentName",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.19.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This variable provides the component's string name for use with the ASCII Console Interface"
  },
  "mscLpArcStorageType": {
    "name": "mscLpArcStorageType",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.19.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "StorageType",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This variable represents the storage type value for the mscLpArc tables."
  },
  "mscLpArcIndex": {
    "name": "mscLpArcIndex",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.19.1.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "NonReplicated",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "obsolete",
    "description": "This variable represents the index for the mscLpArc tables."
  },
  "mscLpArcProvTable": {
    "name": "mscLpArcProvTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.19.100",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "obsolete",
    "description": "This group specifies the configuration of processor-wide ATM- specific resources on a Logical Processor running ATM services. Note that altering any of these parameters will result in a card reboot."
  },
  "mscLpArcProvEntry": {
    "name": "mscLpArcProvEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.19.100.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpArcIndex",
        "implied": 0
      }
    ],
    "status": "obsolete",
    "description": "An entry in the mscLpArcProvTable."
  },
  "mscLpArcTotalConnectionPoolCapacity": {
    "name": "mscLpArcTotalConnectionPoolCapacity",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.19.100.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 10752
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 3072,
        "format": "decimal"
      }
    },
    "maxaccess": "read-write",
    "status": "obsolete",
    "description": "This attribute is migrated to the Lp/n Eng Arc Ov attribute of the same name. This attribute specifies the maximum number of connections (both VCC and VPC) that can be enabled on the LogicalProcessor. If the LogicalProcessor is associated with a card of a cardType other than one of the following: 3pE3Atm, 3pDS3Atm, 3pOC3MmAtm, 3pOC3SmAtm, 3pE1Atm, 3pDS1Atm, 2pJ6MAtm; the value of the attribute restricts the sum of the (maxVccs + maxVpcs) across all AtmIfs bound to this LogicalProcessor. If the LogicalProcessor is associated with a card of one of the following cardTypes: 3pE3Atm, 3pDS3Atm, 3pOC3MmAtm, 3pOC3SmAtm, 3pE1Atm, 3pDS1Atm, 2pJ6MAtm; the number of available connections are distributed equally across the ports on the FP. The number of connections associated to a particular port will limit the size of the Vcc space defined by the ConnMap of the AtmIf linked to the port. Furthermore, the value of this attribute is restricted based on the number of ports on the card. For one port cards, the minimum is 512, the maximum is 4096 and the value must be divisible by 256. For two port cards, the minimum is 1024, the maximum is 8192 and the value must be divisible by 512. For three port cards, the minimum is 1536, the maximum is 7680 and the value must be divisible by 768. Increasing the value of this attribute reduces the CQM memory available for cell and frame free list. This attribute must be set to 0 is the connectionPoolCapacity attribute is set to non-zero values."
  },
  "mscLpArcMulticastBranchesCapacity": {
    "name": "mscLpArcMulticastBranchesCapacity",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.19.100.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 10752
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "obsolete",
    "description": "This attribute is migrated to the Lp/n Eng Arc Ov attribute of the same name. This attribute specifies the number of multicast branches that can be enabled on the Logical Processor. A multicast branch is used for cell replication on a Vcc connection whose Vcc distributionType is pointToMultipoint. A branch represent one ATM destination for the replicated cells Increasing the value of this attribute reduces the CQM memory available for the cell and frame free lists."
  },
  "mscLpArcTxFrameMemoryAllocation": {
    "name": "mscLpArcTxFrameMemoryAllocation",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.19.100.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 100
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 50,
        "format": "decimal"
      }
    },
    "maxaccess": "read-write",
    "status": "obsolete",
    "description": "This attribute is migrated to the Lp/n Eng Arc Ov attribute txCellMemoryAllocation. It is converted from frame percentage to cell percentage by subtracting this value from 100. This attribute specifies the percentage of the transmit CQM memory which should be allocated to the transmit frame free list on the ATM-FP. The remaining transmit CQM memory is allocated to the transmit cell free list. Frame memory is used for trunks, ATM VCC testing and for inter-card communication. There is an absolute minimum quantity of frame buffers which is required by ATM software on the FP. If the value of this attribute is smaller than the absolute minimum, the ATM software will allocate the minimum required, rather than the actual number requested. The actual percentage of the transmit CQM memory allocated to the transmit frame free list is indicated by the Aru txFrameMemoryAllocation attribute. A difference between the provisioned and the operational values may exist due to the requirement for a minimum number of frame buffers or rounding during computation within the FP."
  },
  "mscLpArcRxFrameMemoryAllocation": {
    "name": "mscLpArcRxFrameMemoryAllocation",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.19.100.1.20",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 100
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 80,
        "format": "decimal"
      }
    },
    "maxaccess": "read-write",
    "status": "obsolete",
    "description": "This attribute is migrated to the Lp/n Eng Arc Ov attribute rxCellMemoryAllocation. It is converted from frame percentage to cell percentage by subtracting this value from 100. This attribute specifies the percentage of the receive CQM memory which should be allocated to the receive frame free list on the ATM- FP. The remaining receive CQM memory is allocated to the receive cell free list. Frame memory is used for trunks, ATM VCC testing and for inter-card communication. There is an absolute minimum quantity of frame buffers which is required by ATM software on the FP. If the value of this attribute is smaller than the absolute minimum, the ATM software will allocate the minimum required, rather than the actual number requested. The actual percentage of the receive CQM memory allocated to the receive frame free list is indicated by the Aru rxFrameMemoryAllocation attribute. A difference between the provisioned and the operational values may exist due to the requirement for a minimum number of frame buffers or rounding during computation within the FP"
  },
  "mscLpArcPerVcQueueInterfaces": {
    "name": "mscLpArcPerVcQueueInterfaces",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.19.100.1.25",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 4
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "obsolete",
    "description": "This attribute is migrated to the Lp/n Eng Arc Cqc Ov attribute of the same name. This attribute specifies the number of independent ports or IMA components which support shaping and per-Vc queueing on the LogicalProcessor. When this attribute is not zero, at most 4 independent ports or 4 Ima virtual links are supported, regardless of whether or not traffic shaping is enabled on the associated AtmIf components. In this case only independent port instances 0-3 or Ima instances 0-3 can be supported on an associated AtmIf component. For 2 ports cards, the valid values for this attribute are 0, 1, or 2. For 3 ports cards, the valid values for this attribute are 0, 1, or 3. For 8 ports cards, the valid values for this attribute are 0, 1, 2, or 4."
  },
  "mscLpArcShapingStackAllocation": {
    "name": "mscLpArcShapingStackAllocation",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.19.100.1.30",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 1
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": "80",
        "format": "hex"
      }
    },
    "maxaccess": "read-write",
    "status": "obsolete",
    "description": "This attribute is migrated to the perVcQueueInterfaces attribute of the Lp/n Eng Arc Cqc Ov. Value ~0,~1,~2 is migrated to the value 0; value 0,~1,~2 is migrated to value 1; value 0,1,~2 is migrated to the value 2 and value 0,1,2 is migrated to the value 3 (for cardTypes 3pE3Atm, 3pDS3Atm, 3pOC3MmAtm, 3pOC3SmAtm, 3pE1Atm, 3pDS1Atm) or to the value 4 (for other cardTypes). This attribute specifies the allocation of shaping stack resources among the ports on this FP. Shaping stacks can currently be allocated on port 0, ports 0 and 1, or ports 0, 1 and 2. Allocating shaping stacks on a port allows the use of traffic shaping and per-Vc queueing on that port. Description of bits: n0(0) n1(1) n2(2)"
  },
  "mscLpArcShapingScalingFactor": {
    "name": "mscLpArcShapingScalingFactor",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.19.100.1.40",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "FixedPoint1",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 10,
            "max": 10
          },
          {
            "min": 14,
            "max": 14
          },
          {
            "min": 20,
            "max": 20
          },
          {
            "min": 28,
            "max": 28
          },
          {
            "min": 40,
            "max": 40
          },
          {
            "min": 56,
            "max": 56
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 10,
        "format": "decimal"
      }
    },
    "maxaccess": "read-write",
    "status": "obsolete",
    "description": "This attribute is migrated to the Lp/n Eng Arc Cqc Ov attribute of the same name. This attribute specifies the scaling factor which is to be applied to all shaping rates for this ATM-FP. The scaling factor is a multiplicative factor which is applied to the chosen shaping rate to produce an actual shaping rate. For example, if a shaping rate of 25 Mbps is used with a scaling factor of 2, the actual shaping rate is 12.5 Mbps."
  },
  "mscLpArcCdvAttenuation": {
    "name": "mscLpArcCdvAttenuation",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.19.100.1.41",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "off": 0,
          "on": 1
        }
      }
    },
    "default": {
      "default": {
        "value": "off",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "obsolete",
    "description": "This attribute is migrated to the Lp/n Eng Arc Cqc Ov attribute cdvReduction. This attribute enables the attenuation of the maximum Cell Delay Variation (CDV) of shaped transmit traffic. When the value of this attribute is set to off, the CDV value can be determined by the following equation: CDV <= 2/ASR + 1/LS where ASR is the Actual Shaping Rate of the connection and LS is the Link Speed of the interface. When the value of this attribute is set to on, the CDV relationship changes to the following equation: CDV <= 1/ASR + 1/LS As can be noted from the equations above, setting this attribute to on can reduce the CDV significantly. CDV attenuation may be used to conform to policers which have strict Cell Delay Variance Tolerance (CDVT). However using this function reduces the transmit bandwidth utilization of the following cards: 3pDS3Atm, 3pOC3Atm."
  },
  "mscLpArcPortAggregation": {
    "name": "mscLpArcPortAggregation",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.19.100.1.42",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "on": 0,
          "off": 1
        }
      }
    },
    "default": {
      "default": {
        "value": "on",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "obsolete",
    "description": "This attribute is migrated to the Lp/n Eng Arc Cqc Ov attribute portCongestionPolicy. This attribute specifies whether port aggregation is turned on or off for this ATM-FP. It applies only to transmit traffic served on the common queues and does not apply to perVc queues. When port aggregation is on, the enqueue decision of cells or frames to a common queue is based upon the congestion state of the entire port to which the queue belongs. A port is defined to be as congested as the most congested queue amongst all its queues: the low, medium and high emission priority queues. Thus, for example, if the low priority queue is congested, the high priority queue will also experience discards even though the high priority queue may itself not be congested. Setting port aggregation on assures that the low priority queues are also serviced in the event of congestion. When the value of this attribute is set to off, the enqueue decision of cells or frames to a common queue is based solely upon the congestion state of that queue, not the port. This setting assures that the absolute priority of the traffic is taken into account, regardless of whether or not the lower priority queues are being served."
  },
  "mscLpArcSubConnectionPoolCapacity": {
    "name": "mscLpArcSubConnectionPoolCapacity",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.19.100.1.43",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 8192
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 1024,
        "format": "decimal"
      }
    },
    "maxaccess": "read-write",
    "status": "obsolete",
    "description": "This attribute is migrated to the Lp/n Eng Fcrc Ov attribute of the same name. This attribute specifies the maximum number of sub-connections for the LogicalProcessor. A sub-connection is used for interworking the ATM services with the frame oriented services such as Frame Relay, and Path Oriented Routing System (PORS). When a frame is received at a sub- connection, the frame header is modified to be compatible with the service it is to be forwarded to. Due to limited resources, not all of the provisioned number of sub- connections may be allocated. The actual number of sub- connections allocated is indicated by the sum of Aru subConnectionPoolAvailable and Aru SubConnectionPoolUsage attributes. This pool is used for connection oriented services only. Each of the following components uses one sub-connection from this pool: FrAtm/x Dlci/y Siwf McsMgr Frf5EpG/x Frf5Ep/y Lmi McsMgr Frf5EpG/x Frf5Ep/y Dlci/z When the sub-connection pool is exhausted, no more connections will be accepted from the services which utilize this pool."
  },
  "mscLpArcLnnConnectionPoolCapacity": {
    "name": "mscLpArcLnnConnectionPoolCapacity",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.19.100.1.44",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 512
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 128,
        "format": "decimal"
      }
    },
    "maxaccess": "read-write",
    "status": "obsolete",
    "description": "This attribute is migrated to the Lp/n Eng Fcrc Ov attribute of the same name. This attribute specifies the maximum number of resource records for the connections which utilize Logical Network Number (LNN) on the LogicalProcessor. A logical network is a subset of passport modules together with a subset of trunks that interconnect those modules. It carries the traffic for a defined set of network protocols. A LNN is used to identify a logical network. The connectionless services which utilize the logical networks require some processing at the intermediate nodes. This pool is allocated at the intermediate nodes to sustain these connectionless services. Due to limited resources, not all of the provisioned number of LNN connection resource records may be allocated. The actual number of resource records allocated is indicated by the sum of Aru lnnConnectionPoolAvailable and Aru lnnConnectionPoolUsage attributes. If the McsMgr DprsMcsEpG/x Ep/y EpD transportConnectionPreference attribute is set to atmOnly, each instance of the McsMgr DprsMcsEpG/x Ep/y component uses one resource record from this pool."
  },
  "mscLpArcConnCapTable": {
    "name": "mscLpArcConnCapTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.19.291",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "obsolete",
    "description": "This attribute is migrated to the Lp/n Eng Arc Cqc Ov attribute of the same name. This attribute is provided for backward compatibility and can only be used if the LogicalProcessor is associated to a card of one of the following cardType: 3pE3Atm, 3pDS3Atm, 3pOC3MmAtm, 3pOC3SmAtm, 3pE1Atm, 3pDS1Atm, 2pJ6MAtm. This attribute can be used when the desired distribution of connections across ports cannot be achieved using the totalConnectionPoolCapacity attribute. This attribute defines the maximum number of connections (both VCC and VPC) that are available on each port. The entries are indexed by port number. This number limits the range of the ConnMap entries. Note that the value of this attribute must be evenly divisible by 256, and that port 2 supports at most 2560 connections, not the full 4096."
  },
  "mscLpArcConnCapEntry": {
    "name": "mscLpArcConnCapEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.19.291.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpArcIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpArcConnCapIndex",
        "implied": 0
      }
    ],
    "status": "obsolete",
    "description": "An entry in the mscLpArcConnCapTable."
  },
  "mscLpArcConnCapIndex": {
    "name": "mscLpArcConnCapIndex",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.19.291.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 2
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "obsolete",
    "description": "This variable represents the mscLpArcConnCapTable specific index for the mscLpArcConnCapTable."
  },
  "mscLpArcConnCapValue": {
    "name": "mscLpArcConnCapValue",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.19.291.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 0
          },
          {
            "min": 512,
            "max": 4096
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "obsolete",
    "description": "This variable represents an individual value for the mscLpArcConnCapTable."
  },
  "mscLpAru": {
    "name": "mscLpAru",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20",
    "class": "objectidentity"
  },
  "mscLpAruRowStatusTable": {
    "name": "mscLpAruRowStatusTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "obsolete",
    "description": "This entry controls the addition and deletion of mscLpAru components."
  },
  "mscLpAruRowStatusEntry": {
    "name": "mscLpAruRowStatusEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpAruIndex",
        "implied": 0
      }
    ],
    "status": "obsolete",
    "description": "A single entry in the table represents a single mscLpAru component."
  },
  "mscLpAruRowStatus": {
    "name": "mscLpAruRowStatus",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This variable is used as the basis for SNMP naming of mscLpAru components. These components cannot be added nor deleted."
  },
  "mscLpAruComponentName": {
    "name": "mscLpAruComponentName",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This variable provides the component's string name for use with the ASCII Console Interface"
  },
  "mscLpAruStorageType": {
    "name": "mscLpAruStorageType",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "StorageType",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This variable represents the storage type value for the mscLpAru tables."
  },
  "mscLpAruIndex": {
    "name": "mscLpAruIndex",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.1.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "NonReplicated",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "obsolete",
    "description": "This variable represents the index for the mscLpAru tables."
  },
  "mscLpAruOperTable": {
    "name": "mscLpAruOperTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.100",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "obsolete",
    "description": "This group describes the usage of ATM-specific resources on a Logical Processor running ATM services."
  },
  "mscLpAruOperEntry": {
    "name": "mscLpAruOperEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.100.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpAruIndex",
        "implied": 0
      }
    ],
    "status": "obsolete",
    "description": "An entry in the mscLpAruOperTable."
  },
  "mscLpAruTotalConnectionPoolUsage": {
    "name": "mscLpAruTotalConnectionPoolUsage",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.100.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 10752
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "If the LogicalProcessor is associated with a card of a cardType other than 4pE1Aal1 or 4pDS1Aal1, this attribute indicates the total number of enabled VCCs and VPCs in AtmIfs associated with this LogicalProcessor. An example of a VCC not in the enabled state is a VCC with a Test subcomponent. This attribute is equal to the sum of the AtmIf Ca connectionPoolUsage attributes of AtmIfs associated with this LogicalProcessor. If the LogicalProcessor is associated with a card of cardType 4pE1Aal1 or 4pDS1Aal1, this attribute indicates the total number of Ces components associated with this LogicalProcessor."
  },
  "mscLpAruMulticastBranchesUsage": {
    "name": "mscLpAruMulticastBranchesUsage",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.100.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 10752
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This attribute indicates the total number of multicast branches that are active on the Logical Processor."
  },
  "mscLpAruTxCellBlockCapacity": {
    "name": "mscLpAruTxCellBlockCapacity",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.100.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 8192
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This attribute indicates the amount of memory reserved for storing ATM cells to be transmitted by the Lp."
  },
  "mscLpAruTxCellBlockUsage": {
    "name": "mscLpAruTxCellBlockUsage",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.100.1.20",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 8192
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This attribute indicates the amount of memory currently being used to store ATM cells to be transmitted by the Lp."
  },
  "mscLpAruTxCellFreeListSize": {
    "name": "mscLpAruTxCellFreeListSize",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.100.1.23",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 16383
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This attribute indicates the current size of the transmit cell free list. The transmit cell free list is the memory available for storing ATM cells to be transmitted by the Lp."
  },
  "mscLpAruTxCellFreeListCongestionState": {
    "name": "mscLpAruTxCellFreeListCongestionState",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.100.1.26",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 3
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This attribute indicates the congestion state of the transmit cell free list on this ATM-FP. The congestion state of a free list is indicated by a numeric value ranging from 0 to 3. When a free list is in a congested state x, only traffic with discard priority (DP) 0 to x will be stored. Traffic with DP > x will be discarded. Therefore, if the congestion state is 3, there is no congestion and all traffic is stored. Likewise, when the congestion state is 0, there is maximum congestion and only traffic with DP=0 will be stored."
  },
  "mscLpAruTxFrameMemoryAllocation": {
    "name": "mscLpAruTxFrameMemoryAllocation",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.100.1.30",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 100
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This attribute defines the percentage of the transmit CQM memory which is allocated to the transmit frame free list on the ATM-FP. The remaining transmit CQM memory is allocated to the transmit cell free list. Frame memory is used for trunks, ATM Vcc testing and for inter-card communication."
  },
  "mscLpAruTxFrameBlockCapacity": {
    "name": "mscLpAruTxFrameBlockCapacity",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.100.1.40",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 8192
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This attribute indicates the amount of memory reserved for storing frames to be transmitted by the Lp."
  },
  "mscLpAruTxFrameBlockUsage": {
    "name": "mscLpAruTxFrameBlockUsage",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.100.1.50",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 8192
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This attribute indicates the amount of memory currently being used to store frames to be transmitted by the Lp."
  },
  "mscLpAruTxFrameFreeListSize": {
    "name": "mscLpAruTxFrameFreeListSize",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.100.1.53",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 16383
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This attribute indicates the current size of the transmit frame free list. The transmit frame free list is the memory (in ATM cells) available for storing frames to be transmitted by the Lp."
  },
  "mscLpAruTxFrameFreeListCongestionState": {
    "name": "mscLpAruTxFrameFreeListCongestionState",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.100.1.56",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 3
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This attribute indicates the congestion state of the transmit frame free list on this ATM-FP. The congestion state of a free list is indicated by a numeric value ranging from 0 to 3. When a free list is in a congested state x, only traffic with discard priority (DP) 0 to x will be stored. Traffic with DP > x will be discarded. Therefore, if the congestion state is 3, there is no congestion and all traffic is stored. Likewise, when the congestion state is 0, there is maximum congestion and only traffic with DP=0 will be stored."
  },
  "mscLpAruRxCellBlockCapacity": {
    "name": "mscLpAruRxCellBlockCapacity",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.100.1.60",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 8192
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This attribute indicates the amount of memory reserved for storing ATM cells received by the Lp."
  },
  "mscLpAruRxCellBlockUsage": {
    "name": "mscLpAruRxCellBlockUsage",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.100.1.70",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 8192
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This attribute indicates the amount of memory currently being used to store ATM cells received by the Lp."
  },
  "mscLpAruRxCellFreeListSize": {
    "name": "mscLpAruRxCellFreeListSize",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.100.1.73",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 16383
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This attribute indicates the current size of the receive cell free list. The receive cell free list is the memory available for storing ATM cells received by the Lp."
  },
  "mscLpAruRxCellFreeListCongestionState": {
    "name": "mscLpAruRxCellFreeListCongestionState",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.100.1.76",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 3
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This attribute indicates the congestion state of the receive cell free list on this ATM-FP. The congestion state of a free list is indicated by a numeric value ranging from 0 to 3. When a free list is in a congested state x, only traffic with discard priority (DP) 0 to x will be stored. Traffic with DP > x will be discarded. Therefore, if the congestion state is 3, there is no congestion and all traffic is stored. Likewise, when the congestion state is 0, there is maximum congestion and only traffic with DP=0 will be stored."
  },
  "mscLpAruRxFrameMemoryAllocation": {
    "name": "mscLpAruRxFrameMemoryAllocation",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.100.1.80",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 100
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This attribute indicates the percentage of the receive CQM memory which is allocated to the receive frame free list on the ATM-FP. The remaining receive CQM memory is allocated to the receive cell free list. Frame memory is used for trunks, ATM Vcc testing and for inter-card communication."
  },
  "mscLpAruRxFrameBlockCapacity": {
    "name": "mscLpAruRxFrameBlockCapacity",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.100.1.90",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 8192
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This attribute indicates the amount of memory reserved for storing frames received by the Lp."
  },
  "mscLpAruRxFrameBlockUsage": {
    "name": "mscLpAruRxFrameBlockUsage",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.100.1.100",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 8192
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This attribute indicates the amount of memory currently being used to store frames received by the Lp."
  },
  "mscLpAruRxFrameFreeListSize": {
    "name": "mscLpAruRxFrameFreeListSize",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.100.1.103",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 16383
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This attribute indicates the current size of the receive frame free list. The receive frame free list is the memory (in ATM cells) available for storing frames received by the Lp."
  },
  "mscLpAruRxFrameFreeListCongestionState": {
    "name": "mscLpAruRxFrameFreeListCongestionState",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.100.1.106",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 3
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This attribute indicates the congestion state of the receive frame free list on this ATM-FP. The congestion state of a free list is indicated by a numeric value ranging from 0 to 3. When a free list is in a congested state x, only traffic with discard priority (DP) 0 to x will be stored. Traffic with DP > x will be discarded. Therefore, if the congestion state is 3, there is no congestion and all traffic is stored. Likewise, when the congestion state is 0, there is maximum congestion and only traffic with DP=0 will be stored."
  },
  "mscLpAruSubConnectionPoolAvailable": {
    "name": "mscLpAruSubConnectionPoolAvailable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.100.1.107",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 8192
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This attribute indicates the number of sub-connections available for the LogicalProcessor. A sub-connection is used for interworking the ATM services with the frame oriented services such as Frame Relay, and Path Oriented Routing System (PORS). When a frame is received at a sub- connection, the frame header is modified to be compatible with the service it is to be forwarded to. This pool is used for connection oriented services only. Each of the following components uses one sub-connection from this pool: FrAtm/x Dlci/y Siwf McsMgr Frf5EpG/x Frf5Ep/y Lmi McsMgr Frf5EpG/x Frf5Ep/y Dlci/z Note when the value of this attribute reaches zero, no more connections will be accepted for any of the services which utilize this pool. To increase the size of this pool, use the Arc subConnectionPoolCapacity attribute."
  },
  "mscLpAruSubConnectionPoolUsage": {
    "name": "mscLpAruSubConnectionPoolUsage",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.100.1.108",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 8192
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This attribute indicates the number of sub-connections being utilized for the LogicalProcessor. A sub-connection is used for interworking the ATM services with the frame oriented services such as Frame Relay, and Path Oriented Routing System (PORS). When a frame is received at a sub- connection, the frame header is modified to be compatible with the service it is to be forwarded to. This pool is used for connection oriented services only. Each of the following components uses one sub-connection from this pool: FrAtm/x Dlci/y Siwf McsMgr Frf5EpG/x Frf5Ep/y Lmi McsMgr Frf5EpG/x Frf5Ep/y Dlci/z"
  },
  "mscLpAruLnnConnectionPoolAvailable": {
    "name": "mscLpAruLnnConnectionPoolAvailable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.100.1.109",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 512
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This attribute indicates the number of resource records available for the connections which utilize Logical Network Number (LNN) on the LogicalProcessor. A logical network is a subset of passport modules together with a subset of trunks that interconnect those modules. It carries the traffic for a defined set of network protocols. A LNN is used to identify a logical network. The connectionless services which utilize the logical networks require some processing at the intermediate nodes. This pool is allocated at the intermediate nodes to sustain these connectionless services. If the McsMgr DprsMcsEpG/x Ep/y EpD transportConnectionPreference attribute is set to atmOnly, each instance of the McsMgr DprsMcsEpG/x Ep/y component uses one resource record from this pool. Note, when the value of this attribute reaches zero, no more connections will be accepted for any of the services which utilize this pool. To increase the size of this pool, use the Arc lnnConnectionPoolCapacity attribute."
  },
  "mscLpAruLnnConnectionPoolUsage": {
    "name": "mscLpAruLnnConnectionPoolUsage",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.100.1.110",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 512
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This attribute indicates the number of resource records being utilized for the connections which use Logical Network Number (LNN) on the LogicalProcessor. A logical network is a subset of passport modules together with a subset of trunks that interconnect those modules. It carries the traffic for a defined set of network protocols. A LNN is used to identify a logical network. The connectionless services which utilize the logical networks require some processing at the intermediate nodes. This pool is applied at the intermediate nodes to sustain these connectionless services. If the McsMgr DprsMcsEpG/x Ep/y EpD transportConnectionPreference attribute is set to atmOnly, each instance of the McsMgr DprsMcsEpG/x Ep/y component uses one resource record from this pool."
  },
  "mscLpAruConnUsageTable": {
    "name": "mscLpAruConnUsageTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.292",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "obsolete",
    "description": "This attribute has been replaced by the set of AtmIf CA connectionPoolUsage attributes for AtmIf associated to independent links or IMA groups on this LogicalProcessor. The change better encapsulates the information associated with the AtmIf. This attribute indicates the number of connection identifiers (both VCC and VPC) that are in use on each port. The entries are indexed by port number."
  },
  "mscLpAruConnUsageEntry": {
    "name": "mscLpAruConnUsageEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.292.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpAruIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpAruConnUsageIndex",
        "implied": 0
      }
    ],
    "status": "obsolete",
    "description": "An entry in the mscLpAruConnUsageTable."
  },
  "mscLpAruConnUsageIndex": {
    "name": "mscLpAruConnUsageIndex",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.292.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 2
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "obsolete",
    "description": "This variable represents the mscLpAruConnUsageTable specific index for the mscLpAruConnUsageTable."
  },
  "mscLpAruConnUsageValue": {
    "name": "mscLpAruConnUsageValue",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.292.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 16000
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This variable represents an individual value for the mscLpAruConnUsageTable."
  },
  "mscLpAruTxCflThreshTable": {
    "name": "mscLpAruTxCflThreshTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.353",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "obsolete",
    "description": "This attribute indicates the maximum value of the txCellFreeListSize and the discard thresholds of the transmit cell free list. The transmit cell free list is the memory used for storing ATM cells to be transmitted by the Lp. The first value indicates the maximum size of the transmit cell free list. This is derived based upon the connectionPoolCapacity and the txFrameMemoryAllocation under the ARC component. When the txCellFreeListSize decreases to the second value, the txCellFreeListCongestionState changes from 3 to 2. In congestion state 2, traffic with discard priority (DP) = 3 is discarded. This threshold is set approximately at 25 percent of the first value, the maximum transmit cell free list size. When the txCellFreeListSize decreases to the third value, the txCellFreeListCongestionState changes from 2 to 1. In congestion state 1, traffic with discard priority (DP) = 2 is discarded. This threshold is set approximately at 20 percent of the first value, the maximum transmit cell free list size. When the txCellFreeListSize decreases to the fourth value, the txCellFreeListCongestionState changes from 1 to 0. In congestion state 0, traffic with discard priority (DP) = 1 is discarded. This threshold is set approximately at 10 percent of the first value, the maximum transmit cell free list size."
  },
  "mscLpAruTxCflThreshEntry": {
    "name": "mscLpAruTxCflThreshEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.353.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpAruIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpAruTxCflThreshIndex",
        "implied": 0
      }
    ],
    "status": "obsolete",
    "description": "An entry in the mscLpAruTxCflThreshTable."
  },
  "mscLpAruTxCflThreshIndex": {
    "name": "mscLpAruTxCflThreshIndex",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.353.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 3
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "obsolete",
    "description": "This variable represents the mscLpAruTxCflThreshTable specific index for the mscLpAruTxCflThreshTable."
  },
  "mscLpAruTxCflThreshValue": {
    "name": "mscLpAruTxCflThreshValue",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.353.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 16383
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This variable represents an individual value for the mscLpAruTxCflThreshTable."
  },
  "mscLpAruTxFflThreshTable": {
    "name": "mscLpAruTxFflThreshTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.354",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "obsolete",
    "description": "This attribute indicates the maximum txFrameFeeListSize and the discard thresholds of the transmit frame free list. The transmit frame free list is the memory (in units of ATM cells) used for storing frames to be transmitted by the Lp. The first parameter indicates the total size of the transmit frame free list. This is derived based upon the connectionPoolCapacity and the txFrameMemoryAllocation under the ARC component. When the txFrameFreeListSize decreases to the second value, the txFrameFreeListCongestionState changes from 3 to 2. In congestion state 2, traffic with discard priority (DP) = 3 is discarded. This threshold is set approximately at 25 percent of the first value, the maximum transmit frame free list size. When the txFrameFreeListSize decreases to the third value, the txFrameFreeListCongestionState changes from 2 to 1. In congestion state 1, traffic with discard priority (DP) = 2 is discarded. This threshold is set approximately at 20 percent of the first value, the maximum transmit frame free list size. When the txFameFreeListSize decreases to the fourth value, the txFameFreeListCongestionState changes from 1 to 0. In congestion state 0, traffic with discard priority (DP) = 1 is discarded. This threshold is set approximately at 10 percent of the first value, the maximum transmit frame free list size."
  },
  "mscLpAruTxFflThreshEntry": {
    "name": "mscLpAruTxFflThreshEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.354.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpAruIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpAruTxFflThreshIndex",
        "implied": 0
      }
    ],
    "status": "obsolete",
    "description": "An entry in the mscLpAruTxFflThreshTable."
  },
  "mscLpAruTxFflThreshIndex": {
    "name": "mscLpAruTxFflThreshIndex",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.354.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 3
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "obsolete",
    "description": "This variable represents the mscLpAruTxFflThreshTable specific index for the mscLpAruTxFflThreshTable."
  },
  "mscLpAruTxFflThreshValue": {
    "name": "mscLpAruTxFflThreshValue",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.354.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 16383
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This variable represents an individual value for the mscLpAruTxFflThreshTable."
  },
  "mscLpAruRxCflThreshTable": {
    "name": "mscLpAruRxCflThreshTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.355",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "obsolete",
    "description": "This attribute indicates the maximum value of the rxCellFreeListSize and the discard thresholds of the receive cell free list. The receive cell free list is the memory used for storing ATM cells to be received by the Lp. The first value indicates the maximum size of the recieve cell free list. This is derived based upon the connectionPoolCapacity and the rxFrameMemoryAllocation under the ARC component. When the rxCellFreeListSize decreases to the second value, the rxCellFreeListCongestionState changes from 3 to 2. In congestion state 2, traffic with discard priority (DP) = 3 is discarded. This threshold is set approximately at 25 percent of the first value, the maximum receive cell free list size. When the rxCellFreeListSize decreases to the third value, the rxCellFreeListCongestionState changes from 2 to 1. In congestion state 1, traffic with discard priority (DP) = 2 is discarded. This threshold is set approximately at 20 percent of the first value, the maximum receive cell free list size. When the rxCellFreeListSize decreases to the fourth value, the rxCellFreeListCongestionState changes from 1 to 0. In congestion state 0, traffic with discard priority (DP) = 1 is discarded. This threshold is set approximately at 10 percent of the first value, the maximum receive cell free list size."
  },
  "mscLpAruRxCflThreshEntry": {
    "name": "mscLpAruRxCflThreshEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.355.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpAruIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpAruRxCflThreshIndex",
        "implied": 0
      }
    ],
    "status": "obsolete",
    "description": "An entry in the mscLpAruRxCflThreshTable."
  },
  "mscLpAruRxCflThreshIndex": {
    "name": "mscLpAruRxCflThreshIndex",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.355.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 3
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "obsolete",
    "description": "This variable represents the mscLpAruRxCflThreshTable specific index for the mscLpAruRxCflThreshTable."
  },
  "mscLpAruRxCflThreshValue": {
    "name": "mscLpAruRxCflThreshValue",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.355.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 16383
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This variable represents an individual value for the mscLpAruRxCflThreshTable."
  },
  "mscLpAruRxFflThreshTable": {
    "name": "mscLpAruRxFflThreshTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.356",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "obsolete",
    "description": "This attribute indicates the maximum rxFrameFeeListSize and the discard thresholds of the transmit frame free list. The receive frame free list is the memory (in units of ATM cells) used for storing frames to be received by the Lp. The first parameter indicates the total size of the receive frame free list. This is derived based upon the connectionPoolCapacity and the rxFrameMemoryAllocation under the ARC component. When the rxFrameFreeListSize decreases to the second value, the rxFrameFreeListCongestionState changes from 3 to 2. In congestion state 2, traffic with discard priority (DP) = 3 is discarded. This threshold is set approximately at 25 percent of the first value, the maximum receive frame free list size. When the rxFrameFreeListSize decreases to the third value, the rxFrameFreeListCongestionState changes from 2 to 1. In congestion state 1, traffic with discard priority (DP) = 2 is discarded. This threshold is set approximately at 20 percent of the first value, the maximum receive frame free list size. When the rxFameFreeListSize decreases to the fourth value, the rxFameFreeListCongestionState changes from 1 to 0. In congestion state 0, traffic with discard priority (DP) = 1 is discarded. This threshold is set approximately at 10 percent of the first value, the maximum receive frame free list size."
  },
  "mscLpAruRxFflThreshEntry": {
    "name": "mscLpAruRxFflThreshEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.356.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpAruIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpAruRxFflThreshIndex",
        "implied": 0
      }
    ],
    "status": "obsolete",
    "description": "An entry in the mscLpAruRxFflThreshTable."
  },
  "mscLpAruRxFflThreshIndex": {
    "name": "mscLpAruRxFflThreshIndex",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.356.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 3
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "obsolete",
    "description": "This variable represents the mscLpAruRxFflThreshTable specific index for the mscLpAruRxFflThreshTable."
  },
  "mscLpAruRxFflThreshValue": {
    "name": "mscLpAruRxFflThreshValue",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.20.356.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 16383
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "obsolete",
    "description": "This variable represents an individual value for the mscLpAruRxFflThreshTable."
  },
  "mscLpEngArc": {
    "name": "mscLpEngArc",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5",
    "class": "objectidentity"
  },
  "mscLpEngArcRowStatusTable": {
    "name": "mscLpEngArcRowStatusTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This entry controls the addition and deletion of mscLpEngArc components."
  },
  "mscLpEngArcRowStatusEntry": {
    "name": "mscLpEngArcRowStatusEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpEngIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcIndex",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "A single entry in the table represents a single mscLpEngArc component."
  },
  "mscLpEngArcRowStatus": {
    "name": "mscLpEngArcRowStatus",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "This variable is used as the basis for SNMP naming of mscLpEngArc components. These components can be added and deleted."
  },
  "mscLpEngArcComponentName": {
    "name": "mscLpEngArcComponentName",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This variable provides the component's string name for use with the ASCII Console Interface"
  },
  "mscLpEngArcStorageType": {
    "name": "mscLpEngArcStorageType",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "StorageType",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This variable represents the storage type value for the mscLpEngArc tables."
  },
  "mscLpEngArcIndex": {
    "name": "mscLpEngArcIndex",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.1.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "NonReplicated",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This variable represents the index for the mscLpEngArc tables."
  },
  "mscLpEngArcOperTable": {
    "name": "mscLpEngArcOperTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.10",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This group describes the usage of ATM-specific resources on a Logical Processor running ATM services. The attributes listed represent Queue Controller resource usage for all ATM Cards (CQC for CQC based cards or PQC for SGAF cards)."
  },
  "mscLpEngArcOperEntry": {
    "name": "mscLpEngArcOperEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.10.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpEngIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcIndex",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "An entry in the mscLpEngArcOperTable."
  },
  "mscLpEngArcTotalConnectionPoolAvailable": {
    "name": "mscLpEngArcTotalConnectionPoolAvailable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.10.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 32768
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates the number of connection resources available (VCC, VPC, and VPT) that can be used on this FP. A standard Vpt uses 3 connection resources and a basic Vpt uses 2."
  },
  "mscLpEngArcTotalConnectionPoolUsage": {
    "name": "mscLpEngArcTotalConnectionPoolUsage",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.10.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 32768
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates the number of connection resources (VCC, VPC, and VPT) in use on this FP. A standard Vpt uses 3 connection resources and a basic Vpt uses 2."
  },
  "mscLpEngArcMulticastBranchesAvailable": {
    "name": "mscLpEngArcMulticastBranchesAvailable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.10.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 16384
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates the total number of multicast branches that are available on this FP."
  },
  "mscLpEngArcMulticastBranchesUsage": {
    "name": "mscLpEngArcMulticastBranchesUsage",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.10.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 16384
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates the total number of multicast branches that are active on this FP."
  },
  "mscLpEngArcTxCellMemoryAllocation": {
    "name": "mscLpEngArcTxCellMemoryAllocation",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.10.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 99
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates the fraction of the transmit memory which is allocated for the transmission of cells on the FP. Cell memory is used for Atm Bearer Services, ATM SVCs and ATM PVCs. The remaining transmit memory is allocated for the transmission of frames. Frame memory is used for trunks, ATM VCC testing and for inter-card communication."
  },
  "mscLpEngArcTxCellMemoryAvailable": {
    "name": "mscLpEngArcTxCellMemoryAvailable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.10.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 163839
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates the current availability of the transmit cell memory. The transmit cell memory is the memory available for storing ATM cells to be transmitted by this FP."
  },
  "mscLpEngArcTxCellMemoryMinAvailable": {
    "name": "mscLpEngArcTxCellMemoryMinAvailable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.10.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 163839
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates the lowest availability of the transmit cell memory. The transmit cell memory is the memory available for storing ATM cells to be transmitted by this FP. This value is reset to the current availability every 15 minutes and when the card is reset."
  },
  "mscLpEngArcTxCellMemoryCongestionState": {
    "name": "mscLpEngArcTxCellMemoryCongestionState",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.10.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 3
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates the congestion state of the transmit cell memory on this FP. The congestion state of memory is indicated by a numeric value ranging from 0 to 3. When memory is in a congested state 'x', only traffic with discard priority (DP) 0 to 'x' is processed. Traffic with DP > 'x' is discarded. Therefore, if the congestion state is 3, there is no congestion and all traffic is stored. Likewise, when the congestion state is 0, there is maximum congestion and only traffic with DP=0 is stored."
  },
  "mscLpEngArcRxCellMemoryAllocation": {
    "name": "mscLpEngArcRxCellMemoryAllocation",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.10.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 99
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates the fraction of the receive memory which is allocated for the reception of cells on the FP. Cell memory is used for Atm Bearer Services, ATM SVCS and ATM PVCS. The remaining receive memory is allocated to the reception of frame. Frame memory is used for trunks, ATM VCC testing and for inter-card communication."
  },
  "mscLpEngArcRxCellMemoryAvailable": {
    "name": "mscLpEngArcRxCellMemoryAvailable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.10.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 163839
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates the current availability of the receive cell memory. The receive cell memory is the memory available for storing ATM cells to be transmitted by this FP."
  },
  "mscLpEngArcRxCellMemoryMinAvailable": {
    "name": "mscLpEngArcRxCellMemoryMinAvailable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.10.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 163839
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates the lowest availability of the receive cell memory. The receive cell memory is the memory available for storing ATM cells to be transmitted by this FP. This value is reset to the current availability every 15 minutes and when the card is reset."
  },
  "mscLpEngArcRxCellMemoryCongestionState": {
    "name": "mscLpEngArcRxCellMemoryCongestionState",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.10.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 3
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates the congestion state of the receive cell memory on this FP. The congestion state of memory is indicated by a numeric value ranging from 0 to 3. When memory is in a congested state 'x', only traffic with discard priority (DP) 0 to 'x' is processed. Traffic with DP > 'x' is discarded. Therefore, if the congestion state is 3, there is no congestion and all traffic is stored. Likewise, when the congestion state is 0, there is maximum congestion and only traffic with DP=0 is stored."
  },
  "mscLpEngArcTxCellThreshTable": {
    "name": "mscLpEngArcTxCellThreshTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.440",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This attribute indicates the total transmit cell memory size and the discard thresholds of the transmit cell memory. The transmit cell memory is the memory used for storing ATM cells to be transmitted by this FP. The first value indicates the the total transmit cell memory size. This is derived based upon the connectionPoolCapacity and the txCellMemoryAllocation attributes. When the txCellMemoryAvailable attribute decreases to the second value, the txCellMemoryCongestionState changes from 3 to 2. In congestion state 2, traffic with discard priority (DP) = 3 is discarded. This threshold is set approximately at 25 percent of the first value, the total transmit cell memory size. When the txCellMemoryAvailable attribute decreases to the third value, the txCellMemoryCongestionState changes from 2 to 1. In congestion state 1, traffic with discard priority (DP) >= 2 is discarded. This threshold is set approximately at 20 percent of the first value, the total transmit cell memory size. When the txCellMemoryAvailable attribute decreases to the fourth value, the txCellMemoryCongestionState changes from 1 to 0. In congestion state 0, traffic with discard priority (DP) >= 1 is discarded. This threshold is set approximately at 10 percent of the first value, the total transmit cell memory size. The opposite effect occurs when the txCellMemoryAvailable attribute increases (txCellMemoryCongestionState increases from 0 to 3 accordingly)."
  },
  "mscLpEngArcTxCellThreshEntry": {
    "name": "mscLpEngArcTxCellThreshEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.440.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpEngIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcTxCellThreshIndex",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "An entry in the mscLpEngArcTxCellThreshTable."
  },
  "mscLpEngArcTxCellThreshIndex": {
    "name": "mscLpEngArcTxCellThreshIndex",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.440.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 3
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This variable represents the mscLpEngArcTxCellThreshTable specific index for the mscLpEngArcTxCellThreshTable."
  },
  "mscLpEngArcTxCellThreshValue": {
    "name": "mscLpEngArcTxCellThreshValue",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.440.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 163839
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This variable represents an individual value for the mscLpEngArcTxCellThreshTable."
  },
  "mscLpEngArcRxCellThreshTable": {
    "name": "mscLpEngArcRxCellThreshTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.444",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This attribute indicates the total receive cell memory size and the discard thresholds of the receive cell memory. The receive cell memory is the memory used for storing ATM cells to be received by this FP. The first value indicates the total receive cell memory size. This is derived based upon the connectionPoolCapacity and the rxCellMemoryAllocation under the ARC component. When the rxCellMemoryAvailable attribute decreases to the second value, the rxCellMemoryCongestionState changes from 3 to 2. In congestion state 2, traffic with discard priority (DP) = 3 is discarded. This threshold is set approximately at 25 percent of the first value, the total receive cell memory size. When the rxCellMemoryAvailable attribute decreases to the third value, the rxCellMemoryCongestionState changes from 2 to 1. In congestion state 1, traffic with discard priority (DP) >= 2 is discarded. This threshold is set approximately at 20 percent of the first value, the total receive cell memory size. When the rxCellMemoryAvailable attribute decreases to the fourth value, the rxCellMemoryCongestionState changes from 1 to 0. In congestion state 0, traffic with discard priority (DP) >= 1 is discarded. This threshold is set approximately at 10 percent of the first value, the total receive cell memory size. The opposite effect occurs when the rxCellMemoryAvailable attribute increases (rxCellMemoryCongestionState increases from 0 to 3 accordingly)."
  },
  "mscLpEngArcRxCellThreshEntry": {
    "name": "mscLpEngArcRxCellThreshEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.444.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpEngIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcRxCellThreshIndex",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "An entry in the mscLpEngArcRxCellThreshTable."
  },
  "mscLpEngArcRxCellThreshIndex": {
    "name": "mscLpEngArcRxCellThreshIndex",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.444.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 3
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This variable represents the mscLpEngArcRxCellThreshTable specific index for the mscLpEngArcRxCellThreshTable."
  },
  "mscLpEngArcRxCellThreshValue": {
    "name": "mscLpEngArcRxCellThreshValue",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.444.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 163839
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This variable represents an individual value for the mscLpEngArcRxCellThreshTable."
  },
  "mscLpEngArcOv": {
    "name": "mscLpEngArcOv",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.2",
    "class": "objectidentity"
  },
  "mscLpEngArcOvRowStatusTable": {
    "name": "mscLpEngArcOvRowStatusTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.2.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This entry controls the addition and deletion of mscLpEngArcOv components."
  },
  "mscLpEngArcOvRowStatusEntry": {
    "name": "mscLpEngArcOvRowStatusEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.2.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpEngIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcOvIndex",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "A single entry in the table represents a single mscLpEngArcOv component."
  },
  "mscLpEngArcOvRowStatus": {
    "name": "mscLpEngArcOvRowStatus",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.2.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "This variable is used as the basis for SNMP naming of mscLpEngArcOv components. These components can be added and deleted."
  },
  "mscLpEngArcOvComponentName": {
    "name": "mscLpEngArcOvComponentName",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.2.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This variable provides the component's string name for use with the ASCII Console Interface"
  },
  "mscLpEngArcOvStorageType": {
    "name": "mscLpEngArcOvStorageType",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.2.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "StorageType",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This variable represents the storage type value for the mscLpEngArcOv tables."
  },
  "mscLpEngArcOvIndex": {
    "name": "mscLpEngArcOvIndex",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.2.1.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "NonReplicated",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This variable represents the index for the mscLpEngArcOv tables."
  },
  "mscLpEngArcOvProvTable": {
    "name": "mscLpEngArcOvProvTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.2.10",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This group specifies the configuration of processor-wide ATM- specific resources on a Logical Processor running ATM services on ATM cards. Note that altering any of these parameters will result in a card reboot."
  },
  "mscLpEngArcOvProvEntry": {
    "name": "mscLpEngArcOvProvEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.2.10.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpEngIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcOvIndex",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "An entry in the mscLpEngArcOvProvTable."
  },
  "mscLpEngArcOvTotalConnectionPoolCapacity": {
    "name": "mscLpEngArcOvTotalConnectionPoolCapacity",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.2.10.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 32768
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 3072,
        "format": "decimal"
      }
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "This attribute specifies the maximum number of connections (VCC, VPC and VPT) that can be enabled on this FP.A standard Vpt uses 3 connections and a basic Vpt uses 2. If the LogicalProcessor is associated with a card of a cardType other than one of the following: 3pE3Atm, 3pDS3Atm, 3pOC3MmAtm, 3pOC3SmAtm, 3pE1Atm, 3pDS1Atm, 2pJ6MAtm; the value of the attribute restricts the sum of the (maxVccs + maxVpcs + (maxVpts * 3)) across all AtmIfs bound to this LogicalProcessor. If the LogicalProcessor is associated with a card of one of the following cardTypes: 3pE3Atm, 3pDS3Atm, 3pOC3MmAtm, 3pOC3SmAtm, 3pE1Atm, 3pDS1Atm, 2pJ6MAtm; the number of available connections are distributed equally across the ports on the FP. The number of connections associated to a particular port limits the size of the Vcc space which can be defined by the ConnMap of the AtmIf linked to the port. If the ConnMap component does not exist, its default settings are used for this check. Furthermore, the value of this attribute is restricted based on the number of ports on the card. For one port cards, the minimum is 512, the maximum is 4096 and the value must be divisible by 256. For two port cards, the minimum is 1024, the maximum is 8192 and the value must be divisible by 512. For three port cards, the minimum is 1536, the maximum is 7680 and the value must be divisible by 768. If the LogicalProcessor is associated with a card of one of the following cardTypes: 8pE1Atm, 8pDS1Atm, the maximum value for this attribute is 10752. For SGAF cards, the Connmap attributes are set to their default values. Increasing the value of this attribute reduces the memory available for cell and frame memory. This attribute must be set to 0 if the connectionPoolCapacity attribute of the Arc Ov component is set to non-zero values."
  },
  "mscLpEngArcOvMulticastBranchesCapacity": {
    "name": "mscLpEngArcOvMulticastBranchesCapacity",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.2.10.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 16384
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "This attribute specifies the number of multicast branches that can be enabled on this FP. A multicast branch is used for cell replication on a VCC connection whose Vcc distributionType is pointToMultipoint. A branch represents one ATM destination for the replicated cells. Increasing the value of this attribute reduces the memory available for the cell and frame memorys. This attribute is ignored for the 1pOC48SmSrAtm card as it does not support multicast connections. For CQC based ATM FPs, the maximum value for this attribute is 10752."
  },
  "mscLpEngArcOvTxCellMemoryAllocation": {
    "name": "mscLpEngArcOvTxCellMemoryAllocation",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.2.10.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 99
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 50,
        "format": "decimal"
      }
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "This attribute specifies the fraction of the transmit memory which should be allocated to the transmission of cells on an FP. The remaining memory is allocated for the transmission of frames. Frame memory is used for trunks, ATM VCC testing and for inter- card communication. Cell memory is used for Atm Bearer Service, ATM SVCs and ATM PVCs. There is an absolute minimum quantity of frame buffers which is required by ATM software on the FP. If the value of this attribute is smaller than the absolute minimum, the ATM software allocates the minimum required, rather than the actual number requested. The actual percentage of the transmit memory allocated to the transmit cell memory is indicated by the Arc txCellMemoryAllocation attribute. A difference between the provisioned and the operational values may exist due to the requirement for a minimum number of frame buffers or rounding during computation within the FP."
  },
  "mscLpEngArcOvRxCellMemoryAllocation": {
    "name": "mscLpEngArcOvRxCellMemoryAllocation",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.2.10.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 99
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 20,
        "format": "decimal"
      }
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "This attribute specifies the fraction of the receive memory which should be allocated to the reception of cells on an FP. The remaining receive memory is allocated for the reception of frames. Frame memory is used for trunks, ATM VCC testing and for inter- card communication. Cell memory is used for Atm Bearer Service, ATM SVCs and ATM PVCs. There is an absolute minimum quantity of frame buffers which is required by ATM software on the FP. If the value of this attribute is smaller than the absolute minimum, the ATM software allocates the minimum required, rather than the actual number requested. The actual percentage of the receive memory allocated to the receive cell memory is indicated by the Arc rxCellMemoryAllocation attribute. A difference between the provisioned and the operational values may exist due to the requirement for a minimum number of frame buffers or rounding during computation within the FP."
  },
  "mscLpEngArcCqc": {
    "name": "mscLpEngArcCqc",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.3",
    "class": "objectidentity"
  },
  "mscLpEngArcCqcRowStatusTable": {
    "name": "mscLpEngArcCqcRowStatusTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.3.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This entry controls the addition and deletion of mscLpEngArcCqc components."
  },
  "mscLpEngArcCqcRowStatusEntry": {
    "name": "mscLpEngArcCqcRowStatusEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.3.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpEngIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcCqcIndex",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "A single entry in the table represents a single mscLpEngArcCqc component."
  },
  "mscLpEngArcCqcRowStatus": {
    "name": "mscLpEngArcCqcRowStatus",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.3.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "This variable is used as the basis for SNMP naming of mscLpEngArcCqc components. These components can be added and deleted."
  },
  "mscLpEngArcCqcComponentName": {
    "name": "mscLpEngArcCqcComponentName",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.3.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This variable provides the component's string name for use with the ASCII Console Interface"
  },
  "mscLpEngArcCqcStorageType": {
    "name": "mscLpEngArcCqcStorageType",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.3.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "StorageType",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This variable represents the storage type value for the mscLpEngArcCqc tables."
  },
  "mscLpEngArcCqcIndex": {
    "name": "mscLpEngArcCqcIndex",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.3.1.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "NonReplicated",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This variable represents the index for the mscLpEngArcCqc tables."
  },
  "mscLpEngArcCqcOperTable": {
    "name": "mscLpEngArcCqcOperTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.3.10",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This group describes the usage of ATM-specific resources on a Logical Processor running ATM services on a CQC based card."
  },
  "mscLpEngArcCqcOperEntry": {
    "name": "mscLpEngArcCqcOperEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.3.10.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpEngIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcCqcIndex",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "An entry in the mscLpEngArcCqcOperTable."
  },
  "mscLpEngArcCqcCdvReduction": {
    "name": "mscLpEngArcCqcCdvReduction",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.3.10.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "disabled": 0,
          "enabled": 1,
          "cardDependent": 2
        }
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates if the reduction of the maximum Cell Delay Variation (CDV) of shaped transmit traffic is applicable. When the value of this attribute is disabled, the CDV value can be determined by the following equation: CDV <= 2/ASR + 1/LS where ASR is the Actual Shaping Rate of the connection and LS is the Link Speed of the interface. When the value of this attribute is enabled, the CDV relationship changes to the following equation: CDV <= 1/ASR + 1/LS"
  },
  "mscLpEngArcCqcOv": {
    "name": "mscLpEngArcCqcOv",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.3.2",
    "class": "objectidentity"
  },
  "mscLpEngArcCqcOvRowStatusTable": {
    "name": "mscLpEngArcCqcOvRowStatusTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.3.2.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This entry controls the addition and deletion of mscLpEngArcCqcOv components."
  },
  "mscLpEngArcCqcOvRowStatusEntry": {
    "name": "mscLpEngArcCqcOvRowStatusEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.3.2.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpEngIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcCqcIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcCqcOvIndex",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "A single entry in the table represents a single mscLpEngArcCqcOv component."
  },
  "mscLpEngArcCqcOvRowStatus": {
    "name": "mscLpEngArcCqcOvRowStatus",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.3.2.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This variable is used as the basis for SNMP naming of mscLpEngArcCqcOv components. These components cannot be added nor deleted."
  },
  "mscLpEngArcCqcOvComponentName": {
    "name": "mscLpEngArcCqcOvComponentName",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.3.2.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This variable provides the component's string name for use with the ASCII Console Interface"
  },
  "mscLpEngArcCqcOvStorageType": {
    "name": "mscLpEngArcCqcOvStorageType",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.3.2.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "StorageType",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This variable represents the storage type value for the mscLpEngArcCqcOv tables."
  },
  "mscLpEngArcCqcOvIndex": {
    "name": "mscLpEngArcCqcOvIndex",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.3.2.1.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "NonReplicated",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This variable represents the index for the mscLpEngArcCqcOv tables."
  },
  "mscLpEngArcCqcOvProvTable": {
    "name": "mscLpEngArcCqcOvProvTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.3.2.10",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This group specifies the configuration of processor-wide ATM- specific resources on a Logical Processor running ATM services. Note that altering any of these parameters will result in a card reboot."
  },
  "mscLpEngArcCqcOvProvEntry": {
    "name": "mscLpEngArcCqcOvProvEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.3.2.10.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpEngIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcCqcIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcCqcOvIndex",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "An entry in the mscLpEngArcCqcOvProvTable."
  },
  "mscLpEngArcCqcOvPerVcQueueInterfaces": {
    "name": "mscLpEngArcCqcOvPerVcQueueInterfaces",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.3.2.10.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 4
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "This attribute specifies the number of independent ports or IMA components which support shaping and per-VC queueing on this FP. When this attribute is not zero, at most 4 independent ports or 4 Ima virtual links are supported, regardless of whether or not traffic shaping is enabled on the associated AtmIf components. In this case only independent port instances 0-3 or Ima instances 0-3 can be supported on an associated AtmIf component. For 2 ports cards, the valid values for this attribute are 0, 1, or 2. For 3 ports cards, the valid values for this attribute are 0, 1, 2 or 3. For 8 ports cards, the valid values for this attribute are 0, 1, 2, or 4."
  },
  "mscLpEngArcCqcOvShapingScalingFactor": {
    "name": "mscLpEngArcCqcOvShapingScalingFactor",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.3.2.10.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "FixedPoint1",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 10,
            "max": 10
          },
          {
            "min": 14,
            "max": 14
          },
          {
            "min": 20,
            "max": 20
          },
          {
            "min": 28,
            "max": 28
          },
          {
            "min": 40,
            "max": 40
          },
          {
            "min": 56,
            "max": 56
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 10,
        "format": "decimal"
      }
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "This attribute specifies the scaling factor which is to be applied to all shaping rates for this FP. The scaling factor is an inverse factor which is applied to the chosen shaping rate to produce an actual shaping rate. For example, if a shaping rate of 25 Mbit/s is used with a scaling factor of 2, the actual shaping rate is 12.5 Mbit/s."
  },
  "mscLpEngArcCqcOvCdvReduction": {
    "name": "mscLpEngArcCqcOvCdvReduction",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.3.2.10.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "disabled": 0,
          "enabled": 1,
          "cardDependent": 2
        }
      }
    },
    "default": {
      "default": {
        "value": "cardDependent",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "This attribute specifies the reduction of the maximum Cell Delay Variation (CDV) of shaped transmit traffic. When the value of this attribute is set to disabled, the CDV value can be determined by the following equation: CDV <= 2/ASR + 1/LS where ASR is the Actual Shaping Rate of the connection and LS is the Link Speed of the interface. When the value of this attribute is set to enabled, the CDV relationship changes to the following equation: CDV <= 1/ASR + 1/LS As can be noted from the equations above, setting this attribute to enabled can reduce the CDV significantly. CDV reduction may be used to conform to policers which have strict Cell Delay Variance Tolerance (CDVT). However using this function reduces the transmit bandwidth utilization of the following cards: 3pDS3Atm, 3pOC3Atm, 2pJ6MAtm. When the value is cardDependent, CDV reduction is disabled for cardtypes 3pDS3Atm, 3pOC3Atm, 2pJ6MAtm, 4pDS1Aal1, 4pE1Aal1 and enabled for all other cards."
  },
  "mscLpEngArcCqcOvPortCongestionPolicy": {
    "name": "mscLpEngArcCqcOvPortCongestionPolicy",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.3.2.10.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "aggregate": 0,
          "individualQueue": 1
        }
      }
    },
    "default": {
      "default": {
        "value": "aggregate",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "This attribute specifies the congestion behavior of all ports on this FP. It applies only to transmit traffic served on the common queues and does not apply to per-VC queues. When the value is aggregate, the enqueue decision of cells or frames to a common queue is based upon the congestion state of the entire port to which the queue belongs. A port is defined to be as congested as the most congested queue amongst all its common queues: the low, medium and high emission priority queues. Thus, for example, if the low priority queue is congested, the high priority queue also experiences discards even though the high priority queue may itself not be congested. Setting this attribute to aggregate assures that the low priority queues are also serviced in the event of congestion. When the value of this attribute is set to individualQueue, the enqueue decision of cells or frames to a common queue is based solely upon the congestion state of that queue, not the port. This setting assures that the absolute priority of the traffic is taken into account, regardless of whether the lower priority queues are being served."
  },
  "mscLpEngArcCqcOvConnCapTable": {
    "name": "mscLpEngArcCqcOvConnCapTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.3.2.450",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This attribute is provided for backward compatibility and can only be used if the LogicalProcessor is associated with a card of one of the following cardType: 3pE3Atm, 3pDS3Atm, 3pOC3MmAtm, 3pOC3SmAtm, 3pE1Atm, 3pDS1Atm, 2pJ6MAtm. This attribute can be used when the desired distribution of connections across ports cannot be achieved using the totalConnectionPoolCapacity attribute. This attribute defines the maximum number of connections (VCC, VPC and VPT) that are available on each port. A basic Vpt uses 2 connections. The entries are indexed by port number. This number limits the range of the ConnMap entries. If the Connmap component does not exist, its default settings are used for this check. Note that the value of this attribute must be evenly divisible by 256, and that port 2 supports at most 2560 connections, not the full 4096. The connection pool for each port must be set to 0 if the totalConnectionPoolCapacity attribute is set to a non-zero value."
  },
  "mscLpEngArcCqcOvConnCapEntry": {
    "name": "mscLpEngArcCqcOvConnCapEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.3.2.450.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpEngIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcCqcIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcCqcOvIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcCqcOvConnCapIndex",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "An entry in the mscLpEngArcCqcOvConnCapTable."
  },
  "mscLpEngArcCqcOvConnCapIndex": {
    "name": "mscLpEngArcCqcOvConnCapIndex",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.3.2.450.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 2
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This variable represents the mscLpEngArcCqcOvConnCapTable specific index for the mscLpEngArcCqcOvConnCapTable."
  },
  "mscLpEngArcCqcOvConnCapValue": {
    "name": "mscLpEngArcCqcOvConnCapValue",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.3.2.450.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 0
          },
          {
            "min": 512,
            "max": 4096
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "This variable represents an individual value for the mscLpEngArcCqcOvConnCapTable."
  },
  "mscLpEngArcAqm": {
    "name": "mscLpEngArcAqm",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.4",
    "class": "objectidentity"
  },
  "mscLpEngArcAqmRowStatusTable": {
    "name": "mscLpEngArcAqmRowStatusTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.4.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This entry controls the addition and deletion of mscLpEngArcAqm components."
  },
  "mscLpEngArcAqmRowStatusEntry": {
    "name": "mscLpEngArcAqmRowStatusEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.4.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpEngIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcAqmIndex",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "A single entry in the table represents a single mscLpEngArcAqm component."
  },
  "mscLpEngArcAqmRowStatus": {
    "name": "mscLpEngArcAqmRowStatus",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.4.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "This variable is used as the basis for SNMP naming of mscLpEngArcAqm components. These components can be added and deleted."
  },
  "mscLpEngArcAqmComponentName": {
    "name": "mscLpEngArcAqmComponentName",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.4.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This variable provides the component's string name for use with the ASCII Console Interface"
  },
  "mscLpEngArcAqmStorageType": {
    "name": "mscLpEngArcAqmStorageType",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.4.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "StorageType",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This variable represents the storage type value for the mscLpEngArcAqm tables."
  },
  "mscLpEngArcAqmIndex": {
    "name": "mscLpEngArcAqmIndex",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.4.1.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 3
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This variable represents the index for the mscLpEngArcAqm tables."
  },
  "mscLpEngArcAqmOperTable": {
    "name": "mscLpEngArcAqmOperTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.4.10",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This group describes the usage of ATM-specific resources for a specific AQM on a Logical Processor running ATM services."
  },
  "mscLpEngArcAqmOperEntry": {
    "name": "mscLpEngArcAqmOperEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.4.10.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpEngIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcAqmIndex",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "An entry in the mscLpEngArcAqmOperTable."
  },
  "mscLpEngArcAqmConnectionPoolAvailable": {
    "name": "mscLpEngArcAqmConnectionPoolAvailable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.4.10.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 16000
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates the number of connection resources available (VCC, VPC and VPT) that can be configured on the AQM instance of the LogicalProcessor. A standard Vpt uses 3 connection resources and a basic Vpt uses 2."
  },
  "mscLpEngArcAqmConnectionPoolUsage": {
    "name": "mscLpEngArcAqmConnectionPoolUsage",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.4.10.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 16000
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates the total number of configured VCCs, VPCs and VPTs in AtmIfs associated with the AQM instance of the LogicalProcessor. A standard Vpt uses 3 connection resources and a basic Vpt uses 2."
  },
  "mscLpEngArcAqmTxCellMemoryAvailable": {
    "name": "mscLpEngArcAqmTxCellMemoryAvailable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.4.10.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 163839
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates the current availability of the transmit cell memory. The transmit cell memory is the memory available for storing ATM cells to be transmitted by the Lp."
  },
  "mscLpEngArcAqmTxCellMemoryMinAvailable": {
    "name": "mscLpEngArcAqmTxCellMemoryMinAvailable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.4.10.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 163839
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates the lowest availability of the transmit cell memory. The transmit cell memory is the memory available for storing ATM cells to be transmitted by the Lp. This attribute is reset to the current availability every 15 minutes and when the card is reset."
  },
  "mscLpEngArcAqmTxCellMemoryCongestionState": {
    "name": "mscLpEngArcAqmTxCellMemoryCongestionState",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.4.10.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 3
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates the congestion state of the transmit cell memory on this FP. The congestion state of memory is indicated by a numeric value ranging from 0 to 3. When memory is in a congested state 'x', only traffic with discard priority (DP) 0 to 'x' is processed. Traffic with DP > 'x' is discarded. Therefore, if the congestion state is 3, there is no congestion and all traffic is stored. Likewise, when the congestion state is 0, there is maximum congestion and only traffic with DP=0 is processed."
  },
  "mscLpEngArcAqmTxCellThreshTable": {
    "name": "mscLpEngArcAqmTxCellThreshTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.4.448",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This attribute indicates the total transmit cell memory size and the discard thresholds of the transmit cell memory. The transmit cell memory is the memory used for storing ATM cells to be transmitted by the Lp. The first value indicates the total transmit cell memory size. This is derived based upon the connectionPoolCapacity value. When the txCellMemoryAvailable attribute decreases to the second value, the txCellMemoryCongestionState changes from 3 to 2. In congestion state 2, traffic with discard priority (DP) = 3 is discarded. This threshold is set approximately at 25 percent of the first value, the total transmit cell memory size. When the txCellMemoryAvailable attribute decreases to the third value, the txCellMemoryCongestionState changes from 2 to 1. In congestion state 1, traffic with discard priority (DP) >= 2 is discarded. This threshold is set approximately at 20 percent of the first value, the total transmit cell memory size. When the txCellMemoryAvailable attribute decreases to the fourth value, the txCellMemoryCongestionState changes from 1 to 0. In congestion state 0, traffic with discard priority (DP) >= 1 is discarded. This threshold is set approximately at 10 percent of the first value, the total transmit cell memory size. The opposite effect occurs when the txCellMemoryAvailable attribute increases (txCellMemoryCongestionState increases from 0 to 3 accordingly)"
  },
  "mscLpEngArcAqmTxCellThreshEntry": {
    "name": "mscLpEngArcAqmTxCellThreshEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.4.448.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpEngIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcAqmIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcAqmTxCellThreshIndex",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "An entry in the mscLpEngArcAqmTxCellThreshTable."
  },
  "mscLpEngArcAqmTxCellThreshIndex": {
    "name": "mscLpEngArcAqmTxCellThreshIndex",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.4.448.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 3
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This variable represents the mscLpEngArcAqmTxCellThreshTable specific index for the mscLpEngArcAqmTxCellThreshTable."
  },
  "mscLpEngArcAqmTxCellThreshValue": {
    "name": "mscLpEngArcAqmTxCellThreshValue",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.4.448.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 163839
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This variable represents an individual value for the mscLpEngArcAqmTxCellThreshTable."
  },
  "mscLpEngArcAqmOv": {
    "name": "mscLpEngArcAqmOv",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.4.2",
    "class": "objectidentity"
  },
  "mscLpEngArcAqmOvRowStatusTable": {
    "name": "mscLpEngArcAqmOvRowStatusTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.4.2.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This entry controls the addition and deletion of mscLpEngArcAqmOv components."
  },
  "mscLpEngArcAqmOvRowStatusEntry": {
    "name": "mscLpEngArcAqmOvRowStatusEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.4.2.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpEngIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcAqmIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcAqmOvIndex",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "A single entry in the table represents a single mscLpEngArcAqmOv component."
  },
  "mscLpEngArcAqmOvRowStatus": {
    "name": "mscLpEngArcAqmOvRowStatus",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.4.2.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This variable is used as the basis for SNMP naming of mscLpEngArcAqmOv components. These components cannot be added nor deleted."
  },
  "mscLpEngArcAqmOvComponentName": {
    "name": "mscLpEngArcAqmOvComponentName",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.4.2.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This variable provides the component's string name for use with the ASCII Console Interface"
  },
  "mscLpEngArcAqmOvStorageType": {
    "name": "mscLpEngArcAqmOvStorageType",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.4.2.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "StorageType",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This variable represents the storage type value for the mscLpEngArcAqmOv tables."
  },
  "mscLpEngArcAqmOvIndex": {
    "name": "mscLpEngArcAqmOvIndex",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.4.2.1.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "NonReplicated",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This variable represents the index for the mscLpEngArcAqmOv tables."
  },
  "mscLpEngArcAqmOvProvTable": {
    "name": "mscLpEngArcAqmOvProvTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.4.2.10",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This group specifies the configuration of processor-wide ATM- specific resources on a Logical Processor running ATM services on CQC based cards. Note that altering any of these parameters will result in a card reboot."
  },
  "mscLpEngArcAqmOvProvEntry": {
    "name": "mscLpEngArcAqmOvProvEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.4.2.10.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpEngIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcAqmIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngArcAqmOvIndex",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "An entry in the mscLpEngArcAqmOvProvTable."
  },
  "mscLpEngArcAqmOvConnectionPoolCapacity": {
    "name": "mscLpEngArcAqmOvConnectionPoolCapacity",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.4.2.10.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 0
          },
          {
            "min": 1,
            "max": 16000
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "This attribute specifies the maximum number of connections (VCC, VPC and VPT) that can be configured on the AQM instance of the LogicalProcessor. The value of the attribute restricts the sum of the (maxVccs + maxVpcs +(maxVpts * 3)) across all AtmIfs bound to this AQM instance. Note that 3 connections are used for each standard Vpt and 2 for each basic Vpt. The value of this attribute should be less than than or equal to totalConnectionPoolCapacity of the Arc component. The default value derivedFromArc is obtained using the following equation: totalConnectionPoolCapacity / number of AQM component on FP. VALUES ( 0 = derivedFromArc )"
  },
  "mscLpEngArcAqmOvHighPriorityEpdOffset": {
    "name": "mscLpEngArcAqmOvHighPriorityEpdOffset",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.4.2.10.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 5,
            "max": 1024
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 28,
        "format": "decimal"
      }
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "This attribute specifies the high priority Early Packet Discard (EPD) offset for connection queues. On ATM IP FPs a given connection queue is associated with one of eight emission priorities (EP). These include six unshaped EPs, one exclusive VBR shaper EP and one ABR/VBR shaper EP. This attribute specifies the EPD offset for the exclusive VBR shaper EP and the first four (higher priority) unshaped EPs. This offset is used to derive a connection EPD threshold for a given Congestion Control (CC) level by subtracting the offset from the All Packet Discard (APD) threshold at the same CC level. The APD thresholds are themselves derived from the transmit queue limit. The EPD threshold only applies to a connection if the txPacketWiseDiscard feature is requested. The txPacketWiseDiscard feature can be enabled only if the transmit queue limit is at least 5.71 times the EPD offset. This ensures that the derived EPD threshold will never be less than 17.5 % of the transmit queue limit. If this condition is not satisfied, txPacketWiseDiscard for the connection will be automatically disabled. Due to the above constraint, if the operator wishes to decrease the transmit queue limit and still have txPacketWiseDiscard enabled on the connection then this offset must be set to a lower value that meets the above requirement. Due to hardware granularity the actual value of the EPD offset may not match exactly the value provisioned. The actual value is displayed under the ATM Connection Administrator service category subcomponents on ATM IP FPs. This attribute does not apply to CQC FPs."
  },
  "mscLpEngArcAqmOvLowPriorityEpdOffset": {
    "name": "mscLpEngArcAqmOvLowPriorityEpdOffset",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.4.2.10.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 5,
            "max": 1024
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 200,
        "format": "decimal"
      }
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "This attribute specifies the low priority Early Packet Discard (EPD) offset for connection queues. On ATM IP FPs a given connection queue is associated with one of eight emission priorities (EP). These include six unshaped EPs, one exclusive VBR shaper EP and one ABR/VBR shaper EP. This attribute specifies the EPD offset for the exclusive ABR/VBR shaper EP and the last two (lower priority) unshaped EPs. This offset is used to derive a connection EPD threshold for a given Congestion Control (CC) level by subtracting the offset from the All Packet Discard (APD) threshold at the same CC level. The APD thresholds are themselves derived from the transmit queue limit. The EPD threshold only applies to a connection if the txPacketWiseDiscard feature is requested. The txPacketWiseDiscard feature can be enabled only if the transmit queue limit is at least 5.71 times the EPD offset. This ensures that the derived EPD threshold will never be less than 17.5 % of the transmit queue limit. If this condition is not satisfied, txPacketWiseDiscard for the connection will be automatically disabled. Due to the above constraint, if the operator wishes to decrease the transmit queue limit and still have txPacketWiseDiscard enabled on the connection then this offset must be set to a lower value that meets the above requirement. Due to hardware granularity the actual value of the EPD offset may not match exactly the value provisioned. The actual value is displayed under the ATM Connection Administrator service category subcomponents on ATM IP FPs. This attribute does not apply to CQC FPs."
  },
  "mscLpEngArcAqmOvPortCongestionPolicy": {
    "name": "mscLpEngArcAqmOvPortCongestionPolicy",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.5.4.2.10.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "aggregate": 0,
          "individualQueue": 1
        }
      }
    },
    "default": {
      "default": {
        "value": "individualQueue",
        "format": "enum"
      }
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "This attribute specifies the congestion behavior of all ports on this FP. It applies only to transmit traffic and does not apply to the CBR service category. When the value is aggregate, the enqueue decision of cells or frames to a queue is based upon the congestion state of the entire port to which the queue belongs. A port is defined to be as congested as the most congested queue amongst all its queues. Thus, for example, if a nrtVBR queue is congested, the rtVBR queue also experiences discards even though the rtVBR queue may itself not be congested. Setting this attribute to aggregate assures that the low priority queues are also serviced in the event of congestion. If this attribute is set to aggregate then rtVBR must not be configured to do common queueing and its emissionPriority should be set to a number numerically smaller than or equal to 3. Another impact of setting this attribute to aggregate is that the per connection queue limits for nrtVBR and UBR connections will be increased to the link pool size and their discard thresholds will be modified to be aligned with the free list discard thresholds. When the value of this attribute is set to individualQueue, the enqueue decision of cells or frames to a queue is based solely upon the congestion state of that queue, not the port. This setting assures that the absolute priority of the traffic is taken into account, regardless of whether the lower priority queues are being served. On 3pOC3SmAtm2 and 3pOC3MmAtm2 cards, if more than one override component exists, they must have the same setting for this attribute. Otherwise, setting the attribute under one override component applies to the entire card."
  },
  "mscLpEngFcrc": {
    "name": "mscLpEngFcrc",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6",
    "class": "objectidentity"
  },
  "mscLpEngFcrcRowStatusTable": {
    "name": "mscLpEngFcrcRowStatusTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This entry controls the addition and deletion of mscLpEngFcrc components."
  },
  "mscLpEngFcrcRowStatusEntry": {
    "name": "mscLpEngFcrcRowStatusEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpEngIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngFcrcIndex",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "A single entry in the table represents a single mscLpEngFcrc component."
  },
  "mscLpEngFcrcRowStatus": {
    "name": "mscLpEngFcrcRowStatus",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "This variable is used as the basis for SNMP naming of mscLpEngFcrc components. These components can be added and deleted."
  },
  "mscLpEngFcrcComponentName": {
    "name": "mscLpEngFcrcComponentName",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This variable provides the component's string name for use with the ASCII Console Interface"
  },
  "mscLpEngFcrcStorageType": {
    "name": "mscLpEngFcrcStorageType",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "StorageType",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This variable represents the storage type value for the mscLpEngFcrc tables."
  },
  "mscLpEngFcrcIndex": {
    "name": "mscLpEngFcrcIndex",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.1.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "NonReplicated",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This variable represents the index for the mscLpEngFcrc tables."
  },
  "mscLpEngFcrcOperTable": {
    "name": "mscLpEngFcrcOperTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.10",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This group indicates the configuration of processor-wide frame specific resources on a LogicalProcessor."
  },
  "mscLpEngFcrcOperEntry": {
    "name": "mscLpEngFcrcOperEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.10.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpEngIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngFcrcIndex",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "An entry in the mscLpEngFcrcOperTable."
  },
  "mscLpEngFcrcSubConnectionPoolAvailable": {
    "name": "mscLpEngFcrcSubConnectionPoolAvailable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.10.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 49152
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates the number of sub-connections available for the LogicalProcessor. A sub-connection is used for interworking the ATM services with the frame oriented services such as Frame Relay and Path Oriented Routing System (PORS). When a frame is received at a sub- connection, the frame header is modified to be compatible with the service it is to be forwarded to. This pool is used for connection oriented services only. Each of the following components uses one sub-connection from this pool: FrAtm/n Dlci/n Siwf McsMgr Frf5EpG/n Frf5Ep/n Lmi McsMgr Frf5EpG/n Frf5Ep/n Dlci/n Note: When the value of this attribute reaches zero, no more connections are accepted for any of the services which utilize this pool. To increase the size of this pool, use the Lp Eng Fcrc Ov subConnectionPoolCapacity attribute."
  },
  "mscLpEngFcrcSubConnectionPoolUsage": {
    "name": "mscLpEngFcrcSubConnectionPoolUsage",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.10.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 49152
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates the number of sub-connections being utilized by the LogicalProcessor. A sub-connection is used for interworking the ATM services with the frame oriented services such as Frame Relay and Path Oriented Routing System (PORS). When a frame is received at a sub- connection, the frame header is modified to be compatible with the service it is to be forwarded to. This pool is used for connection oriented services only. Each of the following components uses one sub-connection from this pool: FrAtm/n Dlci/n Siwf McsMgr Frf5EpG/n Frf5Ep/n Lmi McsMgr Frf5EpG/n Frf5Ep/n Dlci/n"
  },
  "mscLpEngFcrcLnnConnectionPoolAvailable": {
    "name": "mscLpEngFcrcLnnConnectionPoolAvailable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.10.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 2048
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates the number of resource records available for the connections which utilize Logical Network Number (LNN) on the LogicalProcessor. A logical network is a subset of Passport modules together with a subset of trunks that interconnect those modules. It carries the traffic for a defined set of network protocols. An LNN is used to identify a logical network. The connectionless services which utilize the logical networks require some processing at the intermediate nodes. This pool is allocated at the intermediate nodes to sustain these connectionless services. If the McsMgr DprsMcsEpG/n Ep/n EpD transportConnectionPreference attribute is set to atmOnly, each instance of the McsMgr DprsMcsEpG/n Ep/n component uses one resource record from this pool, otherwise it does not use this pool. When the value of this attribute reaches zero, no more connections are accepted for any of the services which utilize this pool. To increase the size of this pool, use the Fcrc Ov lnnConnectionPoolCapacity attribute."
  },
  "mscLpEngFcrcLnnConnectionPoolUsage": {
    "name": "mscLpEngFcrcLnnConnectionPoolUsage",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.10.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 2048
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates the number of resource records being utilized for the connections which use Logical Network Number (LNN) on the LogicalProcessor. A logical network is a subset of Passport modules together with a subset of trunks that interconnect those modules. It carries the traffic for a defined set of network protocols. An LNN is used to identify a logical network. The connectionless services which utilize the logical networks require some processing at the intermediate nodes. This pool is applied at the intermediate nodes to sustain these connectionless services. If the McsMgr DprsMcsEpG/n Ep/n EpD transportConnectionPreference attribute is set to atmOnly, each instance of the McsMgr DprsMcsEpG/n Ep/n component uses one resource record from this pool, otherwise it does not use this pool."
  },
  "mscLpEngFcrcTxFrameMemoryAvailable": {
    "name": "mscLpEngFcrcTxFrameMemoryAvailable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.10.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 32767
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates the current availability of the transmit frame memory (in units of frames). The transmit frame memory is the memory available for storing frames to be transmitted by this FP."
  },
  "mscLpEngFcrcTxFrameMemoryMinAvailable": {
    "name": "mscLpEngFcrcTxFrameMemoryMinAvailable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.10.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 32767
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates the lowest availability of the transmit PQC/ CQC frame memory (in units of frames). The transmit frame memory is the memory available for storing frames to be transmitted by this FP. This value is reset every 15 minutes and when the card is reset."
  },
  "mscLpEngFcrcTxFrameMemoryCongestionState": {
    "name": "mscLpEngFcrcTxFrameMemoryCongestionState",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.10.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 3
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates the congestion state of the transmit frame memory on this FP. The congestion state of memory is indicated by a numeric value ranging from 0 to 3. When memory is in a congested state 'x', only traffic with discard priority (DP) 0 to 'x' is processed. Traffic with DP > 'x' is discarded. Therefore, if the congestion state is 3, there is no congestion and all traffic is processed. Likewise, when the congestion state is 0, there is maximum congestion and only traffic with DP=0 is processed."
  },
  "mscLpEngFcrcRxFrameMemoryAvailable": {
    "name": "mscLpEngFcrcRxFrameMemoryAvailable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.10.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 32767
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates the current availability of the receive frame memory (in units of frames). The receive frame memory is the memory available for storing frames received by this FP."
  },
  "mscLpEngFcrcRxFrameMemoryMinAvailable": {
    "name": "mscLpEngFcrcRxFrameMemoryMinAvailable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.10.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 32767
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates the lowest availability of the receive frame memory (in units of frames). The receive frame memory is the memory available for storing frames received by this FP. This value is reset every 15 minutes and when the card is reset."
  },
  "mscLpEngFcrcRxFrameMemoryCongestionState": {
    "name": "mscLpEngFcrcRxFrameMemoryCongestionState",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.10.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 3
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates the congestion state of the receive frame memory on this FP. The congestion state of memory is indicated by a numeric value ranging from 0 to 3. When memory is in a congested state 'x', only traffic with discard priority (DP) 0 to 'x' is processed. Traffic with DP > 'x' is discarded. Therefore, if the congestion state is 3, there is no congestion and all traffic is stored. Likewise, when the congestion state is 0, there is maximum congestion and only traffic with DP=0 is stored."
  },
  "mscLpEngFcrcTxFrThreshTable": {
    "name": "mscLpEngFcrcTxFrThreshTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.442",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This attribute indicates the total transmit frame memory size and the discard thresholds of the transmit frame memory. The transmit frame memory is the memory (in units of frames) used for storing frames to be transmitted by this FP. The first parameter indicates the total size of the transmit frame memory. This is derived from the connectionPoolCapacity and the txCellMemoryAllocation under the ARC component. When the txFrameMemoryAvailable attribute decreases to the second value, the txFrameMemoryCongestionState changes from 3 to 2. In congestion state 2, traffic with discard priority (DP) = 3 is discarded. This threshold is set approximately at 25 percent of the first value, the total transmit frame memory size. When the txFrameMemoryAvailable attribute decreases to the third value, the txFrameMemoryCongestionState changes from 2 to 1. In congestion state 1, traffic with discard priority (DP) >= 2 is discarded. This threshold is set approximately at 20 percent of the first value, the total transmit frame memory size. When the txFrameMemoryAvailable attribute decreases to the fourth value, the txFrameMemoryCongestionState changes from 1 to 0. In congestion state 0, traffic with discard priority (DP) >= 1 is discarded. This threshold is set approximately at 10 percent of the first value, the total transmit frame memory size. The opposite effect occurs when the txFrameMemoryAvailable attribute increases (txFrameMemoryCongestionState increases from 0 to 3 accordingly)."
  },
  "mscLpEngFcrcTxFrThreshEntry": {
    "name": "mscLpEngFcrcTxFrThreshEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.442.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpEngIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngFcrcIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngFcrcTxFrThreshIndex",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "An entry in the mscLpEngFcrcTxFrThreshTable."
  },
  "mscLpEngFcrcTxFrThreshIndex": {
    "name": "mscLpEngFcrcTxFrThreshIndex",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.442.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 3
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This variable represents the mscLpEngFcrcTxFrThreshTable specific index for the mscLpEngFcrcTxFrThreshTable."
  },
  "mscLpEngFcrcTxFrThreshValue": {
    "name": "mscLpEngFcrcTxFrThreshValue",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.442.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 32767
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This variable represents an individual value for the mscLpEngFcrcTxFrThreshTable."
  },
  "mscLpEngFcrcRxFrThreshTable": {
    "name": "mscLpEngFcrcRxFrThreshTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.446",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This attribute indicates the total received frame memory size and the discard thresholds of the receive frame memory. The receive frame memory is the memory (in units of frames) used for storing frames received by this FP. The first parameter indicates the total size of the receive frame memory. This is derived from the connectionPoolCapacity and the rxFrameMemoryAllocation under the ARC component. When the rxFrameMemoryAvailable attribute decreases to the second value, the rxFrameMemoryCongestionState changes from 3 to 2. In congestion state 2, traffic with discard priority (DP) = 3 is discarded. This threshold is set approximately at 25 percent of the first value, the total received frame memory size. When the rxFrameMemoryAvailable attribute decreases to the third value, the rxFrameMemoryCongestionState changes from 2 to 1. In congestion state 1, traffic with discard priority (DP) >= 2 is discarded. This threshold is set approximately at 20 percent of the first value, the total received frame memory size. When the rxFrameMemoryAvailable attribute decreases to the fourth value, the rxFrameMemoryCongestionState changes from 1 to 0. In congestion state 0, traffic with discard priority (DP) >= 1 is discarded. This threshold is set approximately at 10 percent of the first value, the total received frame memory size. The opposite effect occurs when the rxFrameMemoryAvailable attribute increases (rxFrameMemoryCongestionState increases from 0 to 3 accordingly)."
  },
  "mscLpEngFcrcRxFrThreshEntry": {
    "name": "mscLpEngFcrcRxFrThreshEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.446.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpEngIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngFcrcIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngFcrcRxFrThreshIndex",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "An entry in the mscLpEngFcrcRxFrThreshTable."
  },
  "mscLpEngFcrcRxFrThreshIndex": {
    "name": "mscLpEngFcrcRxFrThreshIndex",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.446.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 3
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This variable represents the mscLpEngFcrcRxFrThreshTable specific index for the mscLpEngFcrcRxFrThreshTable."
  },
  "mscLpEngFcrcRxFrThreshValue": {
    "name": "mscLpEngFcrcRxFrThreshValue",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.446.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 32767
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This variable represents an individual value for the mscLpEngFcrcRxFrThreshTable."
  },
  "mscLpEngFcrcOv": {
    "name": "mscLpEngFcrcOv",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.2",
    "class": "objectidentity"
  },
  "mscLpEngFcrcOvRowStatusTable": {
    "name": "mscLpEngFcrcOvRowStatusTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.2.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This entry controls the addition and deletion of mscLpEngFcrcOv components."
  },
  "mscLpEngFcrcOvRowStatusEntry": {
    "name": "mscLpEngFcrcOvRowStatusEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.2.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpEngIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngFcrcIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngFcrcOvIndex",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "A single entry in the table represents a single mscLpEngFcrcOv component."
  },
  "mscLpEngFcrcOvRowStatus": {
    "name": "mscLpEngFcrcOvRowStatus",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.2.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "This variable is used as the basis for SNMP naming of mscLpEngFcrcOv components. These components can be added and deleted."
  },
  "mscLpEngFcrcOvComponentName": {
    "name": "mscLpEngFcrcOvComponentName",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.2.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This variable provides the component's string name for use with the ASCII Console Interface"
  },
  "mscLpEngFcrcOvStorageType": {
    "name": "mscLpEngFcrcOvStorageType",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.2.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "StorageType",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This variable represents the storage type value for the mscLpEngFcrcOv tables."
  },
  "mscLpEngFcrcOvIndex": {
    "name": "mscLpEngFcrcOvIndex",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.2.1.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "NonReplicated",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This variable represents the index for the mscLpEngFcrcOv tables."
  },
  "mscLpEngFcrcOvProvTable": {
    "name": "mscLpEngFcrcOvProvTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.2.10",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This group contains frame services provisionable engineering parameters for this LogicalProcessor. Note that altering any of these parameters will result in a card reset."
  },
  "mscLpEngFcrcOvProvEntry": {
    "name": "mscLpEngFcrcOvProvEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.2.10.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpEngIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngFcrcIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngFcrcOvIndex",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "An entry in the mscLpEngFcrcOvProvTable."
  },
  "mscLpEngFcrcOvSubConnectionPoolCapacity": {
    "name": "mscLpEngFcrcOvSubConnectionPoolCapacity",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.2.10.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 49152
          },
          {
            "min": 65535,
            "max": 65535
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 65535,
        "format": "decimal"
      }
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "This attribute indicates the maximum number of sub-connections for the LogicalProcessor. A sub-connection is used for interworking the ATM services with the frame oriented services such as Frame Relay and Path Oriented Routing System (PORS). When a frame is received at a sub- connection, the frame header is modified to be compatible with the service it is to be forwarded to. Due to limited resources, not all of the sub-connections requested by this attribute may be allocated. The desired number of sub- connections allocated is indicated by the sum of fcrc subConnectionPoolAvailable and fcrc subConnectionPoolUsage attributes. This pool is used for connection oriented services only. Each of the following components uses one sub-connection from this pool: FrAtm/n Dlci/n Siwf McsMgr Frf5EpG/n Frf5Ep/n Lmi McsMgr Frf5EpG/n Frf5Ep/n Dlci/n When the sub-connection pool is exhausted, no more connections are accepted from the services which utilize this pool. Note: Ip Routing entries also compete for this memory. The maximum size of this pool is 8192 for CQC based cards. The default cardDependent has the effect of setting subConnectionPoolCapacity to 1024 for both CQC cards and SGAF cards. VALUES ( 65535 = cardDependent )"
  },
  "mscLpEngFcrcOvLnnConnectionPoolCapacity": {
    "name": "mscLpEngFcrcOvLnnConnectionPoolCapacity",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.2.10.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 0
          },
          {
            "min": 1,
            "max": 2048
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "This attribute indicates the maximum number of resource records for the connections which utilize Logical Network Number (LNN) on the LogicalProcessor. A logical network is a subset of passport modules together with a subset of trunks that interconnect those modules. It carries the traffic for a defined set of network protocols. An LNN is used to identify a logical network. The connectionless services which utilize the logical networks require some processing at the intermediate nodes. This pool is allocated at the intermediate nodes to sustain these connectionless services. If the McsMgr DprsMcsEpG/n Ep/n EpD transportConnectionPreference attribute is set to atmOnly, each instance of the McsMgr DprsMcsEpG/n Ep/n component uses one resource record from this pool, otherwise it does not use this pool. Note: Frame and Cell queues also compete for this memory. Each DPRS instance requires two resource records and each VNS instance requires one resource records from this pool. (A VNS instance is an lnn combined with a trunk). The maximum size of this pool is 256 for CQC based cards. The default cardDependent has the effect of setting lnnConnectionPoolCapacity to 128 for CQC cards and 256 for SGAF cards. VALUES ( 0 = cardDependent )"
  },
  "mscLpEngFcrcPqc": {
    "name": "mscLpEngFcrcPqc",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.3",
    "class": "objectidentity"
  },
  "mscLpEngFcrcPqcRowStatusTable": {
    "name": "mscLpEngFcrcPqcRowStatusTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.3.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This entry controls the addition and deletion of mscLpEngFcrcPqc components."
  },
  "mscLpEngFcrcPqcRowStatusEntry": {
    "name": "mscLpEngFcrcPqcRowStatusEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.3.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpEngIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngFcrcIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngFcrcPqcIndex",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "A single entry in the table represents a single mscLpEngFcrcPqc component."
  },
  "mscLpEngFcrcPqcRowStatus": {
    "name": "mscLpEngFcrcPqcRowStatus",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.3.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "This variable is used as the basis for SNMP naming of mscLpEngFcrcPqc components. These components can be added and deleted."
  },
  "mscLpEngFcrcPqcComponentName": {
    "name": "mscLpEngFcrcPqcComponentName",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.3.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This variable provides the component's string name for use with the ASCII Console Interface"
  },
  "mscLpEngFcrcPqcStorageType": {
    "name": "mscLpEngFcrcPqcStorageType",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.3.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "StorageType",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This variable represents the storage type value for the mscLpEngFcrcPqc tables."
  },
  "mscLpEngFcrcPqcIndex": {
    "name": "mscLpEngFcrcPqcIndex",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.3.1.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "NonReplicated",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This variable represents the index for the mscLpEngFcrcPqc tables."
  },
  "mscLpEngFcrcPqcOperTable": {
    "name": "mscLpEngFcrcPqcOperTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.3.10",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This group describes the usage of resources specific to frame services on a PQC based FP."
  },
  "mscLpEngFcrcPqcOperEntry": {
    "name": "mscLpEngFcrcPqcOperEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.3.10.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpEngIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngFcrcIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngFcrcPqcIndex",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "An entry in the mscLpEngFcrcPqcOperTable."
  },
  "mscLpEngFcrcPqcIpRoutesPoolSize": {
    "name": "mscLpEngFcrcPqcIpRoutesPoolSize",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.3.10.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 100000
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute indicates the number of IP routing entries permitted on the Logical Processor. If there are enough resources on the card, this value is equal to the provisioned attribute (in Fcrc Pqc Ov) ipRoutesPoolCapacity."
  },
  "mscLpEngFcrcPqcIpRoutesPoolUsage": {
    "name": "mscLpEngFcrcPqcIpRoutesPoolUsage",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.3.10.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 100000
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This attribute represents the current number of IP routing entries that are in use."
  },
  "mscLpEngFcrcPqcIpRoutesPoolAvailableEst": {
    "name": "mscLpEngFcrcPqcIpRoutesPoolAvailableEst",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.3.10.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 100000
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "Each IP routing resource can hold between one and three IP routing entries. Therefore, it is not possible to know exactly how many more IP routing entries can be added to the IP routing table. This attribute specifies the estimated number of IP routing entries that are available on the Logical Processor. It is an approximation based on the current average number of IP routing entries per IP routing resource."
  },
  "mscLpEngFcrcPqcOv": {
    "name": "mscLpEngFcrcPqcOv",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.3.2",
    "class": "objectidentity"
  },
  "mscLpEngFcrcPqcOvRowStatusTable": {
    "name": "mscLpEngFcrcPqcOvRowStatusTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.3.2.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This entry controls the addition and deletion of mscLpEngFcrcPqcOv components."
  },
  "mscLpEngFcrcPqcOvRowStatusEntry": {
    "name": "mscLpEngFcrcPqcOvRowStatusEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.3.2.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpEngIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngFcrcIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngFcrcPqcIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngFcrcPqcOvIndex",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "A single entry in the table represents a single mscLpEngFcrcPqcOv component."
  },
  "mscLpEngFcrcPqcOvRowStatus": {
    "name": "mscLpEngFcrcPqcOvRowStatus",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.3.2.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This variable is used as the basis for SNMP naming of mscLpEngFcrcPqcOv components. These components cannot be added nor deleted."
  },
  "mscLpEngFcrcPqcOvComponentName": {
    "name": "mscLpEngFcrcPqcOvComponentName",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.3.2.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This variable provides the component's string name for use with the ASCII Console Interface"
  },
  "mscLpEngFcrcPqcOvStorageType": {
    "name": "mscLpEngFcrcPqcOvStorageType",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.3.2.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "StorageType",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This variable represents the storage type value for the mscLpEngFcrcPqcOv tables."
  },
  "mscLpEngFcrcPqcOvIndex": {
    "name": "mscLpEngFcrcPqcOvIndex",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.3.2.1.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "NonReplicated",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This variable represents the index for the mscLpEngFcrcPqcOv tables."
  },
  "mscLpEngFcrcPqcOvProvTable": {
    "name": "mscLpEngFcrcPqcOvProvTable",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.3.2.10",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This group is used for fine tuning resource configuration of frame services on a PQC based Logical Processor."
  },
  "mscLpEngFcrcPqcOvProvEntry": {
    "name": "mscLpEngFcrcPqcOvProvEntry",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.3.2.10.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-LogicalProcessorMIB",
        "object": "mscLpEngIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngFcrcIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngFcrcPqcIndex",
        "implied": 0
      },
      {
        "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB",
        "object": "mscLpEngFcrcPqcOvIndex",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "An entry in the mscLpEngFcrcPqcOvProvTable."
  },
  "mscLpEngFcrcPqcOvIpRoutesPoolCapacity": {
    "name": "mscLpEngFcrcPqcOvIpRoutesPoolCapacity",
    "oid": "1.3.6.1.4.1.562.36.2.1.12.23.6.3.2.10.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 100000
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 4096,
        "format": "decimal"
      }
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "This attribute indicates the number of desired IP routing entries for the Logical Processor. It is used to determine the number of IP routing resources to be allocated on the card. Each IP routing resource can hold between one and three IP routing entries. To calculate the number of IP routing resources required, an average of 2 IP routing entries per IP routing resource is used. If there are not enough resources on the card, a smaller pool is allocated. Operational attribute (in Fcrc Pqc) ipRoutesPoolSize indicates the actual size of the pool."
  },
  "atmBaseGroup": {
    "name": "atmBaseGroup",
    "oid": "1.3.6.1.4.1.562.36.2.2.63.1",
    "class": "objectidentity"
  },
  "atmBaseGroupCA": {
    "name": "atmBaseGroupCA",
    "oid": "1.3.6.1.4.1.562.36.2.2.63.1.1",
    "class": "objectidentity"
  },
  "atmBaseGroupCA02": {
    "name": "atmBaseGroupCA02",
    "oid": "1.3.6.1.4.1.562.36.2.2.63.1.1.3",
    "class": "objectidentity"
  },
  "atmBaseGroupCA02A": {
    "name": "atmBaseGroupCA02A",
    "oid": "1.3.6.1.4.1.562.36.2.2.63.1.1.3.2",
    "class": "objectidentity"
  },
  "atmBaseCapabilities": {
    "name": "atmBaseCapabilities",
    "oid": "1.3.6.1.4.1.562.36.2.2.63.3",
    "class": "objectidentity"
  },
  "atmBaseCapabilitiesCA": {
    "name": "atmBaseCapabilitiesCA",
    "oid": "1.3.6.1.4.1.562.36.2.2.63.3.1",
    "class": "objectidentity"
  },
  "atmBaseCapabilitiesCA02": {
    "name": "atmBaseCapabilitiesCA02",
    "oid": "1.3.6.1.4.1.562.36.2.2.63.3.1.3",
    "class": "objectidentity"
  },
  "atmBaseCapabilitiesCA02A": {
    "name": "atmBaseCapabilitiesCA02A",
    "oid": "1.3.6.1.4.1.562.36.2.2.63.3.1.3.2",
    "class": "objectidentity"
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/Nortel-MsCarrier-MscPassport-AtmBaseMIB",
      "Produced by pysmi-0.3.4 at Fri May 24 20:46:19 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "Nortel-MsCarrier-MscPassport-AtmBaseMIB"
  }
}