{
  "imports": {
    "class": "imports",
    "RMON-MIB": [
      "rmon"
    ],
    "RMON2-MIB": [
      "protocolDirectoryGroup",
      "protocolDirLocalIndex"
    ],
    "SNMP-FRAMEWORK-MIB": [
      "SnmpAdminString"
    ],
    "SNMPv2-CONF": [
      "OBJECT-GROUP",
      "NOTIFICATION-GROUP",
      "MODULE-COMPLIANCE"
    ],
    "SNMPv2-SMI": [
      "Counter32",
      "IpAddress",
      "OBJECT-TYPE",
      "Counter64",
      "Gauge32",
      "iso",
      "MODULE-IDENTITY",
      "Integer32",
      "Unsigned32",
      "NOTIFICATION-TYPE",
      "MibIdentifier",
      "TimeTicks",
      "OBJECT-IDENTITY",
      "Bits"
    ],
    "SNMPv2-TC": [
      "RowPointer",
      "TEXTUAL-CONVENTION",
      "DisplayString",
      "TruthValue"
    ]
  },
  "pmCapsMIB": {
    "name": "pmCapsMIB",
    "oid": "1.3.6.1.2.1.16.25",
    "class": "moduleidentity",
    "revisions": [
      {
        "revision": "2000-07-14 00:00",
        "description": "Initial Version of the Performance Measurement Capabilities MIB."
      }
    ],
    "lastupdated": "200007140000Z",
    "organization": "IETF RMONMIB WG",
    "contactinfo": " Andy Bierman Cisco Systems, Inc. RMONMIB WG Chair and PMCAPS MIB Editor Postal: 170 West Tasman Drive San Jose, CA USA 95134 Tel: +1 408 527-3711 E-mail: abierman@cisco.com Send comments to <rmonmib@ietf.org> Mailing list subscription information: http://www.ietf.org/mailman/listinfo/rmonmib ",
    "description": "The MIB module for representing Performance Measurement Capabilities."
  },
  "pmCapsMIBObjects": {
    "name": "pmCapsMIBObjects",
    "oid": "1.3.6.1.2.1.16.25.1",
    "class": "objectidentity"
  },
  "pmCaps": {
    "name": "pmCaps",
    "oid": "1.3.6.1.2.1.16.25.1.1",
    "class": "objectidentity"
  },
  "pmMetrics": {
    "name": "pmMetrics",
    "oid": "1.3.6.1.2.1.16.25.1.2",
    "class": "objectidentity"
  },
  "pmMetricTable": {
    "name": "pmMetricTable",
    "oid": "1.3.6.1.2.1.16.25.1.1.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains one row per PM Metric supported by this agent, and should be populated during system initialization."
  },
  "pmMetricEntry": {
    "name": "pmMetricEntry",
    "oid": "1.3.6.1.2.1.16.25.1.1.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "PMCAPS-MIB",
        "object": "pmMetricID",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Information about a particular PM Metric."
  },
  "pmMetricID": {
    "name": "pmMetricID",
    "oid": "1.3.6.1.2.1.16.25.1.1.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OBJECT IDENTIFIER",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The index for this entry. This object identifies the standard or vendor-specific registration OBJECT IDENTIFER defined for a particular PM metric."
  },
  "pmMetricType": {
    "name": "pmMetricType",
    "oid": "1.3.6.1.2.1.16.25.1.1.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "other": 1,
          "connectMetric": 2,
          "delayMetric": 3,
          "lossMetric": 4
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The basic type of metric indicated by this entry. The value 'other(1)' indicates that this metric cannot be characterized by any of the remaining enumerations specified for this object. The value 'connectMetric(2)' indicates that this metric measures connectivity characteristics. The value 'delayMetric(3)' indicates that this metric measures delay characteristics. The value 'lossMetric(4)' indicates that this metric measures loss characteristics."
  },
  "pmMetricDirType": {
    "name": "pmMetricDirType",
    "oid": "1.3.6.1.2.1.16.25.1.1.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "oneWay": 1,
          "twoWay": 2,
          "multiWay": 3
        }
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The directional characteristics of the this metric. The value 'oneWay(1)' indicates that this metric is measured with some sort of uni-directional test. The value 'twoWay(2)' indicates that this metric is measured with some sort of bi-directional test. The value 'multiWay(3)' indicates that this metric is measured with some combination of uni-directional and/or bi- directional tests."
  },
  "pmMetricName": {
    "name": "pmMetricName",
    "oid": "1.3.6.1.2.1.16.25.1.1.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The textual name of this metric."
  },
  "pmMetricReference": {
    "name": "pmMetricReference",
    "oid": "1.3.6.1.2.1.16.25.1.1.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object contains a reference to the document which defines this metric. If this document is available online via electronic download, then a URL should be specified in this object. For example, if this pmMetricEntry identified the IPPM metric 'Type-P-Round-Trip-Delay', then this object should contain the value 'http://www.ietf.org/rfc/rfc2681.txt'."
  },
  "pmStudyClassTable": {
    "name": "pmStudyClassTable",
    "oid": "1.3.6.1.2.1.16.25.1.1.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains one row per PM Study Class supported by this APM/TPM Device, and should be populated during system initialization."
  },
  "pmStudyClassEntry": {
    "name": "pmStudyClassEntry",
    "oid": "1.3.6.1.2.1.16.25.1.1.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "PMCAPS-MIB",
        "object": "pmStudyClassID",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Information about a particular PM Study Class."
  },
  "pmStudyClassID": {
    "name": "pmStudyClassID",
    "oid": "1.3.6.1.2.1.16.25.1.1.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OBJECT IDENTIFIER",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The index for this entry. This object identifier should specify the standard or vendor-specific registration OID for this PM Study Class."
  },
  "pmStudyClassMeasLoc": {
    "name": "pmStudyClassMeasLoc",
    "oid": "1.3.6.1.2.1.16.25.1.1.2.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Bits",
      "class": "type",
      "bits": {
        "pmClient": 0,
        "pmNetwork": 1,
        "pmServer": 2
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The measurement location characteristics of the PM Data collection methodologies employed by this PM Study Class. If this PM Study class utilizes some sort of measurement technology located on the host machine being monitored, then the 'pmClient' BIT will be set. Note that this bit should only be set if any PM technology is installed on the client, in addition to the 'normal' protocol operations supported by that machine. If this PM Study class utilizes some sort of measurement technology located on one or more networking devices (e.g., routers, switches, RMON probes), then the 'pmNetwork' BIT will be set. If this PM Study class utilizes some sort of measurement technology located on the application server being monitored, then the 'pmServer' BIT will be set. Note that this bit should only be set if any PM technology is installed on the server, in addition to the 'normal' protocol operations supported by that machine."
  },
  "pmStudyClassMeasType": {
    "name": "pmStudyClassMeasType",
    "oid": "1.3.6.1.2.1.16.25.1.1.2.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Bits",
      "class": "type",
      "bits": {
        "pmPassive": 0,
        "pmActive": 1,
        "pmBuiltin": 2
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The type(s) of collection methodologies employed by this PM Study Class. If this PM Study class utilizes some sort of passive monitoring technology, (i.e., UI operations and/or protocol transactions of real users are measured) the 'pmPassive' BIT will be set. If this PM Study class utilizes some sort of active monitoring technology, (i.e., protocol transactions generated for the purpose of obtaining PM Data) the 'pmPassive' BIT will be set. If this PM Study class utilizes some sort of built-in monitoring technology, (i.e., UI operations and/or protocol transactions of real users are somehow altered to provide PM Data) the 'pmBuiltin' BIT will be set."
  },
  "pmStudyClassCollectPts": {
    "name": "pmStudyClassCollectPts",
    "oid": "1.3.6.1.2.1.16.25.1.1.2.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 2147483647
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of PM Collection Points utilized in this PM Study Class. If this is a variable quantity, then this object should contain the minimum number needed for this PM Study Class to function."
  },
  "pmStudyClassCollectCaps": {
    "name": "pmStudyClassCollectCaps",
    "oid": "1.3.6.1.2.1.16.25.1.1.2.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Bits",
      "class": "type",
      "bits": {
        "pmCollectTrans": 0,
        "pmCollectApp": 1,
        "pmCollectFlow": 2,
        "pmCollectNonNet": 3
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object identifies some generic characteristics of the collection methodologies employed by this PM Study Class. If this PM Study class utilizes some sort of transport layer PM Data collection technology, then the 'pmCollectTrans' BIT will be set. If this PM Study class utilizes some sort of application layer PM Data collection technology, then the 'pmCollectApp' BIT will be set. If this PM Study class utilizes PM Data collection technology based on monitoring of some sort of network flow summary information, then the 'pmCollectFlow' BIT will be set. If this PM Study class utilizes some sort of PM Data collection technology based on monitoring of non-network events, such as UI monitoring of window events, then the 'pmCollectNonNet' BIT will be set."
  },
  "pmStudyClassOutputCaps": {
    "name": "pmStudyClassOutputCaps",
    "oid": "1.3.6.1.2.1.16.25.1.1.2.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Bits",
      "class": "type",
      "bits": {
        "pmOutputOther": 0,
        "pmOutputApmDist": 1,
        "pmOutputApmStat": 2,
        "pmOutputApmHist": 3,
        "pmOutputApmFlow": 4,
        "pmOutputApmExcept": 5,
        "pmOutputApmProp": 6,
        "pmOutputTpmDist": 7,
        "pmOutputTpmStat": 8,
        "pmOutputTpmHist": 9,
        "pmOutputTpmExcept": 10,
        "pmOutputTpmProp": 11
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The type(s) of APM and/or TPM Reports that this PM Study Class can provide. [ed. - this list will change as the APM and TPM MIBs are finalized.] If this PM Study class can generate standard reports not described by any of the provided BITS here, then the 'pmOutputOther' BIT will be set. If this PM Study class can generate distribution-oriented reports for application layer protocols, then the 'pmOutputApmDist' BIT will be set. If this PM Study class can generate statistics-oriented reports for application layer protocols, then the 'pmOutputApmStat' BIT will be set. If this PM Study class can generate historical analysis oriented reports for application layer protocols, then the 'pmOutputApmHist' BIT will be set. If this PM Study class can generate flow decomposition analysis oriented reports for application layer protocols, then the 'pmOutputApmFlow' BIT will be set. If this PM Study class can generate profile exception oriented reports for application layer protocols, then the 'pmOutputApmExcept' BIT will be set. If this PM Study class can generate vendor-specific proprietary reports for application layer protocols, in addition to standard reports, then the 'pmOutputApmProp' BIT will be set. If this PM Study class can generate distribution-oriented reports for transport layer protocols, then the 'pmOutputTpmDist' BIT will be set. If this PM Study class can generate statistics-oriented reports for transport layer protocols, then the 'pmOutputTpmStat' BIT will be set. If this PM Study class can generate historical analysis oriented reports for transport layer protocols, then the 'pmOutputTpmHist' BIT will be set. If this PM Study class can generate flow decomposition analysis oriented reports for transport layer protocols, then the 'pmOutputTpmFlow' BIT will be set. If this PM Study class can generate profile exception oriented reports for transport layer protocols, then the 'pmOutputTpmExcept' BIT will be set. If this PM Study class can generate vendor-specific proprietary reports for transport layer protocols, in addition to standard reports, then the 'pmOutputTpmProp' BIT will be set."
  },
  "pmStudyClassCtlTablePtr": {
    "name": "pmStudyClassCtlTablePtr",
    "oid": "1.3.6.1.2.1.16.25.1.1.2.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowPointer",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object identifies a specific MIB table that can be used to configure detailed aspects of the collection or report processing functions for this PM Study Class. This object just identifies a particular row in the MIB table to use, not any particular agent which implements this MIB table. This agent may or may not contain an implementation of the specified MIB, and/or the specified MIB may not be accessible in the same views as the this MIB. If no appropriate row in a MIB table can be identified, then the value { 0 0 } is returned."
  },
  "pmStudyMetricTable": {
    "name": "pmStudyMetricTable",
    "oid": "1.3.6.1.2.1.16.25.1.1.3",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains one row for each metric supported by the specified PM Study Class, and should be populated during system initialization."
  },
  "pmStudyMetricEntry": {
    "name": "pmStudyMetricEntry",
    "oid": "1.3.6.1.2.1.16.25.1.1.3.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "PMCAPS-MIB",
        "object": "pmStudyClassID",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Metrics information related to a particular PM Study Class. The pmStudyClassID value in the index identifies the pmStudyClassEntry with the same index value."
  },
  "pmStudyMetricID": {
    "name": "pmStudyMetricID",
    "oid": "1.3.6.1.2.1.16.25.1.1.3.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OBJECT IDENTIFIER",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object identifies the PM Metric associated with this PM Study, and contains the same value as the pmMetricID index for that pmMetricEntry."
  },
  "pmStudyProtocolTable": {
    "name": "pmStudyProtocolTable",
    "oid": "1.3.6.1.2.1.16.25.1.1.4",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains one row for each protocol supported by the specified PM Study Class, and should be populated during system initialization. This is an indication of the protocols the indicated PM Study Class is capable of measuring. The actual protocols present in a given APM or TPM Report may be a subset of the protocols identified in this table. This table contain entries which reference any protocol in the protocolDirTable. If the index of this entry identifies an internal node in the protocolDirTable, then the pmStudyProtocolIsSubtree object is relevant."
  },
  "pmStudyProtocolEntry": {
    "name": "pmStudyProtocolEntry",
    "oid": "1.3.6.1.2.1.16.25.1.1.4.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "PMCAPS-MIB",
        "object": "pmStudyClassID",
        "implied": 0
      },
      {
        "module": "RMON2-MIB",
        "object": "protocolDirLocalIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Protocol information about a particular PM Study Class. The pmStudyClassID value in the index identifies the pmStudyClassEntry with the same index value, associated with the list of protocols in this table. The protocolDirLocalIndex value identifies the protocolDirEntry which contains the same value in the protocolDirLocalIndex object."
  },
  "pmStudyProtocolIsSubtree": {
    "name": "pmStudyProtocolIsSubtree",
    "oid": "1.3.6.1.2.1.16.25.1.1.4.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "This object indicates whether or not this entry identifies one node or an entire subtree of the protocolDirTable. If set to 'true(1)' then the specified protocolDirEntry, and all its children, are supported by the specified PM Study Class. If set to 'false(2)', then the specified protocolDirEntry identified by this entry is supported by the PM Study Class."
  },
  "pmAppAvailMetric": {
    "name": "pmAppAvailMetric",
    "oid": "1.3.6.1.2.1.16.25.1.2.1",
    "class": "objectidentity",
    "status": "current",
    "description": "Metric Name: Type-P-APM-Availability Metric Definition: This metric characterizes the availability of a network service by measuring the percentage of successful transactions the network service delivers over a given time interval. This metric is calculated by first measuring the IPPM metric 'Type-P-Interval-Bidirectional-Connectivity' for the interval starting at the instant 'Src' initiates a transaction of Type-P with the 'Dst' host, and ending at the instant the last packet of the transaction has been received. In addition to successful connectivity over this interval, the particular application request must also succeed, for a transaction to be considered successful. If either condition is false, then that transaction is considered to be unsuccessful. The derived metric is defined as the total number of successful transactions between Src and Dst, divided by the total number of transaction attempts between Src and Dst, during the time interval dT. Metric Parameters: Src, the network address of a host Dst, the network address of a host dT, a time interval Metric Units: Percentage Mapping of Type P: Type P refers to an application protocol encapsulation, identified by a specific protocolDirEntry. Metric Type: connectMetric(1) Metric Dir Type: twoWay(2)",
    "reference": "IPPM Metrics for Measuring Connectivity, RFC 2678 [RFC2678], Section 5, September 1999."
  },
  "pmAppTransRespMetric": {
    "name": "pmAppTransRespMetric",
    "oid": "1.3.6.1.2.1.16.25.1.2.2",
    "class": "objectidentity",
    "status": "current",
    "description": "Metric Name: Type-P-APM-Transaction-Responsiveness Metric Definition: This metric characterizes the speed at which a transaction-oriented network application delivers a requested service, by measuring the speed of individual application transactions. This metric is calculated by utilizing a variation of the IPPM metric 'Type-P-Round-trip-Delay'. The total transaction time (dT) is determined by summing all the packet transactions of Type-P between the Src and Dst hosts. The bi-directional flight times are measured (as specified by the IPPM metric definition), but the server response time for each request is included in the measurement. The derived metric is defined as the total number of tenths of seconds for the transaction between Src and Dst to complete. Metric Parameters: Src, the network address of a host Dst, the network address of a host dT, a time interval Metric Units: Tenths of seconds Mapping of Type P: Type P refers to an application protocol encapsulation, identified by a specific protocolDirEntry, which is characterized as a transaction-oriented protocol. Metric Type: delayMetric(2) Metric Dir Type: twoWay(2)",
    "reference": "Round-trip for Delay Metric for IPPM, RFC 2681 [RFC2681], Section 2, September 1999."
  },
  "pmAppTputRespMetric": {
    "name": "pmAppTputRespMetric",
    "oid": "1.3.6.1.2.1.16.25.1.2.3",
    "class": "objectidentity",
    "status": "current",
    "description": "Metric Name: Type-P-APM-Throughput-Responsiveness Metric Definition: This metric characterizes the speed at which a throughput-oriented network application delivers a requested service, by measuring the transfer rate of individual application transactions. This metric is calculated by ... [rest of para is TBD] The derived metric is normalized and inverted, into units of 'seconds per terabit'. For transactions up to one terabit in size, it is defined as the total number of seconds it would take for the transaction between Src and Dst to complete, if the transaction size included one terabit of data. For transactions over one terabit in size, it is defined as the average number of seconds for the transaction between Src and Dst to complete, for each terabit of data. E.g., a transfer rate of 2Kbps equals 500,000,000 and a transfer rate of 1Gbps = 1000. Metric Parameters: Src, the network address of a host Dst, the network address of a host dT, a time interval B, a number of terabits Metric Units: Seconds Per Terabit Mapping of Type P: Type P refers to an application protocol encapsulation, identified by a specific protocolDirEntry, which is characterized as a throughput-oriented protocol. Metric Type: delayMetric(2) Metric Dir Type: twoWay(2)",
    "reference": "Round-trip for Delay Metric for IPPM, RFC 2681 [RFC2681], Section 2, September 1999."
  },
  "pmAppStreamRespMetric": {
    "name": "pmAppStreamRespMetric",
    "oid": "1.3.6.1.2.1.16.25.1.2.4",
    "class": "objectidentity",
    "status": "current",
    "description": "Metric Name: Type-P-APM-Stream-Responsiveness Metric Definition: This metric characterizes the 'quality' at which a streaming-oriented network application delivers a requested service, by measuring the percentage of time that the service is degraded or interrupted to the total time to deliver the service. [Rest of definition TBD] Metric Parameters: Src, the network address of a host Dst, the network address of a host Metric Units: [TBD] Mapping of Type P: Type P refers to an application protocol encapsulation, identified by a specific protocolDirEntry, which is characterized as a streaming-oriented protocol. Metric Type: delayMetric(2) Metric Dir Type: twoWay(2)",
    "reference": "Round-trip for Delay Metric for IPPM, RFC 2681 [RFC2681], Section 2, September 1999."
  },
  "pmCapsNotifications": {
    "name": "pmCapsNotifications",
    "oid": "1.3.6.1.2.1.16.25.2",
    "class": "objectidentity"
  },
  "pmCapsConformance": {
    "name": "pmCapsConformance",
    "oid": "1.3.6.1.2.1.16.25.3",
    "class": "objectidentity"
  },
  "pmCapsCompliances": {
    "name": "pmCapsCompliances",
    "oid": "1.3.6.1.2.1.16.25.3.1",
    "class": "objectidentity"
  },
  "pmCapsGroups": {
    "name": "pmCapsGroups",
    "oid": "1.3.6.1.2.1.16.25.3.2",
    "class": "objectidentity"
  },
  "pmCapsCompliance": {
    "name": "pmCapsCompliance",
    "oid": "1.3.6.1.2.1.16.25.3.1.1",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "protocolDirectoryGroup",
        "module": "PMCAPS-MIB"
      },
      {
        "object": "pmCapsGroup",
        "module": "PMCAPS-MIB"
      }
    ],
    "status": "current",
    "description": "The compliance statement for SNMP entities which implement version 1 of the APM Capabilities MIB."
  },
  "pmCapsGroup": {
    "name": "pmCapsGroup",
    "oid": "1.3.6.1.2.1.16.25.3.2.1",
    "class": "objectgroup",
    "objects": [
      {
        "module": "PMCAPS-MIB",
        "object": "pmMetricType"
      },
      {
        "module": "PMCAPS-MIB",
        "object": "pmMetricDirType"
      },
      {
        "module": "PMCAPS-MIB",
        "object": "pmMetricName"
      },
      {
        "module": "PMCAPS-MIB",
        "object": "pmMetricReference"
      },
      {
        "module": "PMCAPS-MIB",
        "object": "pmStudyClassMeasLoc"
      },
      {
        "module": "PMCAPS-MIB",
        "object": "pmStudyClassMeasType"
      },
      {
        "module": "PMCAPS-MIB",
        "object": "pmStudyClassCollectPts"
      },
      {
        "module": "PMCAPS-MIB",
        "object": "pmStudyClassCollectCaps"
      },
      {
        "module": "PMCAPS-MIB",
        "object": "pmStudyClassOutputCaps"
      },
      {
        "module": "PMCAPS-MIB",
        "object": "pmStudyClassCtlTablePtr"
      },
      {
        "module": "PMCAPS-MIB",
        "object": "pmStudyMetricID"
      },
      {
        "module": "PMCAPS-MIB",
        "object": "pmStudyProtocolIsSubtree"
      }
    ],
    "status": "current",
    "description": "The collection of objects which are used to represent application performance measurement capabilities, for which a single agent provides management information."
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/PMCAPS-MIB",
      "Produced by pysmi-0.3.4 at Fri May 24 21:00:30 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "PMCAPS-MIB"
  }
}