{
  "imports": {
    "class": "imports",
    "IF-MIB": [
      "InterfaceIndexOrZero"
    ],
    "PW-STD-MIB": [
      "pwIndex"
    ],
    "Q-BRIDGE-MIB": [
      "VlanIdOrAnyOrNone"
    ],
    "RMON2-MIB": [
      "ZeroBasedCounter32"
    ],
    "SNMPv2-CONF": [
      "NOTIFICATION-GROUP",
      "MODULE-COMPLIANCE",
      "OBJECT-GROUP"
    ],
    "SNMPv2-SMI": [
      "Counter32",
      "Bits",
      "iso",
      "Counter64",
      "OBJECT-TYPE",
      "NOTIFICATION-TYPE",
      "Gauge32",
      "Integer32",
      "IpAddress",
      "MibIdentifier",
      "MODULE-IDENTITY",
      "TimeTicks",
      "mib-2",
      "Unsigned32",
      "OBJECT-IDENTITY"
    ],
    "SNMPv2-TC": [
      "TEXTUAL-CONVENTION",
      "DisplayString",
      "RowStatus",
      "StorageType"
    ]
  },
  "pwEnetStdMIB": {
    "name": "pwEnetStdMIB",
    "oid": "1.3.6.1.2.1.180",
    "class": "moduleidentity",
    "revisions": [
      {
        "revision": "2009-06-15 00:00",
        "description": "Initial version published as part of RFC 5603."
      }
    ],
    "lastupdated": "200906150000Z",
    "organization": "Pseudowire Edge-to-Edge Emulation (PWE3) Working Group",
    "contactinfo": "David Zelig Email: davidz@oversi.com Thomas D. Nadeau Email: tom.nadeau@bt.com ",
    "description": "This MIB module describes a model for managing Ethernet point-to-point pseudowire services over a Packet Switched Network (PSN). Copyright (c) 2009 IETF Trust and the persons identified as authors of the code. All rights reserved. Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met: - Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer. - Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution. - Neither the name of Internet Society, IETF or IETF Trust, nor the names of specific contributors, may be used to endorse or promote products derived from this software without specific prior written permission. THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 'AS IS' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE. This version of this MIB module is part of RFC 5603; see the RFC itself for full legal notices."
  },
  "pwEnetObjects": {
    "name": "pwEnetObjects",
    "oid": "1.3.6.1.2.1.180.1",
    "class": "objectidentity"
  },
  "pwEnetConformance": {
    "name": "pwEnetConformance",
    "oid": "1.3.6.1.2.1.180.2",
    "class": "objectidentity"
  },
  "pwEnetTable": {
    "name": "pwEnetTable",
    "oid": "1.3.6.1.2.1.180.1.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains the index to the Ethernet tables associated with this Ethernet PW, the VLAN configuration, and the VLAN mode."
  },
  "pwEnetEntry": {
    "name": "pwEnetEntry",
    "oid": "1.3.6.1.2.1.180.1.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "PW-STD-MIB",
        "object": "pwIndex",
        "implied": 0
      },
      {
        "module": "PW-ENET-STD-MIB",
        "object": "pwEnetPwInstance",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "This table is indexed by the same index that was created for the associated entry in the PW generic table in the PW-STD-MIB module. The pwIndex and the pwEnetPwInstance are used as indexes to allow multiple VLANs to exist on the same PW. An entry is created in this table by the agent for every entry in the pwTable with a pwType of 'ethernetTagged' or 'ethernet'. Additional rows may be created by the operator or the agent if multiple entries are required for the same PW. The value of pwEnetPwInstance can be arbitrarily selected to make the row unique; however, implementations that know the VLAN field value when the row is created MAY use the value of the VLAN itself for better readability and backward compatibility with older versions of this MIB module. This table provides Ethernet port mapping and VLAN configuration for each Ethernet PW. All read-create objects in this table MAY be changed at any time; however, change of some objects (for example, pwEnetVlanMode) during the PW forwarding state MAY cause traffic disruption. Manual entries in this table SHOULD be preserved after a reboot, and the agent MUST ensure the integrity of those entries. If the set of entries of a specific row is found to be inconsistent after reboot, the PW pwOperStatus MUST be declared as notPresent(5). "
  },
  "pwEnetPwInstance": {
    "name": "pwEnetPwInstance",
    "oid": "1.3.6.1.2.1.180.1.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "If multiple rows are mapped to the same PW, this index is used to uniquely identify the individual row. If the value of the VLAN field is known at the time of row creation, the value of pwEnetPwVlan MAY be used for better readability and backward compatibility with older versions of this MIB module. Otherwise, the value 1 SHOULD be set to the first row for each pwIndex for better readability and in order that the management application will know in advance how to access the first row when it was created by the agent. "
  },
  "pwEnetPwVlan": {
    "name": "pwEnetPwVlan",
    "oid": "1.3.6.1.2.1.180.1.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "VlanIdOrAnyOrNone",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object defines the (service-delimiting) VLAN field value on the PW. The value 4095 MUST be used if the object is not applicable, for example, when mapping all packets from an Ethernet port to this PW (raw mode). The value 0 MUST be set to indicate untagged frames (from the PW point of view), i.e., when pwEnetVlanMode equals 'noChange' and pwEnetPortVlan equals 0."
  },
  "pwEnetVlanMode": {
    "name": "pwEnetVlanMode",
    "oid": "1.3.6.1.2.1.180.1.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "other": 0,
          "portBased": 1,
          "noChange": 2,
          "changeVlan": 3,
          "addVlan": 4,
          "removeVlan": 5
        }
      }
    },
    "default": {
      "default": {
        "value": "noChange",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object indicates the mode of VLAN handling between the port or the virtual port associated with the PW and the PW encapsulation. - 'other' indicates an operation that is not defined by this MIB module. - 'portBased' indicates that the forwarder will forward packets between the port and the PW independent of their structure (i.e., there are no service-delimiting VLAN tags from the PE standpoint). - 'noChange' indicates that the PW contains the original user VLAN, as specified in pwEnetPortVlan; i.e., the VLAN on the PE-CE link is the service-delimiting tag and is kept 'as is' on the PW. - 'changeVlan' indicates that the VLAN field on the PW may be different than the VLAN field on the user's port. The VLAN on the PE-CE link is the service-delimiting tag but has a different value on the PW. - 'addVlan' indicates that a VLAN field will be added on the PSN-bound direction (i.e., on the PW). pwEnetPwVlan indicates the value that will be added. - 'removeVlan' indicates that the encapsulation on the PW does not include the service-delimiting VLAN field. Note that PRI bits transparency is lost in this case. - Implementation of 'portsbased', 'removeVlan', 'addVlan' 'other', and 'changeVlan' is OPTIONAL. "
  },
  "pwEnetPortVlan": {
    "name": "pwEnetPortVlan",
    "oid": "1.3.6.1.2.1.180.1.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "VlanIdOrAnyOrNone",
      "class": "type"
    },
    "default": {
      "default": {
        "value": 4095,
        "format": "decimal"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object defines if the mapping between the original port (physical port or VPLS virtual port) to the PW is VLAN based or not. In case of VLAN mapping, this object indicates the VLAN value on the original port. The value of '4095' MUST be used if the whole original port traffic is mapped to the same PW. Note that a pwType of 'ethernetTagged' can still be used if service-delimiting tag is added on the PW (pwEnetVlanMode equals 'addVlan'). This object MUST be equal to pwEnetPwVlan if pwEnetVlanMode equals 'noChange'. The value 0 indicates that packets without a VLAN field (i.e., untagged frames) on the port are associated to this PW. This allows the same behavior as assigning 'Default VLAN' to untagged frames. "
  },
  "pwEnetPortIfIndex": {
    "name": "pwEnetPortIfIndex",
    "oid": "1.3.6.1.2.1.180.1.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InterfaceIndexOrZero",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object is used to specify the ifIndex of the Ethernet port associated with this PW for point-to-point Ethernet service, or the ifIndex of the virtual interface of the VPLS instance associated with the PW if the service is VPLS. Two rows in this table can point to the same ifIndex only if there is no overlap of VLAN values specified in pwEnetPortVlan that are associated with this port. A value of zero indicates that association to an ifIndex is not yet known."
  },
  "pwEnetPwIfIndex": {
    "name": "pwEnetPwIfIndex",
    "oid": "1.3.6.1.2.1.180.1.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InterfaceIndexOrZero",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "If the PW is modeled as an ifIndex in the ifTable, this object indicates the value of the ifIndex representing the Ethernet PW on the PSN side in the Etherlike-MIB. Note that this value may be different from the value of pwIfIndex that represents the ifIndex of the PW for ifType 'pw'."
  },
  "pwEnetRowStatus": {
    "name": "pwEnetRowStatus",
    "oid": "1.3.6.1.2.1.180.1.1.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object enables creating, deleting, and modifying this row."
  },
  "pwEnetStorageType": {
    "name": "pwEnetStorageType",
    "oid": "1.3.6.1.2.1.180.1.1.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "StorageType",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "nonVolatile",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object indicates the storage type of this row."
  },
  "pwEnetStatsTable": {
    "name": "pwEnetStatsTable",
    "oid": "1.3.6.1.2.1.180.1.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table contains statistical counters specific for Ethernet PW."
  },
  "pwEnetStatsEntry": {
    "name": "pwEnetStatsEntry",
    "oid": "1.3.6.1.2.1.180.1.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "PW-STD-MIB",
        "object": "pwIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "Each entry represents the statistics gathered for the PW carrying the Ethernet."
  },
  "pwEnetStatsIllegalVlan": {
    "name": "pwEnetStatsIllegalVlan",
    "oid": "1.3.6.1.2.1.180.1.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of packets received (from the PSN) on this PW with either an illegal VLAN field, a missing VLAN field when one was expected, or an excessive VLAN field when it was not expected. This counter may not be applicable in some cases, and MUST return the value of zero in such a case."
  },
  "pwEnetStatsIllegalLength": {
    "name": "pwEnetStatsIllegalLength",
    "oid": "1.3.6.1.2.1.180.1.2.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ZeroBasedCounter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of packets that were received with an illegal Ethernet packet length on this PW. An illegal length is defined as being greater than the value in the advertised MTU supported, or shorter than the allowed Ethernet packet size."
  },
  "pwEnetGroups": {
    "name": "pwEnetGroups",
    "oid": "1.3.6.1.2.1.180.2.1",
    "class": "objectidentity"
  },
  "pwEnetCompliances": {
    "name": "pwEnetCompliances",
    "oid": "1.3.6.1.2.1.180.2.2",
    "class": "objectidentity"
  },
  "pwEnetModuleFullCompliance": {
    "name": "pwEnetModuleFullCompliance",
    "oid": "1.3.6.1.2.1.180.2.2.1",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "pwEnetGroup",
        "module": "PW-ENET-STD-MIB"
      },
      {
        "object": "pwEnetStatsGroup",
        "module": "PW-ENET-STD-MIB"
      }
    ],
    "status": "current",
    "description": "The compliance statement for agents that provides full support for the PW-ENET-STD-MIB module. Such devices can then be monitored and also be configured using this MIB module."
  },
  "pwEnetModuleReadOnlyCompliance": {
    "name": "pwEnetModuleReadOnlyCompliance",
    "oid": "1.3.6.1.2.1.180.2.2.2",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "pwEnetGroup",
        "module": "PW-ENET-STD-MIB"
      },
      {
        "object": "pwEnetStatsGroup",
        "module": "PW-ENET-STD-MIB"
      }
    ],
    "status": "current",
    "description": "The compliance statement for agents that provide read- only support for the PW-ENET-STD-MIB module. Such devices can then be monitored but cannot be configured using this MIB module."
  },
  "pwEnetGroup": {
    "name": "pwEnetGroup",
    "oid": "1.3.6.1.2.1.180.2.1.1",
    "class": "objectgroup",
    "objects": [
      {
        "module": "PW-ENET-STD-MIB",
        "object": "pwEnetPwVlan"
      },
      {
        "module": "PW-ENET-STD-MIB",
        "object": "pwEnetVlanMode"
      },
      {
        "module": "PW-ENET-STD-MIB",
        "object": "pwEnetPortVlan"
      },
      {
        "module": "PW-ENET-STD-MIB",
        "object": "pwEnetPortIfIndex"
      },
      {
        "module": "PW-ENET-STD-MIB",
        "object": "pwEnetPwIfIndex"
      },
      {
        "module": "PW-ENET-STD-MIB",
        "object": "pwEnetRowStatus"
      },
      {
        "module": "PW-ENET-STD-MIB",
        "object": "pwEnetStorageType"
      }
    ],
    "status": "current",
    "description": "Collection of objects for basic Ethernet PW configuration."
  },
  "pwEnetStatsGroup": {
    "name": "pwEnetStatsGroup",
    "oid": "1.3.6.1.2.1.180.2.1.2",
    "class": "objectgroup",
    "objects": [
      {
        "module": "PW-ENET-STD-MIB",
        "object": "pwEnetStatsIllegalVlan"
      },
      {
        "module": "PW-ENET-STD-MIB",
        "object": "pwEnetStatsIllegalLength"
      }
    ],
    "status": "current",
    "description": "Collection of objects counting various PW level errors."
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/PW-ENET-STD-MIB",
      "Produced by pysmi-0.3.4 at Fri May 24 18:44:34 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "PW-ENET-STD-MIB"
  }
}