{
  "imports": {
    "class": "imports",
    "POLICY-FRAMEWORK-PIB": [
      "RoleCombination",
      "PolicyInstanceId"
    ],
    "SNMP-FRAMEWORK-MIB": [
      "SnmpAdminString"
    ],
    "SNMPv2-CONF": [
      "NOTIFICATION-GROUP",
      "MODULE-COMPLIANCE",
      "OBJECT-GROUP"
    ],
    "SNMPv2-SMI": [
      "Counter64",
      "Integer32",
      "MODULE-IDENTITY",
      "MibIdentifier",
      "OBJECT-TYPE",
      "Counter32",
      "iso",
      "Unsigned32",
      "Gauge32",
      "Bits",
      "TimeTicks",
      "NOTIFICATION-TYPE",
      "OBJECT-IDENTITY",
      "IpAddress"
    ],
    "SNMPv2-TC": [
      "TruthValue",
      "TEXTUAL-CONVENTION",
      "DisplayString",
      "StorageType",
      "RowStatus"
    ],
    "SYNOPTICS-ROOT-MIB": [
      "policy"
    ]
  },
  "qosPolicyIpPib": {
    "name": "qosPolicyIpPib",
    "oid": "1.3.6.1.4.1.45.4.2",
    "class": "moduleidentity",
    "lastupdated": "0107201800Z",
    "organization": "IETF RAP WG",
    "contactinfo": " Michael Fine Cisco Systems, Inc. 170 West Tasman Drive San Jose, CA 95134-1706 USA Phone: +1 408 527 8218 Email: mfine@cisco.com Keith McCloghrie Cisco Systems, Inc. 170 West Tasman Drive, San Jose, CA 95134-1706 USA Phone: +1 408 526 5260 Email: kzm@cisco.com John Seligson Nortel Networks, Inc. 4401 Great America Parkway Santa Clara, CA 95054 USA Phone: +1 408 495 2992 Email: jseligso@nortelnetworks.com",
    "description": "The PIB module containing an initial set of policy rule classes that describe the quality of service (QoS) policies. It includes general classes that may be extended by other PIB specifications as well as an initial set of PIB classes related to IP processing."
  },
  "qosPolicyGenPibClasses": {
    "name": "qosPolicyGenPibClasses",
    "oid": "1.3.6.1.4.1.45.4.2.1",
    "class": "objectidentity"
  },
  "qosPolicyIpPibClasses": {
    "name": "qosPolicyIpPibClasses",
    "oid": "1.3.6.1.4.1.45.4.2.2",
    "class": "objectidentity"
  },
  "Dscp": {
    "name": "Dscp",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 63
          }
        ]
      }
    },
    "status": "current",
    "description": "An integer that is in the range of the DiffServ codepoint values."
  },
  "PolicyInstanceIdOrZero": {
    "name": "PolicyInstanceIdOrZero",
    "class": "textualconvention",
    "type": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 4294967295
          }
        ]
      }
    },
    "status": "current",
    "description": "The textual convention for use by an attribute which is used as the instance-identifying index of a PRC, i.e., an attribute named in an INDEX clause. The value of an attribute with this syntax is always greater than zero when it identifies a PRC. A value of zero indicates that no associated PRC is identified."
  },
  "QosInterfaceQueueCount": {
    "name": "QosInterfaceQueueCount",
    "class": "textualconvention",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 64
          }
        ]
      }
    },
    "status": "current",
    "description": "An integer that describes the number of queues an interface supports. It is limited to the number of DSCP values."
  },
  "qosIfParameters": {
    "name": "qosIfParameters",
    "oid": "1.3.6.1.4.1.45.4.2.1.1",
    "class": "objectidentity"
  },
  "qosInterfaceTypeTable": {
    "name": "qosInterfaceTypeTable",
    "oid": "1.3.6.1.4.1.45.4.2.1.1.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Interface type definitions. This class describes the types of interfaces that exist on the device. An interface type is denoted by its designated role identifier as well as by the queue set and queue capabilities it supports."
  },
  "qosInterfaceTypeEntry": {
    "name": "qosInterfaceTypeEntry",
    "oid": "1.3.6.1.4.1.45.4.2.1.1.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosInterfaceTypeId",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An instance of this class describes the characteristics of a type of an interface. Interface type characteristics include a role combination identifier, a queue set identifier and a queue capabilities attribute. An instance is required for each different unique role combination identifier which represents the different interface types that are operational in the device at any given time. The PEP does not report which specific interfaces have which characteristics."
  },
  "qosInterfaceTypeId": {
    "name": "qosInterfaceTypeId",
    "oid": "1.3.6.1.4.1.45.4.2.1.1.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyInstanceId",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "An arbitrary integer index that uniquely identifies a instance of the qosInterfaceType class. Class instances may not be contiguous."
  },
  "qosInterfaceTypeRoles": {
    "name": "qosInterfaceTypeRoles",
    "oid": "1.3.6.1.4.1.45.4.2.1.1.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RoleCombination",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The role combination that is used to identify interfaces with the characteristics specified by the attributes of this class instance. Interface role combination identifiers are used within a number of classes to logically identify a physical set of interfaces to which policy rules and actions are applied. Role combination identifiers must exist in this table prior to being referenced in other class instances."
  },
  "qosInterfaceTypeQueueSet": {
    "name": "qosInterfaceTypeQueueSet",
    "oid": "1.3.6.1.4.1.45.4.2.1.1.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyInstanceId",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The index of the queue set that is associated with interfaces that are identified with the role combination identifier that is associated with this class instance."
  },
  "qosInterfaceTypeCapabilities": {
    "name": "qosInterfaceTypeCapabilities",
    "oid": "1.3.6.1.4.1.45.4.2.1.1.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Bits",
      "class": "type",
      "bits": {
        "other": 0,
        "inputIpClassification": 1,
        "outputIpClassification": 2,
        "input802Classification": 3,
        "output802Classification": 4,
        "singleQueuingDiscipline": 5,
        "hybridQueuingDiscipline": 6
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "An enumeration of interface capabilities. Used by the PDP or network manager to select which policies and configuration it should push to the PEP."
  },
  "qosInterfaceTypeStorageType": {
    "name": "qosInterfaceTypeStorageType",
    "oid": "1.3.6.1.4.1.45.4.2.1.1.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "StorageType",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "volatile",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The storage type for this conceptual row. Conceptual rows having the value permanent(4) need not allow write-access to any columnar objects in the row. This object may not be modified if the associated qosInterfaceTypeStatus object is equal to active(1)."
  },
  "qosInterfaceTypeStatus": {
    "name": "qosInterfaceTypeStatus",
    "oid": "1.3.6.1.4.1.45.4.2.1.1.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status of this row. An entry may not exist in the active state unless all objects in the entry have an appropriate value. Row creation using only default values is supported."
  },
  "qosIfQueueTable": {
    "name": "qosIfQueueTable",
    "oid": "1.3.6.1.4.1.45.4.2.1.1.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Contains information about the individual queues that comprise a queue set implemented on the device."
  },
  "qosIfQueueEntry": {
    "name": "qosIfQueueEntry",
    "oid": "1.3.6.1.4.1.45.4.2.1.1.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIfQueueId",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A conceptual row in the qosIfQueueTable. Each row identifies a specific queue within a given queue set and contains detailed information about the queue. Queues are associated with a given set through this table and a queue set is associated with an interface set through the qosInterfaceTypeTable."
  },
  "qosIfQueueId": {
    "name": "qosIfQueueId",
    "oid": "1.3.6.1.4.1.45.4.2.1.1.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyInstanceId",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "An index that uniquely identifies this row in the table, i.e., this PRI."
  },
  "qosIfQueueSetId": {
    "name": "qosIfQueueSetId",
    "oid": "1.3.6.1.4.1.45.4.2.1.1.2.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "An index that uniquely identifies a specific queue set. The queue set that is identified with this value is associated with an interface set through the qosInterfaceTypeQueueSet object in the qosInterfaceTypeTable. The individual queues that are members of this set all have the same value for this attribute (i.e., they have the same set ID)."
  },
  "qosIfQueueIndex": {
    "name": "qosIfQueueIndex",
    "oid": "1.3.6.1.4.1.45.4.2.1.1.2.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "QosInterfaceQueueCount",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "An arbitrary index that uniquely identifies a specific queue within a set of queues that is identified by the qosIfQueueSetId value."
  },
  "qosIfQueueGenDiscipline": {
    "name": "qosIfQueueGenDiscipline",
    "oid": "1.3.6.1.4.1.45.4.2.1.1.2.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "other": 1,
          "fifo": 2,
          "pq": 3,
          "fq": 4,
          "wfq": 5
        }
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object identifies the queuing discipline that is associated with the specified queue. Several general purpose and well-known queuing disciplines are supported by this attribute. Queuing disciplines that differ from those that are supported by this object are specified by setting this attribute to other(1) and providing the object identifier that represents the different queuing paradigm in the qosIfQueueExtDiscipline object. A value of fifo(2) indicates that the queue is serviced on a first-in-first-out (FIFO) basis. This discipline is generally employed when only a single queue is available for a given interface. A value of pq(3) indicates that the queue is serviced using a priority queuing discipline. This technique is used when several queues are available for a given interface. Each queue is assigned a priority and queues are serviced in order of priority. Higher priority queues are completely drained before lower priority queues are serviced. A value of fq(4) indicates that the queue is serviced using a fair queuing discipline. This technique is used when several queues are available for a given interface. Each queue is treated equally and is serviced in a round-robin fashion. A value of wfq(5) indicates that the queue is serviced using a weighted fair queuing discipline. This technique is used when several queues are available for a given interface. Each queue is serviced based on queue weights which determine the scheduling and frequency of queue servicing. Queues that are assigned a greater weight are implicitly provided with more bandwidth. Note that the processing disciplines for all of the queues in a given set must be considered when trying to establish a processing profile for a given interface."
  },
  "qosIfQueueExtDiscipline": {
    "name": "qosIfQueueExtDiscipline",
    "oid": "1.3.6.1.4.1.45.4.2.1.1.2.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OBJECT IDENTIFIER",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object identifies the queuing discipline that is associated with the specified queue. This attribute provides a means through which additional queuing mechanisms can be identified should the general queuing disciplines be inadequate for a given device. As such. this attribute is consulted only when the value of the qosIfQueueGenDiscipline object is other(1). It contains an object identifier that uniquely identifies a queuing paradigm. Note that the processing disciplines for all of the queues in a given set must be considered when trying to establish a processing profile for a given interface."
  },
  "qosIfQueueDrainSize": {
    "name": "qosIfQueueDrainSize",
    "oid": "1.3.6.1.4.1.45.4.2.1.1.2.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The maximum number of bytes that may be drained from the queue in one cycle. The percentage of the interface bandwidth allocated to this queue can be calculated from this attribute and the sum of the drain sizes of all the queues in a specific queue cluster in a queue set. This attribute represents the relative bandwidth that is available to a given queue with respect to other queues with which it is associated. The absolute bandwidth that is available to a given queue is specified by the attribute qosIfQueueAbsBandwidth. Which of these two applies is specified by the attribute qosIfQueueBandwidthAllocation."
  },
  "qosIfQueueAbsBandwidth": {
    "name": "qosIfQueueAbsBandwidth",
    "oid": "1.3.6.1.4.1.45.4.2.1.1.2.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The maximum interface bandwidth that is available for consumption when servicing this queue. This bandwidth is specified in terms of kilobits per second. This attribute represents the absolute bandwidth that is available to a given queue. The relative bandwidth that is available to a given queue, with respect to other queues with which it is associated, is specified by the attribute qosIfQueueDrainSize. Which of these two applies is specified by the attribute qosIfQueueBandwidthAllocation."
  },
  "qosIfQueueBandwidthAllocation": {
    "name": "qosIfQueueBandwidthAllocation",
    "oid": "1.3.6.1.4.1.45.4.2.1.1.2.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "absolute": 1,
          "relative": 2
        }
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This attribute specifies whether to configure the queue for an absolute bandwidth limit or one that is relative to other queues of the interface. i.e., whether to configure the queue using qosIfQueueAbsBandwidth or qosIfQueueDrainSize."
  },
  "qosIfQueueServiceOrder": {
    "name": "qosIfQueueServiceOrder",
    "oid": "1.3.6.1.4.1.45.4.2.1.1.2.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "QosInterfaceQueueCount",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object is used to provide an additional level of priority that is required for certain queuing disciplines and when the different queues that comprise a queue set are serviced using a mix of queuing disciplines. This object can be used to specify, for example, the order in which queues will be serviced when priority queuing is used. It also supports the ability to describe the servicing hierarchy when a hybrid queuing scheme, such as priority queuing coupled with weighted fair queuing, is used. Queue service priority is assigned such that a lower service order value indicates a higher priority. For example, a priority queue with a value of 1 will be serviced (i.e., drained) before another priority queue with a service order value of 2. Note that multiple queues that are logically associated, based on the queuing discipline that is being employed, will be assigned the same service order value. Under this scenario, other parameters that are related to the queuing discipline determine the order of queue servicing (e.g., queue drain size is used for 'wfq'). For example, an interface that is associated with a queue set supporting two priority queues and three queues that are serviced using WFQ would be modeled as follows: Q Index Q Discipline Q Drain Size Q Service Order 22 pq(1) - 1 23 pq(1) - 2 24 wfq(3) 500 3 25 wfq(3) 350 3 26 wfq(3) 150 3 The queue set presented in this example would service all queued traffic in queue 22 first, followed by all of the queued traffic in queue 23. Next the queued traffic in queues 24 through 26 would be serviced in a round robin fashion with queue 24 receiving 50% of the available bandwidth, queue 25 receiving 35% of the available bandwidth and queue 26 receiving 15% of the available bandwidth. This example is presented for expository purposes and has been simplified accordingly. Note that, in this example, queues 24, 25 and 26 form a queue cluster. Members of a queue cluster are all assigned the same qosIfQueueServiceOrder as there are tightly coupled. The qosIfQueueDrainSize attribute is used to determine the additional processing characteristics of the individual queues in a cluster."
  },
  "qosIfQueueSize": {
    "name": "qosIfQueueSize",
    "oid": "1.3.6.1.4.1.45.4.2.1.1.2.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The size of the queue in bytes. Some devices set queue size in terms of packets. These devices must calculate the queue size in packets by assuming an average packet size suitable for the particular interface. Some devices have a fixed size buffer to be shared among all queues. These devices must allocate a fraction of the total buffer space to this queue calculated as the the ratio of the queue size to the sum of the queue sizes for the interface."
  },
  "qosIfQueueStorageType": {
    "name": "qosIfQueueStorageType",
    "oid": "1.3.6.1.4.1.45.4.2.1.1.2.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "StorageType",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "volatile",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The storage type for this conceptual row. Conceptual rows having the value permanent(4) need not allow write-access to any columnar objects in the row. This object may not be modified if the associated qosIfQueueStatus object is equal to active(1)."
  },
  "qosIfQueueStatus": {
    "name": "qosIfQueueStatus",
    "oid": "1.3.6.1.4.1.45.4.2.1.1.2.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status of this row. An entry may not exist in the active state unless all objects in the entry have an appropriate value. Row creation using only default values is supported."
  },
  "qosIfDscpAssignmentTable": {
    "name": "qosIfDscpAssignmentTable",
    "oid": "1.3.6.1.4.1.45.4.2.1.1.3",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Supports the assignment of DSCP values to a queue for each interface with a specific queue count. There will be 64 instances of this class for each supported combination of queue count and role combination."
  },
  "qosIfDscpAssignmentEntry": {
    "name": "qosIfDscpAssignmentEntry",
    "oid": "1.3.6.1.4.1.45.4.2.1.1.3.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIfDscpAssignmentId",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An instance of the qosIfDscpAssignment class."
  },
  "qosIfDscpAssignmentId": {
    "name": "qosIfDscpAssignmentId",
    "oid": "1.3.6.1.4.1.45.4.2.1.1.3.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyInstanceId",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "An index that is used to uniquely identify the instance of the qosIfDscpAssignment class."
  },
  "qosIfDscpAssignmentRoles": {
    "name": "qosIfDscpAssignmentRoles",
    "oid": "1.3.6.1.4.1.45.4.2.1.1.3.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RoleCombination",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The role combination with which an interface must be configured to support the DSCP-to-queue assignment described by this instance. The specified role combination must be defined in the qosInterfaceType table prior to being referenced by this entry. Otherwise a 'priAssociationUnknown(3)' error code will be returned."
  },
  "qosIfDscpAssignmentDscp": {
    "name": "qosIfDscpAssignmentDscp",
    "oid": "1.3.6.1.4.1.45.4.2.1.1.3.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Dscp",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The DSCP to which this class instance applies."
  },
  "qosIfDscpAssignmentQueue": {
    "name": "qosIfDscpAssignmentQueue",
    "oid": "1.3.6.1.4.1.45.4.2.1.1.3.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "QosInterfaceQueueCount",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The specific queue, within the queue set that is associated with the interface set identified by the qosIfDscpAssignmentRoles tag, on which traffic with the specified DSCP, dictated by the qosIfDscpAssignmentDscp value, is placed. Failure to specify an appropriate queue results in a 'priAssociationConflict(4)' error indication being returned."
  },
  "qosIfDscpAssignmentStorageType": {
    "name": "qosIfDscpAssignmentStorageType",
    "oid": "1.3.6.1.4.1.45.4.2.1.1.3.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "StorageType",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "volatile",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The storage type for this conceptual row. Conceptual rows having the value permanent(4) need not allow write-access to any columnar objects in the row. This object may not be modified if the associated qosIfDscpAssignmentStatus object is equal to active(1)."
  },
  "qosIfDscpAssignmentStatus": {
    "name": "qosIfDscpAssignmentStatus",
    "oid": "1.3.6.1.4.1.45.4.2.1.1.3.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status of this row. An entry may not exist in the active state unless all objects in the entry have an appropriate value. Row creation using only default values is supported."
  },
  "qosMeter": {
    "name": "qosMeter",
    "oid": "1.3.6.1.4.1.45.4.2.1.2",
    "class": "objectidentity"
  },
  "qosMeterTable": {
    "name": "qosMeterTable",
    "oid": "1.3.6.1.4.1.45.4.2.1.2.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Contains the current set of configured meters. The meters are associated with a classifier during operation through the QoS Target Table."
  },
  "qosMeterEntry": {
    "name": "qosMeterEntry",
    "oid": "1.3.6.1.4.1.45.4.2.1.2.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosMeterId",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "General metering definitions. Each entry specifies an instance of the qosMeter class which specifies metering information in terms of traffic stream bandwidth parameters. An entry can thus be used to support traffic metering based on the specified service level specification."
  },
  "qosMeterId": {
    "name": "qosMeterId",
    "oid": "1.3.6.1.4.1.45.4.2.1.2.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyInstanceId",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "An arbitrary integer index that uniquely identifies the instance of the qosMeter class. Meters are associated with specific flows using this attribute through the qosTargetMeter attribute in the QoS Target class."
  },
  "qosMeterDataSpecification": {
    "name": "qosMeterDataSpecification",
    "oid": "1.3.6.1.4.1.45.4.2.1.2.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "noMeterData": 1,
          "committedData": 2,
          "peakData": 3
        }
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "Specifies the metering data, and thus the actions, that are defined in a given entry. A value of noMeterData(1) indicates that no flow metering is necessary. All flows associated with this meter entry are considered to be at a high level of conformance. A value of committedData(2) indicates that committed rate and committed burst information has been specified and will be applied to associated flows. No peak rate and burst information has been specified meaning that two levels of conformance (high, medium) are supported. A value of peakData(3) indicates that peak rate and peak burst information has been provided in addition to the committed rate and committed burst information. All provided information will be applied to associated flows meaning that three levels of conformance (high, medium, low) are supported."
  },
  "qosMeterCommittedRate": {
    "name": "qosMeterCommittedRate",
    "oid": "1.3.6.1.4.1.45.4.2.1.2.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 4294967295
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object represents the committed information rate (CIR) against which associated traffic streams will be metered. The CIR specifies the rate at which incoming traffic can arrive to be considered to be at a high level of conformance. Typically, this value specifies the rate at which tokens are added to a token bucket used to meter received flows. This object specifies a rate in bytes per second units such that, for example, a value of 100 equates to a committed information rate of 100 bytes per second. Committed rate (and burst) information must be present if the qosMeterDataSpecification object has the value committedData(2) or peakRate(3). This, in turn, requires that at least both high and medium conformance actions be specified."
  },
  "qosMeterCommittedBurst": {
    "name": "qosMeterCommittedBurst",
    "oid": "1.3.6.1.4.1.45.4.2.1.2.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 4294967295
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object represents the committed burst size (CBS) against which associated traffic streams will be metered. The CBS specifies the maximum burst size that is supported for flows to be considered to be at a high level of conformance. Typically, this value represents the maximum number of tokens in a token bucket. This object specifies flow data in bytes per second units such that, for example, a value of 100 equates to a committed information rate of 100 bytes per second. Committed burst (and rate) information must be present if the qosMeterDataSpecification object has the value committedData(2) or peakRate(3). This, in turn, requires that at least both high and medium conformance actions be specified."
  },
  "qosMeterPeakRate": {
    "name": "qosMeterPeakRate",
    "oid": "1.3.6.1.4.1.45.4.2.1.2.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 4294967295
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object represents the peak information rate (PIR) against which associated traffic streams will be metered. The PIR specifies the rate at which incoming traffic can arrive to be considered to be at a medium level of conformance. Typically, this value specifies the rate at which tokens are added to a token bucket used to meter received flows. This object specifies a rate in bytes per second units such that, for example, a value of 100 equates to a committed information rate of 100 bytes per second. Peak rate (and burst) information must be present if the qosMeterDataSpecification object has the value peakData(3). This, in turn, requires that high, medium and low conformance actions be specified."
  },
  "qosMeterPeakBurst": {
    "name": "qosMeterPeakBurst",
    "oid": "1.3.6.1.4.1.45.4.2.1.2.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 4294967295
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This object represents the peak burst size (PBS) against which associated traffic streams will be metered. The CBS specifies the maximum burst size that is supported for flows to be considered to be at a medium level of conformance. Typically, this value represents the maximum number of tokens in a token bucket. This object specifies flow data in bytes per second units such that, for example, a value of 100 equates to a committed information rate of 100 bytes per second. Peak burst (and rate) information must be present if the qosMeterDataSpecification object has the value peakData(3). This, in turn, requires that high, medium and low conformance actions be specified."
  },
  "qosMeterHighConfAction": {
    "name": "qosMeterHighConfAction",
    "oid": "1.3.6.1.4.1.45.4.2.1.2.1.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyInstanceIdOrZero",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This attribute identifies the action that is to be initiated for flows that are determined to have a high level of conformance with regard to metering criteria being applied to the flow. Actions must be defined in the qosActionTable prior to being referenced by this attribute. A non-zero value for this attribute must be provided prior to use unless an in-profile action is specified in the associated qosTargetTable entry."
  },
  "qosMeterMedConfAction": {
    "name": "qosMeterMedConfAction",
    "oid": "1.3.6.1.4.1.45.4.2.1.2.1.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyInstanceIdOrZero",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This attribute identifies the action that is to be initiated for flows that are determined to have a medium level of conformance with regard to metering criteria being applied to the flow. Actions must be defined in the qosActionTable prior to being referenced by this attribute. A valid value for this attribute must be provided prior to use if the value of the associated qosMeterDataSpecification object is committedRate(2) or peakRate(3) and an out-of-profile action is not specified in the associated qosTargetTable entry."
  },
  "qosMeterLowConfAction": {
    "name": "qosMeterLowConfAction",
    "oid": "1.3.6.1.4.1.45.4.2.1.2.1.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyInstanceIdOrZero",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This attribute identifies the action that is to be initiated for flows that are determined to have a low level of conformance with regard to metering criteria being applied to the flow. Actions must be defined in the qosActionTable prior to being referenced by this attribute. A valid value for this attribute must be provided if the value of the associated qosMeterDataSpecification object is peakRate(3)."
  },
  "qosMeterStorageType": {
    "name": "qosMeterStorageType",
    "oid": "1.3.6.1.4.1.45.4.2.1.2.1.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "StorageType",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "volatile",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The storage type for this conceptual row. Conceptual rows having the value permanent(4) need not allow write-access to any columnar objects in the row. This object may not be modified if the associated qosIfDscpAssignmentStatus object is equal to active(1)."
  },
  "qosMeterStatus": {
    "name": "qosMeterStatus",
    "oid": "1.3.6.1.4.1.45.4.2.1.2.1.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status of this row. An entry may not exist in the active state unless all objects in the entry have an appropriate value. Row creation using only default values is supported."
  },
  "qosMeterLabel": {
    "name": "qosMeterLabel",
    "oid": "1.3.6.1.4.1.45.4.2.1.2.1.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 32
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "A label used to reference the entry in a textual manner."
  },
  "qosAction": {
    "name": "qosAction",
    "oid": "1.3.6.1.4.1.45.4.2.1.3",
    "class": "objectidentity"
  },
  "qosActionTable": {
    "name": "qosActionTable",
    "oid": "1.3.6.1.4.1.45.4.2.1.3.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Contains the current set of configured actions. The actions are associated with IP, IEEE 802 and other ACLs and interfaces during operation."
  },
  "qosActionEntry": {
    "name": "qosActionEntry",
    "oid": "1.3.6.1.4.1.45.4.2.1.3.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosActionId",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "General action definitions. Each entry specifies an instance of the qosAction class which describes (potentially) several distinct action attributes. Each action is taken individually regarding the data in question. Several actions can be taken for a single frame. An instance of this class can not be deleted while it is being referenced in a target instance in another class. This class may be extended with actions that apply to specific QoS policies (e.g., IP, IEEE 802, security) using augmentation."
  },
  "qosActionId": {
    "name": "qosActionId",
    "oid": "1.3.6.1.4.1.45.4.2.1.3.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyInstanceId",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "An arbitrary integer index that uniquely identifies the instance of the QoS Action class. Class instances may not be contiguous. Actions are associated with Target instances in other classes (e.g., the QoS Target class) using this attribute."
  },
  "qosActionDrop": {
    "name": "qosActionDrop",
    "oid": "1.3.6.1.4.1.45.4.2.1.3.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This action attribute, when specified, will cause the frame being evaluated to be dropped if the value is 'true(1)'. A value of 'false(2)' indicates that this action will not be initiated (i.e., the frame will not be dropped) based on this attribute. Prior to discarding a packet, other actions that have been specified should be performed if they make protocol sense. For example, requests for traffic mirroring (if such an action is supported by a device) should be honored. However, updating protocol header values will typically not be necessary."
  },
  "qosActionUpdateDSCP": {
    "name": "qosActionUpdateDSCP",
    "oid": "1.3.6.1.4.1.45.4.2.1.3.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": -1,
            "max": -1
          },
          {
            "min": 0,
            "max": 63
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This action component, when specified, will cause the value contained in the Differentiated Services (DS) field of an associated IP datagram to be updated with the value of this object. A value of -1 indicates that this action component has not been set to an appropriate value and should not be used for action initiation. The DSCP should remain unchanged."
  },
  "qosActionMeter": {
    "name": "qosActionMeter",
    "oid": "1.3.6.1.4.1.45.4.2.1.3.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyInstanceId",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This action component, when specified, will identify another level of metering that should be applied to the given flow. This action is only taken if it is not in conflict with other specified actions, i.e., qosActionDrop. A value of 0 indicates that an additional metering component has not been specified. No additional metering is thus required."
  },
  "qosActionStorageType": {
    "name": "qosActionStorageType",
    "oid": "1.3.6.1.4.1.45.4.2.1.3.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "StorageType",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "volatile",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The storage type for this conceptual row. Conceptual rows having the value permanent(4) need not allow write-access to any columnar objects in the row. This object may not be modified if the associated qosActionStatus object is equal to active(1)."
  },
  "qosActionStatus": {
    "name": "qosActionStatus",
    "oid": "1.3.6.1.4.1.45.4.2.1.3.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status of this row. An entry may not exist in the active state unless all objects in the entry have an appropriate value. Row creation using only default values is supported."
  },
  "qosActionLabel": {
    "name": "qosActionLabel",
    "oid": "1.3.6.1.4.1.45.4.2.1.3.1.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 32
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "A label used to reference the entry in a textual manner."
  },
  "qosTargetTable": {
    "name": "qosTargetTable",
    "oid": "1.3.6.1.4.1.45.4.2.1.3.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A class that applies a set of ACLs to interfaces specifying, for each interface, the precedence order of the ACL with respect to other ACLs applied to the same interface and, for each ACL, the action to take for a packet that matches a permit ACE in that ACL. Interfaces are specified abstractly in terms of interface roles. This class may contain ACLs that specify different types of traffic classification (e.g., IP ACLs and IEEE 802 ACLs defined in their respective definition tables). An ACL is identified by its class and instance within that class. An ACL association is formed when ACLs apply to the same interfaces, as determined by the specified interface role and direction. ACL evaluation precedence within an association is determined by the precedence attribute."
  },
  "qosTargetEntry": {
    "name": "qosTargetEntry",
    "oid": "1.3.6.1.4.1.45.4.2.1.3.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosTargetId",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An instance of the qosTarget class. Instance creation may be prohibited based on the status of certain class attributes which must exist prior to class instantiation."
  },
  "qosTargetId": {
    "name": "qosTargetId",
    "oid": "1.3.6.1.4.1.45.4.2.1.3.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyInstanceId",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "An arbitrary integer index that uniquely identifies the instance of the QoS Target class."
  },
  "qosTargetAclId": {
    "name": "qosTargetAclId",
    "oid": "1.3.6.1.4.1.45.4.2.1.3.2.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyInstanceId",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This attribute identifies the ACL that is associated with this target. It identifies (potentially many) ACL class instances in a specific ACL Definition table where ACLs, and their associated ACEs, are defined. For example, instances in the qosIpAclDefinitionTable are identified by setting the value of this object equal to the qosIpAclDefinitionAclId of the instances being targeted. This value, together with the value of the corresponding qosTargetAclType attribute, uniquely identifies one or more instances of a specific ACL Definition class. Attempting to specify an unknown ACL class instance will result in an appropriate error indication being returned to the entity that is attempting to install the conflicting entry. For example, a 'priUnknown(2)' error indication is returned to the policy server in this situation."
  },
  "qosTargetAclType": {
    "name": "qosTargetAclType",
    "oid": "1.3.6.1.4.1.45.4.2.1.3.2.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OBJECT IDENTIFIER",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The ACL Definition class that is being referenced by this instance of the ACL Target class. This policy class identifier, together with the corresponding qosTargetAclId attribute, uniquely identifies instances of a specific ACL Definition class. The object identifier value of this attribute must exist in the policyPrcSupportTable."
  },
  "qosTargetInterfaceRoles": {
    "name": "qosTargetInterfaceRoles",
    "oid": "1.3.6.1.4.1.45.4.2.1.3.2.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RoleCombination",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The interfaces to which this ACL applies specified in terms of a set of roles. The role combination specified by this attribute must exist in the qosInterfaceTypeTable prior to being association with an instance of this class."
  },
  "qosTargetInterfaceDirection": {
    "name": "qosTargetInterfaceDirection",
    "oid": "1.3.6.1.4.1.45.4.2.1.3.2.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "in": 1,
          "out": 2
        }
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The direction of packet flow at the interface in question to which this ACL applies."
  },
  "qosTargetOrder": {
    "name": "qosTargetOrder",
    "oid": "1.3.6.1.4.1.45.4.2.1.3.2.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "An integer that determines the precedence order of this ACL in the list of ACLs applied to interfaces of the specified role combination. An ACL with a given precedence order is positioned in the list before one with a higher-valued precedence order. As an example, consider the following ACL Target association: Index IfRoleCombo IfDirection AclId AclType Order 14 'eth1000+L2+L3' 'in' 8 '802' 1 15 'eth1000+L2+L3' 'in' 3 '802' 2 16 'eth1000+L2+L3' 'in' 12 'IP' 3 17 'eth1000+L2+L3' 'in' 6 'IP' 4 18 'eth1000+L2+L3' 'in' 21 'IP' 5 Five distinct ACL specifications, 3 from an IP ACL Definition class and 2 from an IEEE 802 ACL Definition class, form an Acl Target association (e.g., based on the specified interface role combination and direction attributes) with a prescribed order of evaluation. The AclType and AclId attributes identify the ACL Definition instances in their respective classes. Precedence values within an association must be unique otherwise instance installation will be prohibited and an error value will be returned."
  },
  "qosTargetMeter": {
    "name": "qosTargetMeter",
    "oid": "1.3.6.1.4.1.45.4.2.1.3.2.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyInstanceIdOrZero",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This attribute identifies the meter that is associated with this QoS Target instance. Meters are defined in the qosMeterTable. The corresponding instance in the qosMeter class (i.e., the class instance where the qosMeterId is equal to the value of this object) must exist prior to being associated with an ACL Target entry. A value equal to zero indicates that no metering is requested."
  },
  "qosTargetStorageType": {
    "name": "qosTargetStorageType",
    "oid": "1.3.6.1.4.1.45.4.2.1.3.2.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "StorageType",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "volatile",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The storage type for this conceptual row. Conceptual rows having the value permanent(4) need not allow write-access to any columnar objects in the row. This object may not be modified if the associated qosTargetStatus object is equal to active(1)."
  },
  "qosTargetStatus": {
    "name": "qosTargetStatus",
    "oid": "1.3.6.1.4.1.45.4.2.1.3.2.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status of this row. An entry may not exist in the active state unless all objects in the entry have an appropriate value. Row creation using only default values is supported."
  },
  "qosTargetShapingParams": {
    "name": "qosTargetShapingParams",
    "oid": "1.3.6.1.4.1.45.4.2.1.3.2.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyInstanceIdOrZero",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This attribute identifies the shaping specification that is associated with this QoS Target instance. Shaping parameters are defined in the ntnQosShapingParamsTable. The corresponding instance in the ntnQosShapingParams class (i.e., the class instance where the ntnQosShapingParamsId is equal to the value of this object) must exist prior to being associated with an Target entry. A value equal to 0 for this attribute indicates that no shaping criteria is specified. Note that a shaping specification may be indirectly specified using the qosTargetShapingGroup attribute. The shaping specification associated with the shaping group is used in this case. Inconsistencies between the shaping group shaping specification and a non-zero value provided for this attribute results in an error."
  },
  "qosTargetShapingGroup": {
    "name": "qosTargetShapingGroup",
    "oid": "1.3.6.1.4.1.45.4.2.1.3.2.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This attribute specifies a shaping group number. Aggregate shaping across one or more QoS Target instances (i.e., shaping traffic identified by one or more QoS Target entries as if they were a single flow) is supported by assigning the same shaping group number to multiple QoS Target entries. A value equal to 0 for this attribute indicates that aggregate shaping with one or more existing policies is not specified. Note that a shaping specification may be indirectly specified using this attribute. The shaping specification associated with the shaping group, if it already exists, is used in this case. Inconsistencies between the shaping group shaping specification and a non-zero value for the qosTargetShapingParams attribute results in an error."
  },
  "qosTargetLabel": {
    "name": "qosTargetLabel",
    "oid": "1.3.6.1.4.1.45.4.2.1.3.2.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 32
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "A label used to reference the entry in a textual manner."
  },
  "qosTargetInProfileAction": {
    "name": "qosTargetInProfileAction",
    "oid": "1.3.6.1.4.1.45.4.2.1.3.2.1.13",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyInstanceIdOrZero",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This attribute identifies the action that is to be initiated for flows that are determined to be in-profile with regard to metering criteria being applied to the flow. If no metering criteria is specified, all flows matching a given target specification are considered in-profile. Actions must be defined in the qosActionTable prior to being referenced by this attribute. A non-zero value for this attribute must be provided unless an in-profile (high conformance) action is specified and associated with a meter identified by the qosTargetMeter attribute."
  },
  "qosTargetOutOfProfileAction": {
    "name": "qosTargetOutOfProfileAction",
    "oid": "1.3.6.1.4.1.45.4.2.1.3.2.1.14",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyInstanceIdOrZero",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This attribute identifies the action that is to be initiated for flows that are determined to be out-of- profile with regard to metering criteria being applied to the flow. Actions must be defined in the qosActionTable prior to being referenced by this attribute. An out-of-profile action is required if metering is requested (i.e., the associated meter's qosMeterDataSpecification object is `committedRate` or `peakRate`). A non-zero value for this attribute must be provided unless an out-of-profile (meduim conformance) action is specified and associated with a meter identified by the qosTargetMeter attribute."
  },
  "qosIpQos": {
    "name": "qosIpQos",
    "oid": "1.3.6.1.4.1.45.4.2.2.1",
    "class": "objectidentity"
  },
  "qosIpAceTable": {
    "name": "qosIpAceTable",
    "oid": "1.3.6.1.4.1.45.4.2.2.1.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "ACE definitions. A packet has to match all fields in an ACE. Wildcards may be specified for those fields that are not relevant."
  },
  "qosIpAceEntry": {
    "name": "qosIpAceEntry",
    "oid": "1.3.6.1.4.1.45.4.2.2.1.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIpAceId",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An instance of the qosIpAce class."
  },
  "qosIpAceId": {
    "name": "qosIpAceId",
    "oid": "1.3.6.1.4.1.45.4.2.2.1.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyInstanceId",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "An integer index to uniquely identify this ACE among all the ACEs."
  },
  "qosIpAceDstAddr": {
    "name": "qosIpAceDstAddr",
    "oid": "1.3.6.1.4.1.45.4.2.2.1.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "IpAddress",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The IP address to match against the packet's destination IP address."
  },
  "qosIpAceDstAddrMask": {
    "name": "qosIpAceDstAddrMask",
    "oid": "1.3.6.1.4.1.45.4.2.2.1.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "IpAddress",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "A mask for the matching of the destination IP address. A zero bit in the mask means that the corresponding bit in the address always matches."
  },
  "qosIpAceSrcAddr": {
    "name": "qosIpAceSrcAddr",
    "oid": "1.3.6.1.4.1.45.4.2.2.1.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "IpAddress",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The IP address to match against the packet's source IP address."
  },
  "qosIpAceSrcAddrMask": {
    "name": "qosIpAceSrcAddrMask",
    "oid": "1.3.6.1.4.1.45.4.2.2.1.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "IpAddress",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "A mask for the matching of the source IP address."
  },
  "qosIpAceDscp": {
    "name": "qosIpAceDscp",
    "oid": "1.3.6.1.4.1.45.4.2.2.1.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": -1,
            "max": -1
          },
          {
            "min": 0,
            "max": 63
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The value that the DSCP in the packet can have and match this ACE. A value of -1 indicates that a specific DSCP value has not been defined and thus all DSCP values are considered a match."
  },
  "qosIpAceProtocol": {
    "name": "qosIpAceProtocol",
    "oid": "1.3.6.1.4.1.45.4.2.2.1.1.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 255
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The IP protocol to match against the packet's protocol. A value of zero means match all."
  },
  "qosIpAceDstL4PortMin": {
    "name": "qosIpAceDstL4PortMin",
    "oid": "1.3.6.1.4.1.45.4.2.2.1.1.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The minimum value that the packet's layer 4 destination port number can have and match this ACE. The value of this attribute must be less-than-or-equal-to the value of the corresponding qosIpAceDstL4PortMax attribute."
  },
  "qosIpAceDstL4PortMax": {
    "name": "qosIpAceDstL4PortMax",
    "oid": "1.3.6.1.4.1.45.4.2.2.1.1.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The maximum value that the packet's layer 4 destination port number can have and match this ACE. The value of this attribute must be greater-than-or-equal-to the value of the corresponding qosIpAceDstL4PortMin attribute."
  },
  "qosIpAceSrcL4PortMin": {
    "name": "qosIpAceSrcL4PortMin",
    "oid": "1.3.6.1.4.1.45.4.2.2.1.1.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The minimum value that the packet's layer 4 source port number can have and match this ACE. The value of this attribute must be less-than-or-equal-to the value of the corresponding qosIpAceSrcL4PortMax attribute."
  },
  "qosIpAceSrcL4PortMax": {
    "name": "qosIpAceSrcL4PortMax",
    "oid": "1.3.6.1.4.1.45.4.2.2.1.1.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 65535
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The maximum value that the packet's layer 4 source port number can have and match this ACE. The value of this attribute must be greater-than-or-equal-to the value of the corresponding qosIpAceSrcL4PortMin attribute."
  },
  "qosIpAcePermit": {
    "name": "qosIpAcePermit",
    "oid": "1.3.6.1.4.1.45.4.2.2.1.1.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "If the packet matches this ACE and the value of this attribute is true, then the matching process terminates and the QoS associated with this ACE (indirectly through the ACL) is applied to the packet. If the value of this attribute is false, then no more ACEs in this ACL are compared to this packet and matching continues with the first ACE of the next ACL."
  },
  "qosIpAceStorageType": {
    "name": "qosIpAceStorageType",
    "oid": "1.3.6.1.4.1.45.4.2.2.1.1.1.13",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "StorageType",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "volatile",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The storage type for this conceptual row. Conceptual rows having the value permanent(4) need not allow write-access to any columnar objects in the row. This object may not be modified if the associated qosIpAceStatus object is equal to active(1)."
  },
  "qosIpAceStatus": {
    "name": "qosIpAceStatus",
    "oid": "1.3.6.1.4.1.45.4.2.2.1.1.1.14",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status of this row. An entry may not exist in the active state unless all objects in the entry have an appropriate value. Row creation using only default values is supported."
  },
  "qosIpAclDefinitionTable": {
    "name": "qosIpAclDefinitionTable",
    "oid": "1.3.6.1.4.1.45.4.2.2.1.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A class that defines a set of ACLs each being an ordered list of ACEs. Each instance of this class identifies one ACE of an ACL and the precedence order of that ACE with respect to other ACEs in the same ACL."
  },
  "qosIpAclDefinitionEntry": {
    "name": "qosIpAclDefinitionEntry",
    "oid": "1.3.6.1.4.1.45.4.2.2.1.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIpAclDefinitionId",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "An instance of the qosIpAclDefinition class."
  },
  "qosIpAclDefinitionId": {
    "name": "qosIpAclDefinitionId",
    "oid": "1.3.6.1.4.1.45.4.2.2.1.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyInstanceId",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "Unique index of this policy rule instance."
  },
  "qosIpAclDefinitionAclId": {
    "name": "qosIpAclDefinitionAclId",
    "oid": "1.3.6.1.4.1.45.4.2.2.1.2.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyInstanceId",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "An ID for this ACL. There will be one instance of the class qosIpAclDefinition with this ID for each ACE in the ACL per role combination."
  },
  "qosIpAclDefinitionAceId": {
    "name": "qosIpAclDefinitionAceId",
    "oid": "1.3.6.1.4.1.45.4.2.2.1.2.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "PolicyInstanceId",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "This attribute specifies the ACE in the qosIpAceTable that is in the ACL specified by qosIpAclIndex at the position specified by qosIpAceOrder. Attempting to specify an unknown class instance will result in an appropriate error indication being returned to the entity that is attempting to install the conflicting entry. For example, a 'priUnknown(2)' error indication is returned to the policy server in this situation."
  },
  "qosIpAclDefinitionAceOrder": {
    "name": "qosIpAclDefinitionAceOrder",
    "oid": "1.3.6.1.4.1.45.4.2.2.1.2.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Unsigned32",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The precedence order of this ACE. The precedence order determines the position of this ACE in the ACL. An ACE with a given precedence order is positioned in the access control list before one with a higher-valued precedence order. Precedence values within a group must be unique otherwise instance installation will be prohibited and an error value will be returned."
  },
  "qosIpAclDefinitionStorageType": {
    "name": "qosIpAclDefinitionStorageType",
    "oid": "1.3.6.1.4.1.45.4.2.2.1.2.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "StorageType",
      "class": "type"
    },
    "default": {
      "default": {
        "value": "volatile",
        "format": "enum"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The storage type for this conceptual row. Conceptual rows having the value permanent(4) need not allow write-access to any columnar objects in the row. This object may not be modified if the associated qosIpAclDefinitionStatus object is equal to active(1)."
  },
  "qosIpAclDefinitionStatus": {
    "name": "qosIpAclDefinitionStatus",
    "oid": "1.3.6.1.4.1.45.4.2.2.1.2.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status of this row. An entry may not exist in the active state unless all objects in the entry have an appropriate value. Row creation using only default values is supported."
  },
  "qosIpAclDefinitionLabel": {
    "name": "qosIpAclDefinitionLabel",
    "oid": "1.3.6.1.4.1.45.4.2.2.1.2.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "SnmpAdminString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 32
          }
        ]
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "A label used to reference the filter group in a textual manner. All members of the same group, as determined by the value of the qosIpAclDefinitionAclId attribute, must have the same label."
  },
  "qosPolicyIpPibConformance": {
    "name": "qosPolicyIpPibConformance",
    "oid": "1.3.6.1.4.1.45.4.2.3",
    "class": "objectidentity"
  },
  "qosPolicyIpPibCompliances": {
    "name": "qosPolicyIpPibCompliances",
    "oid": "1.3.6.1.4.1.45.4.2.3.1",
    "class": "objectidentity"
  },
  "qosPolicyIpPibGroups": {
    "name": "qosPolicyIpPibGroups",
    "oid": "1.3.6.1.4.1.45.4.2.3.2",
    "class": "objectidentity"
  },
  "qosPolicyIpPibCompliance": {
    "name": "qosPolicyIpPibCompliance",
    "oid": "1.3.6.1.4.1.45.4.2.3.1.1",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "qosInterfaceTypeGroup",
        "module": "QOS-POLICY-IP-PIB"
      },
      {
        "object": "qosIfQueueGroup",
        "module": "QOS-POLICY-IP-PIB"
      },
      {
        "object": "qosMeterGroup",
        "module": "QOS-POLICY-IP-PIB"
      },
      {
        "object": "qosActionGroup",
        "module": "QOS-POLICY-IP-PIB"
      },
      {
        "object": "qosTargetGroup",
        "module": "QOS-POLICY-IP-PIB"
      }
    ],
    "status": "current",
    "description": "Describes the requirements for conformance to the QoS Policy IP PIB."
  },
  "qosInterfaceTypeGroup": {
    "name": "qosInterfaceTypeGroup",
    "oid": "1.3.6.1.4.1.45.4.2.3.2.1",
    "class": "objectgroup",
    "objects": [
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosInterfaceTypeRoles"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosInterfaceTypeQueueSet"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosInterfaceTypeCapabilities"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosInterfaceTypeStorageType"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosInterfaceTypeStatus"
      }
    ],
    "status": "current",
    "description": "Objects from the qosInterfaceTypeTable."
  },
  "qosIfQueueGroup": {
    "name": "qosIfQueueGroup",
    "oid": "1.3.6.1.4.1.45.4.2.3.2.2",
    "class": "objectgroup",
    "objects": [
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIfQueueSetId"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIfQueueIndex"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIfQueueGenDiscipline"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIfQueueExtDiscipline"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIfQueueDrainSize"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIfQueueAbsBandwidth"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIfQueueBandwidthAllocation"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIfQueueServiceOrder"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIfQueueSize"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIfQueueStorageType"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIfQueueStatus"
      }
    ],
    "status": "current",
    "description": "Objects from the qosIfQueueTable."
  },
  "qosIfDscpAssignmentGroup": {
    "name": "qosIfDscpAssignmentGroup",
    "oid": "1.3.6.1.4.1.45.4.2.3.2.3",
    "class": "objectgroup",
    "objects": [
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIfDscpAssignmentRoles"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIfDscpAssignmentDscp"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIfDscpAssignmentQueue"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIfDscpAssignmentStorageType"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIfDscpAssignmentStatus"
      }
    ],
    "status": "current",
    "description": "Objects from the qosIfDscpAssignmentTable."
  },
  "qosMeterGroup": {
    "name": "qosMeterGroup",
    "oid": "1.3.6.1.4.1.45.4.2.3.2.4",
    "class": "objectgroup",
    "objects": [
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosMeterDataSpecification"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosMeterCommittedRate"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosMeterCommittedBurst"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosMeterPeakRate"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosMeterPeakBurst"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosMeterHighConfAction"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosMeterMedConfAction"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosMeterLowConfAction"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosMeterStorageType"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosMeterStatus"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosMeterLabel"
      }
    ],
    "status": "current",
    "description": "Objects from the qosMeterTable."
  },
  "qosActionGroup": {
    "name": "qosActionGroup",
    "oid": "1.3.6.1.4.1.45.4.2.3.2.5",
    "class": "objectgroup",
    "objects": [
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosActionDrop"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosActionUpdateDSCP"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosActionMeter"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosActionStorageType"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosActionStatus"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosActionLabel"
      }
    ],
    "status": "current",
    "description": "Objects from the qosActionTable."
  },
  "qosTargetGroup": {
    "name": "qosTargetGroup",
    "oid": "1.3.6.1.4.1.45.4.2.3.2.6",
    "class": "objectgroup",
    "objects": [
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosTargetAclId"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosTargetAclType"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosTargetInterfaceRoles"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosTargetInterfaceDirection"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosTargetOrder"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosTargetMeter"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosTargetStorageType"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosTargetStatus"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosTargetShapingParams"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosTargetShapingGroup"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosTargetLabel"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosTargetInProfileAction"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosTargetOutOfProfileAction"
      }
    ],
    "status": "current",
    "description": "Objects from the qosTargetTable."
  },
  "qosIpAceGroup": {
    "name": "qosIpAceGroup",
    "oid": "1.3.6.1.4.1.45.4.2.3.2.7",
    "class": "objectgroup",
    "objects": [
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIpAceDstAddr"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIpAceDstAddrMask"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIpAceSrcAddr"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIpAceSrcAddrMask"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIpAceDscp"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIpAceProtocol"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIpAceDstL4PortMin"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIpAceDstL4PortMax"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIpAceSrcL4PortMin"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIpAceSrcL4PortMax"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIpAcePermit"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIpAceStorageType"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIpAceStatus"
      }
    ],
    "status": "current",
    "description": "Objects from the qosIpAceTable."
  },
  "qosIpAclDefinitionGroup": {
    "name": "qosIpAclDefinitionGroup",
    "oid": "1.3.6.1.4.1.45.4.2.3.2.8",
    "class": "objectgroup",
    "objects": [
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIpAclDefinitionAclId"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIpAclDefinitionAceId"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIpAclDefinitionAceOrder"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIpAclDefinitionStorageType"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIpAclDefinitionStatus"
      },
      {
        "module": "QOS-POLICY-IP-PIB",
        "object": "qosIpAclDefinitionLabel"
      }
    ],
    "status": "current",
    "description": "Objects from the qosIpAclDefinitionTable."
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/QOS-POLICY-IP-PIB",
      "Produced by pysmi-0.3.4 at Fri May 24 20:42:13 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "QOS-POLICY-IP-PIB"
  }
}