{
  "imports": {
    "class": "imports",
    "IF-MIB": [
      "InterfaceIndex"
    ],
    "RBN-SMI": [
      "rbnMgmt"
    ],
    "SNMPv2-CONF": [
      "NOTIFICATION-GROUP",
      "MODULE-COMPLIANCE",
      "OBJECT-GROUP"
    ],
    "SNMPv2-SMI": [
      "OBJECT-TYPE",
      "TimeTicks",
      "MibIdentifier",
      "Unsigned32",
      "MODULE-IDENTITY",
      "Counter64",
      "iso",
      "OBJECT-IDENTITY",
      "Integer32",
      "NOTIFICATION-TYPE",
      "Counter32",
      "IpAddress",
      "Gauge32",
      "Bits"
    ],
    "SNMPv2-TC": [
      "RowStatus",
      "TEXTUAL-CONVENTION",
      "DisplayString"
    ]
  },
  "rbnApsMIB": {
    "name": "rbnApsMIB",
    "oid": "1.3.6.1.4.1.2352.2.5",
    "class": "moduleidentity",
    "revisions": [
      {
        "revision": "1999-05-07 23:00",
        "description": "Creation of the linear APS MIB."
      }
    ],
    "lastupdated": "9905072300Z",
    "organization": "RedBack Networks, Inc.",
    "contactinfo": " RedBack Networks, Inc. Postal: 1389 Moffett Park Drive Sunnyvale, CA 94089-1134 USA Phone: +1 408 548 3500 Fax: +1 408 548 3599 E-mail: mib-info@RedBackNetworks.com",
    "description": "This management information module supports the configuration and management of SONET linear APS groups. The definitions and descriptions used in this mib have been derived from GR-253-CORE Revision 2, January 1999, section 5.3. The mib contains four tables. The apsConfigTable supports addition, modification and deletion of entries representing linear APS groups. Ring APS groups are not currently supported by this MIB. Entries are indexed by a text group name. Each entry contains parameters that specify the configuration of a particular linear APS group. The apsCommandTable provides linear APS commands that support protection switching and the ability to modify APS operation. Commands may only be entered if the corresponding apsConfigRowStatus instance is set to active. The apsStatusTable provides statistics and information about the current APS group state. The apsChanTable provides the ability to add and delete SONET LTE channels from APS groups. Additionally statistics and current state information are provided at the APS channel level. The table contains entries for each SONET LTE interface available on the system. The field apsChanGroupName is initially set to a string of size zero indicating that the SONET LTE is not part of an APS group. Fields that are associated with APS configuration may be modified. An apsChanEntry instance may not be added or deleted through rbnApsMIB mib access operations. However, an apsChanEntry may be added or deleted through other system mechanisms, such as hot swap. An APS group is created and configured with the following sequence of events: CHANNEL CONFIGURATION Set the apsChanGroupName in an apsChanEntry to a user-friendly text string. The string must not be equal to the apsConfigName of an existing apsConfigEntry with apsConfigRowStatus set to active, since a channel cannot be added to an active group. The string may be set equal to the apsConfigName of a row which is currently not set to active, or it may be set to a string which does not currently exist in any instance of apsConfigName. A channel number is entered in apsChanNumber. A channel priority is entered in apsChanPriority, if the intended architecture is 1:n. apsChanPriority is ignored if the architecture is 1+1. This step is repeated for all apsChanEntry instances which are to be included in the APS group. ACTIVATING THE GROUP If the apsChanGroupName does not exist in an instance of apsConfigName, an apsGroupEntry is created with the apsChanGroupName value used as the index for the row. The apsConfigRowStatus value may be set to createAndGo. The apsGroupConfigEntry and apsChanEntry instances with matching name fields will be checked for consistency. If any errors in the channel numbers, architecture or configuration are uncovered the apsConfigRowStatus set will return inconsistentValue , otherwise noError is returned. If the apsChanGroupName value used in channel configuration exists in a previously created, inactive apsChanEntry instance, the apsConfigRowStatus value may be set to active. "
  },
  "rbnApsMIBNotifications": {
    "name": "rbnApsMIBNotifications",
    "oid": "1.3.6.1.4.1.2352.2.5.0",
    "class": "objectidentity"
  },
  "rbnApsMIBObjects": {
    "name": "rbnApsMIBObjects",
    "oid": "1.3.6.1.4.1.2352.2.5.1",
    "class": "objectidentity"
  },
  "rbnApsMIBConformance": {
    "name": "rbnApsMIBConformance",
    "oid": "1.3.6.1.4.1.2352.2.5.2",
    "class": "objectidentity"
  },
  "ApsK1K2": {
    "name": "ApsK1K2",
    "class": "textualconvention",
    "type": {
      "type": "Integer32",
      "class": "type"
    },
    "status": "current",
    "description": "This Textual Convention describes an object that stores a SONET K1 and K2 byte APS protocol field. K1 is located in the low order byte, K2 is located in the higher order second byte. Bits 1-4 of the K1 byte indicate a request. 1111 Lockout of Protection 1110 Forced Switch 1101 SF - High Priority 1100 SF - Low Priority 1011 SD - High Priority 1010 SD - Low Priority 1001 not used 1000 Manual Switch 0111 not used 0110 Wait-to-Restore 0101 not used 0100 Exercise 0011 not used 0010 Reverse Request 0001 Do Not Revert 0000 No Request Bits 5-8 of the K1 byte indicate the channel associated with the request defined in bits 1-4. 0000 is the Null channel 1-14 are working channels. 15 is the extra traffic channel Bits 1-4 of the K2 byte indicate a channel. The channel is defined with the same syntax as K1 Bits 5-8. Bits 5 of the K2 byte indicates the architecture. 0 if the architecture is 1+1 1 if the architecture is 1:n Bits 6-8 of the K2 byte indicates the mode. 000 - 011 are reserved for future use 100 indicates the mode is unidirectional 101 indicates the mode is bidirectional 110 RDI-L 111 AIS-L "
  },
  "apsConfig": {
    "name": "apsConfig",
    "oid": "1.3.6.1.4.1.2352.2.5.1.1",
    "class": "objectidentity"
  },
  "apsConfigGroups": {
    "name": "apsConfigGroups",
    "oid": "1.3.6.1.4.1.2352.2.5.1.1.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The count of APS groups."
  },
  "apsConfigTable": {
    "name": "apsConfigTable",
    "oid": "1.3.6.1.4.1.2352.2.5.1.1.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table lists the APS groups that have been configured on the system."
  },
  "apsConfigEntry": {
    "name": "apsConfigEntry",
    "oid": "1.3.6.1.4.1.2352.2.5.1.1.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "RBN-APS-MIB",
        "object": "apsConfigName",
        "implied": 1
      }
    ],
    "status": "current",
    "description": "A conceptual row in the apsConfigTable."
  },
  "apsConfigName": {
    "name": "apsConfigName",
    "oid": "1.3.6.1.4.1.2352.2.5.1.1.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 1,
            "max": 32
          }
        ]
      }
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "A textual name for the APS group. "
  },
  "apsConfigMode": {
    "name": "apsConfigMode",
    "oid": "1.3.6.1.4.1.2352.2.5.1.1.2.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Bits",
      "class": "type",
      "bits": {
        "onePlusOne": 0,
        "oneToN": 1,
        "revertive": 2,
        "bidirectional": 3,
        "extraTrafficAllowed": 4
      }
    },
    "default": {
      "default": {
        "value": "1",
        "format": "hex"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The architecture and mode of the APS group. The values mean: onePlusOne The 1+1 architecture permanently bridges the working line to the protection line. oneToN The 1:n architecture allows one protection channel to protect up to n working channels. When a fault is detected on one of the n working channels that channel is bridged over the protection channel. Note: onePlusOne and oneToN are mutually exclusive. revertive When the condition that caused a switch to the protection line has been cleared the signal is switched back to the working line. If this bit is clear it indicates a non-revertive system which remains on the protection line until another switch request is received. bidirectional The bi-directional mode provides protection in both directions. If this bit is clear it indicates unidirectional mode which provides protection in one direction. The default for 1:n is bidirectional. The default for 1+1 is unidirectional. extraTrafficAllowed Extra traffic may be carried on the protection channel in a 1:n architecture if this flag is set. It may be necessary to disable this in order to interwork with other SONET network elements that don't support extra traffic. This object may not be modified if the associated apsConfigRowStatus object is equal to active(1)."
  },
  "apsConfigSdBerThreshold": {
    "name": "apsConfigSdBerThreshold",
    "oid": "1.3.6.1.4.1.2352.2.5.1.1.2.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 5,
            "max": 9
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 5,
        "format": "decimal"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The Signal Degrade Bit Error Rate. The negated value of this number is used as the exponent of 10 for computing the threshold value for the Bit Error Rate (BER). For example, a value of 5 indicates a BER threshold of 10^-5. This object may not be modified if the associated apsConfigRowStatus object is equal to active(1)."
  },
  "apsConfigSfBerThreshold": {
    "name": "apsConfigSfBerThreshold",
    "oid": "1.3.6.1.4.1.2352.2.5.1.1.2.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 3,
            "max": 5
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 3,
        "format": "decimal"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The Signal Failure Bit Error Rate. The negated value of this number is used as the exponent of 10 for computing the threshold value for the Bit Error Rate (BER). For example, a value of 5 indicates a BER threshold of 10^-5. This object may not be modified if the associated apsConfigRowStatus object is equal to active(1)."
  },
  "apsConfigWaitToRestore": {
    "name": "apsConfigWaitToRestore",
    "oid": "1.3.6.1.4.1.2352.2.5.1.1.2.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 300,
            "max": 720
          }
        ]
      }
    },
    "default": {
      "default": {
        "value": 600,
        "format": "decimal"
      }
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The Wait To Restore period in seconds. This field only applies if revertive switching is enabled, otherwise this value is ignored. After clearing of a condition that necessitated an automatic switch, the wait to restore period must elapse before reverting. This is intended to avoid rapid switch oscillations. This object may not be modified if the associated apsConfigRowStatus object is equal to active(1)."
  },
  "apsConfigRowStatus": {
    "name": "apsConfigRowStatus",
    "oid": "1.3.6.1.4.1.2352.2.5.1.1.2.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "RowStatus",
      "class": "type"
    },
    "maxaccess": "read-create",
    "status": "current",
    "description": "The status of this APS group entry. An entry may not exist in the active state unless all objects in the entry have an appropriate value. If this object is set to destroy, all associated instances of apsChanGroupName will be set to a string of size 0 and all associated instances of apsChanNumber will be set to 0."
  },
  "apsCommandTable": {
    "name": "apsCommandTable",
    "oid": "1.3.6.1.4.1.2352.2.5.1.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table allows commands to be sent to configured APS groups."
  },
  "apsCommandEntry": {
    "name": "apsCommandEntry",
    "oid": "1.3.6.1.4.1.2352.2.5.1.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "RBN-APS-MIB",
        "object": "apsConfigName",
        "implied": 1
      }
    ],
    "status": "current",
    "description": "A conceptual row in the apsCommandTable."
  },
  "apsCommandSwitch": {
    "name": "apsCommandSwitch",
    "oid": "1.3.6.1.4.1.2352.2.5.1.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This field accepts an Integer32 value containing a 16 bit switch command in the low order word and a channel number in lowest four bits of the high order word. The Switch command values are: Clear(0) Clears all of the switch commands listed below for the specified channel. Lockout of Protection(1) Prevents any of the working channels from switching to the protection line. Forced Switch of Working (to Protection)(2) Switches the specified working channel to the protection line. Forced Switch of Protection (to Working)(3) Switches the working channel back from the protection line to the working line. Manual Switch of Working (to Protection)(4) Switches the specified working channel to the protection line. Manual Switch of Protection (to Working)(5) Switches the working channel back from the protection line to the working line. Exercise(6) Exercises the protocol for a protection switch of the specified channel by issuing an Exercise request for that channel and checking the response on the APS channel. "
  },
  "apsCommandControl": {
    "name": "apsCommandControl",
    "oid": "1.3.6.1.4.1.2352.2.5.1.2.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This field accepts an Integer32 value containing a 16 bit control command in the low order word and a channel number in lowest four bits of the high order word. The Control command values are: Lockout a Working Channel(0) Prevents the specified working channel from switching to the protection line. Clear Lockout a Working Channel(1) Clears the lockout a working channel command for the channel specified. "
  },
  "apsStatusTable": {
    "name": "apsStatusTable",
    "oid": "1.3.6.1.4.1.2352.2.5.1.3",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table provides status information about APS groups that have been configured on the system."
  },
  "apsStatusEntry": {
    "name": "apsStatusEntry",
    "oid": "1.3.6.1.4.1.2352.2.5.1.3.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "RBN-APS-MIB",
        "object": "apsConfigName",
        "implied": 1
      }
    ],
    "status": "current",
    "description": "A conceptual row in the apsStatusTable."
  },
  "apsStatusK1K2Rcv": {
    "name": "apsStatusK1K2Rcv",
    "oid": "1.3.6.1.4.1.2352.2.5.1.3.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ApsK1K2",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The current value of the K1 and K2 bytes received on the protection channel."
  },
  "apsStatusK1K2Trans": {
    "name": "apsStatusK1K2Trans",
    "oid": "1.3.6.1.4.1.2352.2.5.1.3.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ApsK1K2",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The current value of the K1 and K2 bytes transmitted on the protection channel."
  },
  "apsStatusCurrent": {
    "name": "apsStatusCurrent",
    "oid": "1.3.6.1.4.1.2352.2.5.1.3.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Bits",
      "class": "type",
      "bits": {
        "modeMismatch": 0,
        "channelMismatch": 1,
        "psbf": 2,
        "extraTraffic": 3
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The current status of the APS group. modeMismatch Modes other than 1+1 unidirectional monitor protection line K2 bit 5, which indicates the architecture and K2 bits 6-8, which indicate if the mode is unidirectional or bidirectional. A conflict between the current local mode and the received K2 mode information constitutes a mode mismatch. channelMismatch This bit indicates a mismatch between the transmitted K1 channel and the received K2 channel has been detected. psbf This bit indicates a Protection Switch Byte Failure (PSBF) is in effect. This condition occurs when an invalid code or persistently unacceptable codes in the K1 byte are received. extraTraffic This bit indicates whether extra traffic is currently being accepted on the protection line. "
  },
  "apsStatusModeMismatches": {
    "name": "apsStatusModeMismatches",
    "oid": "1.3.6.1.4.1.2352.2.5.1.3.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A count of Mode Mismatch conditions."
  },
  "apsStatusChannelMismatches": {
    "name": "apsStatusChannelMismatches",
    "oid": "1.3.6.1.4.1.2352.2.5.1.3.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A count of Channel Mismatch conditions."
  },
  "apsStatusPSBFs": {
    "name": "apsStatusPSBFs",
    "oid": "1.3.6.1.4.1.2352.2.5.1.3.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A count of Protection Switch Byte Failure conditions. This condition occurs when an invalid code or persistently unacceptable codes in the K1 byte are received."
  },
  "apsStatusCreationTime": {
    "name": "apsStatusCreationTime",
    "oid": "1.3.6.1.4.1.2352.2.5.1.3.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TimeTicks",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The value of sysUpTime at the time the associated apsConfigRowStatus instance was set to active."
  },
  "apsChan": {
    "name": "apsChan",
    "oid": "1.3.6.1.4.1.2352.2.5.1.4",
    "class": "objectidentity"
  },
  "apsChanLTEs": {
    "name": "apsChanLTEs",
    "oid": "1.3.6.1.4.1.2352.2.5.1.4.1",
    "nodetype": "scalar",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The count of available SONET LTE interfaces that may be included in APS groups."
  },
  "apsChanTable": {
    "name": "apsChanTable",
    "oid": "1.3.6.1.4.1.2352.2.5.1.4.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "This table lists the SONET LTE interfaces that may be included in APS groups."
  },
  "apsChanEntry": {
    "name": "apsChanEntry",
    "oid": "1.3.6.1.4.1.2352.2.5.1.4.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "RBN-APS-MIB",
        "object": "apsChanIfIndex",
        "implied": 0
      }
    ],
    "status": "current",
    "description": "A conceptual row in the apsChanTable."
  },
  "apsChanIfIndex": {
    "name": "apsChanIfIndex",
    "oid": "1.3.6.1.4.1.2352.2.5.1.4.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "InterfaceIndex",
      "class": "type"
    },
    "maxaccess": "not-accessible",
    "status": "current",
    "description": "The Interface Index assigned to a SONET LTE."
  },
  "apsChanGroupName": {
    "name": "apsChanGroupName",
    "oid": "1.3.6.1.4.1.2352.2.5.1.4.2.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "DisplayString",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 64
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "A textual name for the APS group which this channel is included in. This object may not be modified if an instance of apsConfigName exists with the same value and the associated apsConfigRowStatus object is equal to active. If the channel is not part of an APS group this value is set to a string of size 0. This field can be changed from a string of size 0 to a value of apsConfigName which has an associated apsConfigRowStatus object which is not set to active. This action includes the SONET LTE into the inactive APS group. This field can be changed from a string of size 0 to a value which is not equal to any existing instance of apsConfigName. This action is the initial step in adding a SONET LTE to a new APS group. An instance of apsConfigName equal to this instance of apsChanGroupName will subsequently be created. If this field is set to any non-empty string it may only be set to a string of size 0. If an attempt is made to set this field from a non-empty string to another non-empty string the error inconsistentValue will be returned. This prevents a manager from inadvertantly re-assigning a channel."
  },
  "apsChanNumber": {
    "name": "apsChanNumber",
    "oid": "1.3.6.1.4.1.2352.2.5.1.4.2.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Integer32",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 14
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "This field is set to a unique channel number within an APS group. The value 0 indicates the null channel. The values 1-14 define a working channel. If the port is not part of an APS group this value is set to 0. If an attempt is made to set this field when the associated apsChanGroupName field is a string of size 0 the error inconsistentValue is returned. If an attempt is made to set this field when an associated apsConfigName field exists and the corresponding apsConfigRowStatus field is set to active the error inconsistentValue is returned. This field must be assigned a unique number within the group. When an attempt is made to set the corresponding apsConfigRowStatus field to active the apsChanNumber values of all entries with equal apsChanGroupName fields must represent a set of consecutive integer values beginning with 0 and ending with n, where n is greater than or equal to 1 and less than or equal to 14. Otherwise the error inconsistentValue is returned to the apsConfigRowStatus set attempt."
  },
  "apsChanPriority": {
    "name": "apsChanPriority",
    "oid": "1.3.6.1.4.1.2352.2.5.1.4.2.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "low": 1,
          "high": 2
        }
      }
    },
    "maxaccess": "read-write",
    "status": "current",
    "description": "The priority of the channel. This field deterimines whether high or low priority SD and SF codes are used in K1 requests. This field is only applicable if the channel is to be included in a group using the 1:n architecture. It is not applicable if the channel is to be included in a group using the 1+1 architecture, and is ignored in that case. "
  },
  "apsChanStatus": {
    "name": "apsChanStatus",
    "oid": "1.3.6.1.4.1.2352.2.5.1.4.2.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Bits",
      "class": "type",
      "bits": {
        "lockedOut": 0,
        "sd": 1,
        "sf": 2,
        "switched": 3
      }
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "Indicates the current state of the port. lockedOut This bit, when applied to a working channel, indicates that the channel is prevented from switching to the protection line. When applied to the null channel, this bit indicates that no working channel may switch to the protection line. sd A signal degrade condition is in effect. sf A signal failure condition is in effect. switched The switched bit is applied to a working channel if that channel is currently switched to the protection line. "
  },
  "apsChanSignalDegrades": {
    "name": "apsChanSignalDegrades",
    "oid": "1.3.6.1.4.1.2352.2.5.1.4.2.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A count of Signal Degrade conditions. This condition occurs when the line Bit Error Rate exceeds the currently configured threshold."
  },
  "apsChanSignalFailures": {
    "name": "apsChanSignalFailures",
    "oid": "1.3.6.1.4.1.2352.2.5.1.4.2.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "A count of Signal Failure conditions that have been detected on the incoming signal. This condition occurs when a loss of signal, loss of frame, AIS-L or a Line bit error rate exceeding 10^-3 is detected on an incoming line."
  },
  "apsChanSwitchovers": {
    "name": "apsChanSwitchovers",
    "oid": "1.3.6.1.4.1.2352.2.5.1.4.2.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter32",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The number of switchovers that have occurred on this port."
  },
  "apsChanLastSwitchover": {
    "name": "apsChanLastSwitchover",
    "oid": "1.3.6.1.4.1.2352.2.5.1.4.2.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TimeTicks",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "current",
    "description": "The value of sysUpTime when this port last switched over."
  },
  "apsTrapSwitchover": {
    "name": "apsTrapSwitchover",
    "oid": "1.3.6.1.4.1.2352.2.5.0.1",
    "class": "notificationtype",
    "objects": [
      {
        "module": "RBN-APS-MIB",
        "object": "apsChanSwitchovers"
      },
      {
        "module": "RBN-APS-MIB",
        "object": "apsChanStatus"
      }
    ],
    "status": "current",
    "description": "An apsTrapSwitchover notification is sent when the value of an instance of apsChanSwitchovers increments."
  },
  "apsTrapModeMismatch": {
    "name": "apsTrapModeMismatch",
    "oid": "1.3.6.1.4.1.2352.2.5.0.2",
    "class": "notificationtype",
    "objects": [
      {
        "module": "RBN-APS-MIB",
        "object": "apsStatusModeMismatches"
      },
      {
        "module": "RBN-APS-MIB",
        "object": "apsStatusCurrent"
      }
    ],
    "status": "current",
    "description": "An apsTrapModeMismatch notification is sent when the value of an instance of apsStatusModeMismatches increments."
  },
  "apsTrapChannelMismatch": {
    "name": "apsTrapChannelMismatch",
    "oid": "1.3.6.1.4.1.2352.2.5.0.3",
    "class": "notificationtype",
    "objects": [
      {
        "module": "RBN-APS-MIB",
        "object": "apsStatusChannelMismatches"
      },
      {
        "module": "RBN-APS-MIB",
        "object": "apsStatusCurrent"
      }
    ],
    "status": "current",
    "description": "An apsTrapChannelMismatch notification is sent when the value of an instance of apsStatusChannelMismatches increments."
  },
  "apsTrapPSBF": {
    "name": "apsTrapPSBF",
    "oid": "1.3.6.1.4.1.2352.2.5.0.4",
    "class": "notificationtype",
    "objects": [
      {
        "module": "RBN-APS-MIB",
        "object": "apsStatusPSBFs"
      },
      {
        "module": "RBN-APS-MIB",
        "object": "apsStatusCurrent"
      }
    ],
    "status": "current",
    "description": "An apsTrapPSBF notification is sent when the value of an instance of apsStatusPSBFs increments."
  },
  "apsGroups": {
    "name": "apsGroups",
    "oid": "1.3.6.1.4.1.2352.2.5.2.1",
    "class": "objectidentity"
  },
  "apsCompliances": {
    "name": "apsCompliances",
    "oid": "1.3.6.1.4.1.2352.2.5.2.2",
    "class": "objectidentity"
  },
  "apsCompliance": {
    "name": "apsCompliance",
    "oid": "1.3.6.1.4.1.2352.2.5.2.2.1",
    "class": "modulecompliance",
    "modulecompliance": [
      {
        "object": "apsConfigGeneral",
        "module": "RBN-APS-MIB"
      },
      {
        "object": "apsStatusGeneral",
        "module": "RBN-APS-MIB"
      },
      {
        "object": "apsChanGeneral",
        "module": "RBN-APS-MIB"
      }
    ],
    "status": "current",
    "description": "The compliance statement for linear APS groups."
  },
  "apsConfigGeneral": {
    "name": "apsConfigGeneral",
    "oid": "1.3.6.1.4.1.2352.2.5.2.1.1",
    "class": "objectgroup",
    "objects": [
      {
        "module": "RBN-APS-MIB",
        "object": "apsConfigMode"
      },
      {
        "module": "RBN-APS-MIB",
        "object": "apsConfigSdBerThreshold"
      },
      {
        "module": "RBN-APS-MIB",
        "object": "apsConfigSfBerThreshold"
      },
      {
        "module": "RBN-APS-MIB",
        "object": "apsConfigRowStatus"
      }
    ],
    "status": "current",
    "description": "A collection of apsConfigTable objects providing configuration information applicable to all linear APS groups."
  },
  "apsConfigOneToN": {
    "name": "apsConfigOneToN",
    "oid": "1.3.6.1.4.1.2352.2.5.2.1.2",
    "class": "objectgroup",
    "objects": [
      {
        "module": "RBN-APS-MIB",
        "object": "apsConfigWaitToRestore"
      }
    ],
    "status": "current",
    "description": "The apsConfigTable object that provides information which is only applicable to groups implementing the linear APS 1:n architecture."
  },
  "apsCommandOnePlusOne": {
    "name": "apsCommandOnePlusOne",
    "oid": "1.3.6.1.4.1.2352.2.5.2.1.3",
    "class": "objectgroup",
    "objects": [
      {
        "module": "RBN-APS-MIB",
        "object": "apsCommandSwitch"
      }
    ],
    "status": "current",
    "description": "The apsCommandTable object which is applicable to groups implementing the linear APS 1+1 architecture. Also, set operations must be supported."
  },
  "apsCommandOneToN": {
    "name": "apsCommandOneToN",
    "oid": "1.3.6.1.4.1.2352.2.5.2.1.4",
    "class": "objectgroup",
    "objects": [
      {
        "module": "RBN-APS-MIB",
        "object": "apsCommandSwitch"
      },
      {
        "module": "RBN-APS-MIB",
        "object": "apsCommandControl"
      }
    ],
    "status": "current",
    "description": "A collection of apsCommandTable objects which are applicable to groups implementing the linear APS 1:n architecture. Also, set operations must be supported."
  },
  "apsStatusGeneral": {
    "name": "apsStatusGeneral",
    "oid": "1.3.6.1.4.1.2352.2.5.2.1.5",
    "class": "objectgroup",
    "objects": [
      {
        "module": "RBN-APS-MIB",
        "object": "apsStatusK1K2Rcv"
      },
      {
        "module": "RBN-APS-MIB",
        "object": "apsStatusK1K2Trans"
      },
      {
        "module": "RBN-APS-MIB",
        "object": "apsStatusCurrent"
      },
      {
        "module": "RBN-APS-MIB",
        "object": "apsStatusModeMismatches"
      },
      {
        "module": "RBN-APS-MIB",
        "object": "apsStatusChannelMismatches"
      },
      {
        "module": "RBN-APS-MIB",
        "object": "apsStatusPSBFs"
      },
      {
        "module": "RBN-APS-MIB",
        "object": "apsStatusCreationTime"
      }
    ],
    "status": "current",
    "description": "A collection of apsStatusTable objects providing status information applicable to all linear APS groups."
  },
  "apsChanGeneral": {
    "name": "apsChanGeneral",
    "oid": "1.3.6.1.4.1.2352.2.5.2.1.6",
    "class": "objectgroup",
    "objects": [
      {
        "module": "RBN-APS-MIB",
        "object": "apsChanGroupName"
      },
      {
        "module": "RBN-APS-MIB",
        "object": "apsChanNumber"
      },
      {
        "module": "RBN-APS-MIB",
        "object": "apsChanStatus"
      },
      {
        "module": "RBN-APS-MIB",
        "object": "apsChanSignalDegrades"
      },
      {
        "module": "RBN-APS-MIB",
        "object": "apsChanSignalFailures"
      },
      {
        "module": "RBN-APS-MIB",
        "object": "apsChanSwitchovers"
      },
      {
        "module": "RBN-APS-MIB",
        "object": "apsChanLastSwitchover"
      }
    ],
    "status": "current",
    "description": "A collection of apsChanTable objects providing information applicable to all linear APS channels."
  },
  "apsChanOneToN": {
    "name": "apsChanOneToN",
    "oid": "1.3.6.1.4.1.2352.2.5.2.1.7",
    "class": "objectgroup",
    "objects": [
      {
        "module": "RBN-APS-MIB",
        "object": "apsChanPriority"
      }
    ],
    "status": "current",
    "description": "The apsChanTable object that provides information which is only applicable to groups implementing the linear APS 1:n architecture."
  },
  "apsTotalsGroup": {
    "name": "apsTotalsGroup",
    "oid": "1.3.6.1.4.1.2352.2.5.2.1.8",
    "class": "objectgroup",
    "objects": [
      {
        "module": "RBN-APS-MIB",
        "object": "apsConfigGroups"
      },
      {
        "module": "RBN-APS-MIB",
        "object": "apsChanLTEs"
      }
    ],
    "status": "current",
    "description": "A collection of objects providing optional counts of configured APS groups and SONET LTE interfaces."
  },
  "apsTrapOptional": {
    "name": "apsTrapOptional",
    "oid": "1.3.6.1.4.1.2352.2.5.2.1.9",
    "class": "notificationgroup",
    "objects": [
      {
        "module": "RBN-APS-MIB",
        "object": "apsTrapSwitchover"
      },
      {
        "module": "RBN-APS-MIB",
        "object": "apsTrapModeMismatch"
      },
      {
        "module": "RBN-APS-MIB",
        "object": "apsTrapChannelMismatch"
      },
      {
        "module": "RBN-APS-MIB",
        "object": "apsTrapPSBF"
      }
    ],
    "status": "current",
    "description": "A collection of SONET linear APS notifications that may optionally be implemented."
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/RBN-APS-MIB",
      "Produced by pysmi-0.3.4 at Fri May 24 21:14:07 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "RBN-APS-MIB"
  }
}