{
  "imports": {
    "class": "imports",
    "SNMPv2-CONF": [
      "MODULE-COMPLIANCE",
      "NOTIFICATION-GROUP"
    ],
    "SNMPv2-SMI": [
      "TimeTicks",
      "Gauge32",
      "OBJECT-IDENTITY",
      "NOTIFICATION-TYPE",
      "Counter64",
      "transmission",
      "Counter32",
      "IpAddress",
      "Integer32",
      "Bits",
      "OBJECT-TYPE",
      "MibIdentifier",
      "MODULE-IDENTITY",
      "Unsigned32",
      "iso"
    ],
    "SNMPv2-TC": [
      "DisplayString",
      "TEXTUAL-CONVENTION"
    ]
  },
  "dot3": {
    "name": "dot3",
    "oid": "1.3.6.1.2.1.10.7",
    "class": "objectidentity"
  },
  "dot3Table": {
    "name": "dot3Table",
    "oid": "1.3.6.1.2.1.10.7.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "Status information and control variables for a collection of ethernet-like interfaces attached to a particular system."
  },
  "dot3Entry": {
    "name": "dot3Entry",
    "oid": "1.3.6.1.2.1.10.7.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "RFC1284-MIB",
        "object": "dot3Index",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "Status information and control variables for a particular interface to an ethernet-like medium."
  },
  "dot3Index": {
    "name": "dot3Index",
    "oid": "1.3.6.1.2.1.10.7.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "An index value that uniquely identifies an interface to an ethernet-like medium. The interface identified by a particular value of this index is the same interface as identified by the same value of ifIndex."
  },
  "dot3InitializeMac": {
    "name": "dot3InitializeMac",
    "oid": "1.3.6.1.2.1.10.7.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "initialized": 1,
          "uninitialized": 2
        }
      }
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "The initialization status of the MAC and PLS (Physical Layer Signalling) subsystems for a particular interface. The value initialized(1) signifies that the subsystems for a particular interface have been previously initialized; the value uninitialized(2) signifies that they have not been previously initialized. Each alteration of an instance of this object to either of the values initialized(1) or uninitialized(2) is analogous to an invocation of the initializeMAC action defined in [9] and has the effect of (re-)initializing the MAC and PLS subsystems for the associated interface. In particular, all management counters pertaining to the MAC and PLS subsystems for said interface are reset to zero; the receive and transmit layer management state variables (receiveEnabled and transmitEnabled in [9]) are set to enable reception and transmission of frames; the promiscuous receive function is disabled; and multicast reception is disabled."
  },
  "dot3MacSubLayerStatus": {
    "name": "dot3MacSubLayerStatus",
    "oid": "1.3.6.1.2.1.10.7.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "enabled": 1,
          "disabled": 2
        }
      }
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "The operational status of the MAC sublayer for a particular interface. The value enabled(1) signifies that the MAC sublayer for said interface is operational for both transmitting and receiving frames -- that is, that the value of both the receive and transmit layer management state variables (receiveEnabled and transmitEnabled in [9]) for said interface are true. The value disabled(2) signifies that the MAC sublayer for said interface is not operational for either transmitting or receiving frames. In particular, the value of an instance of this object is disabled(2) whenever the value of the corresponding instance of the dot3Enabled object is false(2). Each alteration of an instance of this object to the value enabled(1) is analogous to an invocation of the enableMACSublayer action defined in [9] and has the effect of starting normal transmit and receive operations (from the ``idle'' state) on the associated interface. In particular, such an alteration has the effect of resetting the PLS for said interface and of setting the receive and transmit layer management state variables (receiveEnabled and transmitEnabled in [9]) to be true. Each alteration of an instance of this object to the value disabled(2) is analogous to an invocation of the disableMACSublayer action defined in [9] and has the effect of terminating transmit and receive operations on the associated interface. In particular, such an alteration has the effect of setting the receive and transmit layer management state variables (receiveEnabled and transmitEnabled in [9]) to be false. Any transmissions/receptions in progress are completed before operation is terminated."
  },
  "dot3MulticastReceiveStatus": {
    "name": "dot3MulticastReceiveStatus",
    "oid": "1.3.6.1.2.1.10.7.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "enabled": 1,
          "disabled": 2
        }
      }
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "The multicast receive status for a particular interface. The value enabled(1) signifies that reception of multicast frames by the MAC sublayer is enabled on said interface. The value disabled(2) signifies that reception of multicast frames by the MAC sublayer is not enabled on said interface. Each alteration of an instance of this object to the value enabled(1) is analogous to an invocation of the enableMulticastReceive action defined in [9] and has the effect of enabling multicast frame reception on the associated interface. Actual reception of multicast frames is only possible on an interface when the values for the associated instances of the dot3MulticastReceiveStatus and dot3MacSubLayerStatus objects are enabled(1) and enabled(1), respectively. Each alteration of an instance of this object to the value disabled(2) is analogous to an invocation of the disableMulticastReceive action defined in [9] and has the effect of inhibiting multicast frame reception on the associated interface."
  },
  "dot3TxEnabled": {
    "name": "dot3TxEnabled",
    "oid": "1.3.6.1.2.1.10.7.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "true": 1,
          "false": 2
        }
      }
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "The transmit layer management state variable (transmitEnabled as defined in [9]) for a particular interface. The value true(1) signifies that the MAC frame transmission is enabled on said interface. The value false(2) signifies that the MAC frame transmission is inhibited on said interface. In particular, the value of an instance of this object is false(2) whenever the value of the corresponding instance of the dot3MacSubLayerStatus object is disabled(2). Each alteration of an instance of this object to the value true(1) is analogous to an invocation of the enableTransmit action defined in [9] and has the effect of enabling MAC sublayer frame transmission on the associated interface. In particular, such an alteration has the effect of setting the transmit layer management state variable (transmitEnabled in [9]) for said interface to be true. Each alteration of an instance of this object to the value false(2) is analogous to an invocation of the disableTransmit action defined in [9] and has the effect of inhibiting MAC sublayer frame transmission on the associated interface. In particular, such an alteration has the effect of setting the transmit layer management state variable (transmitEnabled in [9]) for said interface to be false. Any transmissions in progress are completed before transmission is inhibited."
  },
  "dot3TestTdrValue": {
    "name": "dot3TestTdrValue",
    "oid": "1.3.6.1.2.1.10.7.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Gauge",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "The number of 10 MHz ticks which elapsed between the beginning of a TDR measurement and the collision which ended it, for the most recently executed TDR test. If no TDR test has been executed, or the last TDR value is not available, this object has the value 0."
  },
  "dot3StatsTable": {
    "name": "dot3StatsTable",
    "oid": "1.3.6.1.2.1.10.7.2",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "Statistics for a collection of ethernet-like interfaces attached to a particular system."
  },
  "dot3StatsEntry": {
    "name": "dot3StatsEntry",
    "oid": "1.3.6.1.2.1.10.7.2.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "RFC1284-MIB",
        "object": "dot3StatsIndex",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "Statistics for a particular interface to an ethernet-like medium."
  },
  "dot3StatsIndex": {
    "name": "dot3StatsIndex",
    "oid": "1.3.6.1.2.1.10.7.2.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "An index value that uniquely identifies an interface to an ethernet-like medium. The interface identified by a particular value of this index is the same interface as identified by the same value of ifIndex."
  },
  "dot3StatsAlignmentErrors": {
    "name": "dot3StatsAlignmentErrors",
    "oid": "1.3.6.1.2.1.10.7.2.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "A count of frames received on a particular interface that are not an integral number of octets in length and do not pass the FCS check. The count represented by an instance of this object is incremented when the alignmentError status is returned by the MAC service to the LLC (or other MAC user). Received frames for which multiple error conditions obtain are, according to the conventions of [9], counted exclusively according to the error status presented to the LLC."
  },
  "dot3StatsFCSErrors": {
    "name": "dot3StatsFCSErrors",
    "oid": "1.3.6.1.2.1.10.7.2.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "A count of frames received on a particular interface that are an integral number of octets in length but do not pass the FCS check. The count represented by an instance of this object is incremented when the frameCheckError status is returned by the MAC service to the LLC (or other MAC user). Received frames for which multiple error conditions obtain are, according to the conventions of [9], counted exclusively according to the error status presented to the LLC."
  },
  "dot3StatsSingleCollisionFrames": {
    "name": "dot3StatsSingleCollisionFrames",
    "oid": "1.3.6.1.2.1.10.7.2.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "A count of successfully transmitted frames on a particular interface for which transmission is inhibited by exactly one collision. A frame that is counted by an instance of this object is also counted by the corresponding instance of either the ifOutUcastPkts or ifOutNUcastPkts object and is not counted by the corresponding instance of the dot3StatsMultipleCollisionFrames object."
  },
  "dot3StatsMultipleCollisionFrames": {
    "name": "dot3StatsMultipleCollisionFrames",
    "oid": "1.3.6.1.2.1.10.7.2.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "A count of successfully transmitted frames on a particular interface for which transmission is inhibited by more than one collision. A frame that is counted by an instance of this object is also counted by the corresponding instance of either the ifOutUcastPkts or ifOutNUcastPkts object and is not counted by the corresponding instance of the dot3StatsSingleCollisionFrames object."
  },
  "dot3StatsSQETestErrors": {
    "name": "dot3StatsSQETestErrors",
    "oid": "1.3.6.1.2.1.10.7.2.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "A count of times that the SQE TEST ERROR message is generated by the PLS sublayer for a particular interface. The SQE TEST ERROR message is defined in section 7.2.2.2.4 of [12] and its generation is described in section 7.2.4.6 of the same document."
  },
  "dot3StatsDeferredTransmissions": {
    "name": "dot3StatsDeferredTransmissions",
    "oid": "1.3.6.1.2.1.10.7.2.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "A count of frames for which the first transmission attempt on a particular interface is delayed because the medium is busy. The count represented by an instance of this object does not include frames involved in collisions."
  },
  "dot3StatsLateCollisions": {
    "name": "dot3StatsLateCollisions",
    "oid": "1.3.6.1.2.1.10.7.2.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "The number of times that a collision is detected on a particular interface later than 512 bit-times into the transmission of a packet. Five hundred and twelve bit-times corresponds to 51.2 microseconds on a 10 Mbit/s system. A (late) collision included in a count represented by an instance of this object is also considered as a (generic) collision for purposes of other collision-related statistics."
  },
  "dot3StatsExcessiveCollisions": {
    "name": "dot3StatsExcessiveCollisions",
    "oid": "1.3.6.1.2.1.10.7.2.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "A count of frames for which transmission on a particular interface fails due to excessive collisions."
  },
  "dot3StatsInternalMacTransmitErrors": {
    "name": "dot3StatsInternalMacTransmitErrors",
    "oid": "1.3.6.1.2.1.10.7.2.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "A count of frames for which transmission on a particular interface fails due to an internal MAC sublayer transmit error. A frame is only counted by an instance of this object if it is not counted by the corresponding instance of either the dot3StatsLateCollisions object, the dot3StatsExcessiveCollisions object, the dot3StatsCarrierSenseErrors object, or the dot3StatsExcessiveDeferrals object. The precise meaning of the count represented by an instance of this object is implementation- specific. In particular, an instance of this object may represent a count of transmission errors on a particular interface that are not otherwise counted."
  },
  "dot3StatsCarrierSenseErrors": {
    "name": "dot3StatsCarrierSenseErrors",
    "oid": "1.3.6.1.2.1.10.7.2.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "The number of times that the carrier sense condition was lost or never asserted when attempting to transmit a frame on a particular interface. The count represented by an instance of this object is incremented at most once per transmission attempt, even if the carrier sense condition fluctuates during a transmission attempt."
  },
  "dot3StatsExcessiveDeferrals": {
    "name": "dot3StatsExcessiveDeferrals",
    "oid": "1.3.6.1.2.1.10.7.2.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "A count of frames for which transmission on a particular interface is deferred for an excessive period of time."
  },
  "dot3StatsFrameTooLongs": {
    "name": "dot3StatsFrameTooLongs",
    "oid": "1.3.6.1.2.1.10.7.2.1.13",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "A count of frames received on a particular interface that exceed the maximum permitted frame size. The count represented by an instance of this object is incremented when the frameTooLong status is returned by the MAC service to the LLC (or other MAC user). Received frames for which multiple error conditions obtain are, according to the conventions of [9], counted exclusively according to the error status presented to the LLC."
  },
  "dot3StatsInRangeLengthErrors": {
    "name": "dot3StatsInRangeLengthErrors",
    "oid": "1.3.6.1.2.1.10.7.2.1.14",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "A count of frames received on a particular interface with a length field value that falls between the minimum unpadded LLC data size and the maximum allowed LLC data size inclusive and that does not match the number of LLC data octets received. The count represented by an instance of this object also includes frames for which the length field value is less than the minimum unpadded LLC data size."
  },
  "dot3StatsOutOfRangeLengthFields": {
    "name": "dot3StatsOutOfRangeLengthFields",
    "oid": "1.3.6.1.2.1.10.7.2.1.15",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "A count of frames received on a particular interface for which the length field value exceeds the maximum allowed LLC data size. The count represented by an instance of this object is not incremented in implementations that observe Ethernet encapsulation conventions (by which the IEEE 802.3 length field is interpreted as the Ethernet Type field)."
  },
  "dot3StatsInternalMacReceiveErrors": {
    "name": "dot3StatsInternalMacReceiveErrors",
    "oid": "1.3.6.1.2.1.10.7.2.1.16",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "A count of frames for which reception on a particular interface fails due to an internal MAC sublayer receive error. A frame is only counted by an instance of this object if it is not counted by the corresponding instance of either the dot3StatsFrameTooLongs object, the dot3StatsAlignmentErrors object, the dot3StatsFCSErrors object, the dot3StatsInRangeLengthErrors object, or the dot3StatsOutOfRangeLengthFields object. The precise meaning of the count represented by an instance of this object is implementation- specific. In particular, an instance of this object may represent a count of receive errors on a particular interface that are not otherwise counted."
  },
  "dot3CollTable": {
    "name": "dot3CollTable",
    "oid": "1.3.6.1.2.1.10.7.5",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "A collection of collision histograms for a particular set of interfaces."
  },
  "dot3CollEntry": {
    "name": "dot3CollEntry",
    "oid": "1.3.6.1.2.1.10.7.5.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "RFC1284-MIB",
        "object": "dot3CollIndex",
        "implied": 0
      },
      {
        "module": "RFC1284-MIB",
        "object": "dot3CollCount",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "A cell in the histogram of per-frame collisions for a particular interface. An instance of this object represents the frequency of individual MAC frames for which the transmission (successful or otherwise) on a particular interface is accompanied by a particular number of media collisions."
  },
  "dot3CollIndex": {
    "name": "dot3CollIndex",
    "oid": "1.3.6.1.2.1.10.7.5.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "The index value that uniquely identifies the interface to which a particular collision histogram cell pertains. The interface identified by a particular value of this index is the same interface as identified by the same value of ifIndex."
  },
  "dot3CollCount": {
    "name": "dot3CollCount",
    "oid": "1.3.6.1.2.1.10.7.5.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 1,
            "max": 16
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "The number of per-frame media collisions for which a particular collision histogram cell represents the frequency on a particular interface."
  },
  "dot3CollFrequencies": {
    "name": "dot3CollFrequencies",
    "oid": "1.3.6.1.2.1.10.7.5.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "A count of individual MAC frames for which the transmission (successful or otherwise) on a particular interface is accompanied by a particular number of media collisions."
  },
  "dot3Errors": {
    "name": "dot3Errors",
    "oid": "1.3.6.1.2.1.10.7.7",
    "class": "objectidentity"
  },
  "dot3ErrorInitError": {
    "name": "dot3ErrorInitError",
    "oid": "1.3.6.1.2.1.10.7.7.1",
    "class": "objectidentity"
  },
  "dot3ErrorLoopbackError": {
    "name": "dot3ErrorLoopbackError",
    "oid": "1.3.6.1.2.1.10.7.7.2",
    "class": "objectidentity"
  },
  "dot3Tests": {
    "name": "dot3Tests",
    "oid": "1.3.6.1.2.1.10.7.6",
    "class": "objectidentity"
  },
  "dot3TestTdr": {
    "name": "dot3TestTdr",
    "oid": "1.3.6.1.2.1.10.7.6.1",
    "class": "objectidentity"
  },
  "dot3ChipSets": {
    "name": "dot3ChipSets",
    "oid": "1.3.6.1.2.1.10.7.8",
    "class": "objectidentity"
  },
  "dot3ChipSetAMD": {
    "name": "dot3ChipSetAMD",
    "oid": "1.3.6.1.2.1.10.7.8.1",
    "class": "objectidentity"
  },
  "dot3ChipSetAMD7990": {
    "name": "dot3ChipSetAMD7990",
    "oid": "1.3.6.1.2.1.10.7.8.1.1",
    "class": "objectidentity"
  },
  "dot3ChipSetAMD79900": {
    "name": "dot3ChipSetAMD79900",
    "oid": "1.3.6.1.2.1.10.7.8.1.2",
    "class": "objectidentity"
  },
  "dot3ChipSetIntel": {
    "name": "dot3ChipSetIntel",
    "oid": "1.3.6.1.2.1.10.7.8.2",
    "class": "objectidentity"
  },
  "dot3ChipSetIntel82586": {
    "name": "dot3ChipSetIntel82586",
    "oid": "1.3.6.1.2.1.10.7.8.2.1",
    "class": "objectidentity"
  },
  "dot3ChipSetIntel82596": {
    "name": "dot3ChipSetIntel82596",
    "oid": "1.3.6.1.2.1.10.7.8.2.2",
    "class": "objectidentity"
  },
  "dot3ChipSetSeeq": {
    "name": "dot3ChipSetSeeq",
    "oid": "1.3.6.1.2.1.10.7.8.3",
    "class": "objectidentity"
  },
  "dot3ChipSetSeeq8003": {
    "name": "dot3ChipSetSeeq8003",
    "oid": "1.3.6.1.2.1.10.7.8.3.1",
    "class": "objectidentity"
  },
  "dot3ChipSetNational": {
    "name": "dot3ChipSetNational",
    "oid": "1.3.6.1.2.1.10.7.8.4",
    "class": "objectidentity"
  },
  "dot3ChipSetNational8390": {
    "name": "dot3ChipSetNational8390",
    "oid": "1.3.6.1.2.1.10.7.8.4.1",
    "class": "objectidentity"
  },
  "dot3ChipSetNationalSonic": {
    "name": "dot3ChipSetNationalSonic",
    "oid": "1.3.6.1.2.1.10.7.8.4.2",
    "class": "objectidentity"
  },
  "dot3ChipSetFujitsu": {
    "name": "dot3ChipSetFujitsu",
    "oid": "1.3.6.1.2.1.10.7.8.5",
    "class": "objectidentity"
  },
  "dot3ChipSetFujitsu86950": {
    "name": "dot3ChipSetFujitsu86950",
    "oid": "1.3.6.1.2.1.10.7.8.5.1",
    "class": "objectidentity"
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/neermitt/kusanagi/mibs.snmplabs.com/asn1/RFC1284-MIB",
      "Produced by pysmi-0.3.4 at Fri May 24 21:19:12 2019",
      "On host NEERMITT-M-J0NV platform Darwin version 18.6.0 by user neermitt",
      "Using Python version 3.7.3 (default, Mar 27 2019, 09:23:15) "
    ],
    "module": "RFC1284-MIB"
  }
}